000001* PDX    - ACAT10DA C0360817 11/03/14 08:58:06 TBLAMUR            00001000
000001* LRM030 SSR 99150 RECOMPILE FOR CONTRA CUSIP SUBMIT WARNING              
000001* PDX    - ACAT10DA C0330171 08/17/12 14:56:48 TBLAMUR            00001000
000001* LRM026 SSR# 84763 RECOMPILE FOR FOREIGN CURR CHG COPY ACAT10IO          
000001* PDX    - ACAT10DA C0327588 06/12/12 13:34:51 TBLAMUR            00001000
000001* PDX    - ACAT10DA C0318727 11/08/11 08:55:49 TBLAMUR            00001000
000001* LRM024 SSR# 80728 WITHHOLD NETWORK LEVEL 4 FUNDS.                       
000001* PDX    - ACAT10DA C0305327 12/23/10 09:20:23 TBLAMUR            00001000
000001* LRM016 - SSR# 73637 RECOMPILE ONLY DUE TO TWA/ACAT10IO CHANGE.          
000001* PDX    - ACAT10DA C0281257 02/11/10 10:11:58 TBLAMUR            00001000
000001* LRM015 - SSR# 62882 RETURN ACTIAST DELETE COUNT                         
000001* PDX    - ACAT10DA C0279780 05/07/09 15:10:13 TBLAMUR            00001000
000001* LRM014 - SSR# 63147 SET ACCT-TIN-MSMTH-IND TO "C" ON                    
000001* LRM014 - ACCOUNT CHANGE.                                                
000001* PDX    - ACAT10DA C0274616 12/18/08 13:44:49 TBLAMUR            00001000
000001* LRM013 - SSR# 55766 DO NOT COPY ACK-IND FROM HSTY TABLE                 
000001* PDX    - ACAT10DA C0273647 11/26/08 13:37:42 TBLAMUR            00001000
000001* LRM012 - SSR# 59508 MEMO ONLY AS AN EXCEPTION RJC2 = N.                 
000001* PDX    - ACAT10DA C0263391 08/20/08 14:28:22 TBLAMUR            00001000
000001* LRM011 SSR 55766 ASCENDIS INTERFACE. WIPE ACK_IND ON UPDATE.            
000001* LRM011 SSR 55644 FLAT-IND = D,L                                         
000001* PDX    - ACAT10DA C0254958 10/18/07 13:16:12 TBLAMUR            00001000
000001* LRM010 SSR 54091 CLIENT 6 CONVERSION ACCT CHANGE                        
000001* PDX    - ACAT10DA C0250441 06/25/07 11:02:50 TBLAMUR            00001000
000001* LRM009 SSR 53075 SPIN-OFF CHANGES                                       
000001* PDX    - ACAT10DA C0242236 12/05/06 11:43:31 TBLAMUR            00001000
      * LRM008 SSR 48334 ADOPTION AGREEMENT EXCEPTION                           
000001* PDX    - ACAT10DA C0238544 08/28/06 16:01:59 TBLAMUR            00001000
      * LRM007 SSR 45145 ADD REJECT TOO LATE WARNING                            
000001* PDX    - ACAT10DA C0231507 07/07/06 15:01:29 TBEDTAK            00001000
      * ET0004 - 40661 RETAIN USER ID OF INITIATOR.                             
      * ET0003 - 45744 BLOCK DELIVERY BASED ON ACCOUNT FREEZE.                  
000001* PDX    - ACAT10DA C0226668 11/18/05 09:46:51 TBLAMUR            00001000
      * LRM004 0034889 DELETE ACCOUNT CHANGE WHEN ISRT REJECT                   
000001* PDX    - ACAT10DA C0215192 01/03/05 11:32:01 TBEDTAK            00001000
      * ET0002 DB2 TABLE KEY CHANGE WITH NEW TABLE NAME.                        
000001* PDX    - ACAT10DA C0209766 08/12/04 11:24:15 TBEDTAK            00001000
      * ET0001 EXPAND RETURN-MSG FIELD LENGTH FROM 70 TO 79 BYTES.              
000001* PDX    - ACAT10DA C0179784 10/02/02 09:22:00 TBLAMUR            00001000
      * LRM002 0026952 CREATE RESCIND BLOCK EXCEPTION MESSAGES                  
000001* PDX    - ACAT10DA C0179784 09/16/02 11:04:07 TBLAMUR            00001000
000001* PDX    - ACAT10DA C0171759 02/27/02 10:58:52 TBLAMUR            00001000
000001* PDX    - ACAT10DA C0151771 02/23/01 11:12:00 TBDOJUN            00001000
      * DJ0001   CHECK FOR TRNFR_TYPE_RJC2_CD = 'F' (FLAT ACCOUNT)      ACAT10DA
000001* PDX    - ACAT10DA C0126743 06/17/99 08:15:35 TBLAMUR            ACAT10DA
000001* PDX    - ACAT10DA C0124783 04/21/99 10:30:42 TBLAMUR            ACAT10DA
000001* PDX    - ACAT10DA C0123344 04/19/99 09:29:35 TBLAMUR            ACAT10DA
000001* PDX    - ACAT10DA C0121429 02/09/99 21:29:26 TBDACRA            ACAT10DA
000001* PDX    - ACAT10DA C0121190 02/08/99 20:44:33 TBLAMUR            ACAT10DA
000001* PDX    - ACAT10DA C0121429 02/07/99 21:12:37 TBDACRA            ACAT10DA
000001* PDX    - ACAT10DA C0120812 02/05/99 21:05:30 TBDACRA            ACAT10DA
000001* PDX    - ACAT10DA C0119861 01/21/99 19:29:00 TBTIKUO            ACAT10DA
000001* PDX    - ACAT10DA C0119290 01/04/99 11:31:41 TBTIKUO            ACAT10DA
000001* PDX    - ACAT10DA C0118748 12/10/98 17:14:14 TBTIKUO            ACAT10DA
000001* PDX    - ACAT10DA C0117770 12/07/98 12:33:30 TBTIKUO            ACAT10DA
000001* PDX    - ACAT10DA C0112193 11/11/98 14:25:19 TBTIKUO            ACAT10DA
000001* PDX    - ACAT10DA C0117817 11/07/98 12:09:09 TBTIKUO            ACAT10DA
000001* PDX    - ACAT10DA C0117770 11/04/98 16:02:34 TBTIKUO            ACAT10DA
000001* PDX    - ACAT10DA C0112193 10/28/98 10:41:44 TBTIKUO            ACAT10DA
       IDENTIFICATION DIVISION.                                         ACAT10DA
       PROGRAM-ID.    ACAT10DA.                                         ACAT10DA
       AUTHOR.        TINA KUO.                                         ACAT10DA
       DATE-WRITTEN.                                                    ACAT10DA
       DATE-COMPILED.                                                   ACAT10DA
      *----------------------------------------------------------------*ACAT10DA
      *                                                                *ACAT10DA
      *   THIS IS THE ACATS I/O MODULE CALLED BY ACAT10NT,             *ACAT10DA
      *   IT HANDLES DB2 FUNCTIONS OF TABLE ACAT_TRNF, ACAT_INIT_TRNF  *ACAT10DA
      *   RECEIVER BKR = DLVR_NBR, DELIVER BKR = RCV_NBR               *ACAT10DA
      *                                                                *ACAT10DA
      *----------------------------------------------------------------*ACAT10DA
      * CHANGE LOG --                                                   ACAT10DA
      * 10/8/98 --  REMOVE SELECT EXCP IND IN WHERE CLAUSE( PARA 0400-) ACAT10DA
      *             WHEN COMMING FROM PENDING XFR.                      ACAT10DA
      * 10/12/98 -- CHANGE LOGIC AS FOLLOWS:                            ACAT10DA
      *             WHEN STCD < 200 ==> GET INIT-ASSET                  ACAT10DA
      *             WHEN STCD < 300 AND >=200 ==> GET ASSET & INIT-ASSETACAT10DA
      *             WHEN STCD > 300 ==> GET ASSET ONLY                  ACAT10DA
      *                                 NO ASSET C/D OF ASSET ALLOWED   ACAT10DA
LRM001* 02/26/02 SSR 00024998 EXCEPTION LOGIC FOR EXPIRING OPTION.      ACAT10DA
      ******************************************************************ACAT10DA
       ENVIRONMENT DIVISION.                                            ACAT10DA
                                                                        ACAT10DA
       DATA DIVISION.                                                   ACAT10DA
                                                                        ACAT10DA
       WORKING-STORAGE SECTION.                                         ACAT10DA
       COPY PDXIDCOB.                                                   ACAT10DA
       01  FILLER                          PIC X(60)                    ACAT10DA
           VALUE 'ACAT10DA WORKING STORAGE BEGINS HERE'.                ACAT10DA
      *                                                                 ACAT10DA
092700*77  TWA-SIZE                         PIC S9(4) COMP.             ACAT10DA
092700 77  WS-CICS-RESPONSE                 PIC S9(8) COMP   VALUE +0.  ACAT10DA
092700 77  WS-COUNT                         PIC S9(9) COMP   VALUE +0.  ACAT10DA
092700 77  WS-EIBCALEN                      PIC S9(8) COMP.             ACAT10DA
092700 77  WS-PHSCL-SEQ-NBR                 PIC S9(4) COMP   VALUE +1.  ACAT10DA
       77  WS-ACATSRCH                      PIC X(08) VALUE 'ACATSRCH'. ACAT10DA
      *                                                                 ACAT10DA
       01  WS-ACAT10DA-WORK-AREA.                                       ACAT10DA
           05  WS-FIRST-TIME-SW             PIC X(01) VALUE SPACE.      ACAT10DA
               88 FIRST-TIME                         VALUE 'Y'.         ACAT10DA
           05  WS-VTRNFR-AREA.                                          ACAT10DA
               10 SEARCH-VTRNFR-SW          PIC X(01) VALUE SPACE.      ACAT10DA
                  88 SEARCH-VTRNFR                   VALUE 'Y'.         ACAT10DA
               10 FOUND-VTRNFR-SW           PIC X(01) VALUE SPACE.      ACAT10DA
                  88  VTRNFR-FOUND                   VALUE 'Y'.         ACAT10DA
                  88  VTRNFR-NOT-FOUND               VALUE 'N'.         ACAT10DA
           05  WS-VINITRNF-AREA.                                        ACAT10DA
               10 SEARCH-VINITRNF-SW          PIC X(01) VALUE SPACE.    ACAT10DA
                  88 SEARCH-VINITRNF                 VALUE 'Y'.         ACAT10DA
               10 FOUND-VINITRNF-SW           PIC X(01) VALUE SPACE.    ACAT10DA
                  88  VINITRNF-FOUND                 VALUE 'Y'.         ACAT10DA
                  88  VINITRNF-NOT-FOUND             VALUE 'N'.         ACAT10DA
               10 WS-VINITRNF-TYPE-RJCT-CD    PIC X(02).                ACAT10DA
               10 WS-VINITRNF-NSCC-PEND-CD    PIC X(01).                ACAT10DA
LRM011         10 WS-VINITRNF-NSCC-ACK-IND    PIC X(01).                ACAT10DA
               10 WS-VINITRNF-CMNT            PIC X(120).               ACAT10DA
           05  WS-CURRENT-VINITRNF-SW         PIC X.                    ACAT10DA
               88  CURRENT-VINITRNF-FOUND         VALUE 'Y'.            ACAT10DA
               88  CURRENT-VINITRNF-NOT-FOUND     VALUE 'Y'.            ACAT10DA
           05  WS-CURRENT-VTRNFR-SW           PIC X.                    ACAT10DA
               88  CURRENT-VTRNFR-FOUND           VALUE 'Y'.            ACAT10DA
               88  CURRENT-VTRNFR-NOT-FOUND       VALUE 'Y'.            ACAT10DA
      *** FOR NEW TIF ACCT INFO (PF2 FUNCTION) *********************    ACAT10DA
01/25      05  NEW-RCV-NBR                    PIC X(04).                ACAT10DA
           05  NEW-DLVR-NBR                   PIC X(04).                ACAT10DA
           05  NEW-ACCT-DLVR-NBR              PIC X(20).                ACAT10DA
01/25      05  NEW-ACCT-RCV-NBR               PIC X(20).                ACAT10DA
01/31      05  WS-ACCT-COMPARE-SW             PIC X(01).                ACAT10DA
               88  WS-ACCT-NOT-EQUAL          VALUE 'Y'.                ACAT10DA
           05  WS-TRANS-TYPE-CD               PIC X(01).                ACAT10DA
           05  WS-TIMESTAMP                   PIC X(26).                ACAT10DA
ET0003     05  WS-ACCT-FRZN-CODE              PIC X(01).                ACAT10DA
LRM007     05  WS-STTLM-TM-CD                 PIC X(01).                        
LRM008     05  WS-ADOPT-AGRMT-IND             PIC X(01).                        
LRM024     05  WS-NETWORK-LVL4-IND            PIC X(01).                        
LRM010     05  WS-CVRSN-ACCT-NBR              PIC X(12).                        
           05  WS-BALANCE-WORK-AREA.                                    ACAT10DA
               07 WS-VASSET-BAL01               USAGE COMP-2.           ACAT10DA
               07 WS-VASSET-BAL02               USAGE COMP-2.           ACAT10DA
               07 WS-VASSET-BAL05               USAGE COMP-2.           ACAT10DA
               07 WS-VASSET-SMA                 USAGE COMP-2.           ACAT10DA
               07 WS-VINITAST-BAL01             USAGE COMP-2.           ACAT10DA
               07 WS-VINITAST-BAL02             USAGE COMP-2.           ACAT10DA
               07 WS-VINITAST-BAL05             USAGE COMP-2.           ACAT10DA
               07 WS-VINITAST-SMA               USAGE COMP-2.           ACAT10DA
               07 WS-VASSET-BAL01-TRAN-TYPE     PIC X(01) VALUE SPACE.  ACAT10DA
               07 WS-VASSET-BAL01-STTMRSN-CD    PIC X(04) VALUE SPACE.  ACAT10DA
01/21          07 WS-VASSET-BAL01-SEQ-NBR       PIC S9(4) COMP.         ACAT10DA
01/27          07 WS-VASSET-BAL01-CMNT          PIC X(120).             ACAT10DA
               07 WS-VASSET-BAL02-TRAN-TYPE     PIC X(01) VALUE SPACE.  ACAT10DA
               07 WS-VASSET-BAL02-STTMRSN-CD    PIC X(04) VALUE SPACE.  ACAT10DA
01/21          07 WS-VASSET-BAL02-SEQ-NBR       PIC S9(4) COMP.         ACAT10DA
01/27          07 WS-VASSET-BAL02-CMNT          PIC X(120).             ACAT10DA
               07 WS-VASSET-BAL05-TRAN-TYPE     PIC X(01) VALUE SPACE.  ACAT10DA
               07 WS-VASSET-BAL05-STTMRSN-CD    PIC X(04) VALUE SPACE.  ACAT10DA
01/21          07 WS-VASSET-BAL05-SEQ-NBR       PIC S9(4) COMP.         ACAT10DA
01/27          07 WS-VASSET-BAL05-CMNT          PIC X(120).             ACAT10DA
               07 WS-VASSET-SMA-TRAN-TYPE       PIC X(01) VALUE SPACE.  ACAT10DA
01/21          07 WS-VASSET-SMA-SEQ-NBR         PIC S9(4) COMP.         ACAT10DA
               07 WS-VASSET-SMA-CMS-CD          PIC X(01) VALUE SPACE.  ACAT10DA
01/27          07 WS-VASSET-SMA-CMNT            PIC X(120).             ACAT10DA
               07 WS-VINITAST-BAL01-TRAN-TYPE   PIC X(01) VALUE SPACE.  ACAT10DA
               07 WS-VINITAST-BAL01-STTMRSN-CD  PIC X(04) VALUE SPACE.  ACAT10DA
01/21          07 WS-VINITAST-BAL01-SEQ-NBR     PIC S9(4) COMP.         ACAT10DA
01/27          07 WS-VINITAST-BAL01-CMNT        PIC X(120).             ACAT10DA
               07 WS-VINITAST-BAL02-TRAN-TYPE   PIC X(01) VALUE SPACE.  ACAT10DA
               07 WS-VINITAST-BAL02-STTMRSN-CD  PIC X(04) VALUE SPACE.  ACAT10DA
01/21          07 WS-VINITAST-BAL02-SEQ-NBR     PIC S9(4) COMP.         ACAT10DA
01/27          07 WS-VINITAST-BAL02-CMNT        PIC X(120).             ACAT10DA
               07 WS-VINITAST-BAL05-TRAN-TYPE   PIC X(01) VALUE SPACE.  ACAT10DA
01/21          07 WS-VINITAST-BAL05-SEQ-NBR     PIC S9(4) COMP.         ACAT10DA
               07 WS-VINITAST-BAL05-STTMRSN-CD  PIC X(04) VALUE SPACE.  ACAT10DA
01/27          07 WS-VINITAST-BAL05-CMNT        PIC X(120).             ACAT10DA
               07 WS-VINITAST-SMA-TRAN-TYPE     PIC X(01) VALUE SPACE.  ACAT10DA
01/21          07 WS-VINITAST-SMA-SEQ-NBR       PIC S9(4) COMP.         ACAT10DA
01/21          07 WS-VINITAST-SMA-CMS-CD        PIC X(01) VALUE SPACE.  ACAT10DA
01/27          07 WS-VINITAST-SMA-CMNT          PIC X(120).             ACAT10DA
01/31      05  WS-CSH-MGN-SHRT-CD          PIC X(01).                   ACAT10DA
      ******************************************************************ACAT10DA
           05  TSQ-WORK-AREA.                                           ACAT10DA
               10  TSQ-NAME.                                            ACAT10DA
                   15  TERM-ID             PIC X(04).                   ACAT10DA
                   15  TRAN-ID             PIC X(04).                   ACAT10DA
               10  ITEM-NUM                PIC S9(04)  COMP VALUE +0.   ACAT10DA
               10  MAX-ITEM-NUM            PIC S9(04)  COMP VALUE +0.   ACAT10DA
      ******************************************************************ACAT10DA
       01  WS-IO-AREA.                                                  ACAT10DA
           05  WS-SAVE-KEY.                                             ACAT10DA
               10  SV-CLIENT-NBR            PIC X(04).                  ACAT10DA
               10  SV-ACAT-CNTL-NBR         PIC X(14).                  ACAT10DA
               10  SV-BRANCH-CD             PIC X(03).                  ACAT10DA
               10  SV-ACCT-CD               PIC X(05).                  ACAT10DA
               10  SV-RR-CD                 PIC X(03).                  ACAT10DA
               10  SV-BRKR                  PIC X(04).                  ACAT10DA
               10  SV-TFR                   PIC X(03).                  ACAT10DA
               10  SV-STCD                  PIC X(03).                  ACAT10DA
               10  SV-ASSET-SEQ-NBR         PIC S9(4) COMP.             ACAT10DA
               10  SV-INITAST-SEQ-NBR       PIC S9(4) COMP.             ACAT10DA
               10  SV-DLVR-NBR              PIC X(04).                  ACAT10DA
               10  SV-RCV-NBR               PIC X(04).                  ACAT10DA
               10  SV-ACCT-DLVR-NBR         PIC X(20).                  ACAT10DA
               10  SV-ACCT-RCV-NBR          PIC X(20).                  ACAT10DA
               10  SV-STTLM-LCTN-CD         PIC X(02).                  ACAT10DA
               10  SV-CNTRY-CD              PIC X(02).                  ACAT10DA
               10  SV-SEC-ISSUE-CD          PIC X(09).                  ACAT10DA
               10  SV-SEC-CDG-CD            PIC X(01).                  ACAT10DA
           05  WS-ACAT10DA-IO.                                          ACAT10DA
               10 WS-SCREEN-IND                 PIC X(01).              ACAT10DA
               10 WS-CLIENT-NBR                 PIC X(04).              ACAT10DA
               10 WS-ACAT-CONTROL-NBR           PIC X(14).              ACAT10DA
               10 WS-BRANCH-CD                  PIC X(03).              ACAT10DA
               10 WS-ACCT-CD                    PIC X(05).              ACAT10DA
               10 WS-RR-CD                      PIC X(03).              ACAT10DA
               10 WS-BRKR                       PIC X(04).              ACAT10DA
               10 WS-TFR-TYPE                   PIC X(03).              ACAT10DA
               10 WS-DSTBN-SIDE-CD              PIC X(01).              ACAT10DA
               10 WS-STCD                       PIC X(03).              ACAT10DA
01/08          10 WS-DAYS                       PIC S9(04) COMP.        ACAT10DA
               10 WS-RCV-NBR                    PIC X(04).              ACAT10DA
               10 WS-DLVR-NBR                   PIC X(04).              ACAT10DA
               10 WS-ACCT-DLVR-NBR              PIC X(20).              ACAT10DA
               10 WS-ACCT-RCV-NBR               PIC X(20).              ACAT10DA
               10 WS-RCV-CUST-NM                PIC X(60).              ACAT10DA
               10 WS-RCV-SS-PRIM-NBR            PIC X(09).              ACAT10DA
               10 WS-RCV-SS-SCNDY-NBR           PIC X(09).              ACAT10DA
               10 WS-RCV-ACCT-TYPE-CD           PIC X(02).              ACAT10DA
               10 WS-INIT-TRANS-TYPE-CD         PIC X(01).              ACAT10DA
               10 WS-TIF-NSCC-PEND-CD           PIC X(01).              ACAT10DA
               10 WS-TRNFR-TYPE-RJCT-CD         PIC X(02).              ACAT10DA
               10 WS-STTLM-DT                   PIC X(10).              ACAT10DA
               10 WS-VTRNFR-CMNT                PIC X(120).             ACAT10DA
06/04          10 WS-ALERT-IND                  PIC X(01).              ACAT10DA
               10 WS-BAL01                      USAGE COMP-2.           ACAT10DA
               10 WS-BAL01-STTLM-RSN-CD         PIC X(04).              ACAT10DA
01/21          10 WS-BAL01-SEQ-NBR              PIC S9(4).              ACAT10DA
01/27          10 WS-BAL01-CMNT                 PIC X(120).             ACAT10DA
               10 WS-BAL02                      USAGE COMP-2.           ACAT10DA
               10 WS-BAL02-STTLM-RSN-CD         PIC X(04).              ACAT10DA
01/21          10 WS-BAL02-SEQ-NBR              PIC S9(4).              ACAT10DA
01/27          10 WS-BAL02-CMNT                 PIC X(120).             ACAT10DA
               10 WS-BAL05                      USAGE COMP-2.           ACAT10DA
               10 WS-BAL05-STTLM-RSN-CD         PIC X(04).              ACAT10DA
01/21          10 WS-BAL05-SEQ-NBR              PIC S9(4).              ACAT10DA
01/27          10 WS-BAL05-CMNT                 PIC X(120).             ACAT10DA
               10 WS-SMA                        USAGE COMP-2.           ACAT10DA
               10 WS-SMA-SEQ-NBR                PIC S9(4).              ACAT10DA
01/21          10 WS-SMA-CMS-CD                 PIC X(01).              ACAT10DA
01/27          10 WS-SMA-CMNT                   PIC X(120).             ACAT10DA
ET0001         10 WS-RETURN-MSG                 PIC X(79).              ACAT10DA
               10 WS-ACAT10DA-EXCEPTIONS.                               ACAT10DA
                  15 FILLER                         PIC X(1).           ACAT10DA
                  15 WS-TS-EXCEPTIONS.                                  ACAT10DA
                     20 WS-ACCT-ACTIVITY-IND        PIC X(01).          ACAT10DA
                     20 WS-ACCT-ORDERS-IND          PIC X(01).          ACAT10DA
                     20 WS-ACCT-RJCT-RSBM-IND       PIC X(01).          ACAT10DA
                     20 WS-ACCT-DB-BAL-T1-IND       PIC X(01).          ACAT10DA
                     20 WS-ACCT-MRGN-DB-IND         PIC X(01).          ACAT10DA
                     20 WS-ACCT-SHRT-PSTN-IND       PIC X(01).          ACAT10DA
                     20 WS-ACCT-SEC-RSTRD-IND       PIC X(01).          ACAT10DA
                     20 WS-ACCT-AST-EXCS-IND        PIC X(01).          ACAT10DA
                     20 WS-ACCT-OPTN-PSTN-IND       PIC X(01).          ACAT10DA
                     20 WS-ACCT-LTD-PRTNR-IND       PIC X(01).          ACAT10DA
                     20 WS-ACCT-TIN-MSMTH-IND       PIC X(01).          ACAT10DA
                     20 WS-ACCT-DPLCT-TRN-IND       PIC X(01).          ACAT10DA
                     20 WS-ACCT-CUST-70-IND         PIC X(01).          ACAT10DA
                     20 WS-ACCT-QULFD-PLN-IND       PIC X(01).          ACAT10DA
                     20 WS-ACCT-MNGD-IND            PIC X(01).          ACAT10DA
                     20 WS-ACCT-PRVT-RNG-IND        PIC X(01).          ACAT10DA
                     20 WS-ACCT-BRKR-TIF-IND        PIC X(01).          ACAT10DA
                     20 WS-NSCC-NON-ADP-IND         PIC X(01).          ACAT10DA
                     20 WS-ACCT-COMMENTS-IND        PIC X(01).          ACAT10DA
01/27                20 WS-CUST-TYPE-MISMATCH       PIC X(01).          ACAT10DA
01/27****            20 WS-ACCOUNT-FLAT-IND         PIC X(01).          ACAT10DA
01/27                20 WS-CMNT-STTS-CD             PIC X(01).          ACAT10DA
04/21                20 WS-TRNFR-TYPE-RJC1-CD       PIC X(02).          ACAT10DA
04/21                20 WS-TRNFR-TYPE-RJC2-CD       PIC X(01).          ACAT10DA
LRM002               20 WS-TRNFR-ACCT-RB-SEC-IND    PIC X(01).                  
LRM002               20 WS-TRNFR-ACCT-CLT-RSCND-IND PIC X(01).                  
LRM002               20 WS-TRNFR-ACCT-LGL-BLK-IND   PIC X(01).                  
ET0003               20 WS-ACCT-FRZN-IND            PIC X(01).          ACAT10DA
      ******************************************************************ACAT10DA
       01  WS-ABEND-MESSAGE.                                            ACAT10DA
           05  FILLER                      PIC X(24) VALUE              ACAT10DA
             'ACAT10DA ABENDED ====> '.                                 ACAT10DA
           05  WS-ABCODE                   PIC X(04) VALUE SPACES.      ACAT10DA
                                                                        ACAT10DA
       01  WS-ERRL-DATA.                                                ACAT10DA
           05  REQUEST-TYPE                PIC X(01).                   ACAT10DA
               88  WRITE-ERROR-TO-LOG          VALUE 'W'.               ACAT10DA
           05  CALLING-TRAN-ID             PIC X(04).                   ACAT10DA
           05  CALLING-PROGRAM-ID          PIC X(08).                   ACAT10DA
           05  SQLCA-AREA                  PIC X(136).                  ACAT10DA
       01  WS-WORK-AREA.                                                ACAT10DA
           05  WS-SEC-DESC                 PIC X(30).                   ACAT10DA
           05  SUB                         PIC S9(04) COMP.             ACAT10DA
      /                                                                 ACAT10DA
           COPY ACATSRCH.                                               ACAT10DA
      /                                                                 ACAT10DA
           EXEC SQL                                                     ACAT10DA
                INCLUDE SQLCA                                           ACAT10DA
           END-EXEC                                                     ACAT10DA
      /                                                                 ACAT10DA
      *====>  ACAT TRANSFER TABLE                                       ACAT10DA
014700     EXEC SQL                                                     ACAT10DA
PC             INCLUDE VTRNFR                                           ACAT10DA
014900     END-EXEC.                                                    ACAT10DA
015000/                                                                 ACAT10DA
      *====>  ACAT INITIAL TRANSFER TABLE                               ACAT10DA
014700     EXEC SQL                                                     ACAT10DA
ET0002**       INCLUDE VINITRNF                                         ACAT10DA
ET0002         INCLUDE ACTITRF                                          ACAT10DA
014900     END-EXEC.                                                    ACAT10DA
015000/                                                                 ACAT10DA
      *====>  ACAT ASSET  TABLE                                         ACAT10DA
014700     EXEC SQL                                                     ACAT10DA
PC             INCLUDE VASSET                                           ACAT10DA
014900     END-EXEC.                                                    ACAT10DA
015000/                                                                 ACAT10DA
      *====>  ACAT INITIAL ASSET TABLE                                  ACAT10DA
014700     EXEC SQL                                                     ACAT10DA
ET0002**       INCLUDE VINITAST                                         ACAT10DA
ET0002         INCLUDE ACTIAST                                          ACAT10DA
014900     END-EXEC.                                                    ACAT10DA
015000/                                                                 ACAT10DA
      *====>  ACAT OPTION TABLE                                         ACAT10DA
014700     EXEC SQL                                                     ACAT10DA
PC             INCLUDE VOPTN                                            ACAT10DA
014900     END-EXEC.                                                    ACAT10DA
015000/                                                                 ACAT10DA
      *====>  ACAT INITIAL OPTION TABLE                                 ACAT10DA
014700     EXEC SQL                                                     ACAT10DA
ET0002**       INCLUDE VINITOPN                                         ACAT10DA
ET0002         INCLUDE ACTIOPN                                          ACAT10DA
014900     END-EXEC.                                                    ACAT10DA
015000/                                                                 ACAT10DA
      ***                                                               ACAT10DA
      *----------------------------------------------------------------*ACAT10DA
      **      FORWARD SEARCH FOR NON-SEARCH-KEY SCROLLING             **ACAT10DA
      *----------------------------------------------------------------*ACAT10DA
      *                                                                 ACAT10DA
FWD   *====> DECLARE CURSOR (FWD_CSR) <===========*                     ACAT10DA
                                                                        ACAT10DA
014700     EXEC SQL                                                     ACAT10DA
               DECLARE FWD_CSR  CURSOR FOR                              ACAT10DA
092700         SELECT                                                   ACAT10DA
                     CLIENT_NBR                                         ACAT10DA
                   , ACAT_CONTROL_NBR                                   ACAT10DA
                   , BRANCH_CD                                          ACAT10DA
                   , RR_CD                                              ACAT10DA
                   , ACCT_CD                                            ACAT10DA
                   , TRNFR_TYPE_CD                                      ACAT10DA
                   , DSTBN_SIDE_CD                                      ACAT10DA
                   , STTS_CD                                            ACAT10DA
                   , DAYS_STTS_QTY                                      ACAT10DA
                   , RCV_NBR                                            ACAT10DA
                   , DLVR_NBR                                           ACAT10DA
                   , ACCT_DLVR_NBR                                      ACAT10DA
                   , ACCT_RCV_NBR                                       ACAT10DA
                   , RCV_CUST_NM                                        ACAT10DA
                   , RCV_SS_PRIM_NBR                                    ACAT10DA
                   , RCV_SS_SCNDY_NBR                                   ACAT10DA
                   , RCV_ACCT_TYPE_CD                                   ACAT10DA
                   , TRNFR_TYPE_RJCT_CD                                 ACAT10DA
                   , NSCC_PEND_CD                                       ACAT10DA
                   , STTLM_DT                                           ACAT10DA
                   , CMNT_TXT                                           ACAT10DA
                   , ACCT_ACTIVITY_IND                                  ACAT10DA
                   , ACCT_ORDERS_IND                                    ACAT10DA
                   , ACCT_RJCT_RSBM_IND                                 ACAT10DA
                   , ACCT_DB_BAL_T1_IND                                 ACAT10DA
                   , ACCT_MRGN_DB_IND                                   ACAT10DA
                   , ACCT_SHRT_PSTN_IND                                 ACAT10DA
                   , ACCT_SEC_RSTRD_IND                                 ACAT10DA
                   , ACCT_AST_EXCS_IND                                  ACAT10DA
                   , ACCT_OPTN_PSTN_IND                                 ACAT10DA
                   , ACCT_LTD_PRTNR_IND                                 ACAT10DA
                   , ACCT_TIN_MSMTH_IND                                 ACAT10DA
                   , ACCT_DPLCT_TRN_IND                                 ACAT10DA
                   , ACCT_CUST_70_IND                                   ACAT10DA
                   , ACCT_QULFD_PLN_IND                                 ACAT10DA
                   , ACCT_MNGD_IND                                      ACAT10DA
                   , ACCT_PRVT_RNG_IND                                  ACAT10DA
                   , ACCT_BRKR_TIF_IND                                  ACAT10DA
                   , NSCC_NON_ADP_IND                                   ACAT10DA
01/27              , CMNT_STTS_CD                                       ACAT10DA
04/21              , TRNFR_TYPE_RJC1_CD                                 ACAT10DA
04/21              , TRNFR_TYPE_RJC2_CD                                 ACAT10DA
06/21              , ALERT_IND                                          ACAT10DA
LRM002             , ACCT_RB_SEC_IND                                    ACAT10DA
                   , ACCT_CLT_RSCND_IND                                         
                   , ACCT_LGL_BLK_IND                                           
ET0003             , ACCT_FRZN_IND                                      ACAT10DA
LRM007             , STTLM_TM_CD                                                
LRM008             , ADOPT_AGRMT_IND                                            
LRM010             , CVRSN_ACCT_NBR                                             
LRM024             , NTWRK_LVL4_FND_IND                                         
092900                FROM VTRNFR                                       ACAT10DA
093000         WHERE (CLIENT_NBR = :SV-CLIENT-NBR)                      ACAT10DA
                 AND (TRNFR_TYPE_CD = 'FUL')                            ACAT10DA
                 AND (DSTBN_SIDE_CD = 'D')                              ACAT10DA
12/29            AND  STTS_CD IN                                        ACAT10DA
12/29            ('100', '110', '120', '130', '220')                    ACAT10DA
                 AND (ACCT_ACTIVITY_IND  = 'Y' OR                       ACAT10DA
                      ACCT_ORDERS_IND    = 'Y' OR                       ACAT10DA
                      ACCT_RJCT_RSBM_IND = 'Y' OR                       ACAT10DA
                      ACCT_DB_BAL_T1_IND = 'Y' OR                       ACAT10DA
                      ACCT_MRGN_DB_IND   = 'Y' OR                       ACAT10DA
                      ACCT_SHRT_PSTN_IND = 'Y' OR                       ACAT10DA
                      ACCT_SEC_RSTRD_IND = 'Y' OR                       ACAT10DA
                      ACCT_AST_EXCS_IND  = 'Y' OR                       ACAT10DA
LRM001                ACCT_OPTN_PSTN_IND = 'X' OR                       ACAT10DA
                      ACCT_OPTN_PSTN_IND = 'Y' OR                       ACAT10DA
                      ACCT_LTD_PRTNR_IND = 'Y' OR                       ACAT10DA
                      ACCT_TIN_MSMTH_IND = 'Y' OR                       ACAT10DA
                      ACCT_DPLCT_TRN_IND = 'Y' OR                       ACAT10DA
                      ACCT_CUST_70_IND   = 'Y' OR                       ACAT10DA
                      ACCT_QULFD_PLN_IND = 'Y' OR                       ACAT10DA
                      ACCT_MNGD_IND      = 'Y' OR                       ACAT10DA
                      ACCT_PRVT_RNG_IND  = 'Y' OR                       ACAT10DA
                      ACCT_BRKR_TIF_IND  = 'Y' OR                       ACAT10DA
                      NSCC_NON_ADP_IND   = 'Y' OR                       ACAT10DA
LRM002                ACCT_RB_SEC_IND    = 'Y' OR                               
LRM002                ACCT_CLT_RSCND_IND = 'Y' OR                               
LRM002                ACCT_LGL_BLK_IND   = 'Y' OR                               
ET0003                ACCT_FRZN_IND      = 'Y' OR                       ACAT10DA
LRM008                ADOPT_AGRMT_IND    = 'N' OR                       ACAT10DA
LRM024                NTWRK_LVL4_FND_IND = 'Y' OR                               
                      TRNFR_TYPE_RJCT_CD IN ('02', '04') OR             ACAT10DA
LRM012                TRNFR_TYPE_RJC2_CD IN ('F', 'D', 'L', 'N' ) OR    ACAT10DA
                      CMNT_STTS_CD = 'Y')                               ACAT10DA
                 AND                                                    ACAT10DA
                      ((BRANCH_CD > :SV-BRANCH-CD       OR              ACAT10DA
                       (BRANCH_CD = :SV-BRANCH-CD AND                   ACAT10DA
                        ACCT_CD > :SV-ACCT-CD)          OR              ACAT10DA
                       (BRANCH_CD = :SV-BRANCH-CD AND                   ACAT10DA
                        ACCT_CD = :SV-ACCT-CD     AND                   ACAT10DA
                        ACAT_CONTROL_NBR > :SV-ACAT-CNTL-NBR))          ACAT10DA
                                                            AND         ACAT10DA
                       RR_CD   LIKE :SV-RR-CD               AND         ACAT10DA
                       RCV_NBR LIKE :SV-BRKR                AND         ACAT10DA
                       STTS_CD LIKE :SV-STCD )                          ACAT10DA
                 ORDER BY  BRANCH_CD, ACCT_CD, RR_CD, RCV_NBR,          ACAT10DA
                           STTS_CD, ACAT_CONTROL_NBR                    ACAT10DA
           END-EXEC.                                                    ACAT10DA
015000/                                                                 ACAT10DA
      *----------------------------------------------------------------*ACAT10DA
      **      BACKWARD SEARCH FOR NON-SEARCH-KEY SCROLLING            **ACAT10DA
      *----------------------------------------------------------------*ACAT10DA
BWD   *====> DECLARE CURSOR (BWD_CSR) <===========*                     ACAT10DA
                                                                        ACAT10DA
014700     EXEC SQL                                                     ACAT10DA
               DECLARE BWD_CSR  CURSOR FOR                              ACAT10DA
092700         SELECT                                                   ACAT10DA
                     CLIENT_NBR                                         ACAT10DA
                   , ACAT_CONTROL_NBR                                   ACAT10DA
                   , BRANCH_CD                                          ACAT10DA
                   , RR_CD                                              ACAT10DA
                   , ACCT_CD                                            ACAT10DA
                   , TRNFR_TYPE_CD                                      ACAT10DA
                   , DSTBN_SIDE_CD                                      ACAT10DA
                   , STTS_CD                                            ACAT10DA
                   , DAYS_STTS_QTY                                      ACAT10DA
                   , RCV_NBR                                            ACAT10DA
                   , DLVR_NBR                                           ACAT10DA
                   , ACCT_DLVR_NBR                                      ACAT10DA
                   , ACCT_RCV_NBR                                       ACAT10DA
                   , RCV_CUST_NM                                        ACAT10DA
                   , RCV_SS_PRIM_NBR                                    ACAT10DA
                   , RCV_SS_SCNDY_NBR                                   ACAT10DA
                   , RCV_ACCT_TYPE_CD                                   ACAT10DA
                   , TRNFR_TYPE_RJCT_CD                                 ACAT10DA
                   , NSCC_PEND_CD                                       ACAT10DA
                   , STTLM_DT                                           ACAT10DA
                   , CMNT_TXT                                           ACAT10DA
                   , ACCT_ACTIVITY_IND                                  ACAT10DA
                   , ACCT_ORDERS_IND                                    ACAT10DA
                   , ACCT_RJCT_RSBM_IND                                 ACAT10DA
                   , ACCT_DB_BAL_T1_IND                                 ACAT10DA
                   , ACCT_MRGN_DB_IND                                   ACAT10DA
                   , ACCT_SHRT_PSTN_IND                                 ACAT10DA
                   , ACCT_SEC_RSTRD_IND                                 ACAT10DA
                   , ACCT_AST_EXCS_IND                                  ACAT10DA
                   , ACCT_OPTN_PSTN_IND                                 ACAT10DA
                   , ACCT_LTD_PRTNR_IND                                 ACAT10DA
                   , ACCT_TIN_MSMTH_IND                                 ACAT10DA
                   , ACCT_DPLCT_TRN_IND                                 ACAT10DA
                   , ACCT_CUST_70_IND                                   ACAT10DA
                   , ACCT_QULFD_PLN_IND                                 ACAT10DA
                   , ACCT_MNGD_IND                                      ACAT10DA
                   , ACCT_PRVT_RNG_IND                                  ACAT10DA
                   , ACCT_BRKR_TIF_IND                                  ACAT10DA
                   , NSCC_NON_ADP_IND                                   ACAT10DA
01/27              , CMNT_STTS_CD                                       ACAT10DA
04/21              , TRNFR_TYPE_RJC1_CD                                 ACAT10DA
04/21              , TRNFR_TYPE_RJC2_CD                                 ACAT10DA
06/21              , ALERT_IND                                          ACAT10DA
LRM002             , ACCT_RB_SEC_IND                                            
LRM002             , ACCT_CLT_RSCND_IND                                         
LRM002             , ACCT_LGL_BLK_IND                                           
ET0003             , ACCT_FRZN_IND                                      ACAT10DA
LRM007             , STTLM_TM_CD                                                
LRM008             , ADOPT_AGRMT_IND                                            
LRM010             , CVRSN_ACCT_NBR                                             
LRM024             , NTWRK_LVL4_FND_IND                                         
092900                FROM VTRNFR                                       ACAT10DA
093000         WHERE (CLIENT_NBR = :SV-CLIENT-NBR)                      ACAT10DA
                 AND (TRNFR_TYPE_CD = 'FUL')                            ACAT10DA
                 AND (DSTBN_SIDE_CD = 'D')                              ACAT10DA
12/29            AND  STTS_CD IN                                        ACAT10DA
12/29            ('100', '110', '120', '130', '220')                    ACAT10DA
                 AND (ACCT_ACTIVITY_IND  = 'Y' OR                       ACAT10DA
                      ACCT_ORDERS_IND    = 'Y' OR                       ACAT10DA
                      ACCT_RJCT_RSBM_IND = 'Y' OR                       ACAT10DA
                      ACCT_DB_BAL_T1_IND = 'Y' OR                       ACAT10DA
                      ACCT_MRGN_DB_IND   = 'Y' OR                       ACAT10DA
                      ACCT_SHRT_PSTN_IND = 'Y' OR                       ACAT10DA
                      ACCT_SEC_RSTRD_IND = 'Y' OR                       ACAT10DA
                      ACCT_AST_EXCS_IND  = 'Y' OR                       ACAT10DA
LRM001                ACCT_OPTN_PSTN_IND = 'X' OR                       ACAT10DA
                      ACCT_OPTN_PSTN_IND = 'Y' OR                       ACAT10DA
                      ACCT_LTD_PRTNR_IND = 'Y' OR                       ACAT10DA
                      ACCT_TIN_MSMTH_IND = 'Y' OR                       ACAT10DA
                      ACCT_DPLCT_TRN_IND = 'Y' OR                       ACAT10DA
                      ACCT_CUST_70_IND   = 'Y' OR                       ACAT10DA
                      ACCT_QULFD_PLN_IND = 'Y' OR                       ACAT10DA
                      ACCT_MNGD_IND      = 'Y' OR                       ACAT10DA
                      ACCT_PRVT_RNG_IND  = 'Y' OR                       ACAT10DA
                      ACCT_BRKR_TIF_IND  = 'Y' OR                       ACAT10DA
                      NSCC_NON_ADP_IND   = 'Y' OR                       ACAT10DA
LRM002                ACCT_RB_SEC_IND    = 'Y' OR                               
LRM002                ACCT_CLT_RSCND_IND = 'Y' OR                               
LRM002                ACCT_LGL_BLK_IND   = 'Y' OR                               
ET0003                ACCT_FRZN_IND      = 'Y' OR                       ACAT10DA
LRM008                ADOPT_AGRMT_IND    = 'N' OR                       ACAT10DA
LRM024                NTWRK_LVL4_FND_IND = 'Y' OR                               
                      TRNFR_TYPE_RJCT_CD IN ('02', '04') OR             ACAT10DA
                      CMNT_STTS_CD = 'Y')                               ACAT10DA
                 AND                                                    ACAT10DA
                     ((BRANCH_CD < :SV-BRANCH-CD      OR                ACAT10DA
                      (BRANCH_CD = :SV-BRANCH-CD AND                    ACAT10DA
                       ACCT_CD < :SV-ACCT-CD)         OR                ACAT10DA
                      (BRANCH_CD = :SV-BRANCH-CD AND                    ACAT10DA
                       ACCT_CD = :SV-ACCT-CD     AND                    ACAT10DA
                       ACAT_CONTROL_NBR < :SV-ACAT-CNTL-NBR))           ACAT10DA
                                                           AND          ACAT10DA
                       RR_CD    LIKE :SV-RR-CD             AND          ACAT10DA
                       RCV_NBR  LIKE :SV-BRKR              AND          ACAT10DA
                       STTS_CD  LIKE :SV-STCD )                         ACAT10DA
                 ORDER BY BRANCH_CD DESC, ACCT_CD DESC, RR_CD DESC,     ACAT10DA
                          RCV_NBR DESC,  STTS_CD DESC,                  ACAT10DA
                          ACAT_CONTROL_NBR DESC                         ACAT10DA
014900     END-EXEC.                                                    ACAT10DA
      ******************************************************************ACAT10DA
015000/                                                                 ACAT10DA
      **********************************************************        ACAT10DA
      *****      L I N K A G E  S E C T I O N              *****        ACAT10DA
      **********************************************************        ACAT10DA
       LINKAGE SECTION.                                                 ACAT10DA
                                                                        ACAT10DA
       01  DFHCOMMAREA.                                                 ACAT10DA
           COPY ACAT10IO.                                               ACAT10DA
      /                                                                 ACAT10DA
      **********************************************************        ACAT10DA
      *****   P R O C E D U R E   D I V I S I O N           *****       ACAT10DA
      **********************************************************        ACAT10DA
       PROCEDURE DIVISION.                                              ACAT10DA
                                                                        ACAT10DA
           MOVE EIBCALEN TO WS-EIBCALEN.                                ACAT10DA
                                                                        ACAT10DA
           IF WS-EIBCALEN > +0                                          ACAT10DA
              PERFORM 0000-MAIN-RTN                                     ACAT10DA
           ELSE                                                         ACAT10DA
              EXEC CICS RETURN END-EXEC                                 ACAT10DA
           END-IF.                                                      ACAT10DA
      *                                                                 ACAT10DA
       0000-MAIN-RTN.                                                   ACAT10DA
      *                                                                 ACAT10DA
           MOVE LOW-VALUES TO WS-ACAT10DA-IO.                           ACAT10DA
01/28      INITIALIZE WS-BALANCE-WORK-AREA, WS-IO-AREA.                 ACAT10DA
      *                                                                 ACAT10DA
           MOVE ACAT10IO-SAVE-KEYS    TO  WS-SAVE-KEY.                  ACAT10DA
      ******************************************************************ACAT10DA
12/21      IF ACAT10IO-FIRST-TIME                                       ACAT10DA
12/21 **   IF (ACAT10IO-FIRST-TIME   AND                                ACAT10DA
12/21 **      NOT ACAT10IO-SRCH-VTRNFR-PND)                             ACAT10DA
             IF  ((SV-ACAT-CNTL-NBR = SPACES OR LOW-VALUE)              ACAT10DA
              AND (SV-BRANCH-CD     = SPACES OR LOW-VALUE)              ACAT10DA
              AND (SV-ACCT-CD       = SPACES OR LOW-VALUE)              ACAT10DA
              AND (SV-RR-CD         = SPACES OR LOW-VALUE)              ACAT10DA
              AND (SV-BRKR          = SPACES OR LOW-VALUE)              ACAT10DA
              AND (SV-TFR           = SPACES OR LOW-VALUE)              ACAT10DA
              AND (SV-STCD          = SPACES OR LOW-VALUE)              ACAT10DA
              AND (SV-DLVR-NBR      = SPACES OR LOW-VALUE)              ACAT10DA
              AND (SV-RCV-NBR       = SPACES OR LOW-VALUE)              ACAT10DA
              AND (SV-ACCT-DLVR-NBR = SPACES OR LOW-VALUE)              ACAT10DA
              AND (SV-ACCT-RCV-NBR  = SPACES OR LOW-VALUE)              ACAT10DA
              AND (SV-STTLM-LCTN-CD = SPACES OR LOW-VALUE)              ACAT10DA
              AND (SV-SEC-ISSUE-CD  = SPACES OR LOW-VALUE)              ACAT10DA
              AND (SV-ASSET-SEQ-NBR = +0))                              ACAT10DA
              PERFORM                                                   ACAT10DA
092600          EXEC SQL                                                ACAT10DA
092700           SELECT COUNT(*)                                        ACAT10DA
                      INTO : WS-COUNT                                   ACAT10DA
092900                FROM VTRNFR                                       ACAT10DA
093000           WHERE (CLIENT_NBR  = :SV-CLIENT-NBR)                   ACAT10DA
                 AND (TRNFR_TYPE_CD = 'FUL')                            ACAT10DA
                 AND (DSTBN_SIDE_CD = 'D')                              ACAT10DA
12/29            AND  STTS_CD IN                                        ACAT10DA
12/29            ('100', '110', '120', '130', '200', '210', '220','230')ACAT10DA
                 AND (ACCT_ACTIVITY_IND  = 'Y' OR                       ACAT10DA
                      ACCT_ORDERS_IND    = 'Y' OR                       ACAT10DA
                      ACCT_RJCT_RSBM_IND = 'Y' OR                       ACAT10DA
                      ACCT_DB_BAL_T1_IND = 'Y' OR                       ACAT10DA
                      ACCT_MRGN_DB_IND   = 'Y' OR                       ACAT10DA
                      ACCT_SHRT_PSTN_IND = 'Y' OR                       ACAT10DA
                      ACCT_SEC_RSTRD_IND = 'Y' OR                       ACAT10DA
                      ACCT_AST_EXCS_IND  = 'Y' OR                       ACAT10DA
LRM001                ACCT_OPTN_PSTN_IND = 'X' OR                       ACAT10DA
                      ACCT_OPTN_PSTN_IND = 'Y' OR                       ACAT10DA
                      ACCT_LTD_PRTNR_IND = 'Y' OR                       ACAT10DA
                      ACCT_TIN_MSMTH_IND = 'Y' OR                       ACAT10DA
                      ACCT_DPLCT_TRN_IND = 'Y' OR                       ACAT10DA
                      ACCT_CUST_70_IND   = 'Y' OR                       ACAT10DA
                      ACCT_QULFD_PLN_IND = 'Y' OR                       ACAT10DA
                      ACCT_MNGD_IND      = 'Y' OR                       ACAT10DA
                      ACCT_PRVT_RNG_IND  = 'Y' OR                       ACAT10DA
                      ACCT_BRKR_TIF_IND  = 'Y' OR                       ACAT10DA
                      NSCC_NON_ADP_IND   = 'Y' OR                       ACAT10DA
                      TRNFR_TYPE_RJCT_CD IN ('02', '04') OR             ACAT10DA
ET0003                ACCT_FRZN_IND IN ('Y', 'O')        OR             ACAT10DA
01/27                 CMNT_STTS_CD = 'Y' OR                             ACAT10DA
04/21                 TRNFR_TYPE_RJC1_CD = 'SP' OR                      ACAT10DA
LRM011                TRNFR_TYPE_RJC2_CD IN ('F', 'D', 'L', 'N'))       ACAT10DA
               END-EXEC                                                 ACAT10DA
                                                                        ACAT10DA
              IF WS-COUNT = +0                                          ACAT10DA
                  SET VTRNFR-NOT-FOUND TO TRUE                          ACAT10DA
                  MOVE 'NO TRANSFER FOR THIS CLIENT (ACAT10DA)'         ACAT10DA
                       TO WS-RETURN-MSG                                 ACAT10DA
                  MOVE WS-RETURN-MSG TO ACAT10IO-RETURN-MSG             ACAT10DA
                  EXEC CICS RETURN END-EXEC                             ACAT10DA
              ELSE                                                      ACAT10DA
                  SET VTRNFR-FOUND TO TRUE                              ACAT10DA
                  MOVE WS-COUNT TO ACAT10IO-VTRNFR-COUNT                ACAT10DA
              END-IF                                                    ACAT10DA
           END-PERFORM.                                                 ACAT10DA
      *----------------------------------------------------------------*ACAT10DA
                                                                        ACAT10DA
           IF ACAT10IO-ISRT-VINITRNF                                    ACAT10DA
              PERFORM 0700-ISRT-VINITRNF                                ACAT10DA
           ELSE                                                         ACAT10DA
             IF ACAT10IO-DLTE-VINITRNF                                  ACAT10DA
                PERFORM 0800-DLTE-VINITRNF                              ACAT10DA
             ELSE                                                       ACAT10DA
                 IF ACAT10IO-SRCH-VTRNFR                                ACAT10DA
                    IF SV-ACAT-CNTL-NBR = LOW-VALUES OR SPACES          ACAT10DA
                       MOVE 'F' TO ACAT10IO-SEARCH-VTRNFR               ACAT10DA
                    END-IF                                              ACAT10DA
ET0003           ELSE                                                   ACAT10DA
ET0003              IF ACAT10IO-UPDT-FRZN-IND                           ACAT10DA
ET0003                 PERFORM 0900-UPDT-FRZN-IND                       ACAT10DA
ET0003              END-IF                                              ACAT10DA
                 END-IF                                                 ACAT10DA
             END-IF                                                     ACAT10DA
           END-IF.                                                      ACAT10DA
      *                                                                 ACAT10DA
           IF ACAT10IO-VINITRNF-INSERTED                                ACAT10DA
              IF ACAT10IO-XFR-REJ-YES                                   ACAT10DA
12/18****        MOVE 'NEW REJECTED TRANSFER IS CREATED'                ACAT10DA
                 MOVE 'THIS TIF WILL BE REJECTED'                       ACAT10DA
                 TO WS-RETURN-MSG                                       ACAT10DA
              ELSE                                                      ACAT10DA
                 IF ACAT10IO-XFR-REJC-YES                               ACAT10DA
12/18*****          MOVE 'NEW REJECTED/COMMENTS TRANSFER IS CREATED'    ACAT10DA
                    MOVE 'THIS TIF WILL BE REJECTED W/COMMENTS'         ACAT10DA
                    TO WS-RETURN-MSG                                    ACAT10DA
                 END-IF                                                 ACAT10DA
              END-IF                                                    ACAT10DA
           END-IF.                                                      ACAT10DA
                                                                        ACAT10DA
           IF ACAT10IO-VINITRNF-DELETED                                 ACAT10DA
              IF ACAT10IO-XFR-REJ-NO                                    ACAT10DA
                 MOVE 'THIS TIF WILL NOT BE REJECTED'                   ACAT10DA
                 TO WS-RETURN-MSG                                       ACAT10DA
              ELSE                                                      ACAT10DA
                 IF ACAT10IO-XFR-REJC-NO                                ACAT10DA
                    MOVE 'THIS TIF WILL NOT BE REJECTED'                ACAT10DA
                    TO WS-RETURN-MSG                                    ACAT10DA
                 END-IF                                                 ACAT10DA
              END-IF                                                    ACAT10DA
           END-IF.                                                      ACAT10DA
                                                                        ACAT10DA
           IF ACAT10IO-SRCH-VTRNFR                                      ACAT10DA
              IF ACAT10IO-SRCH-VTRNFR-PND                               ACAT10DA
                 PERFORM 0400-RETRIEVE-PEND-XFR THRU 0400-EXIT          ACAT10DA
              ELSE                                                      ACAT10DA
                 IF ACAT10IO-SRCH-VTRNFR                                ACAT10DA
                    IF ACAT10IO-SRCH-VTRNFR-FWD                         ACAT10DA
                         PERFORM 0100-FETCH-VTRNFR-FWD                  ACAT10DA
                            THRU 0100-EXIT                              ACAT10DA
                    ELSE                                                ACAT10DA
                        IF ACAT10IO-SRCH-VTRNFR-BWD                     ACAT10DA
                           PERFORM 0200-FETCH-VTRNFR-BWD                ACAT10DA
                              THRU 0200-EXIT                            ACAT10DA
                        END-IF                                          ACAT10DA
                    END-IF                                              ACAT10DA
                 END-IF                                                 ACAT10DA
              END-IF                                                    ACAT10DA
           END-IF.                                                      ACAT10DA
                                                                        ACAT10DA
      *----------------------------------------------------------------*ACAT10DA
      *  VTRNF-NSCC-PEND-CD WILL BE UPDATED TO 'S' OR ' ', DEPENDING ON ACAT10DA
      *  ASSETS SUBMITTED OR UNSUBMITTED.                               ACAT10DA
      *----------------------------------------------------------------*ACAT10DA
      *                                                                 ACAT10DA
           IF ACAT10IO-UPDT-VTRNFR       AND                            ACAT10DA
              ACAT10IO-VINITAST-UPDATED                                 ACAT10DA
              IF  ACAT10IO-MSUBM = 'S'                                  ACAT10DA
                EXEC SQL                                                ACAT10DA
                     UPDATE VTRNFR                                      ACAT10DA
                       SET NSCC_PEND_CD = 'S'                           ACAT10DA
                          ,UPDT_TMSTP = CURRENT TIMESTAMP               ACAT10DA
                          ,PRGM_NM = 'ACAT10DA'                         ACAT10DA
                     WHERE CLIENT_NBR = :SV-CLIENT-NBR AND              ACAT10DA
                           ACAT_CONTROL_NBR = :SV-ACAT-CNTL-NBR         ACAT10DA
                  END-EXEC                                              ACAT10DA
093400            EVALUATE SQLCODE                                      ACAT10DA
093500              WHEN +0                                             ACAT10DA
                         SET ACAT10IO-VTRNFR-UPDATED TO TRUE            ACAT10DA
                         MOVE 'S' TO ACAT10IO-TIF-NSCC-PEND-CD          ACAT10DA
                    WHEN +100                                           ACAT10DA
                         SET ACAT10IO-VTRNFR-NOT-FOUND TO TRUE          ACAT10DA
                         SET CURRENT-VTRNFR-NOT-FOUND TO TRUE           ACAT10DA
                         MOVE ' FAIL TO UPDATE VTRNFR (SUBMITTE)'       ACAT10DA
                                                       TO WS-RETURN-MSG ACAT10DA
094000              WHEN OTHER                                          ACAT10DA
                         MOVE SPACE TO ACAT10IO-VINITRNF-SW             ACAT10DA
                         MOVE 'UPDATE' TO ACAT10IO-SQLCAID              ACAT10DA
                         PERFORM 9000-WRITE-TO-CICS-LOG                 ACAT10DA
                         PERFORM 9500-RETURN-DB2-ERROR                  ACAT10DA
094200            END-EVALUATE                                          ACAT10DA
              ELSE                                                      ACAT10DA
                 IF ACAT10IO-MSUBM = ' '                                ACAT10DA
                   EXEC SQL                                             ACAT10DA
                        UPDATE VTRNFR                                   ACAT10DA
                          SET NSCC_PEND_CD = 'H'                        ACAT10DA
                             ,UPDT_TMSTP = CURRENT TIMESTAMP            ACAT10DA
                             ,PRGM_NM = 'ACAT10DA'                      ACAT10DA
                        WHERE CLIENT_NBR = :SV-CLIENT-NBR AND           ACAT10DA
                              ACAT_CONTROL_NBR = :SV-ACAT-CNTL-NBR      ACAT10DA
                     END-EXEC                                           ACAT10DA
093400               EVALUATE SQLCODE                                   ACAT10DA
093500                WHEN +0                                           ACAT10DA
                           SET ACAT10IO-VTRNFR-UPDATED TO TRUE          ACAT10DA
                           MOVE 'H' TO ACAT10IO-TIF-NSCC-PEND-CD        ACAT10DA
                      WHEN +100                                         ACAT10DA
                           SET ACAT10IO-VTRNFR-NOT-FOUND TO TRUE        ACAT10DA
                           SET CURRENT-VTRNFR-NOT-FOUND TO TRUE         ACAT10DA
                           MOVE ' FAIL TO UPDATE VTRNFR (UNSUBMITTED)'  ACAT10DA
                                                       TO WS-RETURN-MSG ACAT10DA
094000                WHEN OTHER                                        ACAT10DA
                           MOVE SPACE TO ACAT10IO-VINITRNF-SW           ACAT10DA
                           PERFORM 9000-WRITE-TO-CICS-LOG               ACAT10DA
                            MOVE 'UPDATE' TO ACAT10IO-SQLCAID           ACAT10DA
                           PERFORM 9500-RETURN-DB2-ERROR                ACAT10DA
094200               END-EVALUATE                                       ACAT10DA
                 END-IF                                                 ACAT10DA
              END-IF                                                    ACAT10DA
           ELSE                                                         ACAT10DA
              IF ACAT10IO-SRCH-VTRNFR  AND                              ACAT10DA
                 ACAT10IO-VTRNFR-FOUND                                  ACAT10DA
                 MOVE WS-SAVE-KEY TO ACAT10IO-SAVE-KEYS                 ACAT10DA
                 PERFORM 0500-MOVE-DATA                                 ACAT10DA
                 IF ACAT10IO-TIF-ACCT-CHG                               ACAT10DA
                    MOVE WS-RETURN-MSG TO ACAT10IO-RETURN-MSG           ACAT10DA
                 END-IF                                                 ACAT10DA
              ELSE                                                      ACAT10DA
                 MOVE WS-RETURN-MSG TO ACAT10IO-RETURN-MSG              ACAT10DA
              END-IF                                                    ACAT10DA
           END-IF.                                                      ACAT10DA
                                                                        ACAT10DA
           EXEC CICS RETURN END-EXEC.                                   ACAT10DA
      *                                                                 ACAT10DA
       0000-EXIT.                                                       ACAT10DA
           EXIT.                                                        ACAT10DA
      /                                                                 ACAT10DA
       0050-SETUP-SRCH-KEYS.                                            ACAT10DA
      *                                                                 ACAT10DA
11/09 **** SET UP KEYS FOR SEARCH ENGINE =============>                 ACAT10DA
BEG==>     IF ACAT10IO-MBR = SPACE OR LOW-VALUE                         ACAT10DA
              IF ACAT10IO-SV-BRANCH-CD = SPACE OR LOW-VALUE             ACAT10DA
                 MOVE ALL '%' TO SV-BRANCH-CD, SV-ACCT-CD               ACAT10DA
              ELSE                                                      ACAT10DA
                 CONTINUE                                               ACAT10DA
              END-IF                                                    ACAT10DA
           END-IF.                                                      ACAT10DA
                                                                        ACAT10DA
           IF ACAT10IO-MAC = SPACE OR LOW-VALUE                         ACAT10DA
              IF ACAT10IO-SV-ACCT-CD = SPACE OR LOW-VALUE               ACAT10DA
                 MOVE ALL '%' TO SV-ACCT-CD                             ACAT10DA
              END-IF                                                    ACAT10DA
           END-IF.                                                      ACAT10DA
                                                                        ACAT10DA
           IF ACAT10IO-MRR  = SPACE OR LOW-VALUE                        ACAT10DA
              MOVE ALL '%' TO SV-RR-CD                                  ACAT10DA
           ELSE                                                         ACAT10DA
              MOVE ACAT10IO-MRR TO SV-RR-CD                             ACAT10DA
           END-IF.                                                      ACAT10DA
                                                                        ACAT10DA
           IF ACAT10IO-MCBRKR = SPACE OR LOW-VALUE                      ACAT10DA
              MOVE ALL '%' TO SV-BRKR                                   ACAT10DA
           ELSE                                                         ACAT10DA
              MOVE ACAT10IO-MCBRKR  TO  SV-BRKR                         ACAT10DA
           END-IF.                                                      ACAT10DA
                                                                        ACAT10DA
           IF ACAT10IO-MTFR  = SPACE OR LOW-VALUE                       ACAT10DA
              MOVE ALL '%' TO SV-TFR                                    ACAT10DA
           ELSE                                                         ACAT10DA
              MOVE ACAT10IO-MTFR TO SV-TFR                              ACAT10DA
           END-IF.                                                      ACAT10DA
                                                                        ACAT10DA
           IF ACAT10IO-MSTAT  = SPACE OR LOW-VALUE                      ACAT10DA
              MOVE ALL '%' TO SV-STCD                                   ACAT10DA
           ELSE                                                         ACAT10DA
              EVALUATE ACAT10IO-MSTAT                                   ACAT10DA
                 WHEN 'REQ'     MOVE  '100' TO SV-STCD                  ACAT10DA
                 WHEN 'RQA'     MOVE  '110' TO SV-STCD                  ACAT10DA
                 WHEN 'RAP'     MOVE  '120' TO SV-STCD                  ACAT10DA
                 WHEN 'RQP'     MOVE  '130' TO SV-STCD                  ACAT10DA
                 WHEN 'RQR'     MOVE  '140' TO SV-STCD                  ACAT10DA
                 WHEN 'REV'     MOVE  '200' TO SV-STCD                  ACAT10DA
                 WHEN 'RVA'     MOVE  '210' TO SV-STCD                  ACAT10DA
                 WHEN 'RVE'     MOVE  '220' TO SV-STCD                  ACAT10DA
                 WHEN 'RVX'     MOVE  '230' TO SV-STCD                  ACAT10DA
                 WHEN 'STP'     MOVE  '300' TO SV-STCD                  ACAT10DA
                 WHEN 'STC'     MOVE  '310' TO SV-STCD                  ACAT10DA
                 WHEN 'CLP'     MOVE  '400' TO SV-STCD                  ACAT10DA
                 WHEN 'PUR'     MOVE  '500' TO SV-STCD                  ACAT10DA
                 WHEN 'MPP'     MOVE  '510' TO SV-STCD                  ACAT10DA
                 WHEN 'REJ'     MOVE  '600' TO SV-STCD                  ACAT10DA
              END-EVALUATE                                              ACAT10DA
           END-IF.                                                      ACAT10DA
                                                                        ACAT10DA
           IF ACAT10IO-SV-ACAT-CNTL-NBR = SPACE OR LOW-VALUE            ACAT10DA
              MOVE ALL '%'  TO SV-ACAT-CNTL-NBR                         ACAT10DA
           END-IF.                                                      ACAT10DA
END=>*****                                                              ACAT10DA
       0050-EXIT.                                                       ACAT10DA
           EXIT.                                                        ACAT10DA
      /                                                                 ACAT10DA
       0100-FETCH-VTRNFR-FWD.                                           ACAT10DA
      *----------------------------------------------------------------*ACAT10DA
      *   FORWARD FETCH ROWS  FROM VTRNFR (ACAT_TRNFR) TABLE           *ACAT10DA
      *----------------------------------------------------------------*ACAT10DA
                                                                        ACAT10DA
           PERFORM 0050-SETUP-SRCH-KEYS THRU 0050-EXIT.                 ACAT10DA
                                                                        ACAT10DA
           EXEC SQL                                                     ACAT10DA
               OPEN FWD_CSR                                             ACAT10DA
           END-EXEC.                                                    ACAT10DA
                                                                        ACAT10DA
       0100-FETCH-NEXT.                                                 ACAT10DA
092600     EXEC SQL                                                     ACAT10DA
092700          FETCH  FWD_CSR                                          ACAT10DA
                 INTO                                                   ACAT10DA
                       :WS-CLIENT-NBR                                   ACAT10DA
                      ,:WS-ACAT-CONTROL-NBR                             ACAT10DA
                      ,:WS-BRANCH-CD                                    ACAT10DA
                      ,:WS-RR-CD                                        ACAT10DA
                      ,:WS-ACCT-CD                                      ACAT10DA
                      ,:WS-TFR-TYPE                                     ACAT10DA
                      ,:WS-DSTBN-SIDE-CD                                ACAT10DA
                      ,:WS-STCD                                         ACAT10DA
                      ,:WS-DAYS                                         ACAT10DA
                      ,:WS-RCV-NBR                                      ACAT10DA
                      ,:WS-DLVR-NBR                                     ACAT10DA
                      ,:WS-ACCT-DLVR-NBR                                ACAT10DA
                      ,:WS-ACCT-RCV-NBR                                 ACAT10DA
                      ,:WS-RCV-CUST-NM                                  ACAT10DA
                      ,:WS-RCV-SS-PRIM-NBR                              ACAT10DA
                      ,:WS-RCV-SS-SCNDY-NBR                             ACAT10DA
                      ,:WS-RCV-ACCT-TYPE-CD                             ACAT10DA
                      ,:WS-TRNFR-TYPE-RJCT-CD                           ACAT10DA
                      ,:WS-TIF-NSCC-PEND-CD                             ACAT10DA
                      ,:WS-STTLM-DT                                     ACAT10DA
                      ,:WS-VTRNFR-CMNT                                  ACAT10DA
                      ,:WS-ACCT-ACTIVITY-IND                            ACAT10DA
                      ,:WS-ACCT-ORDERS-IND                              ACAT10DA
                      ,:WS-ACCT-RJCT-RSBM-IND                           ACAT10DA
                      ,:WS-ACCT-DB-BAL-T1-IND                           ACAT10DA
                      ,:WS-ACCT-MRGN-DB-IND                             ACAT10DA
                      ,:WS-ACCT-SHRT-PSTN-IND                           ACAT10DA
                      ,:WS-ACCT-SEC-RSTRD-IND                           ACAT10DA
                      ,:WS-ACCT-AST-EXCS-IND                            ACAT10DA
                      ,:WS-ACCT-OPTN-PSTN-IND                           ACAT10DA
                      ,:WS-ACCT-LTD-PRTNR-IND                           ACAT10DA
                      ,:WS-ACCT-TIN-MSMTH-IND                           ACAT10DA
                      ,:WS-ACCT-DPLCT-TRN-IND                           ACAT10DA
                      ,:WS-ACCT-CUST-70-IND                             ACAT10DA
                      ,:WS-ACCT-QULFD-PLN-IND                           ACAT10DA
                      ,:WS-ACCT-MNGD-IND                                ACAT10DA
                      ,:WS-ACCT-PRVT-RNG-IND                            ACAT10DA
                      ,:WS-ACCT-BRKR-TIF-IND                            ACAT10DA
                      ,:WS-NSCC-NON-ADP-IND                             ACAT10DA
01/27                 ,:WS-CMNT-STTS-CD                                 ACAT10DA
04/21                 ,:WS-TRNFR-TYPE-RJC1-CD                           ACAT10DA
04/21                 ,:WS-TRNFR-TYPE-RJC2-CD                           ACAT10DA
06/04                 ,:WS-ALERT-IND                                    ACAT10DA
LRM002                ,:WS-TRNFR-ACCT-RB-SEC-IND                                
LRM002                ,:WS-TRNFR-ACCT-CLT-RSCND-IND                             
LRM002                ,:WS-TRNFR-ACCT-LGL-BLK-IND                               
ET0003                ,:WS-ACCT-FRZN-IND                                ACAT10DA
LRM007                ,:WS-STTLM-TM-CD                                          
LRM008                ,:WS-ADOPT-AGRMT-IND                                      
LRM010                ,:WS-CVRSN-ACCT-NBR                                       
LRM024                ,:WS-NETWORK-LVL4-IND                                     
093200      END-EXEC.                                                   ACAT10DA
093300*                                                                 ACAT10DA
093400      EVALUATE SQLCODE                                            ACAT10DA
093500          WHEN +0                                                 ACAT10DA
                     MOVE WS-RR-CD       TO SRCH-INP-RR                 ACAT10DA
                     MOVE WS-BRANCH-CD   TO SRCH-INP-BRANCH             ACAT10DA
                     PERFORM 0110-SIGNON-SECR-CHECK-RTN                 ACAT10DA
                     IF SRCH-SIGNON-SECR-CHECK-FAIL                     ACAT10DA
                        GO TO 0100-FETCH-NEXT                           ACAT10DA
                     END-IF                                             ACAT10DA
                     SET VTRNFR-FOUND TO TRUE                           ACAT10DA
                     SET ACAT10IO-VTRNFR-FOUND TO TRUE                  ACAT10DA
                     MOVE WS-CLIENT-NBR       TO SV-CLIENT-NBR          ACAT10DA
                     MOVE WS-ACAT-CONTROL-NBR TO SV-ACAT-CNTL-NBR       ACAT10DA
01/27 ****           IF WS-VTRNFR-CMNT > SPACE                          ACAT10DA
01/27                IF WS-CMNT-STTS-CD = 'Y'                           ACAT10DA
                         MOVE 'Y' TO WS-ACCT-COMMENTS-IND               ACAT10DA
                     END-IF                                             ACAT10DA
                     PERFORM 0450-SAVE-VTRNFR-ACCT-INFO THRU 0450-EXIT  ACAT10DA
                     PERFORM 0300-SEARCH-VINITRNF THRU 0300-EXIT        ACAT10DA
093800          WHEN +100                                               ACAT10DA
                     SET VTRNFR-NOT-FOUND TO TRUE                       ACAT10DA
                     IF ACAT10IO-CLIENT-NBR > SPACES                    ACAT10DA
                        SET ACAT10IO-VTRNFR-LAST  TO TRUE               ACAT10DA
                        MOVE 'LAST TIF UNDER THIS SELECTION ' TO        ACAT10DA
                          WS-RETURN-MSG                                 ACAT10DA
                     ELSE                                               ACAT10DA
                        SET ACAT10IO-VTRNFR-NOT-FOUND TO TRUE           ACAT10DA
                        MOVE 'NO TIF UNDER THIS SELECTION ' TO          ACAT10DA
                          WS-RETURN-MSG                                 ACAT10DA
                     END-IF                                             ACAT10DA
094000          WHEN OTHER                                              ACAT10DA
                     SET VTRNFR-NOT-FOUND TO TRUE                       ACAT10DA
                     SET ACAT10IO-VTRNFR-NOT-FOUND TO TRUE              ACAT10DA
                     MOVE 'FETCH ' TO ACAT10IO-SQLCAID                  ACAT10DA
                     PERFORM 9000-WRITE-TO-CICS-LOG                     ACAT10DA
                     PERFORM 9500-RETURN-DB2-ERROR                      ACAT10DA
094200      END-EVALUATE.                                               ACAT10DA
                                                                        ACAT10DA
           EXEC SQL                                                     ACAT10DA
               CLOSE FWD_CSR                                            ACAT10DA
           END-EXEC.                                                    ACAT10DA
10/23                                                                   ACAT10DA
           PERFORM 0550-SRCH-CASH-INFO THRU 0550-EXIT.                  ACAT10DA
      *                                                                 ACAT10DA
094400 0100-EXIT.                                                       ACAT10DA
094500     EXIT.                                                        ACAT10DA
       0110-SIGNON-SECR-CHECK-RTN.                                      ACAT10DA
           IF ACAT10IO-SUPER-SIGN-ON                                    ACAT10DA
              SET SRCH-SIGNON-SECR-CHECK-PASS TO TRUE                   ACAT10DA
           ELSE                                                         ACAT10DA
              SET SECURITY-LOOKUP TO TRUE                               ACAT10DA
              EXEC CICS LINK PROGRAM (WS-ACATSRCH)                      ACAT10DA
                  COMMAREA(ACAT-SRCH-COMM-AREA)                         ACAT10DA
                  LENGTH(LENGTH OF ACAT-SRCH-COMM-AREA)                 ACAT10DA
              END-EXEC                                                  ACAT10DA
           END-IF.                                                      ACAT10DA
092500 SKIP3                                                            ACAT10DA
       0200-FETCH-VTRNFR-BWD.                                           ACAT10DA
      *----------------------------------------------------------------*ACAT10DA
      *   BACKWARD FETCH ROWS FROM VTRNFR (ACAT_TRNFR) TABLE           *ACAT10DA
      *----------------------------------------------------------------*ACAT10DA
                                                                        ACAT10DA
           PERFORM 0050-SETUP-SRCH-KEYS THRU 0050-EXIT.                 ACAT10DA
                                                                        ACAT10DA
           EXEC SQL                                                     ACAT10DA
               OPEN BWD_CSR                                             ACAT10DA
           END-EXEC.                                                    ACAT10DA
                                                                        ACAT10DA
       0200-FETCH-NEXT.                                                 ACAT10DA
092600      EXEC SQL                                                    ACAT10DA
092700           FETCH  BWD_CSR                                         ACAT10DA
                  INTO                                                  ACAT10DA
                       :WS-CLIENT-NBR                                   ACAT10DA
                      ,:WS-ACAT-CONTROL-NBR                             ACAT10DA
                      ,:WS-BRANCH-CD                                    ACAT10DA
                      ,:WS-RR-CD                                        ACAT10DA
                      ,:WS-ACCT-CD                                      ACAT10DA
                      ,:WS-TFR-TYPE                                     ACAT10DA
                      ,:WS-DSTBN-SIDE-CD                                ACAT10DA
                      ,:WS-STCD                                         ACAT10DA
                      ,:WS-DAYS                                         ACAT10DA
                      ,:WS-RCV-NBR                                      ACAT10DA
                      ,:WS-DLVR-NBR                                     ACAT10DA
                      ,:WS-ACCT-DLVR-NBR                                ACAT10DA
                      ,:WS-ACCT-RCV-NBR                                 ACAT10DA
                      ,:WS-RCV-CUST-NM                                  ACAT10DA
                      ,:WS-RCV-SS-PRIM-NBR                              ACAT10DA
                      ,:WS-RCV-SS-SCNDY-NBR                             ACAT10DA
                      ,:WS-RCV-ACCT-TYPE-CD                             ACAT10DA
                      ,:WS-TRNFR-TYPE-RJCT-CD                           ACAT10DA
                      ,:WS-TIF-NSCC-PEND-CD                             ACAT10DA
                      ,:WS-STTLM-DT                                     ACAT10DA
                      ,:WS-VTRNFR-CMNT                                  ACAT10DA
                      ,:WS-ACCT-ACTIVITY-IND                            ACAT10DA
                      ,:WS-ACCT-ORDERS-IND                              ACAT10DA
                      ,:WS-ACCT-RJCT-RSBM-IND                           ACAT10DA
                      ,:WS-ACCT-DB-BAL-T1-IND                           ACAT10DA
                      ,:WS-ACCT-MRGN-DB-IND                             ACAT10DA
                      ,:WS-ACCT-SHRT-PSTN-IND                           ACAT10DA
                      ,:WS-ACCT-SEC-RSTRD-IND                           ACAT10DA
                      ,:WS-ACCT-AST-EXCS-IND                            ACAT10DA
                      ,:WS-ACCT-OPTN-PSTN-IND                           ACAT10DA
                      ,:WS-ACCT-LTD-PRTNR-IND                           ACAT10DA
                      ,:WS-ACCT-TIN-MSMTH-IND                           ACAT10DA
                      ,:WS-ACCT-DPLCT-TRN-IND                           ACAT10DA
                      ,:WS-ACCT-CUST-70-IND                             ACAT10DA
                      ,:WS-ACCT-QULFD-PLN-IND                           ACAT10DA
                      ,:WS-ACCT-MNGD-IND                                ACAT10DA
                      ,:WS-ACCT-PRVT-RNG-IND                            ACAT10DA
                      ,:WS-ACCT-BRKR-TIF-IND                            ACAT10DA
                      ,:WS-NSCC-NON-ADP-IND                             ACAT10DA
01/27                 ,:WS-CMNT-STTS-CD                                 ACAT10DA
04/21                 ,:WS-TRNFR-TYPE-RJC1-CD                           ACAT10DA
04/21                 ,:WS-TRNFR-TYPE-RJC2-CD                           ACAT10DA
06/04                 ,:WS-ALERT-IND                                    ACAT10DA
LRM002                ,:WS-TRNFR-ACCT-RB-SEC-IND                                
LRM002                ,:WS-TRNFR-ACCT-CLT-RSCND-IND                             
LRM002                ,:WS-TRNFR-ACCT-LGL-BLK-IND                               
ET0003                ,:WS-ACCT-FRZN-IND                                ACAT10DA
LRM007                ,:WS-STTLM-TM-CD                                          
LRM008                ,:WS-ADOPT-AGRMT-IND                                      
LRM010                ,:WS-CVRSN-ACCT-NBR                                       
LRM024                ,:WS-NETWORK-LVL4-IND                                     
093200      END-EXEC.                                                   ACAT10DA
093300*                                                                 ACAT10DA
093400      EVALUATE SQLCODE                                            ACAT10DA
093500          WHEN +0                                                 ACAT10DA
                     MOVE WS-RR-CD       TO SRCH-INP-RR                 ACAT10DA
                     MOVE WS-BRANCH-CD   TO SRCH-INP-BRANCH             ACAT10DA
                     PERFORM 0110-SIGNON-SECR-CHECK-RTN                 ACAT10DA
                     IF SRCH-SIGNON-SECR-CHECK-FAIL                     ACAT10DA
                        GO TO 0200-FETCH-NEXT                           ACAT10DA
                     END-IF                                             ACAT10DA
                     SET VTRNFR-FOUND TO TRUE                           ACAT10DA
                     SET ACAT10IO-VTRNFR-FOUND TO TRUE                  ACAT10DA
                     MOVE WS-CLIENT-NBR        TO SV-CLIENT-NBR         ACAT10DA
                     MOVE WS-ACAT-CONTROL-NBR TO SV-ACAT-CNTL-NBR       ACAT10DA
01/27 ******         IF WS-VTRNFR-CMNT > SPACE                          ACAT10DA
01/27                IF WS-CMNT-STTS-CD = 'Y'                           ACAT10DA
                         MOVE 'Y' TO WS-ACCT-COMMENTS-IND               ACAT10DA
                     END-IF                                             ACAT10DA
                     PERFORM 0450-SAVE-VTRNFR-ACCT-INFO THRU 0450-EXIT  ACAT10DA
                     PERFORM 0300-SEARCH-VINITRNF THRU 0300-EXIT        ACAT10DA
093800          WHEN +100                                               ACAT10DA
                     SET VTRNFR-NOT-FOUND TO TRUE                       ACAT10DA
                     IF ACAT10IO-CLIENT-NBR > SPACES                    ACAT10DA
                        SET ACAT10IO-VTRNFR-FIRST  TO TRUE              ACAT10DA
                        MOVE 'FIRST TIF UNDER THIS SELECTION ' TO       ACAT10DA
                          WS-RETURN-MSG                                 ACAT10DA
                     ELSE                                               ACAT10DA
                        SET ACAT10IO-VTRNFR-NOT-FOUND TO TRUE           ACAT10DA
                        MOVE 'NO TIF UNDER THIS SELECTION ' TO          ACAT10DA
                          WS-RETURN-MSG                                 ACAT10DA
                     END-IF                                             ACAT10DA
094000          WHEN OTHER                                              ACAT10DA
                     SET VTRNFR-NOT-FOUND TO TRUE                       ACAT10DA
                     SET ACAT10IO-VTRNFR-NOT-FOUND TO TRUE              ACAT10DA
                     MOVE 'FETCH ' TO ACAT10IO-SQLCAID                  ACAT10DA
                     PERFORM 9000-WRITE-TO-CICS-LOG                     ACAT10DA
                     PERFORM 9500-RETURN-DB2-ERROR                      ACAT10DA
094200      END-EVALUATE.                                               ACAT10DA
                                                                        ACAT10DA
           EXEC SQL                                                     ACAT10DA
               CLOSE BWD_CSR                                            ACAT10DA
           END-EXEC.                                                    ACAT10DA
                                                                        ACAT10DA
           PERFORM 0550-SRCH-CASH-INFO THRU 0550-EXIT.                  ACAT10DA
094300*                                                                 ACAT10DA
094400 0200-EXIT.                                                       ACAT10DA
094500     EXIT.                                                        ACAT10DA
092500/                                                                 ACAT10DA
092500 0300-SEARCH-VINITRNF.                                            ACAT10DA
      *----------------------------------------------------------------*ACAT10DA
ET0002****CHECK VINITRNF TO SEE IF THE TFR HAS ALREADY BEEN REJECTED****ACAT10DA
ET0002*   CHECK ACTITRF  TO SEE IF THE TFR HAS ALREADY BEEN REJECTED   *ACAT10DA
      *   OR SUBMITTED BEFORE THE NEXT BATCH CYCLE                     *ACAT10DA
      *----------------------------------------------------------------*ACAT10DA
092600      EXEC SQL                                                    ACAT10DA
092700          SELECT TRANS_TYPE_CD                                    ACAT10DA
                     , NSCC_PEND_CD                                     ACAT10DA
LRM011               , NSCC_ACK_IND                                     ACAT10DA
                     , TRNFR_TYPE_RJCT_CD                               ACAT10DA
                     , CMNT_TXT                                         ACAT10DA
                INTO  :WS-INIT-TRANS-TYPE-CD                            ACAT10DA
                     ,:WS-VINITRNF-NSCC-PEND-CD                         ACAT10DA
LRM011               ,:WS-VINITRNF-NSCC-ACK-IND                         ACAT10DA
                     ,:WS-VINITRNF-TYPE-RJCT-CD                         ACAT10DA
                     ,:WS-VINITRNF-CMNT                                 ACAT10DA
ET0002          FROM ACTITRF                                            ACAT10DA
                WHERE (CLIENT_NBR = :SV-CLIENT-NBR)                     ACAT10DA
                  AND (TRNFR_TYPE_CD = 'FUL')                           ACAT10DA
                  AND (RCV_NBR = :WS-RCV-NBR)                           ACAT10DA
                  AND (DLVR_NBR = :WS-DLVR-NBR)                         ACAT10DA
                  AND (ACCT_RCV_NBR = :WS-ACCT-RCV-NBR)                 ACAT10DA
                  AND (ACCT_DLVR_NBR = :WS-ACCT-DLVR-NBR)               ACAT10DA
LRM004            AND (ACAT_CONTROL_NBR = :WS-ACAT-CONTROL-NBR)         ACAT10DA
            END-EXEC.                                                   ACAT10DA
093300*                                                                 ACAT10DA
093400      EVALUATE SQLCODE                                            ACAT10DA
093500          WHEN +0                                                 ACAT10DA
                     SET VINITRNF-FOUND TO TRUE                         ACAT10DA
                     SET ACAT10IO-VINITRNF-FOUND TO TRUE                ACAT10DA
                     PERFORM 0350-CHECK-TRANS-TYPE                      ACAT10DA
093800          WHEN +100                                               ACAT10DA
                     SET VINITRNF-NOT-FOUND TO TRUE                     ACAT10DA
                     SET ACAT10IO-VINITRNF-NOT-FOUND TO TRUE            ACAT10DA
094000          WHEN OTHER                                              ACAT10DA
                     SET VINITRNF-NOT-FOUND TO TRUE                     ACAT10DA
                     SET ACAT10IO-VINITRNF-NOT-FOUND TO TRUE            ACAT10DA
                     MOVE 'SELECT' TO ACAT10IO-SQLCAID                  ACAT10DA
                     PERFORM 9000-WRITE-TO-CICS-LOG                     ACAT10DA
                     PERFORM 9500-RETURN-DB2-ERROR                      ACAT10DA
094200      END-EVALUATE.                                               ACAT10DA
094300*                                                                 ACAT10DA
01/25 *----------------------------------------------------------------*ACAT10DA
ET0002****CHECK VINITRNF TO SEE IF THE ACCT INFO HAS BEEN CHANGED FOR***ACAT10DA
ET0002*   CHECK ACTITRF  TO SEE IF THE ACCT INFO HAS BEEN CHANGED FOR  *ACAT10DA
      *   THIS TIF.                                                    *ACAT10DA
      *----------------------------------------------------------------*ACAT10DA
01/25       EXEC SQL                                                    ACAT10DA
                SELECT DLVR_NBR                                         ACAT10DA
                     , RCV_NBR                                          ACAT10DA
                     , ACCT_DLVR_NBR                                    ACAT10DA
                     , RR_CD                                            ACAT10DA
                     , ACCT_RCV_NBR                                     ACAT10DA
                     , RCV_CUST_NM                                      ACAT10DA
                     , RCV_SS_PRIM_NBR                                  ACAT10DA
                     , RCV_SS_SCNDY_NBR                                 ACAT10DA
                     , RCV_ACCT_TYPE_CD                                 ACAT10DA
                     , TRANS_TYPE_CD                                    ACAT10DA
                     , NSCC_PEND_CD                                     ACAT10DA
LRM011               , NSCC_ACK_IND                                     ACAT10DA
                     , TRNFR_TYPE_RJCT_CD                               ACAT10DA
                     , CMNT_TXT                                         ACAT10DA
                INTO  :WS-DLVR-NBR                                      ACAT10DA
                     ,:WS-RCV-NBR                                       ACAT10DA
                     ,:WS-ACCT-DLVR-NBR                                 ACAT10DA
                     ,:WS-RR-CD                                         ACAT10DA
                     ,:WS-ACCT-RCV-NBR                                  ACAT10DA
                     ,:WS-RCV-CUST-NM                                   ACAT10DA
                     ,:WS-RCV-SS-PRIM-NBR                               ACAT10DA
                     ,:WS-RCV-SS-SCNDY-NBR                              ACAT10DA
                     ,:WS-RCV-ACCT-TYPE-CD                              ACAT10DA
                     ,:WS-INIT-TRANS-TYPE-CD                            ACAT10DA
                     ,:WS-VINITRNF-NSCC-PEND-CD                         ACAT10DA
LRM011               ,:WS-VINITRNF-NSCC-ACK-IND                         ACAT10DA
                     ,:WS-VINITRNF-TYPE-RJCT-CD                         ACAT10DA
                     ,:WS-VINITRNF-CMNT                                 ACAT10DA
ET0002          FROM ACTITRF                                            ACAT10DA
                WHERE (CLIENT_NBR = :SV-CLIENT-NBR)                     ACAT10DA
                  AND (RCV_NBR = :WS-RCV-NBR)                           ACAT10DA
                  AND (ACCT_RCV_NBR = :WS-ACCT-RCV-NBR)                 ACAT10DA
                  AND (TRNFR_TYPE_CD = 'FUL')                           ACAT10DA
                  AND (ACAT_CONTROL_NBR = :WS-ACAT-CONTROL-NBR)         ACAT10DA
            END-EXEC.                                                   ACAT10DA
      ****        AND (DLVR_NBR = :WS-DLVR-NBR)                         ACAT10DA
      ****        AND (ACCT_DLVR_NBR = :WS-ACCT-DLVR-NBR)               ACAT10DA
093300*                                                                 ACAT10DA
093400      EVALUATE SQLCODE                                            ACAT10DA
093500          WHEN +0                                                 ACAT10DA
LRM004          WHEN -811                                               ACAT10DA
                     SET VINITRNF-FOUND TO TRUE                         ACAT10DA
                     SET ACAT10IO-VINITRNF-FOUND TO TRUE                ACAT10DA
01/31                PERFORM 0460-COMPARE-ACCTS THRU 0460-EXIT          ACAT10DA
                     IF WS-ACCT-NOT-EQUAL                               ACAT10DA
                        PERFORM 0455-SAVE-NEW-ACCT-INFO THRU 0455-EXIT  ACAT10DA
                        SET ACAT10IO-TIF-ACCT-NEW TO TRUE               ACAT10DA
                        PERFORM 0350-CHECK-TRANS-TYPE                   ACAT10DA
01/31                END-IF                                             ACAT10DA
093800          WHEN +100                                               ACAT10DA
                     SET VINITRNF-NOT-FOUND TO TRUE                     ACAT10DA
                     SET ACAT10IO-VINITRNF-NOT-FOUND TO TRUE            ACAT10DA
094000          WHEN OTHER                                              ACAT10DA
                     SET VINITRNF-NOT-FOUND TO TRUE                     ACAT10DA
                     SET ACAT10IO-VINITRNF-NOT-FOUND TO TRUE            ACAT10DA
                     MOVE 'SELECT' TO ACAT10IO-SQLCAID                  ACAT10DA
                     PERFORM 9000-WRITE-TO-CICS-LOG                     ACAT10DA
                     PERFORM 9500-RETURN-DB2-ERROR                      ACAT10DA
094200      END-EVALUATE.                                               ACAT10DA
093300*                                                                 ACAT10DA
094400 0300-EXIT.                                                       ACAT10DA
094500     EXIT.                                                        ACAT10DA
      /                                                                 ACAT10DA
       0350-CHECK-TRANS-TYPE.                                           ACAT10DA
            MOVE WS-VINITRNF-TYPE-RJCT-CD TO                            ACAT10DA
                                       ACAT10IO-VINITRNF-TYPE-RJCT-CD.  ACAT10DA
      *     IF WS-VINITRNF-NSCC-PEND-CD   = SPACE                       ACAT10DA
      *        MOVE LOW-VALUE    TO  ACAT10IO-VINITRNF-NSCC-PEND-CD     ACAT10DA
      *     ELSE                                                        ACAT10DA
092700         MOVE WS-VINITRNF-NSCC-PEND-CD TO                         ACAT10DA
                                       ACAT10IO-VINITRNF-NSCC-PEND-CD.  ACAT10DA
            MOVE WS-VINITRNF-CMNT TO ACAT10IO-VINITRNF-CMNT.            ACAT10DA
      *                                                                 ACAT10DA
01/11 *     IF WS-INIT-TRANS-TYPE-CD = 'R'                              ACAT10DA
      *        MOVE 'THIS TRANSFER HAS BEEN REJECTED' TO                ACAT10DA
      *             WS-RETURN-MSG                                       ACAT10DA
      *     END-IF.                                                     ACAT10DA
      *                                                                 ACAT10DA
      *     IF ACAT10IO-VINITRNF-NSCC-PEND-CD = ' '                     ACAT10DA
      *        MOVE 'THIS TIF HAD BEEN SUBMITTED BEFORE'                ACAT10DA
      *              TO  WS-RETURN-MSG                                  ACAT10DA
      *     END-IF.                                                     ACAT10DA
094400 0350-EXIT.                                                       ACAT10DA
094500     EXIT.                                                        ACAT10DA
      /                                                                 ACAT10DA
       0400-RETRIEVE-PEND-XFR.                                          ACAT10DA
                                                                        ACAT10DA
014700     EXEC SQL                                                     ACAT10DA
092700         SELECT                                                   ACAT10DA
                     CLIENT_NBR                                         ACAT10DA
                   , ACAT_CONTROL_NBR                                   ACAT10DA
                   , BRANCH_CD                                          ACAT10DA
                   , RR_CD                                              ACAT10DA
                   , ACCT_CD                                            ACAT10DA
                   , TRNFR_TYPE_CD                                      ACAT10DA
                   , DSTBN_SIDE_CD                                      ACAT10DA
                   , STTS_CD                                            ACAT10DA
                   , DAYS_STTS_QTY                                      ACAT10DA
                   , RCV_NBR                                            ACAT10DA
                   , DLVR_NBR                                           ACAT10DA
                   , ACCT_DLVR_NBR                                      ACAT10DA
                   , ACCT_RCV_NBR                                       ACAT10DA
                   , RCV_CUST_NM                                        ACAT10DA
                   , RCV_SS_PRIM_NBR                                    ACAT10DA
                   , RCV_SS_SCNDY_NBR                                   ACAT10DA
                   , RCV_ACCT_TYPE_CD                                   ACAT10DA
                   , TRNFR_TYPE_RJCT_CD                                 ACAT10DA
                   , NSCC_PEND_CD                                       ACAT10DA
                   , STTLM_DT                                           ACAT10DA
                   , CMNT_TXT                                           ACAT10DA
                   , ACCT_ACTIVITY_IND                                  ACAT10DA
                   , ACCT_ORDERS_IND                                    ACAT10DA
                   , ACCT_RJCT_RSBM_IND                                 ACAT10DA
                   , ACCT_DB_BAL_T1_IND                                 ACAT10DA
                   , ACCT_MRGN_DB_IND                                   ACAT10DA
                   , ACCT_SHRT_PSTN_IND                                 ACAT10DA
                   , ACCT_SEC_RSTRD_IND                                 ACAT10DA
                   , ACCT_AST_EXCS_IND                                  ACAT10DA
                   , ACCT_OPTN_PSTN_IND                                 ACAT10DA
                   , ACCT_LTD_PRTNR_IND                                 ACAT10DA
                   , ACCT_TIN_MSMTH_IND                                 ACAT10DA
                   , ACCT_DPLCT_TRN_IND                                 ACAT10DA
                   , ACCT_CUST_70_IND                                   ACAT10DA
                   , ACCT_QULFD_PLN_IND                                 ACAT10DA
                   , ACCT_MNGD_IND                                      ACAT10DA
                   , ACCT_PRVT_RNG_IND                                  ACAT10DA
                   , ACCT_BRKR_TIF_IND                                  ACAT10DA
                   , NSCC_NON_ADP_IND                                   ACAT10DA
01/27              , CMNT_STTS_CD                                       ACAT10DA
04/21              , TRNFR_TYPE_RJC1_CD                                 ACAT10DA
04/21              , TRNFR_TYPE_RJC2_CD                                 ACAT10DA
06/04              , ALERT_IND                                          ACAT10DA
LRM002             , ACCT_RB_SEC_IND                                    ACAT10DA
LRM002             , ACCT_CLT_RSCND_IND                                         
LRM002             , ACCT_LGL_BLK_IND                                           
ET0003             , ACCT_FRZN_IND                                      ACAT10DA
LRM007             , STTLM_TM_CD                                                
LRM008             , ADOPT_AGRMT_IND                                            
LRM024             , NTWRK_LVL4_FND_IND                                         
LRM010             , CVRSN_ACCT_NBR                                             
                  INTO                                                  ACAT10DA
                       :WS-CLIENT-NBR                                   ACAT10DA
                      ,:WS-ACAT-CONTROL-NBR                             ACAT10DA
                      ,:WS-BRANCH-CD                                    ACAT10DA
                      ,:WS-RR-CD                                        ACAT10DA
                      ,:WS-ACCT-CD                                      ACAT10DA
                      ,:WS-TFR-TYPE                                     ACAT10DA
                      ,:WS-DSTBN-SIDE-CD                                ACAT10DA
                      ,:WS-STCD                                         ACAT10DA
                      ,:WS-DAYS                                         ACAT10DA
                      ,:WS-RCV-NBR                                      ACAT10DA
                      ,:WS-DLVR-NBR                                     ACAT10DA
                      ,:WS-ACCT-DLVR-NBR                                ACAT10DA
                      ,:WS-ACCT-RCV-NBR                                 ACAT10DA
                      ,:WS-RCV-CUST-NM                                  ACAT10DA
                      ,:WS-RCV-SS-PRIM-NBR                              ACAT10DA
                      ,:WS-RCV-SS-SCNDY-NBR                             ACAT10DA
                      ,:WS-RCV-ACCT-TYPE-CD                             ACAT10DA
                      ,:WS-TRNFR-TYPE-RJCT-CD                           ACAT10DA
                      ,:WS-TIF-NSCC-PEND-CD                             ACAT10DA
                      ,:WS-STTLM-DT                                     ACAT10DA
                      ,:WS-VTRNFR-CMNT                                  ACAT10DA
                      ,:WS-ACCT-ACTIVITY-IND                            ACAT10DA
                      ,:WS-ACCT-ORDERS-IND                              ACAT10DA
                      ,:WS-ACCT-RJCT-RSBM-IND                           ACAT10DA
                      ,:WS-ACCT-DB-BAL-T1-IND                           ACAT10DA
                      ,:WS-ACCT-MRGN-DB-IND                             ACAT10DA
                      ,:WS-ACCT-SHRT-PSTN-IND                           ACAT10DA
                      ,:WS-ACCT-SEC-RSTRD-IND                           ACAT10DA
                      ,:WS-ACCT-AST-EXCS-IND                            ACAT10DA
                      ,:WS-ACCT-OPTN-PSTN-IND                           ACAT10DA
                      ,:WS-ACCT-LTD-PRTNR-IND                           ACAT10DA
                      ,:WS-ACCT-TIN-MSMTH-IND                           ACAT10DA
                      ,:WS-ACCT-DPLCT-TRN-IND                           ACAT10DA
                      ,:WS-ACCT-CUST-70-IND                             ACAT10DA
                      ,:WS-ACCT-QULFD-PLN-IND                           ACAT10DA
                      ,:WS-ACCT-MNGD-IND                                ACAT10DA
                      ,:WS-ACCT-PRVT-RNG-IND                            ACAT10DA
                      ,:WS-ACCT-BRKR-TIF-IND                            ACAT10DA
                      ,:WS-NSCC-NON-ADP-IND                             ACAT10DA
01/27                 ,:WS-CMNT-STTS-CD                                 ACAT10DA
04/21                 ,:WS-TRNFR-TYPE-RJC1-CD                           ACAT10DA
04/21                 ,:WS-TRNFR-TYPE-RJC2-CD                           ACAT10DA
06/04                 ,:WS-ALERT-IND                                    ACAT10DA
LRM002                ,:WS-TRNFR-ACCT-RB-SEC-IND                                
LRM002                ,:WS-TRNFR-ACCT-CLT-RSCND-IND                             
LRM002                ,:WS-TRNFR-ACCT-LGL-BLK-IND                               
ET0003                ,:WS-ACCT-FRZN-IND                                ACAT10DA
LRM007                ,:WS-STTLM-TM-CD                                          
LRM008                ,:WS-ADOPT-AGRMT-IND                                      
LRM024                ,:WS-NETWORK-LVL4-IND                                     
LRM010                ,:WS-CVRSN-ACCT-NBR                                       
092900                FROM VTRNFR                                       ACAT10DA
093000         WHERE CLIENT_NBR = :SV-CLIENT-NBR                        ACAT10DA
                 AND ACAT_CONTROL_NBR = :SV-ACAT-CNTL-NBR               ACAT10DA
014900     END-EXEC.                                                    ACAT10DA
093300*                                                                 ACAT10DA
093400      EVALUATE SQLCODE                                            ACAT10DA
093500          WHEN +0                                                 ACAT10DA
                     SET VTRNFR-FOUND TO TRUE                           ACAT10DA
                     SET ACAT10IO-VTRNFR-FOUND TO TRUE                  ACAT10DA
                     MOVE WS-CLIENT-NBR        TO SV-CLIENT-NBR         ACAT10DA
                     MOVE WS-ACAT-CONTROL-NBR  TO SV-ACAT-CNTL-NBR      ACAT10DA
01/27 *********      IF WS-VTRNFR-CMNT > SPACE                          ACAT10DA
01/27                IF WS-CMNT-STTS-CD = 'Y'                           ACAT10DA
                         MOVE 'Y' TO WS-ACCT-COMMENTS-IND               ACAT10DA
                     END-IF                                             ACAT10DA
                     PERFORM 0450-SAVE-VTRNFR-ACCT-INFO THRU 0450-EXIT  ACAT10DA
                     PERFORM 0300-SEARCH-VINITRNF THRU 0300-EXIT        ACAT10DA
093800          WHEN +100                                               ACAT10DA
                     SET VTRNFR-NOT-FOUND TO TRUE                       ACAT10DA
                     SET ACAT10IO-VTRNFR-NOT-FOUND TO TRUE              ACAT10DA
                     IF ACAT10IO-SRCH-VTRNFR-FWD                        ACAT10DA
                        MOVE 'FIRST TIF FOR THIS CLIENT' TO             ACAT10DA
                          WS-RETURN-MSG                                 ACAT10DA
                     ELSE                                               ACAT10DA
                        MOVE 'NO TIF UNDER THIS CLIENT ' TO             ACAT10DA
                          WS-RETURN-MSG                                 ACAT10DA
                     END-IF                                             ACAT10DA
094000          WHEN OTHER                                              ACAT10DA
                     SET VTRNFR-NOT-FOUND TO TRUE                       ACAT10DA
                     SET ACAT10IO-VTRNFR-NOT-FOUND TO TRUE              ACAT10DA
                     PERFORM 9000-WRITE-TO-CICS-LOG                     ACAT10DA
                     PERFORM 9500-RETURN-DB2-ERROR                      ACAT10DA
094200      END-EVALUATE.                                               ACAT10DA
094300*                                                                 ACAT10DA
           PERFORM 0550-SRCH-CASH-INFO THRU 0550-EXIT.                  ACAT10DA
094300*                                                                 ACAT10DA
015000/                                                                 ACAT10DA
094400 0400-EXIT.                                                       ACAT10DA
094500     EXIT.                                                        ACAT10DA
      /                                                                 ACAT10DA
01/25  0450-SAVE-VTRNFR-ACCT-INFO.                                      ACAT10DA
           MOVE WS-RCV-NBR            TO  ACAT10IO-O-RCV-NBR.           ACAT10DA
           MOVE WS-DLVR-NBR           TO  ACAT10IO-O-DLVR-NBR.          ACAT10DA
           MOVE WS-ACCT-DLVR-NBR      TO  ACAT10IO-O-ACCT-DLVR-NBR.     ACAT10DA
           MOVE WS-ACCT-RCV-NBR       TO  ACAT10IO-O-ACCT-RCV-NBR.      ACAT10DA
094400 0450-EXIT.                                                       ACAT10DA
094500     EXIT.                                                        ACAT10DA
      /                                                                 ACAT10DA
01/25  0455-SAVE-NEW-ACCT-INFO.                                         ACAT10DA
           MOVE WS-RCV-NBR            TO  NEW-RCV-NBR.                  ACAT10DA
           MOVE WS-DLVR-NBR           TO  NEW-DLVR-NBR.                 ACAT10DA
           MOVE WS-ACCT-DLVR-NBR      TO  NEW-ACCT-DLVR-NBR.            ACAT10DA
           MOVE WS-ACCT-RCV-NBR       TO  NEW-ACCT-RCV-NBR.             ACAT10DA
094400 0455-EXIT.                                                       ACAT10DA
094500     EXIT.                                                        ACAT10DA
      /                                                                 ACAT10DA
01/31  0460-COMPARE-ACCTS.                                              ACAT10DA
           IF WS-DLVR-NBR = ACAT10IO-O-DLVR-NBR           AND           ACAT10DA
              WS-ACCT-DLVR-NBR = ACAT10IO-O-ACCT-DLVR-NBR               ACAT10DA
              CONTINUE                                                  ACAT10DA
           ELSE                                                         ACAT10DA
              SET WS-ACCT-NOT-EQUAL TO TRUE                             ACAT10DA
           END-IF.                                                      ACAT10DA
01/31  0460-EXIT.                                                       ACAT10DA
           EXIT.                                                        ACAT10DA
       0500-MOVE-DATA.                                                  ACAT10DA
12/02 *    INITIALIZE ACAT10IO-SAVE-KEYS, ACAT10IO-DA, ACAT10IO-DC.     ACAT10DA
12/02      INITIALIZE ACAT10IO-DA, ACAT10IO-DC.                         ACAT10DA
           MOVE LOW-VALUES TO ACAT10IO-TS-EXCEPTIONS,                   ACAT10DA
                              ACAT10IO-SAVE-KEYS.                       ACAT10DA
      *                                                                 ACAT10DA
           MOVE WS-CLIENT-NBR         TO  ACAT10IO-CLIENT-NBR           ACAT10DA
                                          ACAT10IO-SV-CLIENT-NBR.       ACAT10DA
           MOVE WS-ACAT-CONTROL-NBR   TO  ACAT10IO-ACAT-CONTROL-NBR     ACAT10DA
                                          ACAT10IO-SV-ACAT-CNTL-NBR.    ACAT10DA
           MOVE WS-RR-CD              TO  ACAT10IO-RR-CD                ACAT10DA
                                          ACAT10IO-SV-RR-CD.            ACAT10DA
           MOVE WS-TFR-TYPE           TO  ACAT10IO-SV-TFR               ACAT10DA
                                          ACAT10IO-TFR-TYPE.            ACAT10DA
           MOVE WS-STCD               TO  ACAT10IO-STCD                 ACAT10DA
                                          ACAT10IO-SV-STCD.             ACAT10DA
01/08      MOVE WS-DAYS               TO  ACAT10IO-DAYS.                ACAT10DA
01/25      IF ACAT10IO-TIF-ACCT-NEW OR                                  ACAT10DA
              ACAT10IO-TIF-UPDT                                         ACAT10DA
              MOVE NEW-RCV-NBR        TO  ACAT10IO-RCV-NBR              ACAT10DA
                                          ACAT10IO-SV-BRKR              ACAT10DA
                                          ACAT10IO-SV-RCV-NBR           ACAT10DA
              MOVE NEW-DLVR-NBR       TO  ACAT10IO-DLVR-NBR             ACAT10DA
                                          ACAT10IO-SV-DLVR-NBR          ACAT10DA
              MOVE NEW-ACCT-DLVR-NBR  TO  ACAT10IO-ACCT-DLVR-NBR        ACAT10DA
                                          ACAT10IO-SV-ACCT-DLVR-NBR     ACAT10DA
              MOVE NEW-ACCT-RCV-NBR   TO  ACAT10IO-ACCT-RCV-NBR         ACAT10DA
                                          ACAT10IO-SV-ACCT-RCV-NBR      ACAT10DA
              MOVE NEW-ACCT-DLVR-NBR (4:5) TO ACAT10IO-ACCT-CD          ACAT10DA
                                              ACAT10IO-SV-ACCT-CD       ACAT10DA
              MOVE NEW-ACCT-DLVR-NBR (1:3) TO ACAT10IO-BRANCH-CD        ACAT10DA
                                              ACAT10IO-SV-BRANCH-CD     ACAT10DA
           ELSE                                                         ACAT10DA
              MOVE WS-RCV-NBR         TO  ACAT10IO-RCV-NBR              ACAT10DA
                                          ACAT10IO-SV-BRKR              ACAT10DA
                                          ACAT10IO-SV-RCV-NBR           ACAT10DA
              MOVE WS-DLVR-NBR        TO  ACAT10IO-DLVR-NBR             ACAT10DA
                                          ACAT10IO-SV-DLVR-NBR          ACAT10DA
              MOVE WS-ACCT-DLVR-NBR   TO  ACAT10IO-ACCT-DLVR-NBR        ACAT10DA
                                          ACAT10IO-SV-ACCT-DLVR-NBR     ACAT10DA
              MOVE WS-ACCT-RCV-NBR    TO  ACAT10IO-ACCT-RCV-NBR         ACAT10DA
                                          ACAT10IO-SV-ACCT-RCV-NBR      ACAT10DA
              MOVE WS-BRANCH-CD       TO  ACAT10IO-BRANCH-CD            ACAT10DA
                                          ACAT10IO-SV-BRANCH-CD         ACAT10DA
              MOVE WS-ACCT-CD         TO  ACAT10IO-ACCT-CD              ACAT10DA
                                          ACAT10IO-SV-ACCT-CD           ACAT10DA
01/25      END-IF.                                                      ACAT10DA
           MOVE WS-BRANCH-CD          TO  ACAT10IO-SV-BRANCH-CD         ACAT10DA
           MOVE WS-ACCT-CD            TO  ACAT10IO-SV-ACCT-CD           ACAT10DA
           MOVE WS-RCV-CUST-NM        TO  ACAT10IO-RCV-CUST-NM.         ACAT10DA
           MOVE WS-RCV-SS-PRIM-NBR    TO  ACAT10IO-RCV-SS-PRIM-NBR.     ACAT10DA
           MOVE WS-RCV-SS-SCNDY-NBR   TO  ACAT10IO-RCV-SS-SCNDY-NBR.    ACAT10DA
           MOVE WS-RCV-ACCT-TYPE-CD   TO  ACAT10IO-RCV-ACCT-TYPE-CD.    ACAT10DA
           MOVE WS-INIT-TRANS-TYPE-CD TO  ACAT10IO-INIT-TRANS-TYPE-CD.  ACAT10DA
           MOVE WS-TRNFR-TYPE-RJCT-CD TO  ACAT10IO-TRNFR-TYPE-RJCT-CD.  ACAT10DA
           MOVE WS-TIF-NSCC-PEND-CD   TO  ACAT10IO-TIF-NSCC-PEND-CD.    ACAT10DA
           MOVE WS-STTLM-DT           TO  ACAT10IO-STTLM-DT.            ACAT10DA
           MOVE WS-BAL01              TO  ACAT10IO-BAL01.               ACAT10DA
           MOVE WS-BAL02              TO  ACAT10IO-BAL02.               ACAT10DA
           MOVE WS-BAL05              TO  ACAT10IO-BAL05.               ACAT10DA
           MOVE WS-SMA                TO  ACAT10IO-SMA.                 ACAT10DA
12/15      MOVE WS-BAL01-STTLM-RSN-CD TO  ACAT10IO-BAL01-STTLM-RSN-CD.  ACAT10DA
12/15      MOVE WS-BAL02-STTLM-RSN-CD TO  ACAT10IO-BAL02-STTLM-RSN-CD.  ACAT10DA
12/15      MOVE WS-BAL05-STTLM-RSN-CD TO  ACAT10IO-BAL05-STTLM-RSN-CD.  ACAT10DA
01/21      MOVE WS-BAL01-SEQ-NBR      TO  ACAT10IO-BAL01-SEQ-NBR.       ACAT10DA
01/21      MOVE WS-BAL02-SEQ-NBR      TO  ACAT10IO-BAL02-SEQ-NBR.       ACAT10DA
01/21      MOVE WS-BAL05-SEQ-NBR      TO  ACAT10IO-BAL05-SEQ-NBR.       ACAT10DA
01/21      MOVE WS-SMA-SEQ-NBR        TO  ACAT10IO-SMA-SEQ-NBR.         ACAT10DA
01/21      MOVE WS-SMA-CMS-CD         TO  ACAT10IO-SMA-CMS-CD.          ACAT10DA
01/27      MOVE WS-BAL01-CMNT         TO  ACAT10IO-BAL01-CMNT.          ACAT10DA
01/27      MOVE WS-BAL02-CMNT         TO  ACAT10IO-BAL02-CMNT.          ACAT10DA
01/27      MOVE WS-BAL05-CMNT         TO  ACAT10IO-BAL05-CMNT.          ACAT10DA
01/27      MOVE WS-SMA-CMNT           TO  ACAT10IO-SMA-CMNT.            ACAT10DA
           MOVE WS-RETURN-MSG         TO  ACAT10IO-RETURN-MSG.          ACAT10DA
           IF WS-VTRNFR-CMNT > SPACES                                   ACAT10DA
              MOVE WS-VTRNFR-CMNT     TO  ACAT10IO-VTRNFR-CMNT          ACAT10DA
           END-IF.                                                      ACAT10DA
           MOVE WS-ACAT10DA-EXCEPTIONS TO ACAT10IO-TS-EXCEPTIONS.       ACAT10DA
      *                                                                 ACAT10DA
           MOVE WS-VINITRNF-TYPE-RJCT-CD TO                             ACAT10DA
                                         ACAT10IO-VINITRNF-TYPE-RJCT-CD.ACAT10DA
           MOVE WS-VINITRNF-NSCC-PEND-CD TO                             ACAT10DA
                                         ACAT10IO-VINITRNF-NSCC-PEND-CD.ACAT10DA
LRM011     MOVE WS-VINITRNF-NSCC-ACK-IND TO                             ACAT10DA
LRM011                                   ACAT10IO-VINITRNF-NSCC-ACK-IND.ACAT10DA
           MOVE WS-VINITRNF-CMNT      TO  ACAT10IO-VINITRNF-CMNT.       ACAT10DA
06/04      MOVE WS-ALERT-IND          TO  ACAT10IO-ALERT-IND.           ACAT10DA
LRM002     MOVE WS-TRNFR-ACCT-RB-SEC-IND    TO                                  
LRM002                                   ACAT10IO-RB-RESTRICTED-SEC-IND.        
LRM002     MOVE WS-TRNFR-ACCT-CLT-RSCND-IND TO                                  
LRM002                                   ACAT10IO-RB-CLIENT-RESCIND-IND.        
LRM002     MOVE WS-TRNFR-ACCT-LGL-BLK-IND   TO                                  
LRM002                                   ACAT10IO-RB-LEGAL-BLOCK-IND.           
ET0003     MOVE WS-ACCT-FRZN-IND      TO  ACAT10IO-ACCT-FRZN-IND.       ACAT10DA
LRM007     MOVE WS-STTLM-TM-CD        TO  ACAT10IO-STTLM-TM-CD.                 
LRM008     MOVE WS-ADOPT-AGRMT-IND    TO  ACAT10IO-ADOPTION-AGREEMENT.          
LRM024     MOVE WS-NETWORK-LVL4-IND   TO  ACAT10IO-NETWORK-LVL4-IND.            
LRM010     MOVE WS-CVRSN-ACCT-NBR     TO  ACAT10IO-CVRSN-ACCT-NBR.              
      ****************************************************************  ACAT10DA
      *    MOVE WS-ACCT-DB-BAL-T1-IND TO  ACAT10IO-ACCT-DB-BAL-T1-IND.  ACAT10DA
      *    MOVE WS-ACCT-MRGN-DB-IND   TO  ACAT10IO-ACCT-MRGN-DB-IND.    ACAT10DA
      *    MOVE WS-ACCT-SHRT-PSTN-IND TO  ACAT10IO-ACCT-SHRT-PSTN-IND.  ACAT10DA
      *    MOVE WS-ACCT-SEC-RSTRD-IND TO  ACAT10IO-ACCT-SEC-RSTRD-IND.  ACAT10DA
      *    MOVE WS-ACCT-AST-EXCS-IND  TO  ACAT10IO-ACCT-AST-EXCS-IND.   ACAT10DA
      *    MOVE WS-ACCT-OPTN-PSTN-IND TO  ACAT10IO-ACCT-OPTN-PSTN-IND.  ACAT10DA
      *    MOVE WS-ACCT-LTD-PRTNR-IND TO  ACAT10IO-ACCT-LTD-PRTNR-IND.  ACAT10DA
      *    MOVE WS-ACCT-CUST-70-IND   TO  ACAT10IO-ACCT-CUST-70-IND.    ACAT10DA
      *    MOVE WS-ACCT-QULFD-PLN-IND TO  ACAT10IO-ACCT-QULFD-PLN-IND.  ACAT10DA
      *    MOVE WS-ACCT-MNGD-IND      TO  ACAT10IO-ACCT-MNGD-IND.       ACAT10DA
      *    MOVE WS-ACCT-PRVT-RNG-IND  TO  ACAT10IO-ACCT-PRVT-RNG-IND.   ACAT10DA
      *    MOVE WS-ACCT-BRKR-TIF-IND  TO  ACAT10IO-ACCT-BRKR-TIF-IND.   ACAT10DA
      *    MOVE WS-ACCT-COMMENTS-IND  TO  ACAT10IO-ACCT-COMMENTS-IND.   ACAT10DA
                                                                        ACAT10DA
       0500-EXIT.                                                       ACAT10DA
           EXIT.                                                        ACAT10DA
      /                                                                 ACAT10DA
      ****************************                                      ACAT10DA
       0550-SRCH-CASH-INFO.                                             ACAT10DA
                                                                        ACAT10DA
           IF VTRNFR-FOUND                                              ACAT10DA
              IF ACAT10IO-FIRST-TIME                                    ACAT10DA
                 MOVE SPACE TO ACAT10IO-FIRST-TIME-SW                   ACAT10DA
              END-IF                                                    ACAT10DA
           END-IF.                                                      ACAT10DA
           IF VTRNFR-FOUND                                              ACAT10DA
              IF WS-STCD LESS THAN 200                                  ACAT10DA
                 PERFORM 0600-SRCH-VINITAST                             ACAT10DA
              ELSE                                                      ACAT10DA
                 PERFORM 0601-SRCH-VASSET                               ACAT10DA
              END-IF                                                    ACAT10DA
           END-IF.                                                      ACAT10DA
      **                                                                ACAT10DA
           IF VTRNFR-FOUND                                              ACAT10DA
              IF ACAT10IO-VINITAST-FOUND                                ACAT10DA
                 PERFORM 0610-SRCH-INIT-BAL01                           ACAT10DA
                 PERFORM 0611-SRCH-INIT-BAL02                           ACAT10DA
                 PERFORM 0612-SRCH-INIT-BAL05                           ACAT10DA
                 PERFORM 0613-SRCH-INIT-SMA                             ACAT10DA
              ELSE                                                      ACAT10DA
                 IF ACAT10IO-VASSET-FOUND                               ACAT10DA
                    PERFORM 0620-SRCH-ASST-BAL01                        ACAT10DA
                    PERFORM 0621-SRCH-ASST-BAL02                        ACAT10DA
                    PERFORM 0622-SRCH-ASST-BAL05                        ACAT10DA
                    PERFORM 0623-SRCH-ASST-SMA                          ACAT10DA
                    PERFORM 0600-SRCH-VINITAST                          ACAT10DA
                    IF ACAT10IO-VINITAST-FOUND                          ACAT10DA
                       PERFORM 0610-SRCH-INIT-BAL01                     ACAT10DA
                       PERFORM 0611-SRCH-INIT-BAL02                     ACAT10DA
                       PERFORM 0612-SRCH-INIT-BAL05                     ACAT10DA
                       PERFORM 0613-SRCH-INIT-SMA                       ACAT10DA
                    END-IF                                              ACAT10DA
                 ELSE                                                   ACAT10DA
                    PERFORM 0600-SRCH-VINITAST                          ACAT10DA
                    IF ACAT10IO-VINITAST-FOUND                          ACAT10DA
                       PERFORM 0610-SRCH-INIT-BAL01                     ACAT10DA
                       PERFORM 0611-SRCH-INIT-BAL02                     ACAT10DA
                       PERFORM 0612-SRCH-INIT-BAL05                     ACAT10DA
                       PERFORM 0613-SRCH-INIT-SMA                       ACAT10DA
                    END-IF                                              ACAT10DA
                 END-IF                                                 ACAT10DA
              END-IF                                                    ACAT10DA
           END-IF.                                                      ACAT10DA
 94300*                                                                 ACAT10DA
           IF WS-VINITAST-BAL01-TRAN-TYPE = 'A'  OR  'C'                ACAT10DA
01/21         MOVE WS-VINITAST-BAL01-SEQ-NBR TO WS-BAL01-SEQ-NBR        ACAT10DA
              IF WS-VINITAST-BAL01 > 0                                  ACAT10DA
                 MOVE WS-VINITAST-BAL01 TO WS-BAL01                     ACAT10DA
12/15            MOVE WS-VINITAST-BAL01-STTMRSN-CD TO                   ACAT10DA
12/15                 WS-BAL01-STTLM-RSN-CD                             ACAT10DA
01/27         ELSE                                                      ACAT10DA
                 IF WS-VINITAST-BAL01-CMNT > SPACE                      ACAT10DA
                    MOVE WS-VINITAST-BAL01-CMNT TO WS-BAL01-CMNT        ACAT10DA
                 END-IF                                                 ACAT10DA
01/27         END-IF                                                    ACAT10DA
           ELSE                                                         ACAT10DA
              MOVE WS-VASSET-BAL01 TO WS-BAL01                          ACAT10DA
12/15         MOVE WS-VASSET-BAL01-STTMRSN-CD TO                        ACAT10DA
12/15              WS-BAL01-STTLM-RSN-CD                                ACAT10DA
01/21         MOVE WS-VASSET-BAL01-SEQ-NBR TO WS-BAL01-SEQ-NBR          ACAT10DA
01/27         MOVE WS-VASSET-BAL01-CMNT    TO WS-BAL01-CMNT             ACAT10DA
           END-IF.                                                      ACAT10DA
      *                                                                 ACAT10DA
           IF WS-VINITAST-BAL02-TRAN-TYPE = 'A' OR 'C'                  ACAT10DA
01/21         MOVE WS-VINITAST-BAL02-SEQ-NBR TO WS-BAL02-SEQ-NBR        ACAT10DA
              IF WS-VINITAST-BAL02 > 0                                  ACAT10DA
                 MOVE WS-VINITAST-BAL02 TO WS-BAL02                     ACAT10DA
12/15            MOVE WS-VINITAST-BAL02-STTMRSN-CD TO                   ACAT10DA
12/15                 WS-BAL02-STTLM-RSN-CD                             ACAT10DA
01/27         ELSE                                                      ACAT10DA
                 IF WS-VINITAST-BAL02-CMNT > SPACE                      ACAT10DA
                    MOVE WS-VINITAST-BAL02-CMNT TO WS-BAL02-CMNT        ACAT10DA
                 END-IF                                                 ACAT10DA
01/27         END-IF                                                    ACAT10DA
           ELSE                                                         ACAT10DA
              MOVE WS-VASSET-BAL02 TO WS-BAL02                          ACAT10DA
12/15         MOVE WS-VASSET-BAL02-STTMRSN-CD TO                        ACAT10DA
12/15              WS-BAL02-STTLM-RSN-CD                                ACAT10DA
01/21         MOVE WS-VASSET-BAL02-SEQ-NBR TO WS-BAL02-SEQ-NBR          ACAT10DA
01/27         MOVE WS-VASSET-BAL02-CMNT    TO WS-BAL02-CMNT             ACAT10DA
           END-IF.                                                      ACAT10DA
      *                                                                 ACAT10DA
           IF WS-VINITAST-BAL05-TRAN-TYPE = 'A' OR 'C'                  ACAT10DA
01/21         MOVE WS-VINITAST-BAL05-SEQ-NBR TO WS-BAL05-SEQ-NBR        ACAT10DA
              IF WS-VINITAST-BAL05 > 0                                  ACAT10DA
                 MOVE WS-VINITAST-BAL05  TO WS-BAL05                    ACAT10DA
12/15            MOVE WS-VINITAST-BAL05-STTMRSN-CD TO                   ACAT10DA
12/15                 WS-BAL05-STTLM-RSN-CD                             ACAT10DA
01/27         ELSE                                                      ACAT10DA
                 IF WS-VINITAST-BAL05-CMNT > SPACE                      ACAT10DA
                    MOVE WS-VINITAST-BAL05-CMNT TO WS-BAL05-CMNT        ACAT10DA
                 END-IF                                                 ACAT10DA
01/27         END-IF                                                    ACAT10DA
           ELSE                                                         ACAT10DA
              MOVE WS-VASSET-BAL05 TO WS-BAL05                          ACAT10DA
12/15         MOVE WS-VASSET-BAL05-STTMRSN-CD TO                        ACAT10DA
12/15              WS-BAL05-STTLM-RSN-CD                                ACAT10DA
01/21         MOVE WS-VASSET-BAL05-SEQ-NBR TO WS-BAL05-SEQ-NBR          ACAT10DA
01/27         MOVE WS-VASSET-BAL05-CMNT    TO WS-BAL05-CMNT             ACAT10DA
           END-IF.                                                      ACAT10DA
      *                                                                 ACAT10DA
           IF WS-VINITAST-SMA-TRAN-TYPE = 'A' OR 'C'                    ACAT10DA
01/21         MOVE WS-VINITAST-SMA-SEQ-NBR TO WS-SMA-SEQ-NBR            ACAT10DA
              IF WS-VINITAST-SMA NOT = 0                                ACAT10DA
                 MOVE WS-VINITAST-SMA         TO WS-SMA                 ACAT10DA
01/21            MOVE WS-VINITAST-SMA-CMS-CD  TO WS-SMA-CMS-CD          ACAT10DA
01/27         ELSE                                                      ACAT10DA
                 IF WS-VINITAST-SMA-CMNT > SPACE                        ACAT10DA
                    MOVE WS-VINITAST-SMA-CMNT TO WS-SMA-CMNT            ACAT10DA
                 END-IF                                                 ACAT10DA
01/27         END-IF                                                    ACAT10DA
           ELSE                                                         ACAT10DA
              MOVE WS-VASSET-SMA TO WS-SMA                              ACAT10DA
01/21         MOVE WS-VASSET-SMA-CMS-CD  TO WS-SMA-CMS-CD               ACAT10DA
01/21         MOVE WS-VASSET-SMA-SEQ-NBR TO WS-SMA-SEQ-NBR              ACAT10DA
01/27         MOVE WS-VASSET-SMA-CMNT      TO WS-SMA-CMNT               ACAT10DA
           END-IF.                                                      ACAT10DA
      *                                                                 ACAT10DA
       0550-EXIT.                                                       ACAT10DA
094500     EXIT.                                                        ACAT10DA
092500/                                                                 ACAT10DA
       0600-SRCH-VINITAST.                                              ACAT10DA
                                                                        ACAT10DA
01/25      IF ACAT10IO-TIF-ACCT-NEW                                     ACAT10DA
              MOVE ACAT10IO-O-DLVR-NBR TO WS-DLVR-NBR                   ACAT10DA
              MOVE ACAT10IO-O-RCV-NBR  TO WS-RCV-NBR                    ACAT10DA
              MOVE ACAT10IO-O-ACCT-DLVR-NBR TO WS-ACCT-DLVR-NBR         ACAT10DA
              MOVE ACAT10IO-O-ACCT-RCV-NBR TO WS-ACCT-RCV-NBR           ACAT10DA
01/25      END-IF.                                                      ACAT10DA
                                                                        ACAT10DA
           EXEC SQL                                                     ACAT10DA
                SELECT COUNT(*)                                         ACAT10DA
                INTO : WS-COUNT                                         ACAT10DA
ET0002          FROM ACTIAST                                            ACAT10DA
                     WHERE  CLIENT_NBR  = :SV-CLIENT-NBR                ACAT10DA
                       AND  DLVR_NBR = :WS-DLVR-NBR                     ACAT10DA
                       AND  RCV_NBR = :WS-RCV-NBR                       ACAT10DA
                       AND  ACCT_DLVR_NBR = :WS-ACCT-DLVR-NBR           ACAT10DA
                       AND  ACCT_RCV_NBR = :WS-ACCT-RCV-NBR             ACAT10DA
                       AND  ACAT_CONTROL_NBR = :WS-ACAT-CONTROL-NBR     ACAT10DA
           END-EXEC.                                                    ACAT10DA
                                                                        ACAT10DA
           IF WS-COUNT = +0                                             ACAT10DA
              SET ACAT10IO-VINITAST-NOT-FOUND TO TRUE                   ACAT10DA
              MOVE 'NO ASSET FOR THIS CLIENT (ACAT10DC)'                ACAT10DA
                   TO WS-RETURN-MSG                                     ACAT10DA
              INITIALIZE ACAT10IO-DC                                    ACAT10DA
           ELSE                                                         ACAT10DA
              SET ACAT10IO-VINITAST-FOUND TO TRUE                       ACAT10DA
              MOVE WS-COUNT      TO  ACAT10IO-VINITAST-COUNT            ACAT10DA
                                     ACAT10IO-VINITAST-COUNT-SV         ACAT10DA
           END-IF.                                                      ACAT10DA
      /                                                                 ACAT10DA
      ****************************                                      ACAT10DA
       0601-SRCH-VASSET.                                                ACAT10DA
                                                                        ACAT10DA
           EXEC SQL                                                     ACAT10DA
                SELECT COUNT(*)                                         ACAT10DA
                INTO : WS-COUNT                                         ACAT10DA
                FROM VASSET                                             ACAT10DA
                     WHERE (CLIENT_NBR  = :SV-CLIENT-NBR)               ACAT10DA
                       AND (ACAT_CONTROL_NBR = :WS-ACAT-CONTROL-NBR)    ACAT10DA
           END-EXEC.                                                    ACAT10DA
                                                                        ACAT10DA
           IF WS-COUNT = +0                                             ACAT10DA
              SET ACAT10IO-VASSET-NOT-FOUND TO TRUE                     ACAT10DA
              INITIALIZE ACAT10IO-DC                                    ACAT10DA
              MOVE 'NO ASSET FOR THIS CLIENT (ACAT10DC)'                ACAT10DA
                   TO WS-RETURN-MSG                                     ACAT10DA
           ELSE                                                         ACAT10DA
              SET ACAT10IO-VASSET-FOUND TO TRUE                         ACAT10DA
              MOVE WS-COUNT      TO  ACAT10IO-VASSET-COUNT              ACAT10DA
                                     ACAT10IO-VASSET-COUNT-SV           ACAT10DA
           END-IF.                                                      ACAT10DA
                                                                                
LRM015     EXEC SQL                                                     ACAT10DA
LRM015          SELECT COUNT(*)                                         ACAT10DA
LRM015          INTO : WS-COUNT                                         ACAT10DA
LRM015          FROM ACTIAST                                            ACAT10DA
LRM015               WHERE (CLIENT_NBR  = :SV-CLIENT-NBR)               ACAT10DA
LRM015                 AND (ACAT_CONTROL_NBR = :WS-ACAT-CONTROL-NBR)    ACAT10DA
LRM015                 AND (TRANS_TYPE_CD = 'D')                        ACAT10DA
LRM015     END-EXEC.                                                    ACAT10DA
LRM015                                                                  ACAT10DA
LRM015     MOVE WS-COUNT TO ACAT10IO-ASSET-DELETE-COUNT.                        
      /                                                                 ACAT10DA
      ****************************                                      ACAT10DA
       0610-SRCH-INIT-BAL01.                                            ACAT10DA
                                                                        ACAT10DA
           MOVE SPACES      TO ACAT10IO-BAL01-TRAN-TYPE                 ACAT10DA
           MOVE '         ' TO SV-SEC-ISSUE-CD.                         ACAT10DA
           MOVE ' '         TO SV-SEC-CDG-CD.                           ACAT10DA
           MOVE '40'  TO SV-STTLM-LCTN-CD.                              ACAT10DA
           MOVE 'C'   TO WS-CSH-MGN-SHRT-CD.                            ACAT10DA
           EXEC SQL                                                     ACAT10DA
                SELECT ASSET_AMT                                        ACAT10DA
                     , TRANS_TYPE_CD                                    ACAT10DA
                     , STTLM_RSN_CD                                     ACAT10DA
                     , ASSET_SEQ_NBR                                    ACAT10DA
                     , ASSET_CMNT_TXT                                   ACAT10DA
                INTO : WS-VINITAST-BAL01                                ACAT10DA
                    ,: WS-VINITAST-BAL01-TRAN-TYPE                      ACAT10DA
                    ,: WS-VINITAST-BAL01-STTMRSN-CD                     ACAT10DA
                    ,: WS-VINITAST-BAL01-SEQ-NBR                        ACAT10DA
                    ,: WS-VINITAST-BAL01-CMNT                           ACAT10DA
ET0002          FROM ACTIAST                                            ACAT10DA
                     WHERE (CLIENT_NBR  = :SV-CLIENT-NBR)               ACAT10DA
LRM004                 AND  ACAT_CONTROL_NBR = :WS-ACAT-CONTROL-NBR     ACAT10DA
                       AND (DLVR_NBR = :WS-DLVR-NBR)                    ACAT10DA
                       AND (RCV_NBR = :WS-RCV-NBR)                      ACAT10DA
                       AND (ACCT_DLVR_NBR = :WS-ACCT-DLVR-NBR)          ACAT10DA
                       AND (ACCT_RCV_NBR = :WS-ACCT-RCV-NBR)            ACAT10DA
                       AND (ISIN_SEC_ISSUE_CD = :SV-SEC-ISSUE-CD)       ACAT10DA
                       AND (ISIN_SEC_CDG_CD = :SV-SEC-CDG-CD)           ACAT10DA
                       AND (STTLM_LCTN_CD = :SV-STTLM-LCTN-CD)          ACAT10DA
                       AND (CSH_MGN_SHRT_CD = :WS-CSH-MGN-SHRT-CD)      ACAT10DA
           END-EXEC.                                                    ACAT10DA
      ****             AND (ISIN_SEC_ISSUE_CD = '         ')            ACAT10DA
      *                AND (STTLM_LCTN_CD = '40')                       ACAT10DA
      *                AND (CSH_MGN_SHRT_CD = 'C')                      ACAT10DA
                                                                        ACAT10DA
           EVALUATE SQLCODE                                             ACAT10DA
                WHEN +0                                                 ACAT10DA
                     MOVE WS-VINITAST-BAL01-TRAN-TYPE                   ACAT10DA
                                       TO ACAT10IO-BAL01-TRAN-TYPE      ACAT10DA
                WHEN +100                                               ACAT10DA
                     MOVE ZERO TO WS-VINITAST-BAL01                     ACAT10DA
                WHEN OTHER                                              ACAT10DA
                     MOVE SPACE TO ACAT10IO-VINITAST-SW                 ACAT10DA
                     MOVE 'SELECT' TO ACAT10IO-SQLCAID                  ACAT10DA
                     PERFORM 9000-WRITE-TO-CICS-LOG                     ACAT10DA
                     PERFORM 9500-RETURN-DB2-ERROR                      ACAT10DA
           END-EVALUATE.                                                ACAT10DA
      /                                                                 ACAT10DA
      ****************************                                      ACAT10DA
       0611-SRCH-INIT-BAL02.                                            ACAT10DA
                                                                        ACAT10DA
           MOVE SPACES      TO ACAT10IO-BAL02-TRAN-TYPE                 ACAT10DA
           MOVE '         ' TO SV-SEC-ISSUE-CD.                         ACAT10DA
           MOVE ' '         TO SV-SEC-CDG-CD.                           ACAT10DA
           MOVE '40'  TO SV-STTLM-LCTN-CD.                              ACAT10DA
           MOVE 'M'   TO WS-CSH-MGN-SHRT-CD.                            ACAT10DA
           EXEC SQL                                                     ACAT10DA
                SELECT ASSET_AMT                                        ACAT10DA
                     , TRANS_TYPE_CD                                    ACAT10DA
                     , STTLM_RSN_CD                                     ACAT10DA
                     , ASSET_SEQ_NBR                                    ACAT10DA
                     , ASSET_CMNT_TXT                                   ACAT10DA
                INTO : WS-VINITAST-BAL02                                ACAT10DA
                    ,: WS-VINITAST-BAL02-TRAN-TYPE                      ACAT10DA
                    ,: WS-VINITAST-BAL02-STTMRSN-CD                     ACAT10DA
                    ,: WS-VINITAST-BAL02-SEQ-NBR                        ACAT10DA
                    ,: WS-VINITAST-BAL02-CMNT                           ACAT10DA
ET0002          FROM ACTIAST                                            ACAT10DA
                     WHERE (CLIENT_NBR  = :SV-CLIENT-NBR)               ACAT10DA
LRM004                 AND  ACAT_CONTROL_NBR = :WS-ACAT-CONTROL-NBR     ACAT10DA
                       AND (DLVR_NBR = :WS-DLVR-NBR)                    ACAT10DA
                       AND (RCV_NBR = :WS-RCV-NBR)                      ACAT10DA
                       AND (ACCT_DLVR_NBR = :WS-ACCT-DLVR-NBR)          ACAT10DA
                       AND (ACCT_RCV_NBR = :WS-ACCT-RCV-NBR)            ACAT10DA
                       AND (ISIN_SEC_ISSUE_CD = :SV-SEC-ISSUE-CD)       ACAT10DA
                       AND (ISIN_SEC_CDG_CD = :SV-SEC-CDG-CD)           ACAT10DA
                       AND (STTLM_LCTN_CD = :SV-STTLM-LCTN-CD)          ACAT10DA
                       AND (CSH_MGN_SHRT_CD = :WS-CSH-MGN-SHRT-CD)      ACAT10DA
           END-EXEC.                                                    ACAT10DA
                                                                        ACAT10DA
                                                                        ACAT10DA
           EVALUATE SQLCODE                                             ACAT10DA
                WHEN +0                                                 ACAT10DA
                     MOVE WS-VINITAST-BAL02-TRAN-TYPE                   ACAT10DA
                                       TO ACAT10IO-BAL02-TRAN-TYPE      ACAT10DA
                WHEN +100                                               ACAT10DA
                     MOVE ZERO TO WS-VINITAST-BAL02                     ACAT10DA
                WHEN OTHER                                              ACAT10DA
                     MOVE SPACE TO ACAT10IO-VINITAST-SW                 ACAT10DA
                     MOVE 'SELECT' TO ACAT10IO-SQLCAID                  ACAT10DA
                     PERFORM 9000-WRITE-TO-CICS-LOG                     ACAT10DA
                     PERFORM 9500-RETURN-DB2-ERROR                      ACAT10DA
           END-EVALUATE.                                                ACAT10DA
                                                                        ACAT10DA
      /                                                                 ACAT10DA
      ****************************                                      ACAT10DA
       0612-SRCH-INIT-BAL05.                                            ACAT10DA
                                                                        ACAT10DA
           MOVE SPACES      TO ACAT10IO-BAL05-TRAN-TYPE                 ACAT10DA
           MOVE '         ' TO SV-SEC-ISSUE-CD.                         ACAT10DA
           MOVE ' '         TO SV-SEC-CDG-CD.                           ACAT10DA
           MOVE '40'  TO SV-STTLM-LCTN-CD.                              ACAT10DA
           MOVE 'S'   TO WS-CSH-MGN-SHRT-CD.                            ACAT10DA
           EXEC SQL                                                     ACAT10DA
                SELECT ASSET_AMT                                        ACAT10DA
                     , TRANS_TYPE_CD                                    ACAT10DA
                     , STTLM_RSN_CD                                     ACAT10DA
                     , ASSET_SEQ_NBR                                    ACAT10DA
                     , ASSET_CMNT_TXT                                   ACAT10DA
                INTO : WS-VINITAST-BAL05                                ACAT10DA
                    ,: WS-VINITAST-BAL05-TRAN-TYPE                      ACAT10DA
                    ,: WS-VINITAST-BAL05-STTMRSN-CD                     ACAT10DA
                    ,: WS-VINITAST-BAL05-SEQ-NBR                        ACAT10DA
                    ,: WS-VINITAST-BAL05-CMNT                           ACAT10DA
ET0002          FROM ACTIAST                                            ACAT10DA
                     WHERE (CLIENT_NBR  = :SV-CLIENT-NBR)               ACAT10DA
LRM004                 AND  ACAT_CONTROL_NBR = :WS-ACAT-CONTROL-NBR     ACAT10DA
                       AND (DLVR_NBR = :WS-DLVR-NBR)                    ACAT10DA
                       AND (RCV_NBR = :WS-RCV-NBR)                      ACAT10DA
                       AND (ACCT_DLVR_NBR = :WS-ACCT-DLVR-NBR)          ACAT10DA
                       AND (ACCT_RCV_NBR = :WS-ACCT-RCV-NBR)            ACAT10DA
                       AND (ISIN_SEC_ISSUE_CD = :SV-SEC-ISSUE-CD)       ACAT10DA
                       AND (ISIN_SEC_CDG_CD = :SV-SEC-CDG-CD)           ACAT10DA
                       AND (STTLM_LCTN_CD = :SV-STTLM-LCTN-CD)          ACAT10DA
                       AND (CSH_MGN_SHRT_CD = :WS-CSH-MGN-SHRT-CD)      ACAT10DA
           END-EXEC.                                                    ACAT10DA
                                                                        ACAT10DA
           EVALUATE SQLCODE                                             ACAT10DA
                WHEN +0                                                 ACAT10DA
                     MOVE WS-VINITAST-BAL05-TRAN-TYPE                   ACAT10DA
                                       TO ACAT10IO-BAL05-TRAN-TYPE      ACAT10DA
                WHEN +100                                               ACAT10DA
                     MOVE ZERO TO WS-VINITAST-BAL05                     ACAT10DA
                WHEN OTHER                                              ACAT10DA
                     MOVE SPACE TO ACAT10IO-VINITAST-SW                 ACAT10DA
                     MOVE 'SELECT' TO ACAT10IO-SQLCAID                  ACAT10DA
                     PERFORM 9000-WRITE-TO-CICS-LOG                     ACAT10DA
                     PERFORM 9500-RETURN-DB2-ERROR                      ACAT10DA
           END-EVALUATE.                                                ACAT10DA
                                                                        ACAT10DA
      /                                                                 ACAT10DA
      ****************************                                      ACAT10DA
       0613-SRCH-INIT-SMA.                                              ACAT10DA
                                                                        ACAT10DA
           MOVE SPACES      TO ACAT10IO-SMA-TRAN-TYPE                   ACAT10DA
           EXEC SQL                                                     ACAT10DA
                SELECT ASSET_AMT                                        ACAT10DA
                     , TRANS_TYPE_CD                                    ACAT10DA
                     , CSH_MGN_SHRT_CD                                  ACAT10DA
                     , ASSET_SEQ_NBR                                    ACAT10DA
                     , ASSET_CMNT_TXT                                   ACAT10DA
                INTO : WS-VINITAST-SMA                                  ACAT10DA
                    ,: WS-VINITAST-SMA-TRAN-TYPE                        ACAT10DA
                    ,: WS-VINITAST-SMA-CMS-CD                           ACAT10DA
                    ,: WS-VINITAST-SMA-SEQ-NBR                          ACAT10DA
                    ,: WS-VINITAST-SMA-CMNT                             ACAT10DA
ET0002          FROM ACTIAST                                            ACAT10DA
                     WHERE (CLIENT_NBR  = :SV-CLIENT-NBR)               ACAT10DA
LRM004                 AND  ACAT_CONTROL_NBR = :WS-ACAT-CONTROL-NBR     ACAT10DA
                       AND (DLVR_NBR = :WS-DLVR-NBR)                    ACAT10DA
                       AND (RCV_NBR = :WS-RCV-NBR)                      ACAT10DA
                       AND (ACCT_DLVR_NBR = :WS-ACCT-DLVR-NBR)          ACAT10DA
                       AND (ACCT_RCV_NBR = :WS-ACCT-RCV-NBR)            ACAT10DA
                       AND (ISIN_SEC_ISSUE_CD = '         ')            ACAT10DA
                       AND (STTLM_LCTN_CD = '45')                       ACAT10DA
                       AND (STTLM_RSN_CD = 'SMA ')                      ACAT10DA
           END-EXEC.                                                    ACAT10DA
                                                                        ACAT10DA
           EVALUATE SQLCODE                                             ACAT10DA
                WHEN +0                                                 ACAT10DA
                     MOVE WS-VINITAST-SMA-TRAN-TYPE                     ACAT10DA
                                       TO ACAT10IO-SMA-TRAN-TYPE        ACAT10DA
                     CONTINUE                                           ACAT10DA
                WHEN +100                                               ACAT10DA
                     MOVE ZERO TO WS-VINITAST-SMA                       ACAT10DA
                WHEN OTHER                                              ACAT10DA
                     MOVE SPACE TO ACAT10IO-VINITAST-SW                 ACAT10DA
                     MOVE 'SELECT' TO ACAT10IO-SQLCAID                  ACAT10DA
                     PERFORM 9000-WRITE-TO-CICS-LOG                     ACAT10DA
                     PERFORM 9500-RETURN-DB2-ERROR                      ACAT10DA
           END-EVALUATE.                                                ACAT10DA
                                                                        ACAT10DA
      /                                                                 ACAT10DA
      ****************************                                      ACAT10DA
       0620-SRCH-ASST-BAL01.                                            ACAT10DA
                                                                        ACAT10DA
           EXEC SQL                                                     ACAT10DA
                SELECT ASSET_AMT                                        ACAT10DA
                     , TRANS_TYPE_CD                                    ACAT10DA
12/15                , STTLM_RSN_CD                                     ACAT10DA
01/21                , ASSET_SEQ_NBR                                    ACAT10DA
01/27                , ASSET_CMNT_TXT                                   ACAT10DA
                INTO : WS-VASSET-BAL01                                  ACAT10DA
                    ,: WS-VASSET-BAL01-TRAN-TYPE                        ACAT10DA
12/15               ,: WS-VASSET-BAL01-STTMRSN-CD                       ACAT10DA
01/21               ,: WS-VASSET-BAL01-SEQ-NBR                          ACAT10DA
01/27               ,: WS-VASSET-BAL01-CMNT                             ACAT10DA
                FROM VASSET                                             ACAT10DA
                     WHERE (CLIENT_NBR  = :SV-CLIENT-NBR)               ACAT10DA
                       AND (ACAT_CONTROL_NBR = :WS-ACAT-CONTROL-NBR)    ACAT10DA
                       AND (STTLM_LCTN_CD = '40')                       ACAT10DA
                       AND (CSH_MGN_SHRT_CD = 'C')                      ACAT10DA
           END-EXEC.                                                    ACAT10DA
01/30 **********       AND (STTLM_RSN_CD = 'CRED')                      ACAT10DA
                                                                        ACAT10DA
093400     EVALUATE SQLCODE                                             ACAT10DA
093500          WHEN +0                                                 ACAT10DA
                     CONTINUE                                           ACAT10DA
                WHEN +100                                               ACAT10DA
                     MOVE ZERO TO WS-VASSET-BAL01                       ACAT10DA
094000          WHEN OTHER                                              ACAT10DA
                     MOVE SPACE TO ACAT10IO-VASSET-SW                   ACAT10DA
                     MOVE 'SELECT' TO ACAT10IO-SQLCAID                  ACAT10DA
                     PERFORM 9000-WRITE-TO-CICS-LOG                     ACAT10DA
                     PERFORM 9500-RETURN-DB2-ERROR                      ACAT10DA
094200     END-EVALUATE.                                                ACAT10DA
                                                                        ACAT10DA
      /                                                                 ACAT10DA
      ****************************                                      ACAT10DA
       0621-SRCH-ASST-BAL02.                                            ACAT10DA
                                                                        ACAT10DA
           EXEC SQL                                                     ACAT10DA
                SELECT ASSET_AMT                                        ACAT10DA
                     , TRANS_TYPE_CD                                    ACAT10DA
12/15                , STTLM_RSN_CD                                     ACAT10DA
01/21                , ASSET_SEQ_NBR                                    ACAT10DA
01/27                , ASSET_CMNT_TXT                                   ACAT10DA
                INTO : WS-VASSET-BAL02                                  ACAT10DA
                    ,: WS-VASSET-BAL02-TRAN-TYPE                        ACAT10DA
12/15               ,: WS-VASSET-BAL02-STTMRSN-CD                       ACAT10DA
01/21               ,: WS-VASSET-BAL02-SEQ-NBR                          ACAT10DA
01/27               ,: WS-VASSET-BAL02-CMNT                             ACAT10DA
                FROM VASSET                                             ACAT10DA
                     WHERE (CLIENT_NBR  = :SV-CLIENT-NBR)               ACAT10DA
                       AND (ACAT_CONTROL_NBR = :WS-ACAT-CONTROL-NBR)    ACAT10DA
                       AND (STTLM_LCTN_CD = '40')                       ACAT10DA
                       AND (CSH_MGN_SHRT_CD = 'M')                      ACAT10DA
           END-EXEC.                                                    ACAT10DA
01/30 **********       AND (STTLM_RSN_CD = 'DEB ')                      ACAT10DA
                                                                        ACAT10DA
093400     EVALUATE SQLCODE                                             ACAT10DA
093500          WHEN +0                                                 ACAT10DA
                     CONTINUE                                           ACAT10DA
                WHEN +100                                               ACAT10DA
                     MOVE ZERO TO WS-VASSET-BAL02                       ACAT10DA
094000          WHEN OTHER                                              ACAT10DA
                     MOVE SPACE TO ACAT10IO-VASSET-SW                   ACAT10DA
                     MOVE 'SELECT' TO ACAT10IO-SQLCAID                  ACAT10DA
                     PERFORM 9000-WRITE-TO-CICS-LOG                     ACAT10DA
                     PERFORM 9500-RETURN-DB2-ERROR                      ACAT10DA
094200     END-EVALUATE.                                                ACAT10DA
                                                                        ACAT10DA
      /                                                                 ACAT10DA
      ****************************                                      ACAT10DA
       0622-SRCH-ASST-BAL05.                                            ACAT10DA
                                                                        ACAT10DA
           EXEC SQL                                                     ACAT10DA
                SELECT ASSET_AMT                                        ACAT10DA
                     , TRANS_TYPE_CD                                    ACAT10DA
12/15                , STTLM_RSN_CD                                     ACAT10DA
01/21                , ASSET_SEQ_NBR                                    ACAT10DA
01/27                , ASSET_CMNT_TXT                                   ACAT10DA
                INTO : WS-VASSET-BAL05                                  ACAT10DA
                    ,: WS-VASSET-BAL05-TRAN-TYPE                        ACAT10DA
12/15               ,: WS-VASSET-BAL05-STTMRSN-CD                       ACAT10DA
01/21               ,: WS-VASSET-BAL05-SEQ-NBR                          ACAT10DA
01/27               ,: WS-VASSET-BAL05-CMNT                             ACAT10DA
                FROM VASSET                                             ACAT10DA
                     WHERE (CLIENT_NBR  = :SV-CLIENT-NBR)               ACAT10DA
                       AND (ACAT_CONTROL_NBR = :WS-ACAT-CONTROL-NBR)    ACAT10DA
                       AND (STTLM_LCTN_CD = '40')                       ACAT10DA
                       AND (CSH_MGN_SHRT_CD = 'S')                      ACAT10DA
           END-EXEC.                                                    ACAT10DA
                                                                        ACAT10DA
093400     EVALUATE SQLCODE                                             ACAT10DA
093500          WHEN +0                                                 ACAT10DA
                     CONTINUE                                           ACAT10DA
                WHEN +100                                               ACAT10DA
                     MOVE ZERO TO WS-VASSET-BAL05                       ACAT10DA
094000          WHEN OTHER                                              ACAT10DA
                     MOVE SPACE TO ACAT10IO-VASSET-SW                   ACAT10DA
                     MOVE 'SELECT' TO ACAT10IO-SQLCAID                  ACAT10DA
                     PERFORM 9000-WRITE-TO-CICS-LOG                     ACAT10DA
                     PERFORM 9500-RETURN-DB2-ERROR                      ACAT10DA
094200     END-EVALUATE.                                                ACAT10DA
                                                                        ACAT10DA
      /                                                                 ACAT10DA
      ****************************                                      ACAT10DA
       0623-SRCH-ASST-SMA.                                              ACAT10DA
                                                                        ACAT10DA
           EXEC SQL                                                     ACAT10DA
                SELECT ASSET_AMT                                        ACAT10DA
                     , TRANS_TYPE_CD                                    ACAT10DA
01/21                , CSH_MGN_SHRT_CD                                  ACAT10DA
01/21                , ASSET_SEQ_NBR                                    ACAT10DA
01/27                , ASSET_CMNT_TXT                                   ACAT10DA
                INTO : WS-VASSET-SMA                                    ACAT10DA
                    ,: WS-VASSET-SMA-TRAN-TYPE                          ACAT10DA
                    ,: WS-VASSET-SMA-CMS-CD                             ACAT10DA
                    ,: WS-VASSET-SMA-SEQ-NBR                            ACAT10DA
01/27               ,: WS-VASSET-SMA-CMNT                               ACAT10DA
                FROM VASSET                                             ACAT10DA
                     WHERE (CLIENT_NBR  = :SV-CLIENT-NBR)               ACAT10DA
                       AND (ACAT_CONTROL_NBR = :WS-ACAT-CONTROL-NBR)    ACAT10DA
                       AND (STTLM_LCTN_CD = '45')                       ACAT10DA
                       AND (STTLM_RSN_CD = 'SMA ')                      ACAT10DA
           END-EXEC.                                                    ACAT10DA
                                                                        ACAT10DA
093400     EVALUATE SQLCODE                                             ACAT10DA
093500          WHEN +0                                                 ACAT10DA
                     CONTINUE                                           ACAT10DA
                WHEN +100                                               ACAT10DA
                     MOVE ZERO TO WS-VASSET-SMA                         ACAT10DA
094000          WHEN OTHER                                              ACAT10DA
                     MOVE SPACE TO ACAT10IO-VASSET-SW                   ACAT10DA
                     PERFORM 9000-WRITE-TO-CICS-LOG                     ACAT10DA
                     PERFORM 9500-RETURN-DB2-ERROR                      ACAT10DA
094200     END-EVALUATE.                                                ACAT10DA
                                                                        ACAT10DA
      /                                                                 ACAT10DA
       0640-RETRIEVE-CURRENT-VINITRNF.                                  ACAT10DA
                                                                        ACAT10DA
ET0002**   EXEC SQL                                                     ACAT10DA
ET0002**        SELECT                                                  ACAT10DA
ET0002**           CLIENT_NBR                                           ACAT10DA
ET0002**         , DLVR_NBR                                             ACAT10DA
ET0002**         , ACCT_DLVR_NBR                                        ACAT10DA
ET0002**         , RCV_NBR                                              ACAT10DA
ET0002**         , ACCT_RCV_NBR                                         ACAT10DA
ET0002**         , TRNFR_TYPE_CD                                        ACAT10DA
ET0002**         , RCV_NBR_STTS_CD                                      ACAT10DA
ET0002**         , DLVR_NBR_STTS_CD                                     ACAT10DA
ET0002**         , ACCT_RCV_STTS_CD                                     ACAT10DA
ET0002**         , ACCT_DLVR_STTS_CD                                    ACAT10DA
ET0002**         , SBMTG_PRTCP_NBR                                      ACAT10DA
ET0002**         , SBMT_PRT_NR_STS_CD                                   ACAT10DA
ET0002**         , ACAT_CONTROL_NBR                                     ACAT10DA
ET0002**         , CONTROL_NBR_STS_CD                                   ACAT10DA
ET0002**         , TRNFR_TYPE_STTS_CD                                   ACAT10DA
ET0002**         , TRANS_TYPE_CD                                        ACAT10DA
ET0002**         , TRANS_TYPE_STTS_CD                                   ACAT10DA
ET0002**         , RCV_CUST_NM                                          ACAT10DA
ET0002**         , RCV_CUST_NM_STS_CD                                   ACAT10DA
ET0002**         , RCV_SS_PRIM_NBR                                      ACAT10DA
ET0002**         , RCV_SS_PRIM_STS_CD                                   ACAT10DA
ET0002**         , RCV_SS_SCNDY_NBR                                     ACAT10DA
ET0002**         , RCV_SS_SCDY_STS_CD                                   ACAT10DA
ET0002**         , RCV_ACCT_TYPE_CD                                     ACAT10DA
ET0002**         , RCV_ACT_TYP_STS_CD                                   ACAT10DA
ET0002**         , RCV_OCC_BRKR_NBR                                     ACAT10DA
ET0002**         , RCV_OCC_STTS_CD                                      ACAT10DA
ET0002**         , RCV_CRSPN_NBR                                        ACAT10DA
ET0002**         , RCV_CRSPN_STTS_CD                                    ACAT10DA
ET0002**         , ACAT_CNTL_ASTD_NBR                                   ACAT10DA
ET0002**         , CNTL_ASTD_STTS_CD                                    ACAT10DA
ET0002**         , CMNT_TXT                                             ACAT10DA
ET0002**         , CMNT_STTS_CD                                         ACAT10DA
ET0002**         , PRCS_DT                                              ACAT10DA
ET0002**         , STTS_CD                                              ACAT10DA
ET0002**         , DSTBN_SIDE_CD                                        ACAT10DA
ET0002**         , SYS_ACT_CD                                           ACAT10DA
ET0002**         , SYS_RJCT_RSN_CD                                      ACAT10DA
ET0002**         , TRNFR_TYPE_RJCT_CD                                   ACAT10DA
ET0002**         , TRNFR_TYPE_RJC1_CD                                   ACAT10DA
ET0002**         , TRNFR_TYPE_RJC2_CD                                   ACAT10DA
ET0002**         , TRN_TYP_RJC_STS_CD                                   ACAT10DA
ET0002**         , PHSCL_SEQ_NBR                                        ACAT10DA
ET0002**         , PHSCL_SEQ_STTS_CD                                    ACAT10DA
ET0002**         , LGCL_SEQ_NBR                                         ACAT10DA
ET0002**         , LGCL_SEQ_NR_STS_CD                                   ACAT10DA
ET0002**         , PRTCP_CONTRA_CD                                      ACAT10DA
ET0002**         , CYCLE_CD                                             ACAT10DA
ET0002**         , DAYS_STTS_QTY                                        ACAT10DA
ET0002**         , TRANS_RFRN_ID_CD                                     ACAT10DA
ET0002**         , TRANS_RFRN_STTS_CD                                   ACAT10DA
ET0002**         , DB_CR_CD                                             ACAT10DA
ET0002**         , STTLM_ASCTD_DT                                       ACAT10DA
ET0002**         , STTLM_ASCTD_STS_CD                                   ACAT10DA
ET0002**         , RCRD_LNGTH_STTS_CD                                   ACAT10DA
ET0002**         , RCRD_STTS_CD                                         ACAT10DA
ET0002**         , NSCC_PEND_CD                                         ACAT10DA
ET0002**         , NSCC_ACK_IND                                         ACAT10DA
ET0002**         , UPDT_TMSTP                                           ACAT10DA
ET0002**         , CRT_TMSTP                                            ACAT10DA
ET0002**         , CICS_TERM_ID_CD                                      ACAT10DA
ET0002**         , PRGM_NM                                              ACAT10DA
ET0002**         , RR_CD                                                ACAT10DA
ET0002**        INTO  :DCLVINITRNF                                      ACAT10DA
ET0002**        FROM  VINITRNF                                          ACAT10DA
ET0002**        WHERE (CLIENT_NBR = :ACAT10IO-CLIENT-NBR                ACAT10DA
ET0002**         AND  TRNFR_TYPE_CD = :ACAT10IO-TFR-TYPE                ACAT10DA
ET0002**         AND  RCV_NBR = :ACAT10IO-RCV-NBR                       ACAT10DA
ET0002**         AND  DLVR_NBR = :ACAT10IO-DLVR-NBR                     ACAT10DA
ET0002**         AND  ACCT_DLVR_NBR = :ACAT10IO-ACCT-DLVR-NBR           ACAT10DA
ET0002**         AND  ACCT_RCV_NBR =  :ACAT10IO-ACCT-RCV-NBR            ACAT10DA
ET0002**         AND  RR_CD  =  :ACAT10IO-RR-CD)                        ACAT10DA
ET0002**     OR                                                         ACAT10DA
ET0002**             (CLIENT_NBR = :ACAT10IO-CLIENT-NBR                 ACAT10DA
ET0002**         AND  ACAT_CONTROL_NBR = :ACAT10IO-ACAT-CONTROL-NBR     ACAT10DA
ET0002**         AND  TRNFR_TYPE_CD = :ACAT10IO-TFR-TYPE                ACAT10DA
ET0002**         AND  RCV_NBR = :ACAT10IO-RCV-NBR                       ACAT10DA
ET0002**         AND  DLVR_NBR = :ACAT10IO-DLVR-NBR                     ACAT10DA
ET0002**         AND  ACCT_DLVR_NBR = :ACAT10IO-ACCT-DLVR-NBR           ACAT10DA
ET0002**         AND  ACCT_RCV_NBR =  :ACAT10IO-ACCT-RCV-NBR            ACAT10DA
ET0002**         AND  RR_CD  =  :ACAT10IO-RR-CD)                        ACAT10DA
ET0002**   END-EXEC.                                                    ACAT10DA
                                                                        ACAT10DA
ET0002     EXEC SQL                                                     ACAT10DA
ET0002         SELECT                                                   ACAT10DA
ET0002            CLIENT_NBR                                                    
ET0002           ,DLVR_NBR                                                      
ET0002           ,ACCT_DLVR_NBR                                                 
ET0002           ,RCV_NBR                                                       
ET0002           ,ACCT_RCV_NBR                                                  
ET0002           ,TRNFR_TYPE_CD                                                 
ET0002           ,RCV_NBR_STTS_CD                                               
ET0002           ,DLVR_NBR_STTS_CD                                              
ET0002           ,ACCT_RCV_STTS_CD                                              
ET0002           ,ACCT_DLVR_STTS_CD                                             
ET0002           ,SBMTG_PRTCP_NBR                                               
ET0002           ,SBMT_PRT_NR_STS_CD                                            
ET0002           ,ACAT_CONTROL_NBR                                              
ET0002           ,CONTROL_NBR_STS_CD                                            
ET0002           ,TRNFR_TYPE_STTS_CD                                            
ET0002           ,TRANS_TYPE_CD                                                 
ET0002           ,TRANS_TYPE_STTS_CD                                            
ET0002           ,RCV_CUST_NM                                                   
ET0002           ,RCV_CUST_NM_STS_CD                                            
ET0002           ,RCV_SS_PRIM_NBR                                               
ET0002           ,RCV_SS_PRIM_STS_CD                                            
ET0002           ,RCV_SS_SCNDY_NBR                                              
ET0002           ,RCV_SS_SCDY_STS_CD                                            
ET0002           ,RCV_ACCT_TYPE_CD                                              
ET0002           ,RCV_ACT_TYP_STS_CD                                            
ET0002           ,RCV_OCC_BRKR_NBR                                              
ET0002           ,RCV_OCC_STTS_CD                                               
ET0002           ,RCV_CRSPN_NBR                                                 
ET0002           ,RCV_CRSPN_STTS_CD                                             
ET0002           ,ACAT_CNTL_ASTD_NBR                                            
ET0002           ,CNTL_ASTD_STTS_CD                                             
ET0002           ,CMNT_TXT                                                      
ET0002           ,CMNT_STTS_CD                                                  
ET0002           ,PRCS_DT                                                       
ET0002           ,STTS_CD                                                       
ET0002           ,DSTBN_SIDE_CD                                                 
ET0002           ,SYS_ACT_CD                                                    
ET0002           ,SYS_RJCT_RSN_CD                                               
ET0002           ,TRNFR_TYPE_RJCT_CD                                            
ET0002           ,TRNFR_TYPE_RJC1_CD                                            
ET0002           ,TRNFR_TYPE_RJC2_CD                                            
ET0002           ,TRN_TYP_RJC_STS_CD                                            
ET0002           ,PHSCL_SEQ_NBR                                                 
ET0002           ,PHSCL_SEQ_STTS_CD                                             
ET0002           ,LGCL_SEQ_NBR                                                  
ET0002           ,LGCL_SEQ_NR_STS_CD                                            
ET0002           ,PRTCP_CONTRA_CD                                               
ET0002           ,CYCLE_CD                                                      
ET0002           ,DAYS_STTS_QTY                                                 
ET0002           ,TRANS_RFRN_ID_CD                                              
ET0002           ,TRANS_RFRN_STTS_CD                                            
ET0002           ,DB_CR_CD                                                      
ET0002           ,STTLM_ASCTD_DT                                                
ET0002           ,STTLM_ASCTD_STS_CD                                            
ET0002           ,RCRD_LNGTH_STTS_CD                                            
ET0002           ,RCRD_STTS_CD                                                  
ET0002           ,NSCC_PEND_CD                                                  
ET0002           ,NSCC_ACK_IND                                                  
ET0002           ,UPDT_TMSTP                                                    
ET0002           ,CRT_TMSTP                                                     
ET0002           ,CICS_TERM_ID_CD                                               
ET0002           ,PRGM_NM                                                       
ET0002           ,RR_CD                                                         
LRM011           ,CICS_SGNON_ID                                                 
LRM011           ,CICS_NET_NM                                                   
LRM011           ,TPSCRT_USR_ID                                                 
LRM011           ,TPSCRT_USR_NM                                                 
LRM011           ,GIFT_IND                                                      
ET0002         INTO                                                     ACAT10DA
                  :DCLACTITRF.CLIENT-NBR                                        
                 ,:DCLACTITRF.DLVR-NBR                                          
                 ,:DCLACTITRF.ACCT-DLVR-NBR                                     
                 ,:DCLACTITRF.RCV-NBR                                           
                 ,:DCLACTITRF.ACCT-RCV-NBR                                      
                 ,:DCLACTITRF.TRNFR-TYPE-CD                                     
                 ,:DCLACTITRF.RCV-NBR-STTS-CD                                   
                 ,:DCLACTITRF.DLVR-NBR-STTS-CD                                  
                 ,:DCLACTITRF.ACCT-RCV-STTS-CD                                  
                 ,:DCLACTITRF.ACCT-DLVR-STTS-CD                                 
                 ,:DCLACTITRF.SBMTG-PRTCP-NBR                                   
                 ,:DCLACTITRF.SBMT-PRT-NR-STS-CD                                
                 ,:DCLACTITRF.ACAT-CONTROL-NBR                                  
                 ,:DCLACTITRF.CONTROL-NBR-STS-CD                                
                 ,:DCLACTITRF.TRNFR-TYPE-STTS-CD                                
                 ,:DCLACTITRF.TRANS-TYPE-CD                                     
                 ,:DCLACTITRF.TRANS-TYPE-STTS-CD                                
                 ,:DCLACTITRF.RCV-CUST-NM                                       
                 ,:DCLACTITRF.RCV-CUST-NM-STS-CD                                
                 ,:DCLACTITRF.RCV-SS-PRIM-NBR                                   
                 ,:DCLACTITRF.RCV-SS-PRIM-STS-CD                                
                 ,:DCLACTITRF.RCV-SS-SCNDY-NBR                                  
                 ,:DCLACTITRF.RCV-SS-SCDY-STS-CD                                
                 ,:DCLACTITRF.RCV-ACCT-TYPE-CD                                  
                 ,:DCLACTITRF.RCV-ACT-TYP-STS-CD                                
                 ,:DCLACTITRF.RCV-OCC-BRKR-NBR                                  
                 ,:DCLACTITRF.RCV-OCC-STTS-CD                                   
                 ,:DCLACTITRF.RCV-CRSPN-NBR                                     
                 ,:DCLACTITRF.RCV-CRSPN-STTS-CD                                 
                 ,:DCLACTITRF.ACAT-CNTL-ASTD-NBR                                
                 ,:DCLACTITRF.CNTL-ASTD-STTS-CD                                 
                 ,:DCLACTITRF.CMNT-TXT                                          
                 ,:DCLACTITRF.CMNT-STTS-CD                                      
                 ,:DCLACTITRF.PRCS-DT                                           
                 ,:DCLACTITRF.STTS-CD                                           
                 ,:DCLACTITRF.DSTBN-SIDE-CD                                     
                 ,:DCLACTITRF.SYS-ACT-CD                                        
                 ,:DCLACTITRF.SYS-RJCT-RSN-CD                                   
                 ,:DCLACTITRF.TRNFR-TYPE-RJCT-CD                                
                 ,:DCLACTITRF.TRNFR-TYPE-RJC1-CD                                
                 ,:DCLACTITRF.TRNFR-TYPE-RJC2-CD                                
                 ,:DCLACTITRF.TRN-TYP-RJC-STS-CD                                
                 ,:DCLACTITRF.PHSCL-SEQ-NBR                                     
                 ,:DCLACTITRF.PHSCL-SEQ-STTS-CD                                 
                 ,:DCLACTITRF.LGCL-SEQ-NBR                                      
                 ,:DCLACTITRF.LGCL-SEQ-NR-STS-CD                                
                 ,:DCLACTITRF.PRTCP-CONTRA-CD                                   
                 ,:DCLACTITRF.CYCLE-CD                                          
                 ,:DCLACTITRF.DAYS-STTS-QTY                                     
                 ,:DCLACTITRF.TRANS-RFRN-ID-CD                                  
                 ,:DCLACTITRF.TRANS-RFRN-STTS-CD                                
                 ,:DCLACTITRF.DB-CR-CD                                          
                 ,:DCLACTITRF.STTLM-ASCTD-DT                                    
                 ,:DCLACTITRF.STTLM-ASCTD-STS-CD                                
                 ,:DCLACTITRF.RCRD-LNGTH-STTS-CD                                
                 ,:DCLACTITRF.RCRD-STTS-CD                                      
                 ,:DCLACTITRF.NSCC-PEND-CD                                      
                 ,:DCLACTITRF.NSCC-ACK-IND                                      
                 ,:DCLACTITRF.UPDT-TMSTP                                        
                 ,:DCLACTITRF.CRT-TMSTP                                         
                 ,:DCLACTITRF.CICS-TERM-ID-CD                                   
                 ,:DCLACTITRF.PRGM-NM                                           
                 ,:DCLACTITRF.RR-CD                                             
                 ,:DCLACTITRF.CICS-SGNON-ID                                     
                 ,:DCLACTITRF.CICS-NET-NM                                       
                 ,:DCLACTITRF.TPSCRT-USR-ID                                     
                 ,:DCLACTITRF.TPSCRT-USR-NM                                     
                 ,:DCLACTITRF.GIFT-IND                                          
      ******************************************************************        
      * THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS 69      *        
      ******************************************************************        
ET0002         FROM  ACTITRF                                            ACAT10DA
ET0002         WHERE (CLIENT_NBR = :ACAT10IO-CLIENT-NBR                 ACAT10DA
ET0002           AND  ACAT_CONTROL_NBR = :ACAT10IO-ACAT-CONTROL-NBR     ACAT10DA
ET0002           AND  TRNFR_TYPE_CD = :ACAT10IO-TFR-TYPE                ACAT10DA
ET0002           AND  RCV_NBR = :ACAT10IO-RCV-NBR                       ACAT10DA
ET0002           AND  DLVR_NBR = :ACAT10IO-DLVR-NBR                     ACAT10DA
ET0002           AND  ACCT_DLVR_NBR = :ACAT10IO-ACCT-DLVR-NBR           ACAT10DA
ET0002           AND  ACCT_RCV_NBR =  :ACAT10IO-ACCT-RCV-NBR            ACAT10DA
ET0002           AND  RR_CD  =  :ACAT10IO-RR-CD)                        ACAT10DA
ET0002     END-EXEC.                                                    ACAT10DA
                                                                        ACAT10DA
           EVALUATE SQLCODE                                             ACAT10DA
                WHEN +0                                                 ACAT10DA
                     SET CURRENT-VINITRNF-FOUND TO TRUE                 ACAT10DA
                WHEN +100                                               ACAT10DA
                     SET VINITRNF-NOT-FOUND TO TRUE                     ACAT10DA
                     SET CURRENT-VINITRNF-NOT-FOUND TO TRUE             ACAT10DA
                     MOVE '2ND RETRIEVE INITIAL TIF NOT FOUND' TO       ACAT10DA
                            WS-RETURN-MSG                               ACAT10DA
                WHEN OTHER                                              ACAT10DA
                     MOVE SPACE TO ACAT10IO-VINITRNF-SW                 ACAT10DA
                     MOVE 'SELECT' TO ACAT10IO-SQLCAID                  ACAT10DA
                     PERFORM 9000-WRITE-TO-CICS-LOG                     ACAT10DA
                     PERFORM 9500-RETURN-DB2-ERROR                      ACAT10DA
           END-EVALUATE.                                                ACAT10DA
                                                                        ACAT10DA
      /                                                                 ACAT10DA
       0650-RETRIEVE-CURRENT-VTRNFR.                                    ACAT10DA
                                                                        ACAT10DA
           EXEC SQL                                                     ACAT10DA
                SELECT                                                  ACAT10DA
                      CLIENT_NBR,                                       ACAT10DA
                      ACAT_CONTROL_NBR,                                 ACAT10DA
                      SBMTG_PRTCP_NBR,                                  ACAT10DA
                      SBMT_PRT_NR_STS_CD,                               ACAT10DA
                      CONTROL_NBR_STS_CD,                               ACAT10DA
                      DLVR_NBR,                                         ACAT10DA
                      DLVR_NBR_STTS_CD,                                 ACAT10DA
                      ACCT_DLVR_NBR,                                    ACAT10DA
                      ACCT_DLVR_STTS_CD,                                ACAT10DA
                      RCV_NBR,                                          ACAT10DA
                      RCV_NBR_STTS_CD,                                  ACAT10DA
                      ACCT_RCV_NBR,                                     ACAT10DA
                      ACCT_RCV_STTS_CD,                                 ACAT10DA
                      TRNFR_TYPE_CD,                                    ACAT10DA
                      TRNFR_TYPE_STTS_CD,                               ACAT10DA
                      TRANS_TYPE_CD,                                    ACAT10DA
                      TRANS_TYPE_STTS_CD,                               ACAT10DA
                      RCV_CUST_NM,                                      ACAT10DA
                      RCV_CUST_NM_STS_CD,                               ACAT10DA
                      RCV_SS_PRIM_NBR,                                  ACAT10DA
                      RCV_SS_PRIM_STS_CD,                               ACAT10DA
                      RCV_SS_SCNDY_NBR,                                 ACAT10DA
                      RCV_SS_SCDY_STS_CD,                               ACAT10DA
                      RCV_ACCT_TYPE_CD,                                 ACAT10DA
                      RCV_ACT_TYP_STS_CD,                               ACAT10DA
                      RCV_OCC_BRKR_NBR,                                 ACAT10DA
                      RCV_OCC_STTS_CD,                                  ACAT10DA
                      RCV_CRSPN_NBR,                                    ACAT10DA
                      RCV_CRSPN_STTS_CD,                                ACAT10DA
                      ACAT_CNTL_ASTD_NBR,                               ACAT10DA
                      CNTL_ASTD_STTS_CD,                                ACAT10DA
                      CMNT_TXT,                                         ACAT10DA
                      CMNT_STTS_CD,                                     ACAT10DA
                      PRCS_DT,                                          ACAT10DA
                      STTS_CD,                                          ACAT10DA
                      STTLM_TM_CD,                                      ACAT10DA
                      VAL_FREE_CD,                                      ACAT10DA
                      TRANS_RFRN_ID_CD,                                 ACAT10DA
                      TRANS_RFRN_STTS_CD,                               ACAT10DA
                      DB_CR_CD,                                         ACAT10DA
                      DSTBN_SIDE_CD,                                    ACAT10DA
                      SYS_ACT_CD,                                       ACAT10DA
                      SYS_RJCT_RSN_CD,                                  ACAT10DA
                      TRNFR_TYPE_RJC1_CD,                               ACAT10DA
                      TRNFR_TYPE_RJC2_CD,                               ACAT10DA
                      TRNFR_TYPE_RJCT_CD,                               ACAT10DA
                      TRN_TYP_RJC_STS_CD,                               ACAT10DA
                      PHSCL_SEQ_NBR,                                    ACAT10DA
                      PHSCL_SEQ_STTS_CD,                                ACAT10DA
                      LGCL_SEQ_NBR,                                     ACAT10DA
                      LGCL_SEQ_NR_STS_CD,                               ACAT10DA
                      RR_CD,                                            ACAT10DA
                      BRANCH_CD,                                        ACAT10DA
                      DVDND_NAA_CD,                                     ACAT10DA
                      SELL_INSTN_NAA_CD,                                ACAT10DA
                      CASH_SWEEP_NAA_CD,                                ACAT10DA
                      PRTCP_CONTRA_CD,                                  ACAT10DA
                      ACM_HOLDER_NAA_CD,                                ACAT10DA
                      ACCT_ACTIVITY_IND,                                ACAT10DA
                      ACCT_ORDERS_IND,                                  ACAT10DA
                      ACCT_RJCT_RSBM_IND,                               ACAT10DA
                      ACCT_DB_BAL_T1_IND,                               ACAT10DA
                      ACCT_MRGN_DB_IND,                                 ACAT10DA
                      ACCT_SHRT_PSTN_IND,                               ACAT10DA
                      ACCT_SEC_RSTRD_IND,                               ACAT10DA
                      ACCT_AST_EXCS_IND,                                ACAT10DA
                      ACCT_OPTN_PSTN_IND,                               ACAT10DA
                      ACCT_LTD_PRTNR_IND,                               ACAT10DA
                      ACCT_TIN_MSMTH_IND,                               ACAT10DA
                      ACCT_DPLCT_TRN_IND,                               ACAT10DA
                      ACCT_CUST_70_IND,                                 ACAT10DA
                      ACCT_QULFD_PLN_IND,                               ACAT10DA
                      ACCT_MNGD_IND,                                    ACAT10DA
                      ACCT_PRVT_RNG_IND,                                ACAT10DA
                      ACCT_BRKR_TIF_IND,                                ACAT10DA
                      NSCC_NON_ADP_IND,                                 ACAT10DA
                      CYCLE_CD,                                         ACAT10DA
                      DAYS_STTS_QTY,                                    ACAT10DA
                      STTLM_DT,                                         ACAT10DA
                      ACCT_NA_UPDT_IND,                                 ACAT10DA
                      ACCT_TRNFR_FEE_AMT,                               ACAT10DA
                      ACCT_IRA_TRMNT_AMT,                               ACAT10DA
                      ACCT_IRA_MAINT_AMT,                               ACAT10DA
                      ACCT_DLRV_PRGR_IND,                               ACAT10DA
                      ACCT_CD,                                          ACAT10DA
                      STTLM_ASCTD_DT,                                   ACAT10DA
                      STTLM_ASCTD_STS_CD,                               ACAT10DA
                      RCRD_LNGTH_STTS_CD,                               ACAT10DA
                      RCRD_STTS_CD,                                     ACAT10DA
                      NSCC_PEND_CD,                                     ACAT10DA
                      NSCC_ACK_IND,                                     ACAT10DA
                      CICS_TERM_ID_CD,                                  ACAT10DA
                      PRGM_NM,                                          ACAT10DA
                      CRT_TMSTP,                                        ACAT10DA
                      UPDT_TMSTP,                                       ACAT10DA
                      ACCT_EQUITY_AMT,                                  ACAT10DA
ET0003                ALERT_IND,                                        ACAT10DA
ET0003                ACCT_RB_SEC_IND,                                  ACAT10DA
ET0003                ACCT_CLT_RSCND_IND,                               ACAT10DA
ET0003                ACCT_LGL_BLK_IND,                                 ACAT10DA
ET0003                FRV_MFC_CMPLT_IND,                                ACAT10DA
ET0003                ACCT_FRZN_IND,                                    ACAT10DA
LRM011                BRANCH_ALTNT_CD,                                          
LRM011                GIFT_IND,                                                 
LRM011                RSTR_TRD_90_DY_IND,                                       
LRM011                REG_T_IND,                                                
LRM011                ADOPT_AGRMT_IND,                                          
LRM024                NTWRK_LVL4_FND_IND,                                       
LRM011                RR_ORGNL_CD,                                              
LRM011                CVRSN_ACCT_NBR                                            
                INTO                                                    ACAT10DA
                   :DCLVTRNFR.CLIENT-NBR                                        
                  ,:DCLVTRNFR.ACAT-CONTROL-NBR                                  
                  ,:DCLVTRNFR.SBMTG-PRTCP-NBR                                   
                  ,:DCLVTRNFR.SBMT-PRT-NR-STS-CD                                
                  ,:DCLVTRNFR.CONTROL-NBR-STS-CD                                
                  ,:DCLVTRNFR.DLVR-NBR                                          
                  ,:DCLVTRNFR.DLVR-NBR-STTS-CD                                  
                  ,:DCLVTRNFR.ACCT-DLVR-NBR                                     
                  ,:DCLVTRNFR.ACCT-DLVR-STTS-CD                                 
                  ,:DCLVTRNFR.RCV-NBR                                           
                  ,:DCLVTRNFR.RCV-NBR-STTS-CD                                   
                  ,:DCLVTRNFR.ACCT-RCV-NBR                                      
                  ,:DCLVTRNFR.ACCT-RCV-STTS-CD                                  
                  ,:DCLVTRNFR.TRNFR-TYPE-CD                                     
                  ,:DCLVTRNFR.TRNFR-TYPE-STTS-CD                                
                  ,:DCLVTRNFR.TRANS-TYPE-CD                                     
                  ,:DCLVTRNFR.TRANS-TYPE-STTS-CD                                
                  ,:DCLVTRNFR.RCV-CUST-NM                                       
                  ,:DCLVTRNFR.RCV-CUST-NM-STS-CD                                
                  ,:DCLVTRNFR.RCV-SS-PRIM-NBR                                   
                  ,:DCLVTRNFR.RCV-SS-PRIM-STS-CD                                
                  ,:DCLVTRNFR.RCV-SS-SCNDY-NBR                                  
                  ,:DCLVTRNFR.RCV-SS-SCDY-STS-CD                                
                  ,:DCLVTRNFR.RCV-ACCT-TYPE-CD                                  
                  ,:DCLVTRNFR.RCV-ACT-TYP-STS-CD                                
                  ,:DCLVTRNFR.RCV-OCC-BRKR-NBR                                  
                  ,:DCLVTRNFR.RCV-OCC-STTS-CD                                   
                  ,:DCLVTRNFR.RCV-CRSPN-NBR                                     
                  ,:DCLVTRNFR.RCV-CRSPN-STTS-CD                                 
                  ,:DCLVTRNFR.ACAT-CNTL-ASTD-NBR                                
                  ,:DCLVTRNFR.CNTL-ASTD-STTS-CD                                 
                  ,:DCLVTRNFR.CMNT-TXT                                          
                  ,:DCLVTRNFR.CMNT-STTS-CD                                      
                  ,:DCLVTRNFR.PRCS-DT                                           
                  ,:DCLVTRNFR.STTS-CD                                           
                  ,:DCLVTRNFR.STTLM-TM-CD                                       
                  ,:DCLVTRNFR.VAL-FREE-CD                                       
                  ,:DCLVTRNFR.TRANS-RFRN-ID-CD                                  
                  ,:DCLVTRNFR.TRANS-RFRN-STTS-CD                                
                  ,:DCLVTRNFR.DB-CR-CD                                          
                  ,:DCLVTRNFR.DSTBN-SIDE-CD                                     
                  ,:DCLVTRNFR.SYS-ACT-CD                                        
                  ,:DCLVTRNFR.SYS-RJCT-RSN-CD                                   
                  ,:DCLVTRNFR.TRNFR-TYPE-RJC1-CD                                
                  ,:DCLVTRNFR.TRNFR-TYPE-RJC2-CD                                
                  ,:DCLVTRNFR.TRNFR-TYPE-RJCT-CD                                
                  ,:DCLVTRNFR.TRN-TYP-RJC-STS-CD                                
                  ,:DCLVTRNFR.PHSCL-SEQ-NBR                                     
                  ,:DCLVTRNFR.PHSCL-SEQ-STTS-CD                                 
                  ,:DCLVTRNFR.LGCL-SEQ-NBR                                      
                  ,:DCLVTRNFR.LGCL-SEQ-NR-STS-CD                                
                  ,:DCLVTRNFR.RR-CD                                             
                  ,:DCLVTRNFR.BRANCH-CD                                         
                  ,:DCLVTRNFR.DVDND-NAA-CD                                      
                  ,:DCLVTRNFR.SELL-INSTN-NAA-CD                                 
                  ,:DCLVTRNFR.CASH-SWEEP-NAA-CD                                 
                  ,:DCLVTRNFR.PRTCP-CONTRA-CD                                   
                  ,:DCLVTRNFR.ACM-HOLDER-NAA-CD                                 
                  ,:DCLVTRNFR.ACCT-ACTIVITY-IND                                 
                  ,:DCLVTRNFR.ACCT-ORDERS-IND                                   
                  ,:DCLVTRNFR.ACCT-RJCT-RSBM-IND                                
                  ,:DCLVTRNFR.ACCT-DB-BAL-T1-IND                                
                  ,:DCLVTRNFR.ACCT-MRGN-DB-IND                                  
                  ,:DCLVTRNFR.ACCT-SHRT-PSTN-IND                                
                  ,:DCLVTRNFR.ACCT-SEC-RSTRD-IND                                
                  ,:DCLVTRNFR.ACCT-AST-EXCS-IND                                 
                  ,:DCLVTRNFR.ACCT-OPTN-PSTN-IND                                
                  ,:DCLVTRNFR.ACCT-LTD-PRTNR-IND                                
                  ,:DCLVTRNFR.ACCT-TIN-MSMTH-IND                                
                  ,:DCLVTRNFR.ACCT-DPLCT-TRN-IND                                
                  ,:DCLVTRNFR.ACCT-CUST-70-IND                                  
                  ,:DCLVTRNFR.ACCT-QULFD-PLN-IND                                
                  ,:DCLVTRNFR.ACCT-MNGD-IND                                     
                  ,:DCLVTRNFR.ACCT-PRVT-RNG-IND                                 
                  ,:DCLVTRNFR.ACCT-BRKR-TIF-IND                                 
                  ,:DCLVTRNFR.NSCC-NON-ADP-IND                                  
                  ,:DCLVTRNFR.CYCLE-CD                                          
                  ,:DCLVTRNFR.DAYS-STTS-QTY                                     
                  ,:DCLVTRNFR.STTLM-DT                                          
                  ,:DCLVTRNFR.ACCT-NA-UPDT-IND                                  
                  ,:DCLVTRNFR.ACCT-TRNFR-FEE-AMT                                
                  ,:DCLVTRNFR.ACCT-IRA-TRMNT-AMT                                
                  ,:DCLVTRNFR.ACCT-IRA-MAINT-AMT                                
                  ,:DCLVTRNFR.ACCT-DLRV-PRGR-IND                                
                  ,:DCLVTRNFR.ACCT-CD                                           
                  ,:DCLVTRNFR.STTLM-ASCTD-DT                                    
                  ,:DCLVTRNFR.STTLM-ASCTD-STS-CD                                
                  ,:DCLVTRNFR.RCRD-LNGTH-STTS-CD                                
                  ,:DCLVTRNFR.RCRD-STTS-CD                                      
                  ,:DCLVTRNFR.NSCC-PEND-CD                                      
                  ,:DCLVTRNFR.NSCC-ACK-IND                                      
                  ,:DCLVTRNFR.CICS-TERM-ID-CD                                   
                  ,:DCLVTRNFR.PRGM-NM                                           
                  ,:DCLVTRNFR.CRT-TMSTP                                         
                  ,:DCLVTRNFR.UPDT-TMSTP                                        
                  ,:DCLVTRNFR.ACCT-EQUITY-AMT                                   
                  ,:DCLVTRNFR.ALERT-IND                                         
                  ,:DCLVTRNFR.ACCT-RB-SEC-IND                                   
                  ,:DCLVTRNFR.ACCT-CLT-RSCND-IND                                
                  ,:DCLVTRNFR.ACCT-LGL-BLK-IND                                  
                  ,:DCLVTRNFR.FRV-MFC-CMPLT-IND                                 
                  ,:DCLVTRNFR.ACCT-FRZN-IND                                     
                  ,:DCLVTRNFR.BRANCH-ALTNT-CD                                   
                  ,:DCLVTRNFR.GIFT-IND                                          
                  ,:DCLVTRNFR.RSTR-TRD-90-DY-IND                                
                  ,:DCLVTRNFR.REG-T-IND                                         
                  ,:DCLVTRNFR.ADOPT-AGRMT-IND                                   
LRM024            ,:DCLVTRNFR.NTWRK-LVL4-FND-IND                                
                  ,:DCLVTRNFR.RR-ORGNL-CD                                       
                  ,:DCLVTRNFR.CVRSN-ACCT-NBR                                    
                FROM  VTRNFR                                            ACAT10DA
                WHERE CLIENT_NBR = :SV-CLIENT-NBR           AND         ACAT10DA
                      ACAT_CONTROL_NBR = :SV-ACAT-CNTL-NBR  AND         ACAT10DA
                      TRNFR_TYPE_CD = :ACAT10IO-TFR-TYPE    AND         ACAT10DA
                      STTS_CD    = :ACAT10IO-STCD                       ACAT10DA
           END-EXEC.                                                    ACAT10DA
                                                                        ACAT10DA
093400     EVALUATE SQLCODE                                             ACAT10DA
093500          WHEN +0                                                 ACAT10DA
                     SET CURRENT-VTRNFR-FOUND TO TRUE                   ACAT10DA
                WHEN +100                                               ACAT10DA
                     SET VTRNFR-NOT-FOUND TO TRUE                       ACAT10DA
                     SET CURRENT-VTRNFR-NOT-FOUND TO TRUE               ACAT10DA
                     MOVE '2ND RETRIEVE TFR NOT FOUND' TO WS-RETURN-MSG ACAT10DA
094000          WHEN OTHER                                              ACAT10DA
                     MOVE SPACE TO ACAT10IO-VINITRNF-SW                 ACAT10DA
                     MOVE 'SELECT' TO ACAT10IO-SQLCAID                  ACAT10DA
                     PERFORM 9000-WRITE-TO-CICS-LOG                     ACAT10DA
                     PERFORM 9500-RETURN-DB2-ERROR                      ACAT10DA
094200     END-EVALUATE.                                                ACAT10DA
                                                                        ACAT10DA
       0660-MOVE-VTRNFR.                                                ACAT10DA
      *                                                                 ACAT10DA
           MOVE CLIENT-NBR         OF DCLVTRNFR     TO                  ACAT10DA
ET0002          CLIENT-NBR         OF DCLACTITRF.                       ACAT10DA
           MOVE DSTBN-SIDE-CD      OF DCLVTRNFR     TO                  ACAT10DA
ET0002          DSTBN-SIDE-CD      OF DCLACTITRF,                       ACAT10DA
                                      WS-DSTBN-SIDE-CD.                 ACAT10DA
           MOVE RCV-NBR OF DCLVTRNFR        TO                          ACAT10DA
ET0002          RCV-NBR OF DCLACTITRF.                                  ACAT10DA
           MOVE DLVR-NBR           OF DCLVTRNFR     TO                  ACAT10DA
ET0002          DLVR-NBR           OF DCLACTITRF.                       ACAT10DA
                                                                        ACAT10DA
           IF WS-DSTBN-SIDE-CD = 'D'                                    ACAT10DA
              IF ACAT10IO-MBR > SPACE                                   ACAT10DA
                 MOVE ACAT10IO-MBR TO ACAT10IO-ACCT-DLVR-NBR (1 : 3)    ACAT10DA
              ELSE                                                      ACAT10DA
                 MOVE ACCT-DLVR-NBR OF DCLVTRNFR (1 : 3) TO             ACAT10DA
                                      ACAT10IO-ACCT-DLVR-NBR (1 : 3)    ACAT10DA
              END-IF                                                    ACAT10DA
              IF ACAT10IO-MAC > SPACE                                   ACAT10DA
                 MOVE ACAT10IO-MAC TO ACAT10IO-ACCT-DLVR-NBR (4 : 5)    ACAT10DA
              ELSE                                                      ACAT10DA
                 MOVE ACCT-DLVR-NBR OF DCLVTRNFR (4 : 5) TO             ACAT10DA
                                      ACAT10IO-ACCT-DLVR-NBR (4 : 5)    ACAT10DA
              END-IF                                                    ACAT10DA
              IF ACAT10IO-MBR > SPACE                                   ACAT10DA
              OR ACAT10IO-MAC > SPACE                                   ACAT10DA
                 MOVE ACAT10IO-ACCT-DLVR-NBR (1 : 3) TO ACAT10IO-MBR    ACAT10DA
                 MOVE ACAT10IO-ACCT-DLVR-NBR (4 : 5) TO ACAT10IO-MAC    ACAT10DA
                 MOVE SPACES       TO ACAT10IO-ACCT-DLVR-NBR (9 : 12)   ACAT10DA
              ELSE                                                      ACAT10DA
                 MOVE ACCT-DLVR-NBR   OF DCLVTRNFR     TO               ACAT10DA
ET0002             ACCT-DLVR-NBR   OF DCLACTITRF                        ACAT10DA
           END-IF.                                                      ACAT10DA
      *                                                                 ACAT10DA
           IF WS-DSTBN-SIDE-CD = 'R'   AND                              ACAT10DA
              (ACAT10IO-MBR > SPACE  OR                                 ACAT10DA
               ACAT10IO-MAC > SPACE )                                   ACAT10DA
              MOVE ACAT10IO-MBR TO ACAT10IO-ACCT-RCV-NBR (1 : 3)        ACAT10DA
              MOVE ACAT10IO-MAC TO ACAT10IO-ACCT-RCV-NBR (4 : 5)        ACAT10DA
              MOVE SPACES       TO ACAT10IO-ACCT-RCV-NBR (9 : 12)       ACAT10DA
           ELSE                                                         ACAT10DA
              MOVE ACCT-RCV-NBR OF DCLVTRNFR TO                         ACAT10DA
ET0002             ACCT-RCV-NBR OF DCLACTITRF                           ACAT10DA
           END-IF.                                                      ACAT10DA
                                                                        ACAT10DA
           MOVE RCV-NBR-STTS-CD OF DCLVTRNFR TO                         ACAT10DA
ET0002          RCV-NBR-STTS-CD OF DCLACTITRF.                          ACAT10DA
           MOVE DLVR-NBR-STTS-CD OF DCLVTRNFR TO                        ACAT10DA
ET0002          DLVR-NBR-STTS-CD OF DCLACTITRF.                         ACAT10DA
           MOVE ACCT-RCV-STTS-CD OF DCLVTRNFR TO                        ACAT10DA
ET0002          ACCT-RCV-STTS-CD OF DCLACTITRF.                         ACAT10DA
           MOVE ACCT-DLVR-STTS-CD OF DCLVTRNFR   TO                     ACAT10DA
ET0002          ACCT-DLVR-STTS-CD OF DCLACTITRF.                        ACAT10DA
01/29***   MOVE SBMTG-PRTCP-NBR   OF DCLVTRNFR   TO                     ACAT10DA
01/29      MOVE DLVR-NBR          OF DCLVTRNFR   TO                     ACAT10DA
ET0002          SBMTG-PRTCP-NBR   OF DCLACTITRF.                        ACAT10DA
           MOVE SBMT-PRT-NR-STS-CD OF DCLVTRNFR  TO                     ACAT10DA
ET0002          SBMT-PRT-NR-STS-CD OF DCLACTITRF.                       ACAT10DA
           MOVE ACAT-CONTROL-NBR   OF DCLVTRNFR  TO                     ACAT10DA
ET0002          ACAT-CONTROL-NBR   OF DCLACTITRF.                       ACAT10DA
           MOVE CONTROL-NBR-STS-CD OF DCLVTRNFR TO                      ACAT10DA
ET0002          TRNFR-TYPE-STTS-CD OF DCLACTITRF.                       ACAT10DA
           MOVE TRANS-TYPE-STTS-CD OF DCLVTRNFR  TO                     ACAT10DA
ET0002          TRANS-TYPE-STTS-CD OF DCLACTITRF.                       ACAT10DA
           MOVE RCV-CUST-NM        OF DCLVTRNFR  TO                     ACAT10DA
ET0002          RCV-CUST-NM        OF DCLACTITRF.                       ACAT10DA
           MOVE RCV-CUST-NM-STS-CD OF DCLVTRNFR  TO                     ACAT10DA
ET0002          RCV-CUST-NM-STS-CD OF DCLACTITRF.                       ACAT10DA
           MOVE RCV-SS-PRIM-NBR    OF DCLVTRNFR  TO                     ACAT10DA
ET0002          RCV-SS-PRIM-NBR    OF DCLACTITRF.                       ACAT10DA
           MOVE RCV-SS-PRIM-STS-CD OF DCLVTRNFR  TO                     ACAT10DA
ET0002          RCV-SS-PRIM-STS-CD OF DCLACTITRF.                       ACAT10DA
           MOVE RCV-SS-SCNDY-NBR   OF DCLVTRNFR  TO                     ACAT10DA
ET0002          RCV-SS-SCNDY-NBR   OF DCLACTITRF.                       ACAT10DA
           MOVE RCV-SS-SCDY-STS-CD OF DCLVTRNFR  TO                     ACAT10DA
ET0002          RCV-SS-SCDY-STS-CD OF DCLACTITRF.                       ACAT10DA
           MOVE RCV-ACCT-TYPE-CD   OF DCLVTRNFR  TO                     ACAT10DA
ET0002          RCV-ACCT-TYPE-CD   OF DCLACTITRF.                       ACAT10DA
           MOVE RCV-ACT-TYP-STS-CD OF DCLVTRNFR  TO                     ACAT10DA
ET0002          RCV-ACT-TYP-STS-CD OF DCLACTITRF.                       ACAT10DA
           MOVE RCV-OCC-BRKR-NBR   OF DCLVTRNFR  TO                     ACAT10DA
ET0002          RCV-OCC-BRKR-NBR   OF DCLACTITRF.                       ACAT10DA
           MOVE RCV-OCC-STTS-CD    OF DCLVTRNFR  TO                     ACAT10DA
ET0002          RCV-OCC-STTS-CD    OF DCLACTITRF.                       ACAT10DA
           MOVE RCV-CRSPN-NBR      OF DCLVTRNFR  TO                     ACAT10DA
ET0002          RCV-CRSPN-NBR      OF DCLACTITRF.                       ACAT10DA
           MOVE RCV-CRSPN-STTS-CD  OF DCLVTRNFR  TO                     ACAT10DA
ET0002          RCV-CRSPN-STTS-CD  OF DCLACTITRF.                       ACAT10DA
           MOVE ACAT-CNTL-ASTD-NBR OF DCLVTRNFR  TO                     ACAT10DA
ET0002          ACAT-CNTL-ASTD-NBR OF DCLACTITRF.                       ACAT10DA
           MOVE CNTL-ASTD-STTS-CD  OF DCLVTRNFR  TO                     ACAT10DA
ET0002          CNTL-ASTD-STTS-CD  OF DCLACTITRF.                       ACAT10DA
           MOVE CMNT-STTS-CD       OF DCLVTRNFR  TO                     ACAT10DA
ET0002          CMNT-STTS-CD       OF DCLACTITRF.                       ACAT10DA
           MOVE STTS-CD            OF DCLVTRNFR  TO                     ACAT10DA
ET0002          STTS-CD            OF DCLACTITRF.                       ACAT10DA
           MOVE SYS-ACT-CD         OF DCLVTRNFR  TO                     ACAT10DA
ET0002          SYS-ACT-CD         OF DCLACTITRF.                       ACAT10DA
           MOVE SYS-RJCT-RSN-CD    OF DCLVTRNFR  TO                     ACAT10DA
ET0002          SYS-RJCT-RSN-CD    OF DCLACTITRF.                       ACAT10DA
           MOVE TRNFR-TYPE-RJC1-CD OF DCLVTRNFR  TO                     ACAT10DA
ET0002          TRNFR-TYPE-RJC1-CD OF DCLACTITRF.                       ACAT10DA
           MOVE TRNFR-TYPE-RJC2-CD OF DCLVTRNFR  TO                     ACAT10DA
ET0002          TRNFR-TYPE-RJC2-CD OF DCLACTITRF.                       ACAT10DA
           MOVE TRN-TYP-RJC-STS-CD OF DCLVTRNFR  TO                     ACAT10DA
ET0002          TRN-TYP-RJC-STS-CD OF DCLACTITRF.                       ACAT10DA
           MOVE PHSCL-SEQ-NBR      OF DCLVTRNFR  TO                     ACAT10DA
ET0002          PHSCL-SEQ-NBR      OF DCLACTITRF.                       ACAT10DA
           MOVE PHSCL-SEQ-STTS-CD  OF DCLVTRNFR  TO                     ACAT10DA
ET0002          PHSCL-SEQ-STTS-CD  OF DCLACTITRF.                       ACAT10DA
           MOVE LGCL-SEQ-NBR       OF DCLVTRNFR  TO                     ACAT10DA
ET0002          LGCL-SEQ-NBR       OF DCLACTITRF.                       ACAT10DA
           MOVE LGCL-SEQ-NR-STS-CD OF DCLVTRNFR  TO                     ACAT10DA
ET0002          LGCL-SEQ-NR-STS-CD OF DCLACTITRF.                       ACAT10DA
           MOVE PRTCP-CONTRA-CD    OF DCLVTRNFR  TO                     ACAT10DA
ET0002          PRTCP-CONTRA-CD    OF DCLACTITRF.                       ACAT10DA
           MOVE CYCLE-CD           OF DCLVTRNFR  TO                     ACAT10DA
ET0002          CYCLE-CD           OF DCLACTITRF.                       ACAT10DA
           MOVE DAYS-STTS-QTY      OF DCLVTRNFR  TO                     ACAT10DA
ET0002          DAYS-STTS-QTY      OF DCLACTITRF.                       ACAT10DA
           MOVE TRANS-RFRN-ID-CD   OF DCLVTRNFR  TO                     ACAT10DA
ET0002          TRANS-RFRN-ID-CD   OF DCLACTITRF.                       ACAT10DA
           MOVE TRANS-RFRN-STTS-CD OF DCLVTRNFR  TO                     ACAT10DA
ET0002          TRANS-RFRN-STTS-CD OF DCLACTITRF.                       ACAT10DA
           MOVE DB-CR-CD           OF DCLVTRNFR  TO                     ACAT10DA
ET0002          DB-CR-CD           OF DCLACTITRF.                       ACAT10DA
           MOVE STTLM-ASCTD-STS-CD OF DCLVTRNFR  TO                     ACAT10DA
ET0002          STTLM-ASCTD-STS-CD OF DCLACTITRF.                       ACAT10DA
           MOVE STTLM-ASCTD-DT     OF DCLVTRNFR  TO                     ACAT10DA
ET0002          STTLM-ASCTD-DT     OF DCLACTITRF.                       ACAT10DA
           MOVE RCRD-LNGTH-STTS-CD OF DCLVTRNFR  TO                     ACAT10DA
ET0002          RCRD-LNGTH-STTS-CD OF DCLACTITRF.                       ACAT10DA
           MOVE RCRD-STTS-CD       OF DCLVTRNFR  TO                     ACAT10DA
ET0002          RCRD-STTS-CD       OF DCLACTITRF.                       ACAT10DA
           MOVE NSCC-ACK-IND       OF DCLVTRNFR  TO                     ACAT10DA
ET0002          NSCC-ACK-IND       OF DCLACTITRF.                       ACAT10DA
           MOVE RR-CD              OF DCLVTRNFR  TO                     ACAT10DA
ET0002          RR-CD              OF DCLACTITRF.                       ACAT10DA
      /                                                                 ACAT10DA
       0700-ISRT-VINITRNF.                                              ACAT10DA
                                                                        ACAT10DA
           MOVE SPACE TO WS-CURRENT-VTRNFR-SW.                          ACAT10DA
                                                                        ACAT10DA
           PERFORM 0650-RETRIEVE-CURRENT-VTRNFR.                        ACAT10DA
           IF CURRENT-VTRNFR-FOUND                                      ACAT10DA
              CONTINUE                                                  ACAT10DA
           ELSE                                                         ACAT10DA
              IF ACAT10IO-TIF-ACCT-CHG OR                               ACAT10DA
                 ACAT10IO-TIF-UPDT                                      ACAT10DA
                 CONTINUE                                               ACAT10DA
              ELSE                                                      ACAT10DA
                 MOVE WS-RETURN-MSG TO ACAT10IO-RETURN-MSG              ACAT10DA
                 EXEC CICS RETURN END-EXEC                              ACAT10DA
              END-IF                                                    ACAT10DA
           END-IF.                                                      ACAT10DA
      *                                                                 ACAT10DA
           EXEC SQL                                                     ACAT10DA
                SET :WS-TIMESTAMP = CURRENT TIMESTAMP                   ACAT10DA
           END-EXEC.                                                    ACAT10DA
                                                                        ACAT10DA
LRM004     PERFORM 0810-DLTE-VINITRNF-PRIOR                             ACAT10DA
LRM004     IF ACAT10IO-MREJ > SPACES                                    ACAT10DA
LRM004        MOVE LOW-VALUES TO ACAT10IO-TIF-RETURN                    ACAT10DA
LRM004     END-IF.                                                              
                                                                                
ET0002**   INITIALIZE DCLVINITRNF.                                      ACAT10DA
ET0002     INITIALIZE DCLACTITRF.                                       ACAT10DA
      *                                                                 ACAT10DA
           PERFORM 0660-MOVE-VTRNFR.                                    ACAT10DA
ET0002     MOVE WS-TIMESTAMP TO  UPDT-TMSTP OF DCLACTITRF               ACAT10DA
ET0002                            CRT-TMSTP OF DCLACTITRF.              ACAT10DA
                                                                        ACAT10DA
ET0002     MOVE WS-TIMESTAMP(1 : 10) TO PRCS-DT OF DCLACTITRF           ACAT10DA
           IF  NOT ACAT10IO-TIF-ACCT-CHG                                ACAT10DA
               MOVE WS-TIMESTAMP(1 : 10)                                ACAT10DA
ET0002                         TO  STTLM-ASCTD-DT OF DCLACTITRF         ACAT10DA
           END-IF                                                       ACAT10DA
                                                                        ACAT10DA
           IF ACAT10IO-MBR > SPACE  OR                                  ACAT10DA
              ACAT10IO-MAC > SPACE                                      ACAT10DA
              IF WS-DSTBN-SIDE-CD  = 'D'                                ACAT10DA
                 MOVE SPACES TO WS-ACCT-DLVR-NBR                        ACAT10DA
                 MOVE ACAT10IO-MBR     TO WS-ACCT-DLVR-NBR (1 : 3)      ACAT10DA
                 MOVE ACAT10IO-MAC     TO WS-ACCT-DLVR-NBR (4 : 8)      ACAT10DA
ET0002           MOVE WS-ACCT-DLVR-NBR TO ACCT-DLVR-NBR OF DCLACTITRF   ACAT10DA
                 IF  NOT ACAT10IO-TIF-ACCT-CHG                          ACAT10DA
ET0002               MOVE ACAT10IO-MRR     TO RR-CD OF DCLACTITRF       ACAT10DA
                 END-IF                                                 ACAT10DA
              END-IF                                                    ACAT10DA
           END-IF.                                                      ACAT10DA
                                                                        ACAT10DA
01/25      IF ACAT10IO-MCSTP > SPACES AND                               ACAT10DA
              NOT ACAT10IO-TIF-ACCT-CHG                                 ACAT10DA
ET0002        MOVE ACAT10IO-MCSTP TO RCV-ACCT-TYPE-CD OF DCLACTITRF     ACAT10DA
                                     WS-RCV-ACCT-TYPE-CD                ACAT10DA
01/25      END-IF.                                                      ACAT10DA
                                                                        ACAT10DA
           IF (ACAT10IO-MNAME1 > SPACE  OR                              ACAT10DA
              ACAT10IO-MNAME2 > SPACE) AND                              ACAT10DA
              NOT ACAT10IO-TIF-ACCT-CHG                                 ACAT10DA
              MOVE ACAT10IO-MNAME1 TO WS-RCV-CUST-NM (1 :30)            ACAT10DA
              MOVE ACAT10IO-MNAME2 TO WS-RCV-CUST-NM (31 :30)           ACAT10DA
ET0002        MOVE WS-RCV-CUST-NM  TO RCV-CUST-NM OF DCLACTITRF         ACAT10DA
           END-IF.                                                      ACAT10DA
                                                                        ACAT10DA
           IF (ACAT10IO-MSSN1 > SPACE OR                                ACAT10DA
              ACAT10IO-MSSN2 > SPACE) AND                               ACAT10DA
              NOT ACAT10IO-TIF-ACCT-CHG                                 ACAT10DA
              MOVE ACAT10IO-MSSN1 (1: 3) TO WS-RCV-SS-PRIM-NBR (1: 3)   ACAT10DA
              MOVE ACAT10IO-MSSN1 (5: 2) TO WS-RCV-SS-PRIM-NBR (4: 2)   ACAT10DA
              MOVE ACAT10IO-MSSN1 (8: 4) TO WS-RCV-SS-PRIM-NBR (6: 4)   ACAT10DA
              MOVE ACAT10IO-MSSN2 (1: 3) TO WS-RCV-SS-SCNDY-NBR (1: 3)  ACAT10DA
              MOVE ACAT10IO-MSSN2 (5: 2) TO WS-RCV-SS-SCNDY-NBR (4: 2)  ACAT10DA
              MOVE ACAT10IO-MSSN2 (8: 4) TO WS-RCV-SS-SCNDY-NBR (6: 4)  ACAT10DA
              MOVE WS-RCV-SS-PRIM-NBR    TO RCV-SS-PRIM-NBR             ACAT10DA
ET0002                                             OF DCLACTITRF        ACAT10DA
              MOVE WS-RCV-SS-SCNDY-NBR   TO RCV-SS-SCNDY-NBR            ACAT10DA
ET0002                                             OF DCLACTITRF        ACAT10DA
           END-IF.                                                      ACAT10DA
                                                                        ACAT10DA
           IF ACAT10IO-XFR-REJ-YES  OR                                  ACAT10DA
              ACAT10IO-XFR-REJC-YES                                     ACAT10DA
              MOVE 'R' TO WS-TRANS-TYPE-CD                              ACAT10DA
12/12         MOVE ' ' TO WS-VINITRNF-NSCC-PEND-CD                      ACAT10DA
01/14      ELSE                                                         ACAT10DA
01/26         MOVE 'C' TO WS-TRANS-TYPE-CD                              ACAT10DA
01/14         MOVE ' ' TO WS-VINITRNF-NSCC-PEND-CD                      ACAT10DA
           END-IF.                                                      ACAT10DA
                                                                        ACAT10DA
           MOVE TRNFR-TYPE-CD OF DCLVTRNFR   TO                         ACAT10DA
ET0002          TRNFR-TYPE-CD OF DCLACTITRF.                            ACAT10DA
                                                                        ACAT10DA
           IF ACAT10IO-XFR-REJ-YES                                      ACAT10DA
               MOVE ACAT10IO-MREJ TO  ACAT10IO-VINITRNF-TYPE-RJCT-CD    ACAT10DA
ET0002                                TRNFR-TYPE-RJCT-CD OF DCLACTITRF  ACAT10DA
           ELSE                                                         ACAT10DA
              IF ACAT10IO-XFR-REJC-YES                                  ACAT10DA
                 MOVE ACAT10IO-MREJC TO  ACAT10IO-VINITRNF-TYPE-RJCT-CD ACAT10DA
ET0002                                 TRNFR-TYPE-RJCT-CD OF DCLACTITRF ACAT10DA
              END-IF                                                    ACAT10DA
           END-IF.                                                      ACAT10DA
      *                                                                 ACAT10DA
           MOVE WS-VINITRNF-NSCC-PEND-CD  TO                            ACAT10DA
ET0002                              NSCC-PEND-CD OF DCLACTITRF.         ACAT10DA
ET0002     MOVE WS-TRANS-TYPE-CD TO TRANS-TYPE-CD OF DCLACTITRF,        ACAT10DA
                                    ACAT10IO-INIT-TRANS-TYPE-CD.        ACAT10DA
                                                                        ACAT10DA
           IF ACAT10IO-VINITRNF-CMNT > SPACES                           ACAT10DA
ET0002        MOVE ACAT10IO-VINITRNF-CMNT TO CMNT-TXT OF DCLACTITRF     ACAT10DA
           ELSE                                                         ACAT10DA
ET0002        MOVE CMNT-TXT OF DCLVTRNFR  TO CMNT-TXT OF DCLACTITRF     ACAT10DA
           END-IF.                                                      ACAT10DA
                                                                        ACAT10DA
ET0002     MOVE +001 TO PHSCL-SEQ-NBR OF DCLACTITRF                     ACAT10DA
ET0002                  LGCL-SEQ-NBR OF DCLACTITRF.                     ACAT10DA
      *                                                                 ACAT10DA
ET0003     IF ACAT10IO-ACCT-FREEZ-PROCESS = 'Y'                                 
ET0003        MOVE 'R'   TO TRANS-TYPE-CD OF DCLACTITRF                 ACAT10DA
ET0003                      ACAT10IO-INIT-TRANS-TYPE-CD                 ACAT10DA
ET0003        MOVE 'H'   TO NSCC-PEND-CD       OF DCLACTITRF            ACAT10DA
ET0003        MOVE '03'  TO TRNFR-TYPE-RJCT-CD OF DCLACTITRF            ACAT10DA
ET0003        MOVE 'ACCOUNT IS FROZEN'                                  ACAT10DA
ET0003                   TO CMNT-TXT OF DCLACTITRF                      ACAT10DA
ET0003     END-IF.                                                              
      *                                                                 ACAT10DA
ET0002     MOVE EIBTRMID TO CICS-TERM-ID-CD OF DCLACTITRF.              ACAT10DA
ET0002     MOVE 'ACAT10DA'  TO  PRGM-NM OF DCLACTITRF.                  ACAT10DA
LRM004     MOVE ACAT10IO-SIGN-ON-ID TO CICS-SGNON-ID OF DCLACTITRF.             
ET0004     MOVE ACAT10IO-NET-NAME   TO CICS-NET-NM   OF DCLACTITRF.             
ET0004     MOVE ACAT10IO-USER-ID    TO TPSCRT-USR-ID OF DCLACTITRF.             
ET0004     MOVE ACAT10IO-USER-NAME  TO TPSCRT-USR-NM OF DCLACTITRF.             
      *                                                                 ACAT10DA
           EXEC SQL                                                     ACAT10DA
ET0002         INSERT INTO ACTITRF                                      ACAT10DA
                 ( CLIENT_NBR                                           ACAT10DA
                 , DLVR_NBR                                             ACAT10DA
                 , ACCT_DLVR_NBR                                        ACAT10DA
                 , RCV_NBR                                              ACAT10DA
                 , ACCT_RCV_NBR                                         ACAT10DA
                 , TRNFR_TYPE_CD                                        ACAT10DA
                 , RCV_NBR_STTS_CD                                      ACAT10DA
                 , DLVR_NBR_STTS_CD                                     ACAT10DA
                 , ACCT_RCV_STTS_CD                                     ACAT10DA
                 , ACCT_DLVR_STTS_CD                                    ACAT10DA
                 , SBMTG_PRTCP_NBR                                      ACAT10DA
                 , SBMT_PRT_NR_STS_CD                                   ACAT10DA
                 , ACAT_CONTROL_NBR                                     ACAT10DA
                 , CONTROL_NBR_STS_CD                                   ACAT10DA
                 , TRNFR_TYPE_STTS_CD                                   ACAT10DA
                 , TRANS_TYPE_CD                                        ACAT10DA
                 , TRANS_TYPE_STTS_CD                                   ACAT10DA
                 , RCV_CUST_NM                                          ACAT10DA
                 , RCV_CUST_NM_STS_CD                                   ACAT10DA
                 , RCV_SS_PRIM_NBR                                      ACAT10DA
                 , RCV_SS_PRIM_STS_CD                                   ACAT10DA
                 , RCV_SS_SCNDY_NBR                                     ACAT10DA
                 , RCV_SS_SCDY_STS_CD                                   ACAT10DA
                 , RCV_ACCT_TYPE_CD                                     ACAT10DA
                 , RCV_ACT_TYP_STS_CD                                   ACAT10DA
                 , RCV_OCC_BRKR_NBR                                     ACAT10DA
                 , RCV_OCC_STTS_CD                                      ACAT10DA
                 , RCV_CRSPN_NBR                                        ACAT10DA
                 , RCV_CRSPN_STTS_CD                                    ACAT10DA
                 , ACAT_CNTL_ASTD_NBR                                   ACAT10DA
                 , CNTL_ASTD_STTS_CD                                    ACAT10DA
                 , CMNT_TXT                                             ACAT10DA
                 , CMNT_STTS_CD                                         ACAT10DA
                 , PRCS_DT                                              ACAT10DA
                 , STTS_CD                                              ACAT10DA
                 , DSTBN_SIDE_CD                                        ACAT10DA
                 , SYS_ACT_CD                                           ACAT10DA
                 , SYS_RJCT_RSN_CD                                      ACAT10DA
                 , TRNFR_TYPE_RJCT_CD                                   ACAT10DA
                 , TRNFR_TYPE_RJC1_CD                                   ACAT10DA
                 , TRNFR_TYPE_RJC2_CD                                   ACAT10DA
                 , TRN_TYP_RJC_STS_CD                                   ACAT10DA
                 , PHSCL_SEQ_NBR                                        ACAT10DA
                 , PHSCL_SEQ_STTS_CD                                    ACAT10DA
                 , LGCL_SEQ_NBR                                         ACAT10DA
                 , LGCL_SEQ_NR_STS_CD                                   ACAT10DA
                 , PRTCP_CONTRA_CD                                      ACAT10DA
                 , CYCLE_CD                                             ACAT10DA
                 , DAYS_STTS_QTY                                        ACAT10DA
                 , TRANS_RFRN_ID_CD                                     ACAT10DA
                 , TRANS_RFRN_STTS_CD                                   ACAT10DA
                 , DB_CR_CD                                             ACAT10DA
                 , STTLM_ASCTD_DT                                       ACAT10DA
                 , STTLM_ASCTD_STS_CD                                   ACAT10DA
                 , RCRD_LNGTH_STTS_CD                                   ACAT10DA
                 , RCRD_STTS_CD                                         ACAT10DA
                 , NSCC_PEND_CD                                         ACAT10DA
                 , NSCC_ACK_IND                                         ACAT10DA
                 , UPDT_TMSTP                                           ACAT10DA
                 , CRT_TMSTP                                            ACAT10DA
                 , CICS_TERM_ID_CD                                      ACAT10DA
                 , PRGM_NM                                              ACAT10DA
                 , RR_CD                                                ACAT10DA
LRM004           , CICS_SGNON_ID                                        ACAT10DA
ET0004           , CICS_NET_NM                                          ACAT10DA
ET0004           , TPSCRT_USR_ID                                        ACAT10DA
ET0004           , TPSCRT_USR_NM )                                      ACAT10DA
                 VALUES                                                 ACAT10DA
ET0002             (:DCLACTITRF.CLIENT-NBR                              ACAT10DA
ET0002             ,:DCLACTITRF.DLVR-NBR                                ACAT10DA
ET0002             ,:DCLACTITRF.ACCT-DLVR-NBR                           ACAT10DA
ET0002             ,:DCLACTITRF.RCV-NBR                                 ACAT10DA
ET0002             ,:DCLACTITRF.ACCT-RCV-NBR                            ACAT10DA
ET0002             ,:DCLACTITRF.TRNFR-TYPE-CD                           ACAT10DA
ET0002             ,:DCLACTITRF.RCV-NBR-STTS-CD                         ACAT10DA
ET0002             ,:DCLACTITRF.DLVR-NBR-STTS-CD                        ACAT10DA
ET0002             ,:DCLACTITRF.ACCT-RCV-STTS-CD                        ACAT10DA
ET0002             ,:DCLACTITRF.ACCT-DLVR-STTS-CD                       ACAT10DA
ET0002             ,:DCLACTITRF.SBMTG-PRTCP-NBR                         ACAT10DA
ET0002             ,:DCLACTITRF.SBMT-PRT-NR-STS-CD                      ACAT10DA
ET0002             ,:DCLACTITRF.ACAT-CONTROL-NBR                        ACAT10DA
ET0002             ,:DCLACTITRF.CONTROL-NBR-STS-CD                      ACAT10DA
ET0002             ,:DCLACTITRF.TRNFR-TYPE-STTS-CD                      ACAT10DA
ET0002             ,:DCLACTITRF.TRANS-TYPE-CD                           ACAT10DA
ET0002             ,:DCLACTITRF.TRANS-TYPE-STTS-CD                      ACAT10DA
ET0002             ,:DCLACTITRF.RCV-CUST-NM                             ACAT10DA
ET0002             ,:DCLACTITRF.RCV-CUST-NM-STS-CD                      ACAT10DA
ET0002             ,:DCLACTITRF.RCV-SS-PRIM-NBR                         ACAT10DA
ET0002             ,:DCLACTITRF.RCV-SS-PRIM-STS-CD                      ACAT10DA
ET0002             ,:DCLACTITRF.RCV-SS-SCNDY-NBR                        ACAT10DA
ET0002             ,:DCLACTITRF.RCV-SS-SCDY-STS-CD                      ACAT10DA
ET0002             ,:DCLACTITRF.RCV-ACCT-TYPE-CD                        ACAT10DA
ET0002             ,:DCLACTITRF.RCV-ACT-TYP-STS-CD                      ACAT10DA
ET0002             ,:DCLACTITRF.RCV-OCC-BRKR-NBR                        ACAT10DA
ET0002             ,:DCLACTITRF.RCV-OCC-STTS-CD                         ACAT10DA
ET0002             ,:DCLACTITRF.RCV-CRSPN-NBR                           ACAT10DA
ET0002             ,:DCLACTITRF.RCV-CRSPN-STTS-CD                       ACAT10DA
ET0002             ,:DCLACTITRF.ACAT-CNTL-ASTD-NBR                      ACAT10DA
ET0002             ,:DCLACTITRF.CNTL-ASTD-STTS-CD                       ACAT10DA
ET0002             ,:DCLACTITRF.CMNT-TXT                                ACAT10DA
ET0002             ,:DCLACTITRF.CMNT-STTS-CD                            ACAT10DA
ET0002             ,:DCLACTITRF.PRCS-DT                                 ACAT10DA
ET0002             ,:DCLACTITRF.STTS-CD                                 ACAT10DA
ET0002             ,:DCLACTITRF.DSTBN-SIDE-CD                           ACAT10DA
ET0002             ,:DCLACTITRF.SYS-ACT-CD                              ACAT10DA
ET0002             ,:DCLACTITRF.SYS-RJCT-RSN-CD                         ACAT10DA
ET0002             ,:DCLACTITRF.TRNFR-TYPE-RJCT-CD                      ACAT10DA
ET0002             ,:DCLACTITRF.TRNFR-TYPE-RJC1-CD                      ACAT10DA
ET0002             ,:DCLACTITRF.TRNFR-TYPE-RJC2-CD                      ACAT10DA
ET0002             ,:DCLACTITRF.TRN-TYP-RJC-STS-CD                      ACAT10DA
ET0002             ,:DCLACTITRF.PHSCL-SEQ-NBR                           ACAT10DA
ET0002             ,:DCLACTITRF.PHSCL-SEQ-STTS-CD                       ACAT10DA
ET0002             ,:DCLACTITRF.LGCL-SEQ-NBR                            ACAT10DA
ET0002             ,:DCLACTITRF.LGCL-SEQ-NR-STS-CD                      ACAT10DA
ET0002             ,:DCLACTITRF.PRTCP-CONTRA-CD                         ACAT10DA
ET0002             ,:DCLACTITRF.CYCLE-CD                                ACAT10DA
ET0002             ,:DCLACTITRF.DAYS-STTS-QTY                           ACAT10DA
ET0002             ,:DCLACTITRF.TRANS-RFRN-ID-CD                        ACAT10DA
ET0002             ,:DCLACTITRF.TRANS-RFRN-STTS-CD                      ACAT10DA
ET0002             ,:DCLACTITRF.DB-CR-CD                                ACAT10DA
ET0002             ,:DCLACTITRF.STTLM-ASCTD-DT                          ACAT10DA
ET0002             ,:DCLACTITRF.STTLM-ASCTD-STS-CD                      ACAT10DA
ET0002             ,:DCLACTITRF.RCRD-LNGTH-STTS-CD                      ACAT10DA
ET0002             ,:DCLACTITRF.RCRD-STTS-CD                            ACAT10DA
ET0002             ,:DCLACTITRF.NSCC-PEND-CD                            ACAT10DA
LRM013             ,' '                                                 ACAT10DA
                   , CURRENT TIMESTAMP                                  ACAT10DA
                   , CURRENT TIMESTAMP                                  ACAT10DA
ET0002             ,:DCLACTITRF.CICS-TERM-ID-CD                         ACAT10DA
ET0002             ,:DCLACTITRF.PRGM-NM                                 ACAT10DA
ET0002             ,:DCLACTITRF.RR-CD                                   ACAT10DA
LRM004             ,:DCLACTITRF.CICS-SGNON-ID                                   
ET0004             ,:DCLACTITRF.CICS-NET-NM                                     
ET0004             ,:DCLACTITRF.TPSCRT-USR-ID                                   
ET0004             ,:DCLACTITRF.TPSCRT-USR-NM )                                 
           END-EXEC.                                                    ACAT10DA
                                                                        ACAT10DA
093400     EVALUATE SQLCODE                                             ACAT10DA
093500          WHEN +0                                                 ACAT10DA
093600               SET ACAT10IO-VINITRNF-INSERTED TO TRUE             ACAT10DA
01/14                IF ACAT10IO-TIF-ACCT-CHG                           ACAT10DA
                        SET ACAT10IO-TIF-UPDT TO TRUE                   ACAT10DA
                        MOVE                                            ACAT10DA
                        '*** A NEW ACCT INFO IS CREATED*** (0700-ISRT) 'ACAT10DA
                         TO WS-RETURN-MSG                               ACAT10DA
                     ELSE                                               ACAT10DA
                        MOVE                                            ACAT10DA
                        '*** A NEW TIF IS CREATED **** (0700-ISRT) '    ACAT10DA
                         TO WS-RETURN-MSG                               ACAT10DA
                     END-IF                                             ACAT10DA
                WHEN -803                                               ACAT10DA
                     PERFORM 0750-UPDT-VINITRNF                         ACAT10DA
094000          WHEN OTHER                                              ACAT10DA
                     MOVE SPACE TO ACAT10IO-VINITRNF-SW                 ACAT10DA
                     MOVE 'ISRT  ' TO ACAT10IO-SQLCAID                  ACAT10DA
                     PERFORM 9000-WRITE-TO-CICS-LOG                     ACAT10DA
                     PERFORM 9500-RETURN-DB2-ERROR                      ACAT10DA
094200     END-EVALUATE.                                                ACAT10DA
                                                                        ACAT10DA
LRM014     IF TRANS-TYPE-CD OF DCLACTITRF = 'C'                         ACAT10DA
LRM014        PERFORM 0910-UPDT-TIN-MSMTH-IND.                          ACAT10DA
           EJECT                                                        ACAT10DA
                                                                        ACAT10DA
       0750-UPDT-VINITRNF.                                              ACAT10DA
      *                                                                 ACAT10DA
           MOVE SPACE TO WS-CURRENT-VTRNFR-SW.                          ACAT10DA
LRM004     MOVE ACAT10IO-SIGN-ON-ID TO CICS-SGNON-ID OF DCLACTITRF.             
LRM004     MOVE ACAT10IO-ACAT-CONTROL-NBR TO WS-ACAT-CONTROL-NBR.               
                                                                        ACAT10DA
           IF ACAT10IO-XFR-REJ-YES                                      ACAT10DA
           OR ACAT10IO-XFR-REJC-YES                                     ACAT10DA
ET0002        MOVE 'R' TO TRANS-TYPE-CD OF DCLACTITRF                   ACAT10DA
           ELSE                                                         ACAT10DA
ET0002        MOVE 'C' TO TRANS-TYPE-CD OF DCLACTITRF                   ACAT10DA
           END-IF.                                                      ACAT10DA
           IF ACAT10IO-TIF-ACCT-CHG                                     ACAT10DA
              EXEC SQL                                                  ACAT10DA
ET0002          UPDATE ACTITRF                                          ACAT10DA
ET0002          SET  TRANS_TYPE_CD = :DCLACTITRF.TRANS-TYPE-CD          ACAT10DA
                    ,NSCC_PEND_CD = :WS-VINITRNF-NSCC-PEND-CD           ACAT10DA
                    ,RCV_CUST_NM = :WS-RCV-CUST-NM                      ACAT10DA
                    ,RCV_SS_PRIM_NBR = :WS-RCV-SS-PRIM-NBR              ACAT10DA
                    ,RCV_SS_SCNDY_NBR = :WS-RCV-SS-SCNDY-NBR            ACAT10DA
                    ,RCV_ACCT_TYPE_CD = :WS-RCV-ACCT-TYPE-CD            ACAT10DA
                    ,UPDT_TMSTP = CURRENT TIMESTAMP                     ACAT10DA
                    ,PRGM_NM = 'ACAT10DA'                               ACAT10DA
LRM004              ,CICS_SGNON_ID = :DCLACTITRF.CICS-SGNON-ID                  
LRM011              ,NSCC_ACK_IND      =  ' '                                   
                WHERE CLIENT_NBR = :SV-CLIENT-NBR             AND       ACAT10DA
LRM004                ACAT_CONTROL_NBR = :WS-ACAT-CONTROL-NBR AND       ACAT10DA
                      RCV_NBR = :ACAT10IO-RCV-NBR             AND       ACAT10DA
                      DLVR_NBR = :ACAT10IO-DLVR-NBR           AND       ACAT10DA
                      ACCT_DLVR_NBR = :ACAT10IO-ACCT-DLVR-NBR AND       ACAT10DA
                      ACCT_RCV_NBR = :ACAT10IO-ACCT-RCV-NBR   AND       ACAT10DA
                      TRNFR_TYPE_CD = :ACAT10IO-TFR-TYPE      AND       ACAT10DA
                      RR_CD = :ACAT10IO-RR-CD                 AND       ACAT10DA
                      STTS_CD = :ACAT10IO-STCD                          ACAT10DA
             END-EXEC                                                   ACAT10DA
                                                                        ACAT10DA
093400        EVALUATE SQLCODE                                          ACAT10DA
093500             WHEN +0                                              ACAT10DA
093600               SET ACAT10IO-VINITRNF-UPDATED TO TRUE              ACAT10DA
093600               SET ACAT10IO-TIF-UPDT TO TRUE                      ACAT10DA
                     MOVE                                               ACAT10DA
                     ' *** THE NEW ACCT INFO IS UPDATED ***(0750-UPDT)' ACAT10DA
                     TO WS-RETURN-MSG                                   ACAT10DA
094000             WHEN OTHER                                           ACAT10DA
                        MOVE SPACE TO ACAT10IO-VINITRNF-SW              ACAT10DA
                        PERFORM 9000-WRITE-TO-CICS-LOG                  ACAT10DA
                        PERFORM 9500-RETURN-DB2-ERROR                   ACAT10DA
094200        END-EVALUATE                                              ACAT10DA
           ELSE                                                         ACAT10DA
              EXEC SQL                                                  ACAT10DA
ET0002           UPDATE ACTITRF                                         ACAT10DA
ET0002             SET  TRANS_TYPE_CD = :DCLACTITRF.TRANS-TYPE-CD       ACAT10DA
                       ,NSCC_PEND_CD = :WS-VINITRNF-NSCC-PEND-CD        ACAT10DA
                       ,TRNFR_TYPE_RJCT_CD =                            ACAT10DA
                                      :ACAT10IO-VINITRNF-TYPE-RJCT-CD   ACAT10DA
                       ,CMNT_TXT = :ACAT10IO-VINITRNF-CMNT              ACAT10DA
                       ,UPDT_TMSTP = CURRENT TIMESTAMP                  ACAT10DA
                       ,PRGM_NM = 'ACAT10DA'                            ACAT10DA
LRM004                 ,CICS_SGNON_ID = :DCLACTITRF.CICS-SGNON-ID               
LRM011                 ,NSCC_ACK_IND      =  ' '                                
                   WHERE CLIENT_NBR = :SV-CLIENT-NBR          AND       ACAT10DA
LRM004                   ACAT_CONTROL_NBR = :WS-ACAT-CONTROL-NBR AND    ACAT10DA
                         RCV_NBR = :ACAT10IO-RCV-NBR          AND       ACAT10DA
                         DLVR_NBR = :ACAT10IO-DLVR-NBR        AND       ACAT10DA
                         ACCT_DLVR_NBR = :ACAT10IO-ACCT-DLVR-NBR AND    ACAT10DA
                         ACCT_RCV_NBR = :ACAT10IO-ACCT-RCV-NBR AND      ACAT10DA
                         TRNFR_TYPE_CD = :ACAT10IO-TFR-TYPE   AND       ACAT10DA
                         RR_CD = :ACAT10IO-RR-CD              AND       ACAT10DA
                         STTS_CD = :ACAT10IO-STCD                       ACAT10DA
              END-EXEC                                                  ACAT10DA
093400        EVALUATE SQLCODE                                          ACAT10DA
093500             WHEN +0                                              ACAT10DA
093600               SET ACAT10IO-VINITRNF-UPDATED TO TRUE              ACAT10DA
                     MOVE                                               ACAT10DA
                     ' *** A INITIAL TIF IS UPDATED ***(0750-UPDT)'     ACAT10DA
                     TO WS-RETURN-MSG                                   ACAT10DA
094000             WHEN OTHER                                           ACAT10DA
                        MOVE SPACE TO ACAT10IO-VINITRNF-SW              ACAT10DA
                        MOVE 'UPDATE' TO ACAT10IO-SQLCAID               ACAT10DA
                        PERFORM 9000-WRITE-TO-CICS-LOG                  ACAT10DA
                        PERFORM 9500-RETURN-DB2-ERROR                   ACAT10DA
01/14         END-EVALUATE                                              ACAT10DA
           END-IF.                                                      ACAT10DA
      *                                                                 ACAT10DA
           EJECT                                                        ACAT10DA
                                                                        ACAT10DA
       0800-DLTE-VINITRNF.                                              ACAT10DA
      *                                                                 ACAT10DA
           PERFORM 0640-RETRIEVE-CURRENT-VINITRNF.                      ACAT10DA
      *                                                                 ACAT10DA
           IF CURRENT-VINITRNF-FOUND                                    ACAT10DA
ET0002        MOVE RCV-NBR OF DCLACTITRF        TO WS-RCV-NBR           ACAT10DA
ET0002        MOVE DLVR-NBR OF DCLACTITRF       TO WS-DLVR-NBR          ACAT10DA
ET0002        MOVE ACCT-DLVR-NBR OF DCLACTITRF  TO WS-ACCT-DLVR-NBR     ACAT10DA
ET0002        MOVE ACCT-RCV-NBR OF DCLACTITRF   TO WS-ACCT-RCV-NBR      ACAT10DA
ET0002        MOVE TRNFR-TYPE-CD OF DCLACTITRF  TO WS-TFR-TYPE          ACAT10DA
ET0002        MOVE RR-CD OF DCLACTITRF          TO WS-RR-CD             ACAT10DA
           ELSE                                                         ACAT10DA
              MOVE WS-RETURN-MSG    TO ACAT10IO-RETURN-MSG              ACAT10DA
              EXEC CICS RETURN END-EXEC                                 ACAT10DA
           END-IF.                                                      ACAT10DA
      *                                                                 ACAT10DA
LRM004     MOVE ACAT10IO-ACAT-CONTROL-NBR TO WS-ACAT-CONTROL-NBR.       ACAT10DA
           EXEC SQL                                                     ACAT10DA
              DELETE                                                    ACAT10DA
ET0002         FROM ACTITRF                                             ACAT10DA
                WHERE (CLIENT_NBR = :SV-CLIENT-NBR                      ACAT10DA
LRM004           AND  ACAT_CONTROL_NBR = :WS-ACAT-CONTROL-NBR)          ACAT10DA
           END-EXEC.                                                    ACAT10DA
LRM004***        AND  TRNFR_TYPE_CD = :WS-TFR-TYPE                      ACAT10DA
LRM004***         AND RCV_NBR = :WS-RCV-NBR                             ACAT10DA
LRM004***        AND  DLVR_NBR = :WS-DLVR-NBR                           ACAT10DA
LRM004***        AND  ACCT_DLVR_NBR = :WS-ACCT-DLVR-NBR                 ACAT10DA
LRM004***        AND  ACCT_RCV_NBR =  :WS-ACCT-RCV-NBR)                 ACAT10DA
                                                                        ACAT10DA
093400     EVALUATE SQLCODE                                             ACAT10DA
093500          WHEN +0                                                 ACAT10DA
093600               SET ACAT10IO-VINITRNF-DELETED TO TRUE              ACAT10DA
                     MOVE LOW-VALUES TO  ACAT10IO-INIT-TRANS-TYPE-CD    ACAT10DA
                                         ACAT10IO-VINITRNF-TYPE-RJCT-CD ACAT10DA
                                         ACAT10IO-VINITRNF-NSCC-PEND-CD ACAT10DA
093500          WHEN +100                                               ACAT10DA
093600               SET ACAT10IO-VINITRNF-NOT-FOUND TO TRUE            ACAT10DA
LRM009               MOVE 'CAN NOT FIND INITAL TIF, CALL HELP DESK'     ACAT10DA
LRM009                 TO WS-RETURN-MSG                                 ACAT10DA
094000          WHEN OTHER                                              ACAT10DA
                     MOVE SPACE TO ACAT10IO-VINITRNF-SW                 ACAT10DA
                     MOVE 'DELETE' TO ACAT10IO-SQLCAID                  ACAT10DA
                     PERFORM 9000-WRITE-TO-CICS-LOG                     ACAT10DA
                     PERFORM 9500-RETURN-DB2-ERROR                      ACAT10DA
094200     END-EVALUATE.                                                ACAT10DA
                                                                        ACAT10DA
LRM004 0810-DLTE-VINITRNF-PRIOR.                                        ACAT10DA
LRM004     MOVE ACAT10IO-ACAT-CONTROL-NBR TO WS-ACAT-CONTROL-NBR.       ACAT10DA
LRM004     EXEC SQL                                                     ACAT10DA
LRM004        DELETE                                                    ACAT10DA
LRM004         FROM ACTITRF                                             ACAT10DA
LRM004          WHERE (CLIENT_NBR = :SV-CLIENT-NBR                      ACAT10DA
LRM004           AND  ACAT_CONTROL_NBR = :WS-ACAT-CONTROL-NBR)          ACAT10DA
LRM004     END-EXEC.                                                    ACAT10DA
LRM004                                                                  ACAT10DA
LRM004     EVALUATE SQLCODE                                             ACAT10DA
LRM004          WHEN +0                                                 ACAT10DA
LRM004               CONTINUE                                           ACAT10DA
LRM004          WHEN +100                                               ACAT10DA
LRM004               CONTINUE                                           ACAT10DA
LRM004          WHEN OTHER                                              ACAT10DA
LRM004               MOVE SPACE TO ACAT10IO-VINITRNF-SW                 ACAT10DA
LRM004               MOVE 'DELETE' TO ACAT10IO-SQLCAID                  ACAT10DA
LRM004               PERFORM 9000-WRITE-TO-CICS-LOG                     ACAT10DA
LRM004               PERFORM 9500-RETURN-DB2-ERROR                      ACAT10DA
LRM004     END-EVALUATE.                                                ACAT10DA
ET0003*                                                                 ACAT10DA
ET0003*----------------------------------------------------------------*ACAT10DA
ET0003*   UPDATE ACCT-FRZN-IND OF VTRNFR IF FOUND BY ONLINE             ACAT10DA
ET0003*----------------------------------------------------------------*ACAT10DA
ET0003 0900-UPDT-FRZN-IND.                                              ACAT10DA
           EXEC SQL                                                     ACAT10DA
                SET :WS-TIMESTAMP = CURRENT TIMESTAMP                   ACAT10DA
           END-EXEC.                                                    ACAT10DA
                                                                        ACAT10DA
           EXEC SQL                                                     ACAT10DA
              UPDATE VTRNFR                                             ACAT10DA
                 SET  ACCT_FRZN_IND = 'O'                               ACAT10DA
                     ,UPDT_TMSTP    = :WS-TIMESTAMP                     ACAT10DA
                     ,PRGM_NM       = 'ACAT10DA'                        ACAT10DA
                 WHERE                                                  ACAT10DA
                      CLIENT_NBR = :SV-CLIENT-NBR                       ACAT10DA
                      AND ACAT_CONTROL_NBR = :SV-ACAT-CNTL-NBR          ACAT10DA
      **              AND ACAT_CONTROL_NBR = :WS-ACAT-CONTROL-NBR       ACAT10DA
           END-EXEC.                                                    ACAT10DA
                                                                        ACAT10DA
           EVALUATE SQLCODE                                             ACAT10DA
               WHEN +0                                                  ACAT10DA
                    CONTINUE                                            ACAT10DA
               WHEN +100                                                ACAT10DA
                    MOVE 'VTRNFR TABLE NOT FOUND - FAILED TO UPDATE ACCTACAT10DA
      -                  '-FRZN-IND OF VTRNFR'                          ACAT10DA
                      TO  WS-RETURN-MSG                                 ACAT10DA
               WHEN OTHER                                               ACAT10DA
                    MOVE 'UPDATE' TO ACAT10IO-SQLCAID                   ACAT10DA
                    PERFORM 9000-WRITE-TO-CICS-LOG                      ACAT10DA
                    PERFORM 9500-RETURN-DB2-ERROR                       ACAT10DA
           END-EVALUATE .                                               ACAT10DA
ET0003*----------------------------------------------------------------*ACAT10DA
ET0003*   UPDATE ACCT-TIN-MSMTH-IND OF VTRNFR TO DENOTE MANUAL ACCT CHG ACAT10DA
ET0003*----------------------------------------------------------------*ACAT10DA
LRM014 0910-UPDT-TIN-MSMTH-IND.                                         ACAT10DA
LRM014     EXEC SQL                                                     ACAT10DA
LRM014          SET :WS-TIMESTAMP = CURRENT TIMESTAMP                   ACAT10DA
LRM014     END-EXEC.                                                    ACAT10DA
LRM014                                                                  ACAT10DA
LRM014     EXEC SQL                                                     ACAT10DA
LRM014        UPDATE VTRNFR                                             ACAT10DA
LRM014           SET  ACCT_TIN_MSMTH_IND = 'C'                          ACAT10DA
LRM014               ,UPDT_TMSTP    = :WS-TIMESTAMP                     ACAT10DA
LRM014               ,PRGM_NM       = 'ACAT10DA'                        ACAT10DA
LRM014           WHERE                                                  ACAT10DA
LRM014                CLIENT_NBR = :SV-CLIENT-NBR                       ACAT10DA
LRM014                AND ACAT_CONTROL_NBR = :SV-ACAT-CNTL-NBR          ACAT10DA
LRM014                AND ACAT_CONTROL_NBR = :WS-ACAT-CONTROL-NBR       ACAT10DA
LRM014     END-EXEC.                                                    ACAT10DA
LRM014                                                                  ACAT10DA
LRM014     EVALUATE SQLCODE                                             ACAT10DA
LRM014         WHEN +0                                                  ACAT10DA
LRM014              MOVE ' ' TO ACAT10IO-ACCT-TIN-MSMTH-IND             ACAT10DA
LRM014         WHEN +100                                                ACAT10DA
LRM014              MOVE 'VTRNFR TABLE NOT FOUND - FAILED TO UPDATE ACCTACAT10DA
LRM014-                 'TIN-MSMTH-IND OF VTRNFR'                       ACAT10DA
LRM014                TO  WS-RETURN-MSG                                 ACAT10DA
LRM014         WHEN OTHER                                               ACAT10DA
LRM014              MOVE 'UPDATE' TO ACAT10IO-SQLCAID                   ACAT10DA
LRM014              PERFORM 9000-WRITE-TO-CICS-LOG                      ACAT10DA
LRM014              PERFORM 9500-RETURN-DB2-ERROR                       ACAT10DA
LRM014     END-EVALUATE .                                               ACAT10DA
ET0003 EJECT                                                            ACAT10DA
     *******************************************************************ACAT10DA
      /                                                                 ACAT10DA
       ABENDED.                                                         ACAT10DA
     ***   EXEC CICS ASSIGN ABCODE(WS-ABCODE) END-EXEC.                 ACAT10DA
     ***   MOVE WS-ABEND-MESSAGE TO BHST-MESSAGE.                       ACAT10DA
     ***   MOVE '9999' TO BHST-RETURN-CODE.                             ACAT10DA
     ***                                                                ACAT10DA
           EXEC CICS RETURN END-EXEC.                                   ACAT10DA
                                                                        ACAT10DA
      *==============================                                   ACAT10DA
       9000-WRITE-TO-CICS-LOG.                                          ACAT10DA
      *==============================                                   ACAT10DA
     ***   MOVE SQLCODE TO BHST-SQLCODE.                                ACAT10DA
           IF SQLCODE = -803                                            ACAT10DA
               CONTINUE                                                 ACAT10DA
           ELSE                                                         ACAT10DA
               MOVE SPACES             TO WS-ERRL-DATA                  ACAT10DA
               SET WRITE-ERROR-TO-LOG  TO TRUE                          ACAT10DA
               MOVE 'ACAA'             TO CALLING-TRAN-ID               ACAT10DA
               MOVE 'ACAT10DA'         TO CALLING-PROGRAM-ID            ACAT10DA
               MOVE SQLCA              TO SQLCA-AREA                    ACAT10DA
               EXEC CICS LINK PROGRAM ('FPDB2LOG')                      ACAT10DA
                     COMMAREA (WS-ERRL-DATA)                            ACAT10DA
                     LENGTH (LENGTH OF WS-ERRL-DATA)                    ACAT10DA
                     NOHANDLE                                           ACAT10DA
               END-EXEC                                                 ACAT10DA
           END-IF.                                                      ACAT10DA
     ***   EXEC CICS RETURN END-EXEC.                                   ACAT10DA
                                                                        ACAT10DA
       9500-RETURN-DB2-ERROR.                                           ACAT10DA
           EXEC CICS SYNCPOINT ROLLBACK END-EXEC.                       ACAT10DA
           SET ACAT10IO-DB2-ERROR TO TRUE                               ACAT10DA
*******    MOVE SQLCAID TO ACAT10IO-SQLCAID                             ACAT10DA
           MOVE SQLCODE TO ACAT10IO-SQLCODE                             ACAT10DA
           MOVE SQLERRM TO ACAT10IO-SQLERRM                             ACAT10DA
           EXEC CICS RETURN END-EXEC.                                   ACAT10DA
                                                                        ACAT10DA
