000001* PDX    - ACAT11PT C0360817 12/16/14 11:05:07 TBLAMUR            00001000
LRM048* SSR 99150 CONTRA CUSIP SUBMIT WARNING.                                  
000001* PDX    - ACAT11PT C0354742 05/27/14 08:18:47 TBCHKOP            00001000
      * CSG001 SSR 101121 REPLACE ILLEGAL CHARS IN MSD-DESC WITH SPACES.        
000001* PDX    - ACAT11PT C0346519 12/12/13 10:55:01 TBLAMUR            00001000
LRM047* SSR 96477 INCLUDE BANK DEPOSIT MONEY IN DLVY EDIT, ADD TO               
LRM047*       CMBL-MM-FUND-YEST.                                                
000001* PDX    - ACAT11PT C0344162 09/16/13 08:37:27 TBLAMUR            00001000
LRM046* SSR 94296 RECOMPILE ONLY FOR EXPANDED MFAINTW.                          
000001* PDX    - ACAT11PT C0342789 07/29/13 09:34:21 TBLAMUR            00001000
LRM045* SSR 91019 POPULTE ASSET WITH CUSIP WHEN ONE IS PRESENT ON MSD           
LRM045*   RATHER THAN THE 12 BYTE ISIN.                                         
000001* PDX    - ACAT11PT C0332370 10/14/12 14:02:36 TBLAMUR            00001000
LRM044* SSR 86655 CHANGE UNPRICED POSITIONS FROM 1.00 PER SHARE TO A            
LRM044*   PENNY, WITH A MINIMUM ASSET VALUE OF $1.00.                           
000001* PDX    - ACAT11PT C0330859 09/28/12 09:53:58 TBLAMUR            00001000
LRM043* SSR 85105 USE 12 ISIN ON DATABASE FOR A FOREIGN ISIN (NON US).          
000001* PDX    - ACAT11PT C0318727 01/30/12 11:27:11 TBLAMUR            00001000
LRM042* SSR# 80728 DO NOT ALLOW DELIVERY OF NETWORK LEVEL 4 FUND                
000001* PDX    - ACAT11PT C0317548 10/10/11 11:14:03 TBLAMUR            00001000
LRM041* SSR# 80596 CL 10 ALLOW TYPE4 POSITION TO BE DELIVERED AS TYPE1          
000001* PDX    - ACAT11PT C0308008 03/10/11 13:28:10 TBLAMUR            00001000
LRM040* SSR# 74535 WARNING MESSAGE ABOUT OTHER DELIVERY.                        
000001* PDX    - ACAT11PT C0305327 12/14/10 08:56:27 TBLAMUR            00001000
LRM039* SSR# 73009 USE COPY CATACTYP TO STANDARIZE ACCOUNT TYPE LOOKUP.         
000001* PDX    - ACAT11PT C0304411 12/13/10 08:19:10 TBLAMUR            00001000
LRM038* SSR# 73420 ADD WARNING MESSAGE WHEN NO ASSETS OR REJECT LASTDAY         
000001* PDX    - ACAT11PT C0300215 08/10/10 18:02:26 TBLAMUR            00001000
LRM037* SSR# 70251 CAUSE TRANSFER LEVEL COMMENT SCREEN POP-UP AFTER             
LRM037* THE PTR WAS ENTERED CLEAN.                                              
000001* PDX    - ACAT11PT C0298114 07/27/10 07:29:21 TBLAMUR            00001000
LRM036* SSR# 68565 SHOW CONTRA'S CMNT A REJECT PF1 POP-UP WHEN                  
LRM036*   THE REJECT WAS BUILT WITHOUT CMNT.                                    
000001* PDX    - ACAT11PT C0289853 12/28/09 15:57:18 TBLAMUR            00001000
LRM035* SSR# 59603 OPTION SYMBOLOGY CHANGE TO ADD OPTION EXP DT,                
LRM035* P/C, L/S AND STRIKE PRICE TO SCREEN, ALLOW OPTION ENTRY VIA             
LRM035* THESE WITH SYMBOL.  CALL GETADPNO TO LOOKUP.                            
000001* PDX    - ACAT11PT C0288029 11/09/09 14:37:17 TBLAMUR            00001000
LRM034* SSR# 59603 OPTION SYMBOLOGY CHANGE TO ALLOW ASSET AMT LESS 1            
000001* PDX    - ACAT11PT C0287256 10/21/09 08:14:16 TBLAMUR            00001000
LRM033* SSS# 67653 CORRECT BALANCE EDIT AGAINST MARGIN BAL WHEN                 
LRM033*   B1 434714 > 0 AND USER CHANGES AND EXCEEDS MRGR.                      
000001* PDX    - ACAT11PT C0284083 09/14/09 11:18:17 TBLAMUR            00001000
LRM032* SSR# 64156 LOOK AT TABL FOR EXTENDED CYCLE CUTOFF TIMES.                
000001* PDX    - ACAT11PT C0284941 08/19/09 08:25:39 TBLAMUR            00001000
LRM031* SSR# ##TBD CORRECT PTF RE-DISPLAY FOR MUTLI ENTRIES PER ACCT.           
000001* PDX    - ACAT11PT C0278346 03/17/09 08:17:34 TBLAMUR            00001000
LRM030* SSR# 61867 UPGRADE RESTICTED SECURITY FOUND MSG                         
000001* PDX    - ACAT11PT C0275533 03/05/09 15:25:45 TBLAMUR            00001000
LRM029* SSR# 57674 DEFAULT TO SUBMIT FROM B1/COMMAREA AND REMOVE                
LRM029* NO ERRORS FOUND MESSAGE.                                                
LRM029* OPEN UP SUBMIT FIELD AFTET PF4 AND NO ASSETS BUILT.                     
000001* PDX    - ACAT11PT C0272581 12/08/08 10:44:34 TBLAMUR            00001000
LRM028* SSR# 66164 ALLOW INITIATION WITH FUND COMPANY PRT-TYPE = 3,             
LRM028*      AND CUST-TYPE SS ON PTF.                                           
000001* PDX    - ACAT11PT C0273647 11/28/08 13:41:51 TBLAMUR            00001000
LRM027* MODIFY SSR 57271 WHEN BOTH ACCOUNT AND CUST TYPE ENTERED/CHANGED        
LRM027* AT THE SAME TIME, ACCEPT CUST TYPE AS KEYED, DON'T DEFAULT IT.          
000001* PDX    - ACAT11PT C0267683 09/26/08 07:55:56 TBLAMUR            00001000
LRM026* SSR# 57271 RESET CUST ACCOUNT TYPE ON ACCOUNT CHANGE                    
000001* PDX    - ACAT11PT C0263391 07/21/08 08:26:09 TBLAMUR            00001000
LRM024* SSR# 55766 ASCENDIS INTERFACE. BROWSE ONLY UNLESS SCON OVERRIDE         
000001* PDX    - ACAT11PT C0266453 06/12/08 08:14:54 TBLAMUR            00001000
000001* PDX    - ACAT11PT C0267139 06/27/08 08:46:28 TBLAMUR            00001000
LRM026* TASK 59180 FRACTIONAL QTY BUG FIX                                       
000001* PDX    - ACAT11PT C0263391 06/23/08 08:45:05 TBLAMUR            00001000
LRM025* SSR# 56200 MATCH WHEN-ISSUED INDICATOR TO CUSHOL IN EDIT                
LRM025*        THE DELIVERY QUANTITY.  SEE ACAT11DB FOR FULFILL CHANGES.        
000001* PDX    - ACAT11PT C0250441 07/27/07 15:36:35 TBLAMUR            00001000
LRM023* SSR# 53075 SPIN-OFF CHANGES                                             
000001* PDX    - ACAT11PT C0249595 06/04/07 15:29:20 TBLAMUR            00001000
LRM022* SSR# 51567 REGULATORY CHANGE A6425 SHORTEN CYCLE                        
000001* PDX    - ACAT11PT C0240732 11/09/06 12:34:08 TBLAMUR            00001000
LRM021* SSR# 49202 REGULATORY CHANGE A6291 ADD GIFT IND ON PTD                  
LRM021*        AND ALLOW 6 NEW ACCOUNT TYPES.                                   
000001* PDX    - ACAT11PT C0240592 10/20/06 14:29:12 TBLAMUR            00001000
LRM020* SSR# 48634 USE N/A ADT CUSTOMER TYPE TO LOOKUP ACCOUNT TYPE             
000001* PDX    - ACAT11PT C0238544 08/28/06 11:44:42 TBLAMUR            00001000
LRM019* SSR# 45145 ADD REJECT TOO LATE WARNING WHEN USER ENTERS REJECT          
LRM019*      AFTER NSCC CUTOFF TIME OF LAST DAY.                                
LRM019*      (LAST DAY MARKED ON VTRNFR BY BATCH).                              
000001* PDX    - ACAT11PT C0231507 07/07/06 12:25:56 TBLAMUR            00001000
LRM017* SSR# 45744 BLOCK DELIVERY BASED ON ACCOUNT FREEZE                       
LRM017* SSR# 40661 RETAIN USER ID OF INITIATOR.                                 
000001* PDX    - ACAT11PT C0232628 03/16/06 13:25:37 TBLAMUR            00001000
LRM018* SSR# TBD CORRECT ASSET ADD BUG AFTER PF4, NOTHING FULFILLED.            
000001* PDX    - ACAT11PT C0229888 02/21/06 14:02:32 TBLAMUR            00001000
LRM016* SSR# 39684 CORRECT SCROLLING ON PTDS.                                   
LRM016* SSR# 41120 SWAP LOGICAL FUNCTIONS OF PF4 AND PF6 KEYS                   
000001* PDX    - ACAT11PT C0227932 12/12/05 09:00:26 TBLAMUR            00001000
LRM015* SSR# 45207 DISPLAY FULL CASH REQUEST AS "FULL" OR "FULL-"               
000001* PDX    - ACAT11PT C0227932 11/29/05 10:39:53 TBLAMUR            00001000
LRM014* SSR# 42405 CONTRA ACCOUNT EDIT WARNING, B1 434730                       
000001* PDX    - ACAT11PT C0225533 10/14/05 12:22:07 TBLAMUR            00001000
LRM013* SSR 0043083 SUPPORT FULL ASSET REQUEST.                                 
000001* PDX    - ACAT11PT C0223543 07/19/05 10:50:47 TBLAMUR            00001000
LRM012* SSR 0031687 OPTION ASSET BOOKS W/WRONG ADP NBR.                         
000001* PDX    - ACAT11PT C0216396 06/10/05 14:38:37 TBLAMUR            00001000
LRM006* SSR 0039561 PHASE-II COMMENT MSG. CHANGE DSPL SEQ TO BRAC.              
LRM007*        - ALLOW DUPLICATE PTD DELIVERY.                                  
LRM008*        - ASSETS WITHHELD AND SENSITIVE TO SELECTION STATUS.             
LRM009*        - RESTRICT DSPLY TO EXCEPTIONS.                                  
LRM010*        - PF9 LINK TO ACAT5 FUND DISPLAY IN AUTO FULFILL MODE.           
LRM011*        - DON'T VERIFY CASH AGAINST MRGR WHEN AUTO                       
LRM011*        - FULFILL AND NOT CHANGED BY USER. (LIQ $ MAY EXCEED)            
000001* PDX    - ACAT11PT C0213985 01/03/05 10:59:06 TBLAMUR            00001000
LRM005* SSR 0039561 PHASE-II SUPPORT PERCENTAGE CASH REQUEST.                   
000001* PDX    - ACAT11PT C0211781 10/18/04 16:23:39 TBLAMUR            00001000
000001* PDX    - ACAT11PT C0205792 09/07/04 16:49:04 TBLAMUR            00001000
LRM016* SSR 0038232 CHANGE PF4 CONVERSION NO LONGER CREATE PTD, CAUSE           
LRM003*        - EXISTING PTR MEMO TIF TO CHANGE TO REAL DLVY, BY               
LRM003*        - ADDING DLVY ASSETS.                                            
LRM003*        - ALLOW REJECT CODE ENTRY ON PTR DELIVERY                        
LRM016*        - ADD PF6 LINK TO EXCEPTIONS POPUP SCREEN                        
LRM003* SSR 0025085 SETTLE LOCATION AND ASSET CATEGORY UPGRADE                  
LRM003* SSR 0030395 SETTLE LOCATION 50 AND INPUT REASON CODE                    
000001* PDX    - ACAT11PT C0205792 05/13/04 12:37:11 TBLAMUR            00001000
000001* PDX    - ACAT11PT C0182233 02/14/03 11:50:15 TBLAMUR            00001000
LRM002* SSR 0029711 USE MARGIN REWRITE FILES                                    
000001* PDX    - ACAT11PT C0179784 09/26/02 14:32:35 TBEDTAK            00001000
000001* PDX    - ACAT11PT C0174072 06/05/02 14:17:26 TBLAMUR            00001000
000001* PDX    - ACAT11PT C0160324 06/15/01 11:37:17 TBLAMUR            00001000
000001* PDX    - ACAT11PT C0156118 06/13/01 11:11:38 TBLAMUR            00001000
      * LRM    CHANGES                                                  00001000
000001* PDX    - ACAT11PT C0151771 02/23/01 14:01:18 TBDOJUN            00001000
      * DJ0001 SSR# R451550 CORRECT BEARER-BOND-IND                     00001000
000001* PDX    - ACAT11PT C0147438 11/22/00 14:11:14 TBLAMUR            00001000
000001* PDX    - ACAT11PT C0146352 08/23/00 15:04:35 TBLAMUR            00001000
000001* PDX    - ACAT11PT C0124874 08/25/99 08:30:36 TBLAMUR            00001000
000001* PDX    - ACAT11PT C0122453 03/01/99 12:22:35 TBLAMUR            00001000
000001* PDX    - ACAT11PT C0121428 02/16/99 08:55:49 TBLAMUR            00001000
000001* PDX    - ACAT11PT C0120327 01/30/99 11:41:57 TBLAMUR            00001000
000001* PDX    - ACAT11PT C0119861 01/21/99 08:29:00 TBLAMUR            00001000
000001* PDX    - ACAT11PT C0119769 01/07/99 12:50:15 TBLAMUR            00001000
000001* PDX    - ACAT11PT C0109165 10/12/98 10:48:08 TBEDTAK            00001000
000100 IDENTIFICATION DIVISION.                                         00020002
000200 PROGRAM-ID.    ACAT11PT.                                         00030002
000300 AUTHOR.  LARRY MUREY.                                            00040002
000400*REMARKS.                                                         00050002
000500**-------------------------------------------------------------** 00060002
000600*  ACAT INITIAL PARTIAL TRANSFER REQUEST (DELIVERER).           *         
000650*  THIS PROGRAM WAS MODELLED AFTER ACAT03IP.                    *         
000660*  THERE ARE (2) MODES: HOT AND COLD.  THE TRANSFER TYPE WILL   *         
000662*  DEFAULT TO (PTR) HOT MODE UPON LINK FROM CONTROL PROGRAM, TO *         
000663*  ALLOW THE USER TO SCROLL THRU EXISTING PTR REQUESTS FROM     *         
000664*  OTHER BROKERS.  THE USER MAY CREATE A PTD MODELLED FROM THIS *         
LRM016*  VIA PF4 AND EDIT THE NEW PTD AS DESIRED. THE USER MAY CHANGE *         
000666*  THE TFR-TYPE TO PTD; AT WHICH TIME THEY CAN CREATE A PTD     *         
000667*  (COLD) MODE OR MAINTAIN THE PTD(S) ON FILE.                  *         
000667*  PAGING IS ALLOWED THRU BOTH PTR(S) AND PTD(S) VIA PF7,PF8    *         
000667*  FOR TIF(S), AND PA1 PA1 FOR ASSETS.                          *         
000668*  A CONFIRMATION FUNCTION IS NEEDED; MAY ONLY ALLOW CERTAIN    *         
000669*  USER LEVEL TO CHANGE SUBMIT=Y, THEREBY HOLDING THIS TIF.     *         
000700**-------------------------------------------------------------** 00080002
000700**CHANGE LOG.                                                  ** 00080002
LRM001* 05/27/02 CAUSE PTD MODE FROM MENU TO DISPLAY INITIAL TABLE  **          
000700**-------------------------------------------------------------** 00080002
000800 ENVIRONMENT DIVISION.                                            00090002
000900 DATA DIVISION.                                                   00100002
001000 WORKING-STORAGE SECTION.                                         00110002
001100 COPY PDXIDCOB.                                                   00120002
001200 77  TWA-SIZE                       PIC S9(4) COMP.               00130002
LRM032 77  WS-CICS-RESP                   PIC S9(8) COMP   VALUE +0.            
       77  WS-B1PRINT-LENGTH              PIC S9(4) COMP.               00130002
TEMP   77  WS-EDITMOD                     PIC X(08) VALUE 'ACATEDIT'.   00140002
TEMP   77  WS-ORIG-EDITMOD                PIC X(08) VALUE 'EDITMOD '.   00140002
TEMP   77  WS-ACATNAIO                    PIC X(08) VALUE 'ACAT00NA'.   00140002
TEMP   77  WS-ACATPPIO                    PIC X(08) VALUE 'ACATPPDB'.   00140002
TEMP   77  WS-ACATMSD                     PIC X(08) VALUE 'ACATMSD '.   00140002
TEMP   77  WS-ACATRST                     PIC X(08) VALUE 'ACATRST '.   00140002
TEMP   77  WS-ACAT11DB                    PIC X(08) VALUE 'ACAT11DB'.   00140002
TEMP   77  WS-ACATSRCH                    PIC X(08) VALUE 'ACATSRCH'.   00140002
LRM001 77  WS-ACAT-PROGRAM-NAME           PIC X(08) VALUE '        '.   02550002
LRM047 77  WS-MRGRLBB                     PIC X(08) VALUE 'MRGRLBB '.           
       77  WS-CALC-PRICE                  PIC S9(9)V9(7) COMP-3.                
                                                                                
       77  WS-MCACCT                      PIC X(20) VALUE SPACES.               
       77  CURR-EDIT-LEN                  PIC S9(4) COMP  VALUE +35.            
001400*******************************************************           00150002
001500*      TSQ WORK AREA                                              00160002
001600*******************************************************           00170002
001700 01  TSQ-WORK-AREA.                                               00180002
001800     05  TSQ-NAME.                                                00190002
001900         09 TERM-ID                     PIC X(04).                00200002
002000         09 TRAN-ID                     PIC X(04).                00210002
002100     05  ITEM-NUM                       PIC S9(04) COMP VALUE +1. 00220002
002200 EJECT                                                            00230002
       01  WS-DB2-PROBLEM-MSG.                                                  
           05  FILLER                     PIC X(36) VALUE                       
           'ACAT11PT - DB2 UNEXPECTED ERROR '.                                  
           05  WS-DB2-PROBLEM-FUNCTION    PIC X(06) VALUE SPACES.               
           05  WS-DB2-PROBLEM-TABLE       PIC X(09) VALUE SPACES.               
           05  WS-DB2-PROBLEM-ID          PIC -999  VALUE SPACES.               
LRM023     05  FILLER                     PIC X(15) VALUE                       
LRM023         ' CALL HELP DESK'.                                               
                                                                                
       01  WS-SUBMITTED-MSG               PIC X(70) VALUE                       
           'TIF ALREADY SUBMITTED TO NSCC; AWAITING REPLY; BROWSE ONLY'.        
LRM024 01  WS-FRWD-ASCENDIS-MSG           PIC X(70) VALUE                       
LRM024     'ASSETS UNDER ASCENDIS CONTROL; AWAITING REPLY; BROWSE ONLY'.        
       01  WS-ASSET-SUBMITTED-MSG         PIC X(70) VALUE                       
           'ASSETS ALREADY SUBMITTED TO NSCC; AWAITING REPLY; BROWSE ONL        
      -      'Y'.                                                               
       01  WS-ACKNOWLEDGE-MSG             PIC X(70) VALUE                       
           'TIF AWAITING CONTRA BROKER ACKNOWLEDGEMENT; BROWSE ONLY'.           
LRM030 01  WS-CUSIP-RESTRICTED-MSG.                                             
LRM030     05  FILLER                     PIC X(47) VALUE                       
LRM030             'CUSIP NUMBER FOUND ON RESTRICTED SECURITY TABLE'.           
LRM030     05  FILLER                     PIC X(16) VALUE                       
LRM030             '/BROADRIDGE NBR '.                                          
LRM030     05  WS-CUSIP-RESTRICTED-ADP-NO PIC X(07).                            
002200 EJECT                                                            00230002
002900*******************************************************           00300002
003000*      EDITMOD WORK AREA                                          00310002
003100*******************************************************           00320002
       01  EDIT-AMT-AREA.                                                       
           05  WK-AMT-CODE                PIC X(01) VALUE 'D'.                  
           05  WK-AMT-NUM-ITEM            PIC S9(03) COMP-3 VALUE +1.           
LRM034     05  WK-AMT-IN-LEN              PIC S9(03) COMP-3 VALUE +22.          
           05  WK-AMT-OUT-LEN             PIC S9(03) COMP-3 VALUE +17.          
LRM034     05  WK-AMT-IN                  PIC X(22) VALUE LOW-VALUE.            
           05  WK-AMT-OUT                 PIC S9(15)V99.                        
           05  WK-AMT-DECIMAL-LEN         PIC S9(03) COMP-3 VALUE +2.           
           05  WK-AMT-COMMAR              PIC X(01) VALUE 'Y'.                  
           05  WK-AMT-RET-CODE            PIC X(01) VALUE SPACE.                
           05  FILLER                     PIC X(01) VALUE HIGH-VALUE.           
                                                                                
       01  EDIT-QTY-AREA.                                                       
           05  WK-QTY-CODE                PIC X(01) VALUE 'D'.                  
           05  WK-QTY-NUM-ITEM            PIC S9(03) COMP-3 VALUE +1.           
           05  WK-QTY-IN-LEN              PIC S9(03) COMP-3 VALUE +22.          
           05  WK-QTY-OUT-LEN             PIC S9(03) COMP-3 VALUE +21.          
           05  WK-QTY-IN                  PIC X(22) VALUE LOW-VALUE.            
           05  WK-QTY-OUT-D5X.                                                  
               07  FILLER                 PIC X(04).                            
               07  WK-QTY-OUT             PIC S9(12)V9(5).                      
           05  WK-QTY-DECIMAL-LEN         PIC S9(03) COMP-3 VALUE +5.           
           05  WK-QTY-COMMAR              PIC X(01) VALUE 'Y'.                  
           05  WK-QTY-RET-CODE            PIC X(01) VALUE SPACE.                
           05  FILLER                     PIC X(01) VALUE HIGH-VALUE.           
                                                                                
LRM035 01  EDIT-STRK-AREA.                                                      
LRM035     05  WK-STRK-CODE               PIC X(01) VALUE 'D'.                  
LRM035     05  WK-STRK-NUM-ITEM           PIC S9(03) COMP-3 VALUE +1.           
LRM035     05  WK-STRK-IN-LEN             PIC S9(03) COMP-3 VALUE +09.          
LRM035     05  WK-STRK-OUT-LEN            PIC S9(03) COMP-3 VALUE +08.          
LRM035     05  WK-STRK-IN                 PIC X(09) VALUE LOW-VALUE.            
LRM035     05  WK-STRK-OUT                PIC S9(5)V9(3).                       
LRM035     05  WK-STRK-DECIMAL-LEN        PIC S9(03) COMP-3 VALUE +3.           
LRM035     05  WK-STRK-COMMAR             PIC X(01) VALUE 'Y'.                  
LRM035     05  WK-STRK-RET-CODE           PIC X(01) VALUE SPACE.                
LRM035     05  FILLER                     PIC X(01) VALUE HIGH-VALUE.           
                                                                                
        01  WS-MQTY-AREA.                                                       
           05  WS-MQTY-ED-D5           PIC ZZZZZZZ,ZZZ,ZZZ.99999-.              
           05  WS-MQTY-ED-D4 REDEFINES WS-MQTY-ED-D5                            
                                       PIC ZZZZ,ZZZ,ZZZ,ZZZ.9999-.              
           05  WS-MQTY-ED-D3 REDEFINES WS-MQTY-ED-D4                            
                                       PIC ZZZZZ,ZZZ,ZZZ,ZZZ.999-.              
           05  WS-MQTY-ED-D2 REDEFINES WS-MQTY-ED-D3                            
                                       PIC ZZZZZZ,ZZZ,ZZZ,ZZZ.99-.              
           05  WS-MQTY-ED-D1 REDEFINES WS-MQTY-ED-D2                            
                                       PIC ZZZZZZZ,ZZZ,ZZZ,ZZZ.9-.              
           05  WS-MQTY-ED-D0 REDEFINES WS-MQTY-ED-D1                            
                                       PIC ZZZZZ,ZZZ,ZZZ,ZZZ,ZZZ-.              
LRM035  01  WS-MSTRK-AREA.                                                      
LRM035     05  WS-MSTRK-ED-D3           PIC ZZZZZ.999.                          
002200 EJECT                                                            00230002
004300*******************************************************           00440002
004400*      GET DATE TIME LAYOUT                                       00450002
004500*******************************************************           00460002
004600 01  WSWORKAREA.                                                  00470002
004700     05  WSABSTIME           PIC S9(08) COMP.                     00480002
004800     05  WSMMDDYY.                                                00490002
               09 WS-CUR-MM        PIC XX.                                      
               09  FILLER          PIC X.                                       
               09 WS-CUR-DD        PIC XX.                                      
               09  FILLER          PIC X.                                       
               09 WS-CUR-YY        PIC XX.                                      
004900     05  WSDATESEP           PIC X(01) VALUE '/'.                 00500002
005000     05  WSTIME.                                                  00510002
               09  WS-TIME-HH      PIC XX.                                      
               09  FILLER          PIC X.                                       
               09  WS-TIME-MM      PIC XX.                                      
               09  FILLER          PIC X.                                       
               09  WS-TIME-SS      PIC XX.                                      
LRM019     05  WS-TIME-HHMM        PIC X(04).                           00510002
005100     05  WSTIMESEP           PIC X(01) VALUE ':'.                 00520002
LRM032     05  WS-CYCLE3-HHMM      PIC X(04) VALUE '1130'.                      
005200                                                                  00530002
LRM047 01  WS-BDF-SECURITY-TABLE.                                               
LRM047     03  WS-BDF-COUNT        PIC 9(02).                                   
LRM047     03  WS-BDF-SEC-ENTRY OCCURS 10 TIMES PIC X(07).                      
005300 EJECT                                                            00540002
005400*******************************************************           00550002
005500*      I/O CALL AREAS.                                            00560002
005600*******************************************************           00570002
       01  ACATNAIO-CALL-AREA.                                                  
           COPY ACATNAIO.                                                       
                                                                                
       01  ACATPPIO-CALL-AREA.                                                  
           COPY ACATPPIO.                                                       
                                                                                
       01  ACATMSDIO-CALL-AREA.                                                 
           COPY ACATMSDI.                                                       
                                                                                
LRM035     COPY GETADPC.                                                        
                                                                                
       01  ACATRSTIO-CALL-AREA.                                                 
           COPY ACATRSIO.                                                       
                                                                                
       01  ACAT11IO-CALL-AREA.                                                  
           COPY ACAT11IO.                                                       
00342      EJECT                                                        MRGIPS05
LRM002*01  MRGN-COMMAREA.                                               MRGIPS05
LRM002***  COPY  IOCOMALP.                                              MRGIPS05
LRM002 01  CUSHOLIO-COMM-AREA.                                                  
LRM002     COPY  CUSHOLIO REPLACING ==:IO:== BY ==IOH==.                        
00345      SKIP3                                                        MRGIPS05
LRM002 01  CUSBALIO-COMM-AREA.                                                  
LRM002     COPY  CUSBALIO REPLACING ==:IO:== BY ==IOB==.                        
00345      SKIP3                                                        MRGIPS05
00346 ******************************************************************MRGIPS05
00347 *           FOLLOWING THREE(3) KEYS ARE USED FOR :               *MRGIPS05
00348 *  1) PSKEY IS USED THE SAME WAY AS IF IT REDEFINED THE          *MRGIPS05
00349 *      IO-HOL-KEY, IT IS USED TO HOLD CONTENTES OF IO-HOL-KEY    *MRGIPS05
00350 *      DURRING VALIDATION.                                       *MRGIPS05
00351 *  2)  SAVEKEY IS USED TO HOLD THE CURRENT KEY THAT IS BEEING    *MRGIPS05
00352 *        LOOKED AT.                                              *MRGIPS05
00353 *  3)  TEMPKEY IS USED TO HOLD CHLD-KEY DURRING VALIDATCIO, AND  *MRGIPS05
00354 *        REFLECTS CHLD-KEY DURRING EXECUTION.                    *MRGIPS05
00355 ******************************************************************MRGIPS05
00356  01  PSKEY.                                                       MRGIPS05
00357      03  MAIN-PSKEY.                                              MRGIPS05
00358          05  MAIN-KEY.                                            MRGIPS05
00359              10  KEY-CLIENT                    PIC 9(05) COMP-3.  MRGIPS05
00360              10  KEY-BRANCH                    PIC X(03).         MRGIPS05
00361              10  KEY-ACCNT                     PIC X(05).         MRGIPS05
00362          05  KEY-CURCOD.                                          MRGIPS05
00363              10  KEY-CURR-CODE                 PIC 9(6).          MRGIPS05
00364          05  KEY-REC-TYPE                  PIC X(02).             MRGIPS05
00365      03  KEY-ACCNT-TYPE.                                          MRGIPS05
00366          05  ZERO-ACCNT                PIC 9.                     MRGIPS05
00367          05  PS-ACCNT-TYPE             PIC X.                     MRGIPS05
00368      03  KEY-ACCOUNT-TYPE-NUM REDEFINES                           MRGIPS05
00368            KEY-ACCNT-TYPE              PIC 99.                    MRGIPS05
00371      03  KEY-CUSIP-NUM                 PIC X(15).                 MRGIPS05
00372      03  KEY-WIC-KEY                   PIC X(01).                 MRGIPS05
00372      03  FILLER                        PIC X(01) VALUE SPACES.    MRGIPS05
00373      03  KEY-SEQ-KEY                   PIC 9(04).                 MRGIPS05
00374      SKIP3                                                        MRGIPS05
00375  01  SAVEKEY.                                                     MRGIPS05
00376      03  MAIN-SAVKEY.                                             MRGIPS05
00377          05  SVKEY.                                               MRGIPS05
00377              10  SAV-KEY.                                         MRGIPS05
00378                  15  SAV-CLIENT        PIC 9(05) COMP-3.          MRGIPS05
00379                  15  SAV-BRANCH        PIC X(03).                 MRGIPS05
00380                  15  SAV-ACCNT         PIC X(05).                 MRGIPS05
00381              10  SAV-CURCOD.                                      MRGIPS05
00382                  15  SAV-CURR-CODE     PIC 9(6).                  MRGIPS05
00383          05  SAV-REC-TYPE              PIC X(02).                 MRGIPS05
00384      03  SAV-ACCNT-TYPE                PIC X(02).                 MRGIPS05
00385      03  SAV-ACCOUNT-TYPE-NUM REDEFINES                           MRGIPS05
00386          SAV-ACCNT-TYPE                PIC 9(02).                 MRGIPS05
00387      03  SAV-CUSIP-NUM                 PIC X(15).                 MRGIPS05
00388      03  SAV-WIC-KEY                   PIC X(01).                 MRGIPS05
00388      03  FILLER                        PIC X(01) VALUE SPACES.    MRGIPS05
00389      03  SAV-SEQ-KEY                   PIC 9(04).                 MRGIPS05
00390  01  TEMPKEY.                                                     MRGIPS05
00391      03  MAIN-TEMPKEY.                                            MRGIPS05
00392          05  TMPKEY.                                              MRGIPS05
00392              10  TEMP-KEY.                                        MRGIPS05
00393                  15  TEMP-CLIENT        PIC 9(05) COMP-3.         MRGIPS05
00394                  15  TEMP-BRANCH        PIC X(03).                MRGIPS05
00395                  15  TEMP-ACCNT         PIC X(05).                MRGIPS05
00396              10  TEMP-CURCOD.                                     MRGIPS05
00397                  15  TEMP-CURR-CODE     PIC 9(6).                 MRGIPS05
00398          05  TEMP-REC-TYPE              PIC X(02).                MRGIPS05
00399      03  TEMP-ACCNT-TYPE                PIC X(02).                MRGIPS05
00400      03  TEMP-ACCOUNT-TYPE-NUM REDEFINES                          MRGIPS05
00401          TEMP-ACCNT-TYPE.                                         MRGIPS05
00402          05  FILLER                     PIC 9.                    MRGIPS05
00403          05  TEMP-ACC-TYPE              PIC 9.                    MRGIPS05
00404      03  TEMP-CUSIP-NUM.                                          MRGIPS05
00405          05  TEMP-SEC                   PIC X(7).                 MRGIPS05
00406          05  FILLER                     PIC X(8).                 MRGIPS05
00407      03  TEMP-WIC-KEY                   PIC X(01).                MRGIPS05
00407      03  FILLER                         PIC X(01) VALUE SPACES.   MRGIPS05
00408      03  TEMP-SEQ-KEY                   PIC 9(04).                MRGIPS05
                                                                                
00075  01  WS-BALNC-KEY.                                                MRGIML03
00076      05  WS-BALNC-CLIENT                   PIC 9(5) COMP-3.       MRGIML03
00077      05  WS-BALNC-BRANCH                   PIC X(3).              MRGIML03
00078      05  WS-BALNC-ACCOUNT                  PIC X(05).             MRGIML03
00079      05  WS-BALNC-ID                       PIC 9(02) VALUE 28.    MRGIML03
00080      05  WS-BALNC-CURR                     PIC 9(06).             MRGIML03
005300 EJECT                                                            00540002
005400*******************************************************           00550002
005500*      B1 WORK AREA                                               00560002
005600*******************************************************           00570002
       01  B1-RECORD.                                                   00580002
           05  B1-REC-ID.                                               00590002
               09  B1-CLIENT-NO          PIC 9(03) COMP-3.              00600002
               09  B1-CARD-NO            PIC 9(07) COMP-3.              00610002
               09  B1-CLIENT             PIC 9(03) COMP-3.              00620002
               09  B1-SEQUENCE           PIC 9(05) COMP-3 VALUE 1.      00630002
           05  B1-REC-TYP-3              PIC X(01) VALUE '3'.           00640002
           05  B1-RETURN-VALUE           PIC X(35).                     00650002
006100                                                                  00670002
006000 EJECT                                                            00680002
006100                                                                  00690002
006200*******************************************************           00700002
006300*      ACAT11 WORK AREA                                           00710002
006400*******************************************************           00720002
006500 01  ACAT-WORK-AREA.                                              00730002
           05  WS-MRGN-POSN-QTY-TYPE1   PIC S9(12)V9(5) COMP-3 VALUE +0.        
           05  WS-MRGN-POSN-QTY-TYPE2   PIC S9(12)V9(5) COMP-3 VALUE +0.        
LRM041     05  WS-MRGN-POSN-QTY-TYPE4   PIC S9(12)V9(5) COMP-3 VALUE +0.        
           05  WS-MRGN-POSN-QTY-TYPE5   PIC S9(12)V9(5) COMP-3 VALUE +0.        
           05  WS-MRGN-POSN-MV-TYPE1      PIC S9(17)    COMP-3 VALUE +0.        
           05  WS-MRGN-POSN-MV-TYPE2      PIC S9(17)    COMP-3 VALUE +0.        
LRM041     05  WS-MRGN-POSN-MV-TYPE4      PIC S9(17)    COMP-3 VALUE +0.        
           05  WS-MRGN-POSN-MV-TYPE5      PIC S9(17)    COMP-3 VALUE +0.        
           05  WS-MRGN-BAL-TYPE1          PIC S9(15)V99 COMP-3 VALUE +0.MRGIML03
           05  WS-MRGN-BAL-TYPE2          PIC S9(15)V99 COMP-3 VALUE +0.MRGIML03
           05  WS-MRGN-BAL-TYPE5          PIC S9(15)V99 COMP-3 VALUE +0.MRGIML03
00314      05  UNPK-TYPE.                                               MRGIPS05
00315          10  FILLER                 PIC 9 VALUE ZERO.             MRGIPS05
00316          10  WK-PS-TYPE             PIC X VALUE ZERO.             MRGIPS05
           05  B1-CARD-OPTION             PIC X.                                
           05  REAL-CODE                  PIC 99 VALUE 0.               MRGIPS05
           05  WS-99-MEMO-SUBS-AREA.                                            
LRM            09  WS-99-MEMO-SUB OCCURS 18 TIMES PIC 99.                       
           05  CURRENCY-NUM               PIC 9(03).                            
           05  CURRENCY-X REDEFINES CURRENCY-NUM                                
                                          PIC X(03).                            
           05  WORK-AUTH-BRANCH           PIC X(03).                            
           05  WORK-AUTH-AE               PIC X(03).                            
006600     05  CALLED-PROGRAM-NAME        PIC X(08).                    00740002
006600     05  WORK-QTY-X                 PIC X(20).                    00740002
006700     05  FILLER REDEFINES WORK-QTY-X.                             00750002
006800         09 WORK-QTY                PIC 9(12)V9(05).              00760002
006900         09 FILLER                  PIC X(03).                    00770002
007000     05  WORK-DATE-X.                                             00780002
007100         09 WORK-DATE-X-MM          PIC X(02).                    00790002
007200         09 FILLER                  PIC X(01).                    00800002
007300         09 WORK-DATE-X-YY          PIC X(02).                    00810002
007400     05  WORK-DATE.                                               00820002
007500         09 WORK-DATE-MM            PIC X(02).                    00830002
007600         09 WORK-DATE-YY            PIC X(02).                    00840002
007700     05  TWA-CLIENT-NO-X.                                         00850002
007700         09 TWA-CLIENT-NO-9         PIC 9(04).                    00850002
007800     05  WK-BRW-KEY.                                              00860002
007900         09 WK-BRW-CLIENT           PIC X(03).                    00870002
007900         09 WK-BRW-RECORD-TYPE      PIC X(02)   VALUE '90'.       00870002
008000         09 WK-BRW-CUR-BR-AC.                                     00880002
                  15 WK-BRW-CURRENCY      PIC X(03).                            
                  15 WK-BRW-BRANCH        PIC X(03).                            
                  15 WK-BRW-ACCOUNT       PIC X(05).                            
           05  WK-SUSPEND-COUNT           PIC S9(04) COMP VALUE ZERO.           
           05  WK-BROWSE-FORWARD-FLAG     PIC X(01) VALUE 'Y'.                  
               88  WK-BROWSE-FORWARD      VALUE 'Y'.                            
               88  WK-BROWSE-BACKWARD     VALUE 'N'.                            
008300     05  ALARM-NEEDED-FLAG          PIC X(01)  VALUE 'N'.         00910002
008400         88  ALARM-NEEDED           VALUE  'Y'.                   00920002
008700     05  END-OF-DATA-FLAG           PIC X(01)  VALUE 'N'.         00950002
008800         88  END-OF-DATA            VALUE  'Y'.                   00960002
008900     05  INPUT-ERROR-FLAG           PIC X(01)  VALUE 'N'.         00970002
009000         88  INPUT-ERROR            VALUE  'Y'.                   00980002
009100     05  FIRST-TIME-FLAG            PIC X(01)  VALUE 'N'.         00990002
009200         88  FIRST-TIME             VALUE  'Y'.                   01000002
           05  WS-DELETE-FLAG             PIC X(01)  VALUE 'N'.         00990002
               88  WS-DELETE              VALUE 'Y'.                            
LRM027     05  WS-ACCOUNT-TYPE-CHANGED-FG PIC X(01)  VALUE 'N'.                 
LRM027         88  ACCOUNT-TYPE-CHANGED   VALUE  'Y'.                           
           05  WS-ERROR-THIS-LINE-FLAG    PIC X(01)  VALUE 'N'.         00990002
009200         88  ERROR-THIS-LINE        VALUE  'Y'.                   01000002
           05  WS-DUPLICATE-PTD-FLAG      PIC X(01)  VALUE 'N'.         00990002
               88  DUPLICATE-PTD          VALUE 'Y'.                            
           05  WS-MCACCT-SW               PIC X(01)  VALUE 'N'.         00990002
               88  MCACCT-ERROR           VALUE 'Y'.                            
LRM009     05  WS-NEW-ACCOUNT-SW          PIC X(01)  VALUE 'N'.         04809410
LRM009         88  WS-NEW-ACCOUNT                    VALUE 'Y'.         04809410
           05  WS-SLOCRSN-VALID-SW        PIC X(01)  VALUE 'N'.         00990002
               88  SLOCRSN-VALID          VALUE 'Y'.                            
009300     05  ERASE-KEY-VALUE            PIC S9(04) COMP VALUE +128.   01010002
009400     05  FILLER REDEFINES ERASE-KEY-VALUE.                        01020002
009500         09  FILLER                 PIC X(01).                    01030002
009600         09  ERASE-KEY              PIC X(01).                    01040002
009700     05  REFORMAT-TIME              PIC 9(07).                    01050002
009800     05  FILLER REDEFINES REFORMAT-TIME.                          01060002
009900         09  FILLER                 PIC X(01).                    01070002
010000         09  REFORMAT-HH            PIC X(02).                    01080002
010100         09  REFORMAT-MM            PIC X(02).                    01090002
010200         09  FILLER                 PIC X(02).                    01100002
010300     05  WORK-TIME.                                               01110002
010400         09  WORK-HH                PIC X(02).                    01120002
010500         09  FILLER                 PIC X(01) VALUE ':'.          01130002
010600         09  WORK-MM                PIC X(02).                    01140002
010700     05  INPUT-OPT-SPACE-FLAG       PIC X(01)  VALUE 'N'.         01150002
010800         88  INPUT-OPT-SPACE        VALUE  'Y'.                   01160002
010900     05  DATA-ONLY-FLAG             PIC X(01)  VALUE 'N'.         01170002
011000         88  DATA-ONLY              VALUE  'Y'.                   01180002
           05  WK-CURSOR                  PIC S9(04) COMP.                      
           05  SYSTEM-MSG                 PIC X(79) VALUE SPACES.       01190002
           05  WS-MRGN-MSG.                                                     
               09  WS-MRGN-MSG-LIT        PIC X(45).                            
               09  WS-MRGN-MSG-AMT        PIC ZZZ,ZZZ,ZZZ,ZZZ.99-.      MRGIML03
           05  WS-MRGN-QTY-MSG.                                                 
               09  WS-MRGN-MSG-LIT-QTY    PIC X(45).                            
               09  WS-MRGN-MSG-QTY        PIC ZZZ,ZZZ,ZZZ,ZZZ.99999-.   MRGIML03
           05  ERR-MSG.                                                 MRGIPS05
               09  ERR-EIBDS              PIC X(8)  VALUE SPACES.               
               09  ERR-MSG2               PIC X(70) VALUE SPACES.               
           05  ABEND-LINE.                                              03630002
               09  ABEND-MSG              PIC X(30).                    03630002
               09  FILLER                 PIC X(11) VALUE ' EIBRESP ='.         
               09  ABEND-EIBRESP          PIC 99.                               
011100     05  UNAUTH-MESSAGE             PIC X(79)                     01190002
011500         VALUE 'UNAUTHORIZED USER.'.                              01230002
011100     05  SEC-MESSAGE                PIC X(79)                     01190002
011500         VALUE 'SIGN ON SECURITY NOT AVAILABLE, TRY AGAIN.'.      01230002
011200     05  ERROR-PROG-MSG.                                          01200002
011300         09  ERROR-PROG-NAME        PIC X(08).                    01210002
011400         09  FILLER                 PIC X(71)                     01220002
011500             VALUE ' PROGRAM NOT AVAILIABLE.'.                    01230002
LRM017     05  WS-FULL-FREEZE-MSG         PIC X(23) VALUE                       
LRM017                              'ACCOUNT IS FULLY FROZEN'.                  
LRM017     05  WS-CASH-FREEZE-FULL-MSG    PIC X(32) VALUE                       
LRM017                              'ACCOUNT IS FULLY FROZEN FOR CASH'.         
LRM017     05  WS-CASH-FREEZE-CR-MSG      PIC X(30) VALUE                       
LRM017                              'ACCOUNT IS FROZEN FOR CASH IN'.            
LRM017     05  WS-CASH-FREEZE-DB-MSG      PIC X(30) VALUE                       
LRM017                              'ACCOUNT IS FROZEN FOR CASH OUT'.           
LRM017     05  WS-SEC-FREEZE-FULL-MSG     PIC X(32) VALUE                       
LRM017                              'ACCOUNT IS FULLY FROZEN FOR SEC'.          
LRM017     05  WS-SEC-FREEZE-LONG-MSG     PIC X(30) VALUE                       
LRM017                              'ACCOUNT IS FROZEN FOR SEC OUT'.            
LRM017     05  WS-SEC-FREEZE-SHORT-MSG    PIC X(30) VALUE                       
LRM017                              'ACCOUNT IS FROZEN FOR SEC IN'.             
011600     05  SAVE-INTRAN-FLAG           PIC X(01).                    01240002
011700     05  PREV-INTRAN-FLAG           PIC X(01).                    01250002
011800     05  WS-ACAT-NEXT               PIC X.                        01260002
011900     05  LINE-COUNT                 PIC 9(03).                    01270002
012000     05  SUB                        PIC S9(03) COMP-3.            01280002
012000     05  SUB2                       PIC S9(03) COMP-3.            01280002
           05  WS-MQTY-9-UNSIGNED      USAGE COMP-2.                            
           05  WS-SSN-EDIT-FLAG           PIC X  VALUE SPACES.                  
               88  SSN-INVALID            VALUE 'I'.                            
               88  SSN-VALID              VALUE 'V'.                            
           05  WS-SSN-EDIT                PIC X(11) VALUE SPACES.               
           05  WS-TYPE-9                  PIC S9(04) COMP VALUE +0.             
           05  FILLER REDEFINES WS-TYPE-9.                                      
               07  FILLER                 PIC X.                                
               07  WS-TYPE                PIC X.                                
                                                                                
           05  W-SUB1                    PIC  9(004) VALUE 0.           CAT513  
           05 W-IRA-B1-SW                PIC  X(001).                   CAT513  
              88 W-IRA-B1-FOUND               VALUE 'Y'.                CAT513  
           05 W-CLASS-CODE-B1-SW         PIC  X(001).                   CAT513  
              88 W-CLASS-CODE-B1-FOUND        VALUE 'Y'.                CAT513  
LRM020     05 W-CUST-TYPE-B1-SW          PIC  X(001).                           
LRM020        88 W-CUST-TYPE-B1-FOUND         VALUE 'Y'.                        
LRM020     05 W-ADT-CUSTOMER-TYPE.                                              
LRM020        07 W-ADT-CUSTOMER-TYPE-9   PIC  9(003).                           
LRM035     05 WS-OPTION-SW               PIC X(1) VALUE SPACES.                 
LRM035           88 WS-OPTION-FOUND          VALUE 'Y'.                         
LRM035           88 WS-OPTION-NOT-FOUND      VALUE 'N'.                         
LRM035     05 WS-OPTION-MSECR            PIC X(009) VALUE SPACES.               
           05 W-RETIRE-ACCOUNT-SW        PIC  X(001).                   CAT513  
              88 W-RETIRE-ACCOUNT-FOUND       VALUE 'Y'.                CAT513  
           05 W-IRA-BR-RANGE-SW          PIC  X(001).                   CAT513  
              88 W-IRA-BR-RANGE-FOUND         VALUE 'Y'.                CAT513  
           05 W-IRA-BR-ACT-RANGE-SW      PIC  X(001).                   CAT513  
              88 W-IRA-BR-ACT-RANGE-FOUND     VALUE 'Y'.                CAT513  
434531     05  BH-ACAT-DEFAULT-CUSTOMER-TYPE   PIC XX VALUE SPACES.             
434504     05  BH-ACAT-DEFINE-CUSTOMER-TYPE   PIC X(1) VALUE '0'.       BHACAT  
434534     05  BH-ACAT-RETIRE-ACT-SUB-CTG-NO   PIC S9(3) COMP-3 VALUE 0.CAT513  
           05  BH-ACAT-RETIRE-ACT-SUB-CTG.                              BHACAT  
               07  BH-ACAT-RETIRE-ACT-SUB-CTG-ENT OCCURS 40 TIMES.      BHACAT  
                   09  BH-ACAT-RETIRE-ACT-IRA-CODE     PIC X(1).        BHACAT  
                   09  FILLER                          PIC X.                   
                   09  BH-ACAT-RETIRE-ACT-CUST-TYPE    PIC X(2).        BHACAT  
434535     05  BH-ACAT-CUST-TYPE-VALUE-NO    PIC 9(3) COMP-3 VALUE 0.   BHACAT  
           05  BH-ACAT-CUST-TYPE-VALUES.                                BHACAT  
               07  BH-ACAT-CUST-TYPE-VALUE-ENTRY  OCCURS 100 TIMES.     BHACAT  
                   09  BH-ACAT-CUST-TYPE-FROM-NA       PIC X(3).        BHACAT  
                   09  FILLER                          PIC X.                   
                   09  BH-ACAT-CUST-ACCT-TYPE          PIC X(2).        BHACAT  
009125     05  BH-MGCA-IRA-BR-RANGE-NO       PIC 9(3) COMP-3 VALUE 0.   BHMGCA  
           05  BH-MGCA-IRA-BR-RANGE.                                    BHMGCA  
               07  BH-MGCA-IRA-BR-RANGE-ENTRY      OCCURS 50 TIMES.     BHMGCA  
                   09  BH-MGCA-IRA-BR-RANGE-LO         PIC X(3).        BHMGCA  
                   09  FILLER                          PIC X.                   
                   09  BH-MGCA-IRA-BR-RANGE-HI         PIC X(3).        BHMGCA  
009126     05  BH-MGCA-IRA-BR-ACT-RANGE-NO   PIC 9(3) COMP-3 VALUE 0.   BHMGCA  
           05  BH-MGCA-IRA-BR-ACT-RANGE.                                BHMGCA  
               07  BH-MGCA-IRA-BR-ACT-RANGE-ENTRY  OCCURS 50 TIMES.     BHMGCA  
                   09  BH-MGCA-IRA-BR-ACT-BR-LO        PIC X(3).        BHMGCA  
                   09  FILLER                          PIC X.                   
                   09  BH-MGCA-IRA-BR-ACT-BR-HI        PIC X(3).        BHMGCA  
                   09  FILLER                          PIC X.                   
                   09  BH-MGCA-IRA-BR-ACT-ACT-LO       PIC X(5).        BHMGCA  
                   09  FILLER                          PIC X.                   
                   09  BH-MGCA-IRA-BR-ACT-ACT-HI       PIC X(5).        BHMGCA  
           05  WS-ASSET-X.                                                      
               07  WS-ASSET-ED             PIC ZZZ9.                            
LRM003     05  WK-CNS-IND              PIC X(01)  VALUE 'N'.                    
LRM003     05  WK-DTC-IND              PIC X(01)  VALUE 'N'.                    
LRM003     05  WK-MS-CLASS.                                                     
LRM003         10  WK-MS-CLASS-1       PIC 9.                                   
LRM003         10  WK-MS-CLASS-2-5     PIC 9(4).                                
LRM003         10  WK-MS-CLASS-6-7     PIC 9(2).                                
LRM003     05  FILLER                  REDEFINES WK-MS-CLASS.                   
LRM003         10  WK-MS-CLASS-1-2-3   PIC 9(3).                                
LRM003         10  WK-MS-CLASS-4       PIC 9.                                   
LRM003         10  WK-MS-CLASS-5-7     PIC 9(3).                                
LRM003     05  FILLER                  REDEFINES WK-MS-CLASS.                   
LRM003         10  FILLER              PIC 9.                                   
LRM003         10  WK-MS-CLASS-2       PIC 9.                                   
LRM003         10  WK-MS-CLASS-3-4     PIC 9(2).                                
LRM003         10  WK-MS-CLASS-5       PIC 9.                                   
LRM003         10  WK-MS-CLASS-6       PIC 9.                                   
LRM003         10  WK-MS-CLASS-7       PIC 9.                                   
LRM003     05  FILLER                  REDEFINES WK-MS-CLASS.                   
LRM003         10  WK-MS-CLASS-1-2     PIC 9(2).                                
LRM003         10  FILLER              PIC 9(2).                                
LRM003         10  WK-MS-CLASS-5-6-7   PIC 9(3).                                
LRM003     05  FILLER                  REDEFINES WK-MS-CLASS.                   
LRM003         10  FILLER              PIC 9(3).                                
LRM003         10  WK-MS-CLASS-4-5     PIC 9(2).                                
LRM003         10  FILLER              PIC 9(2).                                
00032                                                                   01320002
LRM005     05  WS-PCT-BAL.                                                      
LRM005         10  FILLER              PIC X(5)     VALUE SPACES.               
LRM005         10  WS-PCT-BAL-ED       PIC ZZ9.99999-.                          
LRM005         10  FILLER              PIC X(4)     VALUE ' %  '.               
LRM042     05  MFAINTW                PIC X(8)   VALUE 'MFAINTW'.               
CSG001*                                                                         
CSG001     05  W-EDIT-ASSET-DESC-TXT-AREA.                                      
CSG001         10 W-SUB2                       PIC S9(03) COMP-3.               
CSG001         10 W-SUB3                       PIC S9(03) COMP-3.               
CSG001         10 W-ASSET-DESC-TXT             PIC X(30) VALUE SPACES.          
CSG001         10 W-ASSET-DESC-TMP             PIC X(30) VALUE SPACES.          
CSG001         10 W-ASSET-DESC-TXT-GRP.                                         
CSG001            15 W-ASSET-DESC1-TXT         PIC X(30)  VALUE SPACES.         
CSG001            15 W-ASSET-DESC2-TXT         PIC X(30)  VALUE SPACES.         
CSG001            15 W-ASSET-DESC3-TXT         PIC X(30)  VALUE SPACES.         
CSG001            15 W-ASSET-DESC4-TXT         PIC X(30)  VALUE SPACES.         
CSG001            15 W-ASSET-DESC5-TXT         PIC X(20)  VALUE SPACES.         
CSG001         10 W-JUST-LEFT-REQ-FLAG         PIC X(01).                       
CSG001            88 W-JUST-LEFT-REQ-Y         VALUE 'Y'.                       
CSG001            88 W-JUST-LEFT-REQ-N         VALUE 'N'.                       
CSG001         10 W-JUST-LEFT-FLAG             PIC X(01).                       
CSG001            88 W-JUST-LEFT-DONE          VALUE 'Y'.                       
CSG001            88 W-JUST-LEFT-NOT-DONE      VALUE 'N'.                       
CSG001         10 W-EDIT-ASSET-DESC-TXT-FLAG   PIC X(01).                       
CSG001            88 W-EDIT-ASSET-DESC-TXT-Y   VALUE 'Y'.                       
CSG001            88 W-EDIT-ASSET-DESC-TXT-N   VALUE 'N'.                       
                                                                                
LRM042 01  MFAINTW-COMMAREA.                                                    
LRM042     COPY MFAINTW.                                                        
                                                                                
LRM042 01  EDITMOD-WORK-AREA1.                                                  
LRM042     03  WK-ACCT-CHKDIG-CODE1         PIC X             VALUE 'G'.        
LRM042     03  WK-NUM-OF-ACCT1              PIC S9(3)  COMP-3 VALUE +1.         
LRM042     03  WK-ACCT-TC1.                                                     
LRM042         05  WK-ACCT-IN1.                                                 
LRM042             10  WK-ACCT-IN1-8        PIC X(8).                           
LRM042             10  WK-ACCT-IN1-TYPE     PIC X.                              
LRM042             10  WK-ACCT-IN1-CHK-DIG  PIC X.                              
LRM042         05  WK-ACCT-OUT1.                                                
LRM042             10  WK-ACCT-OUT1-9       PIC 9(9).                           
LRM042             10  WK-ACCT-OUT1-CHK-DIG PIC 9.                              
LRM042         05  WK-ACCT-RET-CODE1        PIC X(01).                          
LRM042     03  FILLER                       PIC X(01) VALUE HIGH-VALUE.         
           EJECT                                                        01350002
       COPY ACATCOM.                                                    01360002
           EJECT                                                        01350002
       COPY SECLINKC.                                                   01360002
           EJECT                                                        01350002
       COPY ACATSRCH.                                                   01360002
           EJECT                                                        01350002
017600 COPY ATTR.                                                       01410002
017700     EJECT                                                        01420002
017800 COPY DFHAID.                                                     01430002
017900     EJECT                                                        01440002
018000 COPY ACAT00M.                                                    01450002
018000 COPY ACAT11M.                                                    01450002
                                                                                
            EJECT                                                       01660002
LRM039 COPY CATACTYP.                                                           
021300      EJECT                                                       01660002
CSG001/                                                                         
CSG001******************************************************************        
CSG001* ACATS VALID CHARACTER SET FROM "ACATS USER GUIDE (SECTION 19)" *        
CSG001******************************************************************        
CSG001 01  FILLER                        PIC X(08) VALUE 'CATVCHAR'.            
CSG001     COPY CATVCHAR.                                                       
CSG001     EJECT                                                        01660002
CSG001/                                                                         
LRM047 01  LB-BANK-COMM-AREA.                                                   
LRM047     COPY LBBCOMM.                                                        
      /                                                                         
       01  WS-POP-UP-WORKAREA.                                                  
            COPY ACAT90TS.                                                      
LRM010*** IO AREA FOR FUND REGISTRATION *****                                   
LRM010 COPY ACATFIO.                                                            
                                                                                
LRM032 01  TABL-RECORD.                                                         
LRM032    03  TABL-KEY.                                                         
LRM032        05  TABL-LITERAL   PIC X(33) VALUE 'ACAT        DCYCLE3'.         
LRM032    03  TABL-DATA.                                                        
LRM032        05  FILLER         PIC X(01).                                     
LRM032        05  TABL-HHMM      PIC X(04).                                     
LRM032        05  FILLER         PIC X(56).                                     
021300      EJECT                                                       01660002
021400 LINKAGE SECTION.                                                 01670002
021500 01  DFHCOMMAREA.                                                 01680002
021600     03  FILLER                    PIC X(2000).                   01690002
                                                                        01900002
021700 COPY TWACOMMN.                                                   01910002
021800     03 TWA-ACAT-AREA.                                            01920002
              05 TWA-ACAT-NOT-FOUND-FLAG      PIC X(01).                01930002
014100           88 TWA-ACAT-NOT-FOUND        VALUE 'Y'.                01950002
              05  TWA-CONFIRM-FLAG            PIC X.                            
                 88 TWA-CONFIRM               VALUE 'Y'.                        
013800        05 TWA-INTRAN-FLAG              PIC X.                    01940002
014100           88 TWA-INTRAN-BRW            VALUE 'B'.                01950002
014300           88 TWA-INTRAN-NO-CHANGE      VALUE 'N'.                01980002
LRM009        05 TWA-EXCEPTION-ONLY-MODE      PIC X.                            
LRM010        05 TWA-B1-434714                PIC X.                            
              05 TWA-ACTION            PIC X.                                   
              05 TWA-MAP-TABLE.                                         02000002
                  07 TWA-SCREEN        PIC X(01).                       02030002
                  07 TWA-ACAT90CM-UPDATE-IND                            02030002
                                       PIC X(01).                               
                  07 TWA-MBR.                                           02030002
                     09 TWA-MBR-9      PIC 9(03).                       02030002
                  07 TWA-MAC.                                           02030002
                     09 TWA-MAC-9      PIC 9(05).                       02030002
                  07 TWA-MRR           PIC X(03).                       02030002
                  07 TWA-MCTYPE        PIC X(02).                       02030002
                  07 TWA-MCBRKR        PIC X(04).                       02030002
                  07 TWA-MCBNAM        PIC X(30).                       02030002
                  07 TWA-MCACCT        PIC X(20).                       02030002
                  07 TWA-MNAME         PIC X(30).                       02030002
                  07 TWA-MNAME2        PIC X(30).                       02030002
                  07 FILLER            PIC X(30).                       02030002
                  07 TWA-MSSN          PIC X(11).                       02030002
                  07 TWA-MSSN2         PIC X(11).                       02030002
                  07 TWA-MCCMNT-X120.                                           
                     09 TWA-MCCMNT     PIC X(60).                               
                     09 TWA-MCCMNT2    PIC X(60).                               
                  07 TWA-NA-IRA        PIC X(01).                               
                  07 TWA-MSUBM         PIC X(01).                       02030002
                  07 TWA-MACAT         PIC X(14).                       02030002
                  07 TWA-MSTAT         PIC X(03).                       02030002
                  07 TWA-MNEXT         PIC X(01).                       02030002
                  07 TWA-MCMNT         PIC X(01).                       02030002
                  07  TWA-CONTRA-CMNTM-FND       PIC X.                         
                      88  TWA-CONTRA-TIF-CMNTM           VALUE 'T'.             
                      88  TWA-CONTRA-AST-CMNTM           VALUE 'A'.             
                      88  TWA-CONTRA-BOTH-CMNTM          VALUE 'B'.             
                  07 TWA-MREJ          PIC X(02).                       02030002
                  07 TWA-ORIG-MREJ     PIC X(02).                       02030002
LRM003            07 TWA-DLVR-ACCT     PIC X(20).                       02030002
LRM003            07 TWA-PTR-MCCMNT-X120.                                       
LRM003               09 TWA-PTR-MCCMNT  PIC X(60).                              
LRM003               09 TWA-PTR-MCCMNT2 PIC X(60).                              
                  07 TWA-MDEL          PIC X(01).                       02030002
                  07 TWA-MMRR          PIC X(03).                       02030002
                  07 TWA-MSD           PIC X(10).                       02030002
                  07 TWA-CONTROL-NBR   PIC X(14).                       02030002
                  07 TWA-ORIG-RCV-NBR  PIC X(04).                               
                  07 TWA-ORIG-RCV-ACCT PIC X(20).                               
                  07 TWA-TRNFR-TYPE-CD PIC X(03).                               
                  07 TWA-STTS-CD       PIC X(03).                               
LRM019            07 TWA-STTLM-TM-CD   PIC X(01).                               
LRM021            07 TWA-GIFT-IND      PIC X(01).                               
                  07 TWA-MBAL01        PIC X(19).                               
                  07 TWA-ORIG-MBAL01 PIC X(19).                                 
LRM026            07 TWA-MBAL01-9       PIC S9(15)V99   COMP-3.                 
LRM005            07 TWA-MBAL01-PCT-IND PIC X.                                  
LRM015            07 TWA-MBAL01-RQST-CD     PIC X.                              
LRM015            07 TWA-MBAL01-CREDIT-IND  PIC X.                              
                  07 TWA-MBAL02         PIC X(19).                              
                  07 TWA-ORIG-MBAL02 PIC X(19).                                 
LRM026            07 TWA-MBAL02-9       PIC S9(15)V99   COMP-3.                 
LRM005            07 TWA-MBAL02-PCT-IND PIC X.                                  
LRM015            07 TWA-MBAL02-RQST-CD     PIC X.                              
LRM015            07 TWA-MBAL02-CREDIT-IND  PIC X.                              
                  07 TWA-MBAL05         PIC X(19).                              
                  07 TWA-ORIG-MBAL05 PIC X(19).                                 
LRM026            07 TWA-MBAL05-9       PIC S9(15)V99   COMP-3.                 
LRM005            07 TWA-MBAL05-PCT-IND PIC X.                                  
LRM015            07 TWA-MBAL05-RQST-CD     PIC X.                              
LRM015            07 TWA-MBAL05-CREDIT-IND  PIC X.                              
                  07 TWA-M1CMNT-X120.                                           
                     09 TWA-M1CMNT     PIC X(60).                               
                     09 TWA-M1CMNT2    PIC X(60).                               
                  07 TWA-M2CMNT-X120.                                           
                     09 TWA-M2CMNT     PIC X(60).                               
                     09 TWA-M2CMNT2    PIC X(60).                               
                  07 TWA-M5CMNT-X120.                                           
                     09 TWA-M5CMNT     PIC X(60).                               
                     09 TWA-M5CMNT2    PIC X(60).                               
                  07 TWA-MMCMNT-X120.                                           
                     09 TWA-MMCMNT     PIC X(60).                               
                     09 TWA-MMCMNT2    PIC X(60).                               
                  07 TWA-UPDT-TMSTP    PIC X(26).                               
LRM007            07 TWA-DUPE-FOUND    PIC X.                                   
                  07 TWA-OCC-BRKR      PIC X(05).                               
LRM003            07 TWA-EXCEPTIONS.                                            
LRM003               09 TWA-ACCT-ACTIVITY-IND       PIC X(1).                   
LRM003               09 TWA-ACCT-ORDERS-IND         PIC X(1).                   
LRM003               09 TWA-ACCT-DB-BAL-T1-IND      PIC X(1).                   
LRM003               09 TWA-ACCT-MRGN-DB-IND        PIC X(1).                   
LRM003               09 TWA-ACCT-SHRT-PSTN-IND      PIC X(1).                   
LRM003               09 TWA-ACCT-SEC-RSTRD-IND      PIC X(1).                   
LRM003               09 TWA-ACCT-AST-EXCS-IND       PIC X(1).                   
LRM003               09 TWA-ACCT-OPTN-PSTN-IND      PIC X(1).                   
LRM003               09 TWA-ACCT-LTD-PRTNR-IND      PIC X(1).                   
LRM003               09 TWA-ACCT-TIN-MSMTH-IND      PIC X(1).                   
LRM003               09 TWA-ACCT-DPLCT-TRN-IND      PIC X(1).                   
LRM003               09 TWA-ACCT-CUST-70-IND        PIC X(1).                   
LRM003               09 TWA-ACCT-QULFD-PLN-IND      PIC X(1).                   
LRM003               09 TWA-ACCT-MNGD-IND           PIC X(1).                   
LRM003               09 TWA-ACCT-PRVT-RNG-IND       PIC X(1).                   
LRM003               09 TWA-ACCT-BRKR-TIF-IND       PIC X(1).                   
LRM003               09 TWA-NSCC-NON-ADP-IND        PIC X(1).                   
LRM003               09 TWA-COMMENTS-IND            PIC X(1).                   
LRM003               09 TWA-CUST-TYPE-MISMATCH      PIC X(1).                   
LRM003               09 TWA-ACCOUNT-FLAT-IND        PIC X(1).                   
LRM003               09 TWA-SPECIAL-ACCOUNT         PIC X(1).                   
LRM003               09 TWA-TRNFR-TYPE-RJCT-CD      PIC X(2).                   
LRM003               09 TWA-TRNFR-RJC1-CD           PIC X(2).                   
LRM003               09 TWA-TRNFR-RJC2-CD           PIC X(1).                   
LRM003               09 TWA-TRNFR-ACCT-CLT-RSCND-IND PIC X(01).                 
LRM003               09 TWA-TRNFR-ACCT-LGL-BLK-IND   PIC X(01).                 
LRM003               09 TWA-TRNFR-ACCT-RB-SEC-IND    PIC X(01).                 
LRM017               09 TWA-ORIG-FREEZE-IND          PIC X(01).                 
LRM008            07 TWA-MMSTAT        PIC X(03).                       02030002
                  07 TWA-ASSET-AREA.                                            
                     09 TWA-MSECR      PIC X(12).                               
                     09 TWA-ORIG-MSECR PIC X(12).                               
                     09 TWA-MCD        PIC X(01).                               
                     09 TWA-MCATGR     PIC X(04).                               
                     09 TWA-MSLOC      PIC X(02).                               
*********            09 TWA-MACMNT     PIC X(01).                               
LRM035               09 TWA-MEXPDT     PIC X(06).                               
LRM035               09 TWA-MCALL      PIC X(01).                               
LRM035               09 TWA-MLONG      PIC X(01).                               
LRM035               09 TWA-MSTRIKE    PIC X(09).                               
LRM035               09 TWA-MSTRIKE-9  PIC 9(05)V9(3).                          
                     09 TWA-MTYPE      PIC X(01).                               
                     09 TWA-ORIG-MTYPE PIC X(01).                               
                     09 TWA-KEY-FIELDS.                                         
LRM003                  11  TWA-ISIN-CNTRY-CD     PIC X(02).                    
                        11  TWA-ISIN-SEC-ISSUE-CD PIC X(09).                    
                        11  TWA-ISIN-SEC-CDG-CD   PIC X.                        
                     09 TWA-ADP-NBR    PIC X(07).                               
                     09 TWA-MWI        PIC X(01).                               
LRM048               09 TWA-MWI-STTS   PIC X(01).                               
LRM008               09 TWA-NSCC-WTHLD-CD  PIC X(01).                           
LRM048               09 TWA-ORIG-WTHLD-CD  PIC X(01).                           
                     09 TWA-MMEMO      PIC X(02).                               
                     09 TWA-SLOCRSN    PIC X(04).                               
                     09 TWA-MDESC-GROUP.                                        
                        11 TWA-MDESC   PIC X(30).                               
                        11 TWA-MDESC2  PIC X(30).                               
                        11 TWA-MDESC3  PIC X(30).                               
                     09 TWA-MQTY        PIC X(22).                              
                     09 TWA-ORIG-MQTY   PIC X(22).                              
LRM026               09 TWA-MQTY-9      PIC S9(12)V9(5)   COMP-3.               
                     09 TWA-MAMT        PIC X(22).                              
                     09 TWA-ORIG-MAMT   PIC X(22).                              
                     09 TWA-MAMT-9      PIC S9(15)V99   COMP-3.                 
                     09 TWA-BOND-REG-CODE  PIC X.                               
                  07 TWA-MSCMNT-X120.                                           
                     09 TWA-MSCMNT     PIC X(60).                               
                     09 TWA-MSCMNT2    PIC X(60).                               
                                                                                
              05 TWA-SUBMIT-APPROVAL   PIC X  VALUE 'N'.                        
                 88 TWA-APPROVAL-AUTH         VALUE 'A'.                        
                 88 TWA-APPROVAL-NO-AUTH      VALUE 'N'.                        
              05 TWA-ACTIVE-DB         PIC X.                                   
LRM003           88 TWA-PTR-BEEN-FLIPPED            VALUE 'D'.                  
LRM016           88 TWA-INIT-DB                     VALUE 'I'.                  
              05 TWA-SECR-ACTION       PIC X.                                   
              05 TWA-INP-TFR-TYP       PIC X(03).                               
              05 TWA-CALLING-PROG      PIC X(08).                               
              05 TWA-PRIOR-INP-SEL     PIC X.                                   
LRM014        05 TWA-EDIT-MCBRKR       PIC X(04).                               
LRM014        05 TWA-EDIT-MCACCT       PIC X(20).                               
LRM017        05 TWA-FREEZE-CASH-CREDIT   PIC X.                                
LRM017        05 TWA-FREEZE-CASH-DEBIT    PIC X.                                
LRM017        05 TWA-FREEZE-SEC-LONG      PIC X.                                
LRM017        05 TWA-FREEZE-SEC-SHORT     PIC X.                                
LRM028        05 TWA-PRTCP-TYPE-CD     PIC X.                                   
              05 TWA-PAGE-AREA.                                         02000002
                  07 TWA-PAGE-NO       PIC S9(08) COMP.                 02030002
                  07 TWA-PAGE-MODE     PIC X.                           02030002
                     88 TWA-ASSET-LVL-PG  VALUE 'A'.                            
                  07 TWA-CURRENT-ASSET-KEY.                             02030002
                     09 TWA-ORIG-SECR     PIC X(09).                            
                     09 TWA-ORIG-SLOC     PIC X(02).                            
                     09 TWA-ORIG-TYPE     PIC X(01).                            
                     09 TWA-ASSET-SEQ     PIC S9(4) COMP.                       
00422      EJECT                                                        MRGIPS05
00230      COPY ACBALALP.                                               MRGIML03
00230      COPY ADVMAST.                                                MRGIML03
00228      EJECT                                                        MRGIML03
           COPY  HOLDAVSM.                                              MRGIPS05
00424      EJECT                                                        MRGIPS05
           COPY  OPNORVSM.                                              MRGIPS05
00427      EJECT                                                        MRGIPS05
023800                                                                  02160002
024000 PROCEDURE DIVISION.                                              02170002
024100 INITIALIZATION.                                                  02180002
024200     EXEC CICS IGNORE CONDITION DUPKEY DUPREC  ENDFILE  ERROR     02190002
024300               ILLOGIC INVREQ   IOERR  ITEMERR LENGERR  MAPFAIL   02200002
024400               NOSPACE NOSTG    NOTFND         PGMIDERR QIDERR    02210002
024500     END-EXEC.                                                    02220002
024600     EXEC CICS HANDLE CONDITION NOTOPEN (NOT-OPEN)                02230002
024700                               DISABLED (NOT-OPEN)                02240002
024800                               DSIDERR  (NOT-OPEN)                02250002
024900     END-EXEC.                                                    02260002
025000                                                                  02270002
025100     EXEC CICS ASSIGN TWALENG (TWA-SIZE)                          02280002
025200     END-EXEC.                                                    02290002
025300     IF TWA-SIZE = 0                                              02300002
              MOVE LOW-VALUE TO ACAT11MO                                        
025400        MOVE 'TWA SIZE EQUAL ZERO, FATAL ERROR' TO SYSTEM-MSG     02310002
025500        PERFORM  ERROR-RTN.                                       02320002
025600                                                                  02330002
025700     EXEC CICS ADDRESS TWA (ADDRESS OF TWA-AREA)                  02340002
025800     END-EXEC.                                                    02350002
025900                                                                  02360002
026000     EJECT                                                        02370002
026100                                                                  02380002
026200 MAIN-PROCESSING.                                                 02390002
026300     MOVE EIBTRMID TO TERM-ID.                                    02400002
LRM009     MOVE 'ACAX'   TO TRAN-ID.                                    02410002
026500     MOVE TWA-CLIENT-NO TO TWA-CLIENT-NO-9.                       02420002
026600     MOVE 'N'           TO END-OF-DATA-FLAG.                      02430002
026700     MOVE SPACES        TO SYSTEM-MSG.                            02440002
           MOVE 0             TO WK-SUSPEND-COUNT.                              
           MOVE 0             TO WK-CURSOR.                                     
026800     MOVE 0             TO LINE-COUNT.                            02450002
026900     MOVE LOW-VALUE     TO ACAT11MO.                              02460002
     ***   MOVE ATT-UNPROT TO NEXTA                                     02480002
027100     PERFORM GET-DATE-AND-TIME-RTN.                               02530002
027200     MOVE DFHCOMMAREA          TO ACATCOMM-COMMAREA.              02540002
           PERFORM SET-TRANSACTION-SECURITY-RTN.                                
LRM001     MOVE ACAT-PROGRAM-NAME TO WS-ACAT-PROGRAM-NAME.              02550002
NEW ET     IF ACAT-CALLING-PROG-NAME = 'ACAT21PT'                               
           AND ACAT-INP-SEL NOT = 'J'                                           
LRM006        IF (ACAT-INP-TFR-TYP = 'PTD' OR 'PTF')                            
                 MOVE '7' TO TWA-ACTION                                         
LRM017        ELSE                                                              
LRM017           MOVE ' ' TO TWA-ACTION                                         
LRM006        END-IF                                                            
              MOVE ACAT-CALLING-PROG-NAME TO TWA-CALLING-PROG                   
              MOVE ACAT-INP-SEL TO TWA-PRIOR-INP-SEL                            
           ELSE                                                                 
              MOVE SPACES                 TO TWA-CALLING-PROG                   
           END-IF.                                                              
           IF  ACAT-PROGRAM-NAME = 'ACAT11PT'                           02550002
               MOVE SPACES TO ACAT-CALLING-PROG-NAME                            
028100         PERFORM CONTINUE-PROCESS                                 02560002
028000     ELSE                                                         02570002
           IF  ACAT-PROGRAM-NAME = 'RATT01  '                           02550002
               MOVE 'ACAT11PT' TO ACAT-PROGRAM-NAME                             
032500         PERFORM READ-TSQ-RTN                                     03810002
032600         PERFORM DELETE-TSQ-RTN                                   03820002
               SET FIRST-TIME TO TRUE                                   02810002
LRM003         PERFORM ASKIP-MAP-RTN                                            
               PERFORM REFORMAT-SCREEN-DETAIL                                   
               MOVE TWA-INP-TFR-TYP     TO MMTFRO                               
               PERFORM REFORMAT-SCREEN-ASSET                                    
               PERFORM PROCESS-MAP-ITEMS THRU PROCESS-MAP-ITEMS-EXIT            
               IF TWA-ACTION = 'B' OR 'R'                                       
               OR NOT ACAT-SIGN-ON-UPDATE                                       
                  PERFORM ASKIP-MAP-RTN                                         
                  MOVE ATT-UNPROT TO  MACATA                                    
                  MOVE -1         TO  MACATL                                    
               END-IF                                                           
               PERFORM SEND-MAP-ERASE                                           
               PERFORM WRITE-TSQ-RTN                                        1079
               PERFORM RETURN-TO-CICS                                       0835
028000     ELSE                                                         02570002
               MOVE 'ACAT11PT' TO ACAT-PROGRAM-NAME                             
027900         PERFORM FIRST-TIME-RTN                                   02580002
028200     END-IF END-IF.                                               02590002
028300                                                                  02600002
028400     EJECT                                                        02610002
028500                                                                  02620002
028600 GET-DATE-AND-TIME-RTN.                                           02630002
028700     EXEC  CICS ASKTIME                                           02640002
028800           ABSTIME(WSABSTIME)                                     02650002
028900     END-EXEC.                                                    02660002
029000     EXEC  CICS FORMATTIME                                        02670002
029100           ABSTIME(WSABSTIME)                                     02680002
029200           MMDDYY(WSMMDDYY)                                       02690002
029300           DATESEP(WSDATESEP)                                     02700002
029400           TIME(WSTIME)                                           02710002
029500           TIMESEP(WSTIMESEP)                                     02720002
029600     END-EXEC.                                                    02730002
LRM019     MOVE WS-TIME-HH TO WS-TIME-HHMM(1 : 2).                      00510002
LRM019     MOVE WS-TIME-MM TO WS-TIME-HHMM(3 : 2).                      00510002
LRM032     EXEC CICS READ DATASET('TABLFLE ' )                                  
LRM032                INTO   (TABL-RECORD)                                      
LRM032                RIDFLD (TABL-KEY)                                         
LRM032                RESP   (WS-CICS-RESP)                                     
LRM032     END-EXEC                                                             
LRM032                                                                          
LRM032     IF WS-CICS-RESP = DFHRESP(NORMAL)                                    
LRM032     AND TABL-HHMM > WS-CYCLE3-HHMM                                       
LRM032         MOVE TABL-HHMM TO WS-CYCLE3-HHMM                                 
LRM032     END-IF.                                                              
029900                                                                  02760002
030800     EJECT                                                        02770002
030900                                                                  02780002
031000 FIRST-TIME-RTN.                                                  02790002
LRM009     PERFORM SET-PHASE2-MODE-RTN.                                         
LRM009     IF ACAT-CALLING-PROG-NAME = 'ACAT01CP'                               
LRM009        PERFORM SET-PHASE2-EXCEPTION-ONLY-RTN                             
LRM009     ELSE                                                                 
LRM009     IF (ACAT-CALLING-PROG-NAME NOT = 'ACAT11PT' AND SPACES               
LRM009                                   AND 'ACAT5FSC')                        
LRM009        MOVE 'N' TO TWA-EXCEPTION-ONLY-MODE                               
LRM009     END-IF.                                                              
           IF EIBAID = DFHPF10                                                  
           AND ACAT-CALLING-PROG-NAME = 'ACAT90CM'                              
              PERFORM READ-TSQ-RTN                                      03810002
              PERFORM DELETE-TSQ-RTN                                    03820002
              PERFORM READ-ACAT90CM-TS-RTN                              10350002
              MOVE 'DISPLAY REFRESHED' TO SYSTEM-MSG                            
LRM010        MOVE 'ACAT11PT' TO WS-ACAT-PROGRAM-NAME                   02550002
           ELSE                                                                 
LRM009     IF EIBAID = DFHPF10                                                  
LRM009     AND ACAT-CALLING-PROG-NAME = 'ACAT5FSC'                              
LRM009        PERFORM READ-TSQ-RTN                                      03810002
LRM009        PERFORM DELETE-TSQ-RTN                                    03820002
LRM009        MOVE 'DISPLAY REFRESHED' TO SYSTEM-MSG                            
LRM010        MOVE 'ACAT11PT' TO WS-ACAT-PROGRAM-NAME                   02550002
LRM009     ELSE                                                                 
           IF EIBAID NOT = DFHPF5                                               
              MOVE SPACES              TO TWA-MAP-TABLE                    02000
              MOVE ZEROS TO TWA-MBAL01-9                                        
                            TWA-MBAL02-9                                        
                            TWA-MBAL05-9                                        
                            TWA-MQTY-9                                          
                            TWA-MAMT-9                                          
LRM035                                TWA-MSTRIKE-9                             
              MOVE ACAT-INP-BRANCH     TO TWA-MBR  MMBRO                        
              MOVE ACAT-INP-ACCOUNT    TO TWA-MAC  MMACO                        
              MOVE ACAT-INP-RR         TO TWA-MMRR MMRRO                        
              MOVE ACAT-INP-CONTRA-BKR TO TWA-MCBRKR  MMBKRO                    
LRM008        MOVE ACAT-INP-STATUS     TO TWA-MMSTAT MMSTATO                    
LRM001        IF  ACAT-INP-TFR-TYP  = 'PTD' OR 'PTR' OR 'PTF'                   
LRM001           MOVE ACAT-INP-TFR-TYP TO TWA-INP-TFR-TYP                       
LRM001        ELSE                                                              
              IF TWA-INP-TFR-TYP = 'PTD' OR 'PTR' OR 'PTF'                      
LRM015           CONTINUE                                                       
LRM015***********MOVE TWA-INP-TFR-TYP  TO TWA-INP-TFR-TYP                       
              ELSE                                                              
                 MOVE 'PTR'            TO TWA-INP-TFR-TYP                       
              END-IF END-IF                                                     
              MOVE TWA-INP-TFR-TYP     TO MMTFRO                                
           END-IF.                                                              
           MOVE SPACES TO TWA-MCMNT MCMNTO.                                     
*********  MOVE SPACES TO TWA-MACMNT MACMNTO.                                   
LRM016     IF EIBAID = DFHPF2                                                   
LRM040        MOVE SPACES TO ACAT11IO-DUPE-DLVY-ASSSET-IND                      
LRM016        IF NOT ACAT-SIGN-ON-UPDATE                                        
LRM016           MOVE SPACES TO TWA-ACTIVE-DB                                   
LRM016        END-IF                                                            
LRM016     ELSE                                                                 
LRM003     IF EIBAID NOT = DFHPF5 AND DFHPF10                                   
LRM003        MOVE SPACES TO TWA-ACTIVE-DB.                                     
           SET FIRST-TIME TO TRUE.                                      02810002
           MOVE ZERO TO TWA-PAGE-NO.                                            
           MOVE 'J' TO ACAT-NEXT                                                
           PERFORM DELETE-TSQ-RTN.                                      02800002
           IF TWA-ACTION = '7'                                                  
              PERFORM FORMAT-FROM-ACTIVE-RTN.                                   
           IF TWA-INP-TFR-TYP = 'PTR'                                           
LRM003     AND NOT TWA-PTR-BEEN-FLIPPED                                         
LRM003     AND EIBAID NOT = DFHPF10                                             
LRM004     AND EIBAID NOT = DFHPF5                                              
LRM006        MOVE LOW-VALUES TO TWA-CONTROL-NBR                                
LRM006****    MOVE SPACES TO TWA-CONTROL-NBR                                    
LRM006        MOVE TWA-MBR TO TWA-DLVR-ACCT                                     
LRM006        MOVE TWA-MAC TO TWA-DLVR-ACCT (4 : 5)                             
LRM008        IF WS-ACAT-PROGRAM-NAME NOT = 'ACAT11PT'                  02550002
LRM008        AND ACAT-CONTROL-NBR > SPACES                                     
LRM008           MOVE ACAT-CONTROL-NBR TO TWA-MACAT                             
LRM008        END-IF                                                            
              MOVE ZERO   TO TWA-ASSET-SEQ                                      
              PERFORM PAGE-FORWARD-TIF                                  03900002
           END-IF.                                                              
LRM001**** 'PTD'  CAUSE PTD(S) ON VINITRNF TO DISPLAY.                          
LRM001     IF EIBAID NOT = DFHPF2                                               
LRM001     AND EIBAID NOT = DFHPF5                                              
LRM001     AND WS-ACAT-PROGRAM-NAME NOT = 'ACAT11PT'                    02550002
LRM010     AND TWA-INP-TFR-TYP NOT = 'PTD' AND 'PTF'                            
LRM001        PERFORM PAGE-FORWARD-TIF                                  03900002
LRM001     END-IF.                                                              
                                                                                
LRM004     IF EIBAID = DFHPF5                                                   
LRM028        IF TWA-INP-TFR-TYP = 'PTF'                                        
LRM028           MOVE 'Y'  TO TWA-DUPE-FOUND                                    
LRM028           MOVE 'A'  TO TWA-ACTION                                        
LRM028        END-IF                                                            
LRM004        MOVE 'A' TO TWA-SECR-ACTION                                       
LRM004        MOVE SPACES TO TWA-ASSET-AREA                             02790002
LRM008                       TWA-MSCMNT-X120                                    
LRM004        MOVE ZEROS  TO TWA-MQTY-9                                         
LRM004                       TWA-MAMT-9                                         
LRM004        IF TWA-INP-TFR-TYP = 'PTR'                                        
LRM004           SET TWA-PTR-BEEN-FLIPPED TO TRUE                               
LRM004     END-IF.                                                              
                                                                                
LRM003     PERFORM ASKIP-MAP-RTN.                                               
           PERFORM REFORMAT-SCREEN-DETAIL.                                      
           PERFORM REFORMAT-SCREEN-ASSET.                                       
           PERFORM PROCESS-MAP-ITEMS THRU PROCESS-MAP-ITEMS-EXIT.               
                                                                                
   ***** CAUSE UPDATE UPON RETURN FROM POP-UP IF NO ERRORS FOUND.               
           IF ACAT-SIGN-ON-UPDATE                                               
           AND NOT INPUT-ERROR                                                  
           AND ACAT-CALLING-PROG-NAME = 'ACAT90CM'                              
               PERFORM UPDATE-ACAT-IT-RTN.                                      
                                                                                
           IF NOT ACAT-SIGN-ON-UPDATE                                           
             PERFORM ASKIP-MAP-RTN                                              
             IF EIBAID = DFHPF2                                                 
LRM024        IF ACAT-ASCENDIS-CLIENT                                           
LRM024        MOVE                                                              
LRM024     'ASCENDIS USER DOES NOT HAVE CREATE AUTHORITY; PF2 IGNORED'          
LRM024           TO SYSTEM-MSG                                                  
LRM024        ELSE                                                              
              MOVE 'USER DOES NOT HAVE CREATE AUTHORITY; PF2 IGNORED'           
                 TO SYSTEM-MSG                                                  
             ELSE                                                               
             IF EIBAID = DFHPF5                                                 
LRM024        IF ACAT-ASCENDIS-CLIENT                                           
LRM024        MOVE                                                              
LRM024     'ASCENDIS USER DOES NOT HAVE CREATE AUTHORITY; PF5 IGNORED'          
LRM024           TO SYSTEM-MSG                                                  
LRM024        ELSE                                                              
              MOVE 'USER DOES NOT HAVE CREATE AUTHORITY; PF5 IGNORED'           
                 TO SYSTEM-MSG.                                                 
                                                                                
           MOVE SPACES TO ACAT-CALLING-PROG-NAME                                
           PERFORM SEND-MAP-ERASE.                                              
           PERFORM WRITE-TSQ-RTN.                                       10790002
           PERFORM RETURN-TO-CICS.                                      08350002
       EJECT                                                            02860002
LRM009 SET-PHASE2-MODE-RTN.                                                     
LRM009     MOVE TWA-CLIENT-NO   TO B1-CLIENT-NO B1-CLIENT.              03580002
LRM009     MOVE 434714          TO B1-CARD-NO.                          03590002
LRM009     PERFORM READ-B1-RTN.                                         03600002
LRM009     IF EIBRESP  = +0                                             03610002
LRM009        MOVE B1-RETURN-VALUE(1 : 1) TO TWA-B1-434714                      
LRM009     ELSE                                                                 
LRM009        MOVE '0'                    TO TWA-B1-434714                      
LRM009     END-IF.                                                              
LRM009 SET-PHASE2-EXCEPTION-ONLY-RTN.                                           
LRM009     IF TWA-B1-434714 < '1'                                               
LRM009        MOVE 'N' TO TWA-EXCEPTION-ONLY-MODE                               
LRM009     ELSE                                                                 
LRM009        MOVE TWA-CLIENT-NO   TO B1-CLIENT-NO B1-CLIENT            03580002
LRM009        MOVE 434718          TO B1-CARD-NO                        03590002
LRM009        PERFORM READ-B1-RTN                                       03600002
LRM009        IF EIBRESP  = +0                                          03610002
LRM009        AND B1-RETURN-VALUE(1 : 1) = '1'                                  
LRM009           MOVE 'Y' TO TWA-EXCEPTION-ONLY-MODE                            
LRM009        ELSE                                                              
LRM009           MOVE 'N' TO TWA-EXCEPTION-ONLY-MODE                            
LRM009     END-IF.                                                              
       SET-TRANSACTION-SECURITY-RTN.                                            
     *** ASSUME SUPER SIGNON(UPDATE) CAN DO EVERYTHING.                         
     ***  SCON ACAXJA HAS APPROVAL AUTHORITY TO SUBMIT PTD.                     
     ***  SCON ACAXJ MAY CREATE, DELETE OR UPDATE BUT NOT SUBMIT.               
     ***  SUBMIT MEANS CHANGE SUBMIT IND TO 'Y'; ELIGIBLE TO GO TO NSCC.        
           SET TWA-APPROVAL-NO-AUTH TO TRUE.                                    
LRM024     IF ACAT-ASCENDIS-CLIENT                                              
LRM024        SET ACAT-SIGN-ON-BROWSE TO TRUE                                   
LRM024     ELSE                                                                 
           IF ACAT-SUPER-SIGN-ON-UPDATE                                         
              SET ACAT-SIGN-ON-UPDATE TO TRUE                                   
              SET TWA-APPROVAL-AUTH TO TRUE                                     
           ELSE                                                                 
               MOVE 'J'         TO ACAT-SCREEN-IND                              
               MOVE 'U'         TO ACAT-UPDATE-IND                              
               SET ACAT-UPDATE-MODE TO TRUE                                     
               MOVE SPACES    TO SECLINK-LIST                           AEISAC07
               MOVE '2'       TO SECLINK-ACTION-CODE                    AEISAC07
               MOVE 'SCON'    TO SECLINK-TYPE                                   
               MOVE ACAT-SEC-LIT TO SECLINK-ITEM                                
               PERFORM CALL-SECLINK-RTN                                 AEISAC07
               IF SECLINK-RETURN-CODE = '00' OR '20'                    AEISAC07
                  SET ACAT-SIGN-ON-UPDATE TO TRUE                               
               ELSE                                                             
                  SET ACAT-SIGN-ON-BROWSE TO TRUE                               
               END-IF                                                           
                                                                                
               MOVE 'J'         TO ACAT-SCREEN-IND                              
               MOVE 'A'         TO ACAT-UPDATE-IND                              
               MOVE SPACES    TO SECLINK-LIST                           AEISAC07
               MOVE '2'       TO SECLINK-ACTION-CODE                    AEISAC07
               MOVE 'SCON'    TO SECLINK-TYPE                                   
               MOVE ACAT-SEC-LIT TO SECLINK-ITEM                                
               PERFORM CALL-SECLINK-RTN                                 AEISAC07
               IF SECLINK-RETURN-CODE = '00' OR '20'                    AEISAC07
                  SET ACAT-SIGN-ON-UPDATE TO TRUE                               
                  SET TWA-APPROVAL-AUTH TO TRUE                                 
           END-IF.                                                              
       EJECT                                                            02860002
                                                                        03690002
       READ-B1-RTN.                                                     03700002
           MOVE +22 TO WS-B1PRINT-LENGTH.                                       
           EXEC CICS READ                                               03710002
                     DATASET('B1PRINT')                                 03720002
                     INTO(B1-RECORD)                                    03730002
                     RIDFLD(B1-REC-ID)                                  03740002
                     LENGTH(WS-B1PRINT-LENGTH)                          03750002
           END-EXEC.                                                    03760002
       READ-B1-RTN-LONG.                                                03700002
           EXEC CICS READ                                               03710002
                     DATASET('B1PRINT')                                 03720002
                     INTO(B1-RECORD)                                    03730002
                     RIDFLD(B1-REC-ID)                                  03740002
                     LENGTH(LENGTH OF B1-RECORD)                        03750002
           END-EXEC.                                                    03760002
       EJECT                                                            03780002
                                                                        03790002
   400 CONTINUE-PROCESS.                                                03800009
032500     PERFORM READ-TSQ-RTN.                                        03810002
032600     PERFORM DELETE-TSQ-RTN.                                      03820002
032700     SET DATA-ONLY TO TRUE.                                       03830002
033000     EVALUATE TRUE                                                03840002
033100          WHEN EIBAID = DFHPF11 OR DFHCLEAR                       03850002
033200               PERFORM RETURN-CONTROL-RTN                         03860002
033300          WHEN EIBAID = DFHENTER OR DFHPF9                        03870002
033400               PERFORM ENTER-KEY-RTN                              03880002
                WHEN EIBAID = DFHPF1                                            
                     PERFORM SEND-POPUP-MAP-RTN                                 
                WHEN EIBAID = DFHPF2                                            
LRM016               SET TWA-INIT-DB TO TRUE                                    
LRM007               IF TWA-DUPE-FOUND = 'Y'                                    
LRM007                  MOVE 'A' TO TWA-ACTION TWA-SECR-ACTION                  
LRM028                  IF TWA-INP-TFR-TYP NOT = 'PTF'                          
LRM010                     MOVE 'PTD' TO TWA-INP-TFR-TYP                        
LRM028                  END-IF                                                  
LRM007                  MOVE SPACES TO TWA-ASSET-AREA                           
LRM007                                 TWA-ORIG-MSECR                           
LRM007                                 TWA-ORIG-SLOC                            
LRM035                                 TWA-MEXPDT                               
LRM035                                 TWA-MCALL                                
LRM035                                 TWA-MLONG                                
LRM035                                 TWA-MSTRIKE                              
LRM007                                 TWA-ORIG-MTYPE                           
LRM007                                 TWA-ORIG-MREJ                            
LRM007                                 TWA-INTRAN-FLAG                          
LRM007                                 TWA-CURRENT-ASSET-KEY                    
LRM007                                 TWA-MSUBM                                
LRM007                                 TWA-MREJ                                 
LRM016                  MOVE LOW-VALUES TO TWA-CONTROL-NBR              02030002
LRM007                  MOVE ZEROS TO TWA-MBAL01-9                              
LRM007                                TWA-MBAL02-9                              
LRM007                                TWA-MBAL05-9                              
LRM035                                TWA-MSTRIKE-9                             
LRM007                  MOVE DFHPF5 TO EIBAID                                   
LRM007                  PERFORM FIRST-TIME-RTN                                  
LRM007               END-IF                                                     
                     MOVE 'A' TO TWA-ACTION TWA-SECR-ACTION                     
                     MOVE SPACES TO TWA-MAP-TABLE                       02790002
LRM009                              TWA-INTRAN-FLAG                     01940002
LRM028               IF TWA-INP-TFR-TYP NOT = 'PTF'                             
                        MOVE 'PTD' TO TWA-INP-TFR-TYP                           
LRM028               END-IF                                                     
                     MOVE ZEROS TO TWA-MBAL01-9                                 
                                   TWA-MBAL02-9                                 
                                   TWA-MBAL05-9                                 
LRM035                             TWA-MSTRIKE-9                                
                     PERFORM FIRST-TIME-RTN                             02790002
LRM016          WHEN EIBAID = DFHPF4                                    03910002
                     PERFORM CREATE-DLVY-FROM-MEMO-RTN                          
                WHEN EIBAID = DFHPF5                                            
LRM004***            MOVE 'A' TO TWA-SECR-ACTION                                
LRM004***            MOVE SPACES TO TWA-ASSET-AREA                      02790002
LRM004***            MOVE ZEROS  TO TWA-MQTY-9                                  
LRM004***                           TWA-MAMT-9                                  
                     PERFORM FIRST-TIME-RTN                             02790002
LRM016          WHEN EIBAID = DFHPF6                                            
LRM003               PERFORM SEND-EXCEPTION-RTN                         02790002
033700          WHEN EIBAID = DFHPF7                                    03910002
033800               PERFORM PAGE-BACKWARD-TIF                          03920002
033500          WHEN EIBAID = DFHPF8                                    03890002
033600               PERFORM PAGE-FORWARD-TIF                           03900002
033500          WHEN EIBAID = DFHPA1                                    03890002
033600               PERFORM PAGE-FORWARD-RTN                           03900002
                        THRU PAGE-FORWARD-RTN-EXIT                              
033700          WHEN EIBAID = DFHPA2                                    03910002
033800               PERFORM PAGE-BACKWARD-RTN                          03920002
033900          WHEN OTHER                                              03930002
                     MOVE LOW-VALUE TO ACAT11MO                         03940002
                     MOVE -1 TO MNEXTL                                          
034000               MOVE 'ERROR FUNCTION KEY'                          03950002
034100                 TO SYSTEM-MSG                                    03960002
034200               PERFORM ERROR-RTN                                  03970002
034300     END-EVALUATE.                                                03980002
034400                                                                  03990002
DD6700     EJECT                                                        04240002
036800                                                                  04250002
037500 RECEIVE-MAP-RTN.                                                 04320002
037600     EXEC CICS RECEIVE MAP('TRLMAP')                                      
037700                       MAPSET('ACAT00M')                          04340002
                             FROM(ACAT-RECEIVE-MAP)                     04350002
037800                       LENGTH(ACAT-RECEIVE-MAP-LENGTH)            04360002
037900     END-EXEC.                                                    04370002
           MOVE +1000 TO ACAT-RECEIVE-MAP-LENGTH.                               
037600     EXEC CICS RECEIVE MAP('ACAT11M')                                     
037700                       MAPSET('ACAT11M')                          04340002
                             FROM(ACAT-RECEIVE-MAP)                     04350002
037800                       LENGTH(ACAT-RECEIVE-MAP-LENGTH)            04360002
037900     END-EXEC.                                                    04370002
038000                                                                  04380002
038100     EJECT                                                        04390002
038200                                                                  04400002
038300 ENTER-KEY-RTN.                                                   04410002
038400     PERFORM RECEIVE-MAP-RTN.                                     04420002
038700     PERFORM EDIT-INPUT-BRW-RTN.                                  04440010
038600     PERFORM MERGE-MAP-DTL-RTN.                                           
038600     PERFORM MERGE-MAP-NEXT-RTN.                                          
039300     IF TWA-MNEXT GREATER SPACES AND NOT = 'J'                            
              MOVE TWA-MNEXT TO ACAT-INP-SEL                                    
039300        PERFORM PROCESS-JUMP-RTN.                                         
           IF TWA-MCMNT GREATER ' '                                             
              MOVE 'A' TO TWA-SCREEN                                            
              PERFORM SEND-POPUP-MAP-RTN.                                       
           IF TWA-MCTYPE(1 : 1) = '?'                                           
           OR (EIBAID = DFHPF9                                                  
LRM010     AND TWA-ACTION = 'A')                                                
              MOVE 'T' TO TWA-SCREEN                                            
              PERFORM SEND-POPUP-MAP-RTN.                                       
LRM010     IF EIBAID = DFHPF9                                                   
LRM010        IF TWA-MSLOC = '10'                                               
LRM010***********IF TWA-B1-434714 > '0'                                         
LRM010              INITIALIZE ACATFIO-COMMAREA                                 
LRM010              PERFORM 0630-BUILD-ACATFIO-TS-RTN                           
LRM010******     ELSE                                                           
LRM010******        MOVE 'NON AUTO FULFILL DLVY CLIENT' TO                      
LRM010******          SYSTEM-MSG                                                
LRM010******        SET INPUT-ERROR TO TRUE                                     
LRM010        ELSE                                                              
LRM010           MOVE 'NON SETTLE LOC 10 ASSET; NO/REG INFO' TO                 
LRM010             SYSTEM-MSG                                                   
LRM010           SET INPUT-ERROR TO TRUE                                        
LRM010     END-IF.                                                              
*********  IF TWA-MACMNT GREATER ' '                                            
*********     MOVE 'S' TO TWA-SCREEN                                            
*********     PERFORM SEND-POPUP-MAP-RTN.                                       
           IF ACAT-SIGN-ON-UPDATE                                               
065800        MOVE 'N' TO INPUT-ERROR-FLAG                                      
              PERFORM PROCESS-MAP-ITEMS THRU PROCESS-MAP-ITEMS-EXIT             
              IF INPUT-ERROR                                                    
LRM029        OR (TWA-INTRAN-BRW AND TWA-ACTION NOT = 'A')              01950002
              OR FIRST-TIME                                                     
                 MOVE SPACES TO TWA-INTRAN-FLAG                         01940002
                 PERFORM ERROR-RTN                                              
              ELSE                                                              
                PERFORM UPDATE-ACAT-IT-RTN                                      
                PERFORM ERROR-RTN.                                              
                                                                                
           PERFORM ERROR-RTN.                                                   
LRM003 SEND-EXCEPTION-RTN.                                              02790002
           MOVE SPACES TO ACAT90CM-TS-AREA.                                     
           MOVE 'X' TO ACAT90CM-TS-SCREEN                                       
           MOVE TWA-ACCT-ACTIVITY-IND  TO ACAT90CM-ACCT-ACTIVITY-IND            
           MOVE TWA-ACCT-ORDERS-IND    TO ACAT90CM-ACCT-ORDERS-IND              
           MOVE ' '                    TO ACAT90CM-ACCT-RJCT-RSBM-IND           
           MOVE TWA-ACCT-DB-BAL-T1-IND TO ACAT90CM-ACCT-DB-BAL-T1-IND           
           MOVE TWA-ACCT-MRGN-DB-IND   TO ACAT90CM-ACCT-MRGN-DB-IND             
           MOVE TWA-ACCT-SHRT-PSTN-IND TO ACAT90CM-ACCT-SHRT-PSTN-IND           
           MOVE TWA-ACCT-SEC-RSTRD-IND TO ACAT90CM-ACCT-SEC-RSTRD-IND           
           MOVE TWA-ACCT-AST-EXCS-IND  TO ACAT90CM-ACCT-AST-EXCS-IND            
           MOVE TWA-ACCT-OPTN-PSTN-IND TO ACAT90CM-ACCT-OPTN-PSTN-IND           
           MOVE TWA-ACCT-LTD-PRTNR-IND TO ACAT90CM-ACCT-LTD-PRTNR-IND           
           MOVE TWA-ACCT-TIN-MSMTH-IND TO ACAT90CM-ACCT-TIN-MSMTH-IND           
           MOVE TWA-ACCT-DPLCT-TRN-IND TO ACAT90CM-ACCT-DPLCT-TRN-IND           
           MOVE TWA-ACCT-CUST-70-IND   TO ACAT90CM-ACCT-CUST-70-IND             
           MOVE TWA-ACCT-QULFD-PLN-IND TO ACAT90CM-ACCT-QULFD-PLN-IND           
           MOVE TWA-ACCT-MNGD-IND      TO ACAT90CM-ACCT-MNGD-IND                
           MOVE TWA-ACCT-PRVT-RNG-IND  TO ACAT90CM-ACCT-PRVT-RNG-IND            
           MOVE TWA-ACCT-BRKR-TIF-IND  TO ACAT90CM-ACCT-BRKR-TIF-IND            
           MOVE TWA-NSCC-NON-ADP-IND   TO ACAT90CM-NSCC-NON-ADP-IND             
           MOVE TWA-COMMENTS-IND       TO ACAT90CM-COMMENTS-IND                 
LRM003     IF TWA-TRNFR-TYPE-RJCT-CD = '02'                                     
              MOVE 'Y'                 TO ACAT90CM-CUST-TYPE-MISMATCH           
           END-IF                                                               
           IF TWA-TRNFR-RJC1-CD = 'SP'                                          
              MOVE 'Y'                TO ACAT90CM-SPECIAL-ACCOUNT-IND           
           END-IF                                                               
           IF TWA-TRNFR-RJC2-CD = 'F'                                           
              MOVE 'Y'                 TO ACAT90CM-ACCOUNT-FLAT-IND             
LRM008     ELSE                                                                 
LRM008        MOVE TWA-TRNFR-RJC2-CD   TO ACAT90CM-ACCOUNT-FLAT-IND             
LRM008     END-IF                                                               
           MOVE TWA-TRNFR-ACCT-RB-SEC-IND     TO                                
                                     ACAT90CM-RB-RESTRICTED-SEC-IND             
           MOVE TWA-TRNFR-ACCT-CLT-RSCND-IND  TO                                
                                     ACAT90CM-RB-CLIENT-RESCIND-IND             
           MOVE TWA-TRNFR-ACCT-LGL-BLK-IND    TO                                
                                     ACAT90CM-RB-LEGAL-BLOCK-IND.               
LRM017     MOVE TWA-ORIG-FREEZE-IND TO ACAT90CM-BATCH-FREEZE-FND-IND.           
LRM017     IF TWA-FREEZE-CASH-CREDIT = 'Y'                                      
LRM017     AND TWA-FREEZE-CASH-DEBIT = 'Y'                                      
LRM017     AND TWA-FREEZE-SEC-LONG   = 'Y'                                      
LRM017     AND TWA-FREEZE-SEC-SHORT  = 'Y'                                      
LRM017        SET ACAT90CM-ACCOUNT-FULL-FREEZE TO TRUE                          
LRM017     END-IF.                                                              
LRM017     MOVE TWA-FREEZE-CASH-CREDIT TO ACAT90CM-FREEZE-CASH-IN-IND           
LRM017     MOVE TWA-FREEZE-CASH-DEBIT TO ACAT90CM-FREEZE-CASH-OUT-IND           
LRM017     MOVE TWA-FREEZE-SEC-LONG   TO ACAT90CM-FREEZE-SEC-IN-IND             
LRM017     MOVE TWA-FREEZE-SEC-SHORT  TO ACAT90CM-FREEZE-SEC-OUT-IND            
           MOVE 'X' TO TWA-SCREEN                                               
           PERFORM WRITE-TSQ-RTN.                                       10790002
           MOVE 'J' TO ACAT-INP-SEL.                                            
           PERFORM WRITE-ACAT90CM-TS-RTN.                                       
           MOVE '$' TO WS-ACAT-NEXT.                                            
           MOVE 'ACAT90CM' TO CALLED-PROGRAM-NAME.                              
           PERFORM INVOKE-DETAIL-PROGRAM-RTN.                           07225010
LRM010 0630-BUILD-ACATFIO-TS-RTN.                                               
LRM010     MOVE TWA-CLIENT-NO-X      TO  ACATFIO-CLIENT-NBR.                    
LRM010     MOVE ACAT-ADP-BROKER      TO  ACATFIO-DLVR-NBR.                      
LRM010     MOVE TWA-MCBRKR           TO  ACATFIO-RCV-NBR.                       
LRM010     MOVE TWA-DLVR-ACCT        TO  ACATFIO-ACCT-DLVR-NBR.                 
LRM010     MOVE TWA-MCACCT           TO  ACATFIO-ACCT-RCV-NBR.                  
LRM028     MOVE TWA-ISIN-CNTRY-CD    TO  ACATFIO-ISIN-CNTRY-CD.                 
LRM010     MOVE TWA-MSECR            TO  ACATFIO-ISIN-SEC-ISSUE-CD.             
LRM010     MOVE SPACE                TO  ACATFIO-ISIN-SEC-CDG-CD.               
LRM010     MOVE TWA-MSLOC            TO  ACATFIO-STTLM-LCTN-CD.                 
LRM010     MOVE TWA-SECR-ACTION      TO  ACATFIO-TRANS-TYPE-CD.                 
LRM010     IF TWA-MTYPE = '1'                                                   
LRM010        MOVE 'C'               TO  ACATFIO-CSH-MGN-SHRT-CD                
LRM010     ELSE                                                                 
LRM010     IF TWA-MTYPE = '2'                                                   
LRM010        MOVE 'M'               TO  ACATFIO-CSH-MGN-SHRT-CD                
LRM010     ELSE                                                                 
LRM010        MOVE 'S'               TO  ACATFIO-CSH-MGN-SHRT-CD                
LRM010     END-IF.                                                              
LRM010     MOVE TWA-ADP-NBR          TO  ACATFIO-SECURITY-ADP-NBR.              
LRM010     MOVE TWA-MDESC            TO  ACATFIO-ASSET-DESC-TXT.                
CSG001                                                                          
CSG001* IN SOME CASES MSD DESCRIPTIONS CONTAIN SPECIAL CHARACTERS.              
CSG001* CORRECT THEM BY REPLACING SPECIAL CHARACTERS WITH SPACES.               
CSG001     MOVE TWA-MDESC            TO W-ASSET-DESC-TXT                        
CSG001     MOVE 30                   TO W-SUB3                                  
CSG001     SET W-JUST-LEFT-REQ-Y     TO TRUE                                    
CSG001     PERFORM EDIT-ASSET-DESC-TXT                                          
CSG001     MOVE W-ASSET-DESC-TXT     TO ACATFIO-ASSET-DESC-TXT                  
CSG001                                                                          
LRM010     MOVE TWA-CONTROL-NBR      TO  ACATFIO-ACAT-CONTROL-NBR.              
LRM010     MOVE TWA-ASSET-SEQ        TO  ACATFIO-ASSET-SEQ-NBR.                 
LRM010     MOVE TWA-INP-TFR-TYP      TO  ACATFIO-TRNFR-TYPE-CD.                 
LRM010     IF TWA-STTS-CD = '500'                                               
LRM010     OR ((TWA-INP-TFR-TYP = 'PTD' OR 'PTF')                               
LRM010     AND TWA-STTS-CD = '   ')                                             
LRM010        IF TWA-SECR-ACTION = 'C'                                          
LRM010           SET ACATFIO-UPDATE-ALLOWED TO TRUE                             
LRM010        ELSE                                                              
LRM010           SET ACATFIO-INIT-BROWSE    TO TRUE                             
LRM010     ELSE                                                                 
LRM010        SET ACATFIO-BROWSE-ONLY    TO TRUE                                
LRM010     END-IF.                                                              
LRM010                                                                          
LRM010     PERFORM WRITE-TSQ-RTN.                                           1079
LRM010     MOVE EIBTRMID      TO TERM-ID.                                       
LRM010     MOVE 'AMF5'        TO TRAN-ID.                                       
LRM010     EXEC CICS DELETEQ TS QUEUE(TSQ-NAME)                                 
LRM010     END-EXEC.                                                            
LRM010                                                                          
LRM010     EXEC CICS WRITEQ TS QUEUE(TSQ-NAME)                                  
LRM010               FROM(ACATFIO-COMMAREA)                                     
LRM010               LENGTH(LENGTH OF ACATFIO-COMMAREA)                         
LRM010               ITEM(ITEM-NUM)                                             
LRM010     END-EXEC.                                                            
LRM010     IF EIBRESP NOT = +0                                                  
LRM010        MOVE 'ACAT11PT WRITE TSQ ERROR ON AMF5'                           
LRM010          TO SYSTEM-MSG                                                   
LRM010           SET INPUT-ERROR TO TRUE                                        
LRM010           MOVE SPACES TO TWA-INTRAN-FLAG                         01940002
LRM010           PERFORM ERROR-RTN                                              
LRM010     END-IF.                                                              
LRM010     MOVE '#' TO WS-ACAT-NEXT ACAT-INP-SEL.                               
LRM010     MOVE 'ACAT5FSC' TO CALLED-PROGRAM-NAME.                              
LRM010     PERFORM INVOKE-DETAIL-PROGRAM-RTN.                                   
LRM010     MOVE -1 TO MNEXTL.                                                   
LRM010     PERFORM ERROR-RTN.                                                   
LRM010     PERFORM PROCESS-JUMP-RTN.                                            
040200                                                                  04560002
040300 EJECT                                                            04570002
040300 PROCESS-JUMP-RTN.                                                04570002
           MOVE 'ACAT11PT' TO ACAT-CALLING-PROG-NAME.                           
           MOVE ACAT-INP-SEL   TO WS-ACAT-NEXT.                                 
           MOVE 'J'            TO ACAT-NEXT ACAT-INP-SEL.                       
  *****    MOVE ACAT-COMMON-WORK-AREA TO ACAT-SUM-RESTORE-AREA                  
  *****                                  ACAT-NFD-RESTORE-AREA.                 
           PERFORM SCREEN-SECURITY-CHECK.                                       
                                                                                
       COPY ACATJUMP.                                                           
           IF CALLED-PROGRAM-NAME = SPACES                                      
              MOVE -1             TO MNEXTL                                     
              MOVE ATT-UNPROT-BRT TO MNEXTA                                     
              MOVE 'NEXT TRANSACTION SELECTION IS INVALID' TO                   
                  SYSTEM-MSG                                                    
              MOVE SPACES     TO ACAT-CALLING-PROG-NAME                         
              PERFORM ERROR-RTN.                                                
                                                                                
           MOVE -1 TO MNEXTL.                                                   
           MOVE WS-ACAT-NEXT         TO ACAT-INP-SEL ACAT-NEXT.                 
           PERFORM INVOKE-DETAIL-PROGRAM-RTN.                                   
           MOVE -1 TO MNEXTL.                                                   
           PERFORM ERROR-RTN.                                                   
                                                                        04770310
       SCREEN-SECURITY-CHECK.                                                   
           IF  ACAT-SUPER-SIGN-ON-UPDATE                                        
           OR  ACAT-SUPER-SIGN-ON-BROWSE                                        
           OR  ACAT-JUMP-ANYWHERE                                               
           OR  WS-ACAT-NEXT = '$'                                               
               CONTINUE                                                         
           ELSE                                                                 
               MOVE WS-ACAT-NEXT TO ACAT-SCREEN-IND                             
               SET ACAT-UPDATE-MODE TO TRUE                                     
               MOVE SPACES    TO SECLINK-LIST                           AEISAC07
               MOVE '2'       TO SECLINK-ACTION-CODE                    AEISAC07
               MOVE 'SCON'    TO SECLINK-TYPE                                   
               MOVE ACAT-SEC-LIT TO SECLINK-ITEM                                
               PERFORM CALL-SECLINK-RTN                                 AEISAC07
               IF SECLINK-RETURN-CODE = '00' OR '20'                    AEISAC07
                  MOVE SECLINK-USER-ID TO ACAT-SIGN-ON-ID                       
               ELSE                                                             
                  SET ACAT-BROWSE-MODE TO TRUE                                  
                  MOVE SPACES    TO SECLINK-LIST                        AEISAC07
                  MOVE '2'       TO SECLINK-ACTION-CODE                 AEISAC07
                  MOVE 'SCON'    TO SECLINK-TYPE                                
                  MOVE ACAT-SEC-LIT TO SECLINK-ITEM                             
                  PERFORM CALL-SECLINK-RTN                              AEISAC07
                  IF SECLINK-RETURN-CODE = '00' OR '20'                 AEISAC07
                     MOVE SPACE TO ACAT-SIGN-ON-SEC-FLAG                        
                  ELSE                                                          
                     MOVE 'USER NOT AUTHORIZED TO USE NEXT SELECTION '  AEISAC07
                          TO SYSTEM-MSG                                 AEISAC07
                     MOVE WS-ACAT-NEXT                                  AEISAC07
                          TO SYSTEM-MSG(44 : 1)                         AEISAC07
                     MOVE -1             TO MNEXTL                              
                     MOVE ATT-UNPROT-BRT TO MNEXTA                              
                     PERFORM ERROR-RTN                                          
                  END-IF                                                        
               END-IF                                                           
           END-IF.                                                              
       EJECT                                                            04770210
                                                                        04770310
   100 EDIT-INPUT-BRW-RTN.                                              04800010
      *    MOVE TWA-INTRAN-FLAG TO SAVE-INTRAN-FLAG.                    04812002
           IF MMRRL > 0                                                 04809210
              MOVE MMRRI TO    ACAT-INP-RR                                      
           ELSE                                                         04809510
           IF MMRRA = ERASE-KEY                                         04809610
                 MOVE SPACES TO ACAT-INP-RR                             04809710
           END-IF END-IF.                                               04809910
                                                                                
           IF MMTFRL > 0                                                04809210
              MOVE MMTFRI TO   TWA-INP-TFR-TYP                                  
           ELSE                                                         04809510
           IF MMTFRA = ERASE-KEY                                        04809610
                 MOVE SPACES TO TWA-INP-TFR-TYP                         04809710
           END-IF END-IF.                                               04809910
                                                                                
           IF MMRDL > 0                                                 04809210
              MOVE MMRDI TO    ACAT-INP-RCV-DEL                                 
           ELSE                                                         04809510
           IF MMRDA = ERASE-KEY                                         04809610
                 MOVE SPACES TO ACAT-INP-RCV-DEL                        04809710
           END-IF END-IF.                                               04809910
                                                                                
           IF MMBKRL > 0                                                04809210
              MOVE MMBKRI TO   ACAT-INP-CONTRA-BKR                              
           ELSE                                                         04809510
           IF MMBKRA = ERASE-KEY                                        04809610
                 MOVE SPACES TO ACAT-INP-CONTRA-BKR                     04809710
           END-IF END-IF.                                               04809910
                                                                                
           IF MMSTATL > 0                                               04809210
LRM008        IF MMSTATI = TWA-MMSTAT                                           
LRM008           CONTINUE                                                       
LRM008        ELSE                                                              
                 MOVE MMSTATI TO  TWA-MMSTAT                                    
LRM008           SET TWA-INTRAN-BRW TO TRUE                             04809410
LRM009           MOVE 'N' TO TWA-EXCEPTION-ONLY-MODE                            
LRM008        END-IF                                                    04809410
           ELSE                                                         04809510
           IF MMSTATA = ERASE-KEY                                       04809610
                 MOVE SPACES TO TWA-MMSTAT                              04809710
LRM008           SET TWA-INTRAN-BRW TO TRUE                             04809410
LRM009           MOVE 'N' TO TWA-EXCEPTION-ONLY-MODE                            
           END-IF END-IF.                                               04809910
                                                                                
           IF MBRL > 0                                                  04809210
              IF MBRI = TWA-MBR                                                 
                 CONTINUE                                                       
              ELSE                                                              
                 MOVE MBRI TO TWA-MBR                                           
                 SET TWA-INTRAN-BRW TO TRUE                             04809410
LRM026           SET WS-NEW-ACCOUNT TO TRUE                                     
              END-IF                                                            
           ELSE                                                         04809510
           IF MBRA = ERASE-KEY                                          04809610
                 MOVE SPACES TO TWA-MBR                                 04809710
                 SET TWA-INTRAN-BRW TO TRUE                             04809810
           END-IF END-IF.                                               04809910
                                                                                
           IF MACL > 0                                                  04809210
              IF MACI = TWA-MAC                                                 
                 CONTINUE                                                       
              ELSE                                                              
                 MOVE MACI TO TWA-MAC                                           
                 SET TWA-INTRAN-BRW TO TRUE                             04809410
LRM026           SET WS-NEW-ACCOUNT TO TRUE                                     
              END-IF                                                            
           ELSE                                                         04809510
           IF MACA = ERASE-KEY                                          04809610
                 MOVE SPACES TO TWA-MAC                                 04809710
                 SET TWA-INTRAN-BRW TO TRUE                             04809810
           END-IF END-IF.                                               04809910
                                                                                
           IF MMSDL > 0                                                         
              MOVE MMSDI TO    ACAT-INP-STTL-DT                                 
           ELSE                                                                 
           IF MMSDA = ERASE-KEY                                                 
                 MOVE SPACES TO ACAT-INP-STTL-DT                                
           END-IF END-IF.                                                       
                                                                                
           IF MMBRL > 0                                                 04809210
              IF MMBRI = ACAT-INP-BRANCH                                        
                 CONTINUE                                                       
              ELSE                                                              
                 MOVE MMBRI TO ACAT-INP-BRANCH                                  
                 SET TWA-INTRAN-BRW TO TRUE                             04809410
LRM009           SET WS-NEW-ACCOUNT TO TRUE                             04809410
LRM006           MOVE LOW-VALUES TO TWA-CONTROL-NBR                             
              END-IF                                                            
           ELSE                                                         04809510
           IF MMBRA = ERASE-KEY                                         04809610
                 MOVE SPACES TO ACAT-INP-BRANCH                         04809710
                 SET TWA-INTRAN-BRW TO TRUE                             04809810
LRM009           SET WS-NEW-ACCOUNT TO TRUE                             04809410
LRM006           MOVE LOW-VALUES TO TWA-CONTROL-NBR                             
           END-IF END-IF.                                               04809910
                                                                                
           IF MMACL > 0                                                 04809210
              IF MMACI = ACAT-INP-ACCOUNT                                       
                 CONTINUE                                                       
              ELSE                                                              
                 MOVE MMACI TO ACAT-INP-ACCOUNT                                 
                 SET TWA-INTRAN-BRW TO TRUE                             04809410
LRM006           MOVE LOW-VALUES TO TWA-CONTROL-NBR                             
LRM009           SET WS-NEW-ACCOUNT TO TRUE                             04809410
              END-IF                                                            
           ELSE                                                         04809510
           IF MMACA = ERASE-KEY                                         04809610
                 MOVE SPACES TO ACAT-INP-ACCOUNT                        04809710
                 SET TWA-INTRAN-BRW TO TRUE                             04809810
LRM006           MOVE LOW-VALUES TO TWA-CONTROL-NBR                             
LRM009           SET WS-NEW-ACCOUNT TO TRUE                             04809410
           END-IF END-IF.                                               04809910
                                                                                
           IF MMBKRL > 0                                                04809210
              IF MMBKRI = ACAT-INP-CONTRA-BKR                                   
                 CONTINUE                                                       
              ELSE                                                              
                 MOVE MMBKRI TO ACAT-INP-CONTRA-BKR                             
LRM006***        SET TWA-INTRAN-BRW TO TRUE                             04809410
              END-IF                                                            
           ELSE                                                         04809510
           IF MMBKRA = ERASE-KEY                                        04809610
                 MOVE SPACES TO ACAT-INP-CONTRA-BKR                     04809710
LRM006***        SET TWA-INTRAN-BRW TO TRUE                             04809810
           END-IF END-IF.                                               04809910
                                                                                
           IF MMRRL > 0                                                 04809210
              IF MMRRI = ACAT-INP-RR                                            
                 CONTINUE                                                       
              ELSE                                                              
                 MOVE MMRRI TO ACAT-INP-RR                                      
LRM006***        SET TWA-INTRAN-BRW TO TRUE                             04809410
              END-IF                                                            
           ELSE                                                         04809510
           IF MMRRA = ERASE-KEY                                         04809610
                 MOVE SPACES TO ACAT-INP-RR                             04809710
LRM006***        SET TWA-INTRAN-BRW TO TRUE                             04809810
           END-IF END-IF.                                               04809910
                                                                                
           IF MMTFRL > 0                                                04809210
              IF MMTFRI = TWA-INP-TFR-TYP                                       
                 CONTINUE                                                       
              ELSE                                                              
                 MOVE MMTFRI TO TWA-INP-TFR-TYP                                 
LRM006           SET TWA-INTRAN-BRW TO TRUE                             04809410
              END-IF                                                            
           ELSE                                                         04809510
           IF MMTFRA = ERASE-KEY                                        04809610
                 MOVE SPACES TO TWA-INP-TFR-TYP                         04809710
LRM006           SET TWA-INTRAN-BRW TO TRUE                             04809810
           END-IF END-IF.                                               04809910
                                                                                
           IF MMSTATL > 0                                               04809210
              IF MMSTATI = ACAT-INP-STATUS                                      
                 CONTINUE                                                       
              ELSE                                                              
                 MOVE MMSTATI TO ACAT-INP-STATUS                                
                 SET TWA-INTRAN-BRW TO TRUE                             04809410
              END-IF                                                            
           ELSE                                                         04809510
           IF MMSTATA = ERASE-KEY                                       04809610
                 MOVE SPACES TO ACAT-INP-STATUS                         04809710
LRM006           SET TWA-INTRAN-BRW TO TRUE                             04809810
LRM009           SET WS-NEW-ACCOUNT TO TRUE                             04809410
           END-IF END-IF.                                               04809910
                                                                                
CSG001 EDIT-ASSET-DESC-TXT.                                                     
CSG001* MOVE SPACES FOR THE SPECIAL CHARACTERS FOUND IN ASSET-DESC-TXT.         
CSG001* AND LEFT JUSTIFY THE DESCRIPTIONS.                                      
CSG001     MOVE SPACES                   TO W-EDIT-ASSET-DESC-TXT-FLAG          
CSG001     PERFORM                                                              
CSG001         VARYING W-SUB2 FROM 1 BY 1                                       
CSG001           UNTIL W-SUB2 > W-SUB3                                          
CSG001            MOVE W-ASSET-DESC-TXT(W-SUB2:1)                               
CSG001                                   TO W-EDIT-CHAR-AREA2                   
CSG001         IF NOT W-VALID-CHARACTER2                                        
CSG001            MOVE SPACES            TO W-ASSET-DESC-TXT(W-SUB2:1)          
CSG001            SET W-EDIT-ASSET-DESC-TXT-Y  TO TRUE                          
CSG001         END-IF                                                           
CSG001     END-PERFORM                                                          
CSG001*                                                                         
CSG001     IF W-JUST-LEFT-REQ-Y                                                 
CSG001        IF W-EDIT-ASSET-DESC-TXT-Y AND                                    
CSG001           W-ASSET-DESC-TXT(1:1) = SPACES                                 
CSG001           SET W-JUST-LEFT-NOT-DONE   TO TRUE                             
CSG001           PERFORM                                                        
CSG001             VARYING W-SUB2 FROM 2 BY 1                                   
CSG001               UNTIL W-SUB2 > 30 OR W-JUST-LEFT-DONE                      
CSG001             IF W-ASSET-DESC-TXT(W-SUB2 : 1) NOT = SPACES                 
CSG001                MOVE SPACES               TO W-ASSET-DESC-TMP             
CSG001                MOVE W-ASSET-DESC-TXT(W-SUB2 : )                          
CSG001                                          TO W-ASSET-DESC-TMP             
CSG001                MOVE W-ASSET-DESC-TMP     TO W-ASSET-DESC-TXT             
CSG001                SET W-JUST-LEFT-DONE      TO TRUE                         
CSG001             END-IF                                                       
CSG001           END-PERFORM                                                    
CSG001        END-IF                                                            
CSG001        MOVE SPACES                       TO W-JUST-LEFT-REQ-FLAG         
CSG001     END-IF                                                               
CSG001                                                                          
CSG001     MOVE 0  TO W-SUB3.                                                   
                                                                                
062900 MERGE-MAP-DTL-RTN.                                               06100002
           IF MCBRKRL > 0                                               04809210
              IF MCBRKRI = TWA-MCBRKR                                           
                 CONTINUE                                                       
              ELSE                                                              
                 MOVE MCBRKRI TO TWA-MCBRKR                                     
           ELSE                                                         04809510
           IF MCBRKRA = ERASE-KEY                                       04809610
                 MOVE SPACES TO TWA-MCBRKR                              04809710
           END-IF END-IF.                                               04809910
                                                                                
           IF MCACCTL > 0                                               04809210
              IF MCACCTI = TWA-MCACCT                                           
                 CONTINUE                                                       
              ELSE                                                              
                 MOVE MCACCTI(1 : MCACCTL) TO TWA-MCACCT                        
           ELSE                                                         04809510
           IF MCACCTA = ERASE-KEY                                       04809610
                 MOVE SPACES TO TWA-MCACCT                              04809710
           END-IF END-IF.                                               04809910
                                                                                
           PERFORM                                                              
               VARYING SUB2 FROM 1 BY 1                                         
                  UNTIL SUB2 > 20                                               
              IF TWA-MCACCT(SUB2 : 1) < SPACES                                  
                 MOVE SPACES TO TWA-MCACCT(SUB2 : 1)                            
              END-IF                                                            
           END-PERFORM.                                                         
                                                                                
           IF MCTYPEL > 0                                               04809210
LRM027        IF MCTYPEI NOT = TWA-MCTYPE                                       
LRM027           SET ACCOUNT-TYPE-CHANGED TO TRUE                               
                 MOVE MCTYPEI TO TWA-MCTYPE                                     
LRM027        END-IF                                                            
           ELSE                                                         04809510
           IF MCTYPEA = ERASE-KEY                                       04809610
                 MOVE SPACES TO TWA-MCTYPE                              04809710
           END-IF END-IF.                                               04809910
                                                                                
           IF MCBNAML > 0                                               04809210
              MOVE MCBNAMI TO TWA-MCBNAM                                        
           ELSE                                                         04809510
           IF MCBNAMA = ERASE-KEY                                       04809610
                 MOVE SPACES TO TWA-MCBNAM                              04809710
           END-IF END-IF.                                               04809910
                                                                                
           IF MNAMEL > 0                                                04809210
              MOVE MNAMEI(1 : MNAMEL) TO TWA-MNAME                              
           ELSE                                                         04809510
           IF MNAMEA = ERASE-KEY                                        04809610
                 MOVE SPACES TO TWA-MNAME                               04809710
           END-IF END-IF.                                               04809910
                                                                                
           PERFORM                                                              
               VARYING SUB2 FROM 1 BY 1                                         
                  UNTIL SUB2 > 30                                               
              IF TWA-MNAME(SUB2 : 1) < SPACES                                   
                 MOVE SPACES TO TWA-MNAME(SUB2 : 1)                             
              END-IF                                                            
              IF TWA-MNAME2(SUB2 : 1) < SPACES                                  
                 MOVE SPACES TO TWA-MNAME2(SUB2 : 1)                            
              END-IF                                                            
           END-PERFORM.                                                         
           IF MNAME2L > 0                                               04809210
              MOVE MNAME2I(1 : MNAME2L) TO TWA-MNAME2                           
           ELSE                                                         04809510
           IF MNAME2A = ERASE-KEY                                       04809610
                 MOVE SPACES TO TWA-MNAME2                              04809710
           END-IF END-IF.                                               04809910
                                                                                
           IF MSSNL > 0                                                 04809210
              MOVE MSSNI(1 : MSSNL) TO TWA-MSSN                                 
           ELSE                                                         04809510
           IF MSSNA = ERASE-KEY                                         04809610
                 MOVE SPACES TO TWA-MSSN                                04809710
           END-IF END-IF.                                               04809910
                                                                                
LRM021     IF GIFTINDL > 0                                              04809210
LRM021        MOVE GIFTINDI TO TWA-GIFT-IND                                     
LRM021     ELSE                                                         04809510
LRM021     IF GIFTINDA = ERASE-KEY                                      04809610
LRM021           MOVE SPACES TO TWA-GIFT-IND                            04809710
LRM021     END-IF END-IF.                                               04809910
LRM021                                                                          
           IF MSSN2L > 0                                                04809210
              MOVE MSSN2I(1 : MSSN2L) TO TWA-MSSN2                              
           ELSE                                                         04809510
           IF MSSN2A = ERASE-KEY                                        04809610
                 MOVE SPACES TO TWA-MSSN2                               04809710
           END-IF END-IF.                                               04809910
                                                                                
           IF MACATL > 0                                                04809210
              IF MACATI NOT = TWA-MACAT                                         
                 MOVE MACATI TO TWA-MACAT                                       
                 IF TWA-INP-TFR-TYP = 'PTR'                                     
LRM003              PERFORM PAGE-FORWARD-TIF                                    
                 END-IF                                                         
              END-IF                                                            
           ELSE                                                         04809510
           IF MACATA = ERASE-KEY                                        04809610
              IF TWA-MACAT NOT = SPACES                                 04809710
                 MOVE SPACES TO TWA-MACAT                               04809710
                 IF TWA-INP-TFR-TYP = 'PTR'                                     
                    PERFORM PAGE-FORWARD-TIF                                    
                 END-IF                                                         
           END-IF END-IF.                                               04809910
                                                                                
           IF MSTATL > 0                                                04809210
              MOVE MSTATI TO TWA-MSTAT                                          
           ELSE                                                         04809510
           IF MSTATA = ERASE-KEY                                        04809610
                 MOVE SPACES TO TWA-MSTAT                               04809710
           END-IF END-IF.                                               04809910
                                                                                
LRM009     IF TWA-ACTION NOT = 'A'                                      04809810
LRM009     AND TWA-INTRAN-BRW                                           04809810
LRM009        PERFORM PAGE-FORWARD-TIF                                          
LRM009     END-IF.                                                              
     ****** ASSET SECTION                                                       
           IF MBAL01L > 0                                               04809210
              MOVE MBAL01I TO TWA-MBAL01                                        
           ELSE                                                         04809510
           IF MBAL01A = ERASE-KEY                                       04809610
                 MOVE SPACES TO TWA-MBAL01                              04809710
           END-IF END-IF.                                               04809910
                                                                                
           IF MBAL02L > 0                                               04809210
              MOVE MBAL02I TO TWA-MBAL02                                        
           ELSE                                                         04809510
           IF MBAL02A = ERASE-KEY                                       04809610
                 MOVE SPACES TO TWA-MBAL02                              04809710
           END-IF END-IF.                                               04809910
                                                                                
           IF MBAL05L > 0                                               04809210
              MOVE MBAL05I TO TWA-MBAL05                                        
           ELSE                                                         04809510
           IF MBAL05A = ERASE-KEY                                       04809610
                 MOVE SPACES TO TWA-MBAL05                              04809710
           END-IF END-IF.                                               04809910
                                                                                
           IF MSECRL > 0                                                04809210
              MOVE MSECRI TO TWA-MSECR                                          
           ELSE                                                         04809510
           IF MSECRA = ERASE-KEY                                        04809610
                 MOVE SPACES TO TWA-MSECR                               04809710
           END-IF END-IF.                                               04809910
                                                                                
           IF MSLOCL > 0                                                04809210
              MOVE MSLOCI TO TWA-MSLOC                                          
           ELSE                                                         04809510
           IF MSLOCA = ERASE-KEY                                        04809610
                 MOVE SPACES TO TWA-MSLOC                               04809710
           END-IF END-IF.                                               04809910
                                                                                
           IF MCATGRL > 0                                               04809210
              MOVE MCATGRI TO TWA-MCATGR                                        
           ELSE                                                         04809510
           IF MCATGRA = ERASE-KEY                                       04809610
                 MOVE SPACES TO TWA-MCATGR                              04809710
           END-IF END-IF.                                               04809910
                                                                                
*********  IF MACMNTL > 0                                               04809210
*********     MOVE MACMNTI TO TWA-MACMNT                                        
*********  ELSE                                                         04809510
*********  IF MACMNTA = ERASE-KEY                                       04809610
*********        MOVE SPACES TO TWA-MACMNT                              04809710
*********  END-IF END-IF.                                               04809910
                                                                                
           IF MCDL > 0                                                  04809210
              MOVE MCDI TO TWA-MCD                                              
           ELSE                                                         04809510
           IF MCDA = ERASE-KEY                                          04809610
                 MOVE SPACES TO TWA-MCD                                 04809710
           END-IF END-IF.                                               04809910
                                                                                
           IF MQTYL > 0                                                 04809210
              MOVE MQTYI TO TWA-MQTY                                            
           ELSE                                                         04809510
           IF MQTYA = ERASE-KEY                                         04809610
                 MOVE SPACES TO TWA-MQTY                                04809710
           END-IF END-IF.                                               04809910
                                                                                
           IF MAMTL > 0                                                 04809210
              MOVE MAMTI TO TWA-MAMT                                            
           ELSE                                                         04809510
           IF MAMTA = ERASE-KEY                                         04809610
                 MOVE SPACES TO TWA-MAMT                                04809710
           END-IF END-IF.                                               04809910
                                                                                
           IF MDESCL > 0                                                04809210
              MOVE MDESCI(1 : MDESCL) TO TWA-MDESC                              
CSG001* IN SOME CASES MSD DESCRIPTIONS CONTAIN SPECIAL CHARACTERS.              
CSG001* CORRECT THEM BY REPLACING SPECIAL CHARACTERS WITH SPACES.               
CSG001        MOVE TWA-MDESC                 TO W-ASSET-DESC-TXT                
CSG001        MOVE 30                        TO W-SUB3                          
CSG001        SET W-JUST-LEFT-REQ-Y          TO TRUE                            
CSG001        PERFORM EDIT-ASSET-DESC-TXT                                       
CSG001        MOVE W-ASSET-DESC-TXT          TO TWA-MDESC                       
CSG001                                                                          
           ELSE                                                         04809510
           IF MDESCA = ERASE-KEY                                        04809610
                 MOVE SPACES TO TWA-MDESC                               04809710
           END-IF END-IF.                                               04809910
                                                                                
           IF MWIL > 0                                                  04809210
              MOVE MWII TO TWA-MWI                                              
           ELSE                                                         04809510
           IF MWIA = ERASE-KEY                                          04809610
                 MOVE SPACES TO TWA-MWI                                 04809710
           END-IF END-IF.                                               04809910
                                                                                
           IF MMEMOL > 0                                                04809210
              MOVE MMEMOI TO TWA-MMEMO                                          
           ELSE                                                         04809510
           IF MMEMOA = ERASE-KEY                                        04809610
                 MOVE SPACES TO TWA-MMEMO                               04809710
           END-IF END-IF.                                               04809910
                                                                                
           IF SLOCRSNL > 0                                              04809210
              MOVE SLOCRSNI TO TWA-SLOCRSN                                      
           ELSE                                                         04809510
           IF SLOCRSNA = ERASE-KEY                                      04809610
                 MOVE SPACES TO TWA-SLOCRSN                             04809710
           END-IF END-IF.                                               04809910
                                                                                
           IF MTYPEL > 0                                                04809210
              MOVE MTYPEI TO TWA-MTYPE                                          
           ELSE                                                         04809510
           IF MTYPEA = ERASE-KEY                                        04809610
                 MOVE SPACES TO TWA-MTYPE                               04809710
           END-IF END-IF.                                               04809910
                                                                                
LRM035     IF MEXPDTL > 0                                                       
LRM035        MOVE MEXPDTI TO TWA-MEXPDT                                        
LRM035     ELSE                                                                 
LRM035     IF MEXPDTA = ERASE-KEY                                               
LRM035           MOVE SPACES TO TWA-MEXPDT                                      
LRM035     END-IF END-IF.                                                       
LRM035                                                                          
LRM035     IF MCALLL > 0                                                        
LRM035        MOVE MCALLI TO TWA-MCALL                                          
LRM035     ELSE                                                                 
LRM035     IF MCALLA = ERASE-KEY                                                
LRM035           MOVE SPACES TO TWA-MCALL                                       
LRM035     END-IF END-IF.                                                       
LRM035                                                                          
LRM035     IF MLONGL > 0                                                        
LRM035        MOVE MLONGI TO TWA-MLONG                                          
LRM035     ELSE                                                                 
LRM035     IF MLONGA = ERASE-KEY                                                
LRM035           MOVE SPACES TO TWA-MLONG                                       
LRM035     END-IF END-IF.                                                       
LRM035                                                                          
LRM035     IF MSTRIKEL > 0                                                      
LRM035        MOVE MSTRIKEI TO TWA-MSTRIKE                                      
LRM035     ELSE                                                                 
LRM035     IF MSTRIKEA = ERASE-KEY                                              
LRM035           MOVE SPACES TO TWA-MSTRIKE                                     
LRM035     END-IF END-IF.                                                       
                                                                                
           IF MDESC2L > 0                                               04809210
              MOVE MDESC2I(1 : MDESC2L) TO TWA-MDESC2                           
CSG001        MOVE TWA-MDESC2                TO W-ASSET-DESC-TXT                
CSG001        MOVE 30                        TO W-SUB3                          
CSG001        SET W-JUST-LEFT-REQ-N     TO TRUE                                 
CSG001        PERFORM EDIT-ASSET-DESC-TXT                                       
CSG001        MOVE W-ASSET-DESC-TXT          TO TWA-MDESC2                      
           ELSE                                                         04809510
           IF MDESC2A = ERASE-KEY                                       04809610
                 MOVE SPACES TO TWA-MDESC2                              04809710
           END-IF END-IF.                                               04809910
                                                                                
           IF MDESC3L > 0                                               04809210
              MOVE MDESC3I(1 : MDESC3L) TO TWA-MDESC3                           
CSG001        MOVE TWA-MDESC3                TO W-ASSET-DESC-TXT                
CSG001        MOVE 30                        TO W-SUB3                          
CSG001        SET W-JUST-LEFT-REQ-N     TO TRUE                                 
CSG001        PERFORM EDIT-ASSET-DESC-TXT                                       
CSG001        MOVE W-ASSET-DESC-TXT          TO TWA-MDESC3                      
           ELSE                                                         04809510
           IF MDESC3A = ERASE-KEY                                       04809610
                 MOVE SPACES TO TWA-MDESC3                              04809710
           END-IF END-IF.                                               04809910
                                                                                
062900 MERGE-MAP-NEXT-RTN.                                              06100002
           IF MNEXTL > 0                                                04809210
              MOVE MNEXTI TO TWA-MNEXT                                          
           ELSE                                                         04809510
           IF MNEXTA = ERASE-KEY                                        04809610
                 MOVE SPACES TO TWA-MNEXT                               04809710
           END-IF END-IF.                                               04809910
                                                                                
           IF MSUBML > 0                                                04809210
              MOVE MSUBMI TO TWA-MSUBM                                          
           ELSE                                                         04809510
           IF MSUBMA = ERASE-KEY                                        04809610
                 MOVE SPACES TO TWA-MSUBM                               04809710
           END-IF END-IF.                                               04809910
                                                                                
           IF MCMNTL > 0                                                04809210
              MOVE MCMNTI TO TWA-MCMNT                                          
           ELSE                                                         04809510
           IF MCMNTA = ERASE-KEY                                        04809610
                 MOVE SPACES TO TWA-MCMNT                               04809710
           END-IF END-IF.                                               04809910
                                                                                
           IF MREJL > 0                                                 04809210
              MOVE MREJI TO TWA-MREJ                                            
           ELSE                                                         04809510
           IF MREJA = ERASE-KEY                                         04809610
                 MOVE SPACES TO TWA-MREJ                                04809710
           END-IF END-IF.                                               04809910
                                                                                
           IF MDELL > 0                                                 04809210
              MOVE MDELI TO TWA-MDEL                                            
           ELSE                                                         04809510
           IF MDELA = ERASE-KEY                                         04809610
                 MOVE SPACES TO TWA-MDEL                                04809710
           END-IF END-IF.                                               04809910
                                                                                
       EJECT                                                                    
       MOVE-ACAT11IO-TO-TWA-RTN.                                                
           MOVE ACAT11IO-RCV-NBR    TO TWA-MCBRKR                               
                                       TWA-ORIG-RCV-NBR.                        
           MOVE ACAT11IO-RCV-ACCT   TO TWA-MCACCT                               
                                       TWA-ORIG-RCV-ACCT.                       
           MOVE ACAT11IO-DLVR-ACCT  TO TWA-DLVR-ACCT                            
                                       TWA-MBR                                  
                                       ACAT-BR.                         02030002
           MOVE ACAT11IO-DLVR-ACCT(4 : 5) TO TWA-MAC                            
                                             ACAT-AC.                           
           MOVE ACAT11IO-RR-CD            TO TWA-MRR.                           
           MOVE ACAT11IO-CMNT-TXT TO TWA-MCCMNT-X120.                           
           MOVE ACAT11IO-CONTRA-CMNTM-FND TO TWA-CONTRA-CMNTM-FND               
           MOVE ACAT11IO-ASSET-CMNT1-TXT TO TWA-M1CMNT-X120.                    
           MOVE ACAT11IO-ASSET-CMNT2-TXT TO TWA-M2CMNT-X120.                    
           MOVE ACAT11IO-ASSET-CMNT5-TXT TO TWA-M5CMNT-X120.                    
           MOVE ACAT11IO-ASSET-CMNTM-TXT TO TWA-MMCMNT-X120.                    
           MOVE ACAT11IO-RCV-ACCT-TYPE-CD TO TWA-MCTYPE.                02030002
           MOVE ACAT11IO-RCV-CUST-NM            TO TWA-MNAME.           02030002
           MOVE ACAT11IO-RCV-CUST-NM(31 : 30)   TO TWA-MNAME2.          02030002
           MOVE ACAT11IO-RCV-SS-PRIM-NBR(1 : 3) TO TWA-MSSN.            02030002
           MOVE ACAT11IO-RCV-SS-PRIM-NBR(4 : 2) TO TWA-MSSN(5 : 2).     02030002
           MOVE ACAT11IO-RCV-SS-PRIM-NBR(6 : 4) TO TWA-MSSN(8 : 4).     02030002
           MOVE '-'                             TO TWA-MSSN(4 : 1)      02030002
                                                   TWA-MSSN(7 : 1).     02030002
           IF ACAT11IO-RCV-SS-SCNDY-NBR NOT GREATER SPACES                      
              MOVE SPACES TO TWA-MSSN2                                          
           ELSE                                                                 
              MOVE ACAT11IO-RCV-SS-SCNDY-NBR(1 : 3) TO TWA-MSSN2                
              MOVE ACAT11IO-RCV-SS-SCNDY-NBR(4 : 2) TO TWA-MSSN2(5 : 2)         
              MOVE ACAT11IO-RCV-SS-SCNDY-NBR(6 : 4) TO TWA-MSSN2(8 : 4)         
              MOVE '-'                              TO TWA-MSSN2(4 : 1) 02030002
                                                       TWA-MSSN2(7 : 1) 02030002
           END-IF.                                                              
           MOVE ACAT11IO-TRNFR-TYPE-CD TO TWA-TRNFR-TYPE-CD  MMTFRO             
                                          TWA-INP-TFR-TYP.                      
           MOVE ACAT11IO-STTS-CD       TO TWA-STTS-CD.                          
           MOVE SPACES TO TWA-MSUBM.                                    02030002
LRM003     MOVE SPACES TO TWA-MDEL.                                     02030002
           IF TWA-INP-TFR-TYP = 'PTR'                                           
LRM003     AND (TWA-STTS-CD = '500' OR '510')                                   
LRM003     AND (ACAT11IO-REJECT-CODE > '00'                                     
LRM003       OR ACAT11IO-ACCT-RJCT-RSBM-IND = 'S')                              
              IF (ACAT11IO-NSCC-SUBMIT-ELIGIBLE                                 
LRM003        OR ACAT11IO-NSCC-SUBMITTED)                                       
                 MOVE 'Y'   TO TWA-MSUBM                                02030002
LRM032           IF WS-TIME-HHMM > WS-CYCLE3-HHMM                               
LRM022           AND TWA-STTLM-TM-CD = 'L'                                      
LRM022              MOVE 'WARNING-PAST CUTOFF TIME;SUBMITTING WILL CAUSE        
LRM022-                    ' NSCC ERROR' TO SYSTEM-MSG                          
LRM022           END-IF                                                         
              ELSE                                                              
                 MOVE ' '   TO TWA-MSUBM                                02030002
              END-IF                                                            
LRM003     END-IF.                                                              
LRM003     IF TWA-INP-TFR-TYP = 'PTR'                                           
LRM003        IF ACAT11IO-ACCT-RJCT-RSBM-IND = 'S'                              
LRM003           SET TWA-PTR-BEEN-FLIPPED TO TRUE                               
LRM003        ELSE                                                              
LRM003           MOVE 'Y' TO TWA-ACTIVE-DB                                      
           ELSE                                                                 
           IF (TWA-INP-TFR-TYP = 'PTD' OR 'PTF')                                
           AND (ACAT11IO-NSCC-SUBMIT-ELIGIBLE                                   
LRM003     OR ACAT11IO-NSCC-SUBMITTED)                                          
              MOVE 'Y'   TO TWA-MSUBM                                   02030002
           ELSE                                                                 
              MOVE SPACES TO TWA-MSUBM                                          
           END-IF.                                                              
           MOVE ACAT11IO-CONTROL-NBR TO TWA-CONTROL-NBR.                        
LRM017     MOVE ACAT11IO-VTRNFR-FREEZE-IND TO TWA-ORIG-FREEZE-IND.              
                                                                                
LRM015     IF ACAT11IO-AMT-01-RQST-CD = 'F'                                     
LRM015        MOVE 'F' TO TWA-MBAL01-PCT-IND                                    
LRM015                    TWA-MBAL01-RQST-CD                                    
LRM015        MOVE ACAT11IO-AMT-01-CREDIT-IND TO TWA-MBAL01-CREDIT-IND          
LRM015        MOVE ZEROS              TO TWA-MBAL01-9                           
LRM015     ELSE                                                                 
LRM015        MOVE ' ' TO TWA-MBAL01-RQST-CD                                    
LRM005        IF ACAT11IO-PCT-01 > 0.00                                         
LRM005           MOVE ACAT11IO-PCT-01    TO TWA-MBAL01-9                        
LRM005           MOVE 'Y' TO TWA-MBAL01-PCT-IND                                 
LRM005        ELSE                                                              
                 MOVE ACAT11IO-AMT-01    TO TWA-MBAL01-9                        
LRM005           MOVE ' ' TO TWA-MBAL01-PCT-IND                                 
LRM005     END-IF.                                                              
           IF ACAT11IO-AMT-01-CREDIT                                            
              COMPUTE TWA-MBAL01-9 = TWA-MBAL01-9 * -1                          
              END-COMPUTE.                                                      
LRM015     IF ACAT11IO-AMT-02-RQST-CD = 'F'                                     
LRM015        MOVE 'F' TO TWA-MBAL02-PCT-IND                                    
LRM015                    TWA-MBAL02-RQST-CD                                    
LRM015        MOVE ACAT11IO-AMT-02-CREDIT-IND TO TWA-MBAL02-CREDIT-IND          
LRM015        MOVE ZEROS              TO TWA-MBAL02-9                           
LRM015     ELSE                                                                 
LRM015        MOVE ' ' TO TWA-MBAL02-RQST-CD                                    
LRM005        IF ACAT11IO-PCT-02 > 0.00                                         
LRM005           MOVE ACAT11IO-PCT-02    TO TWA-MBAL02-9                        
LRM005           MOVE 'Y' TO TWA-MBAL02-PCT-IND                                 
LRM005        ELSE                                                              
                 MOVE ACAT11IO-AMT-02    TO TWA-MBAL02-9                        
LRM005           MOVE ' ' TO TWA-MBAL02-PCT-IND                                 
LRM005     END-IF.                                                              
           IF ACAT11IO-AMT-02-CREDIT                                            
              COMPUTE TWA-MBAL02-9 = TWA-MBAL02-9 * -1                          
              END-COMPUTE.                                                      
LRM015     IF ACAT11IO-AMT-05-RQST-CD = 'F'                                     
LRM015        MOVE 'F' TO TWA-MBAL05-PCT-IND                                    
LRM015                    TWA-MBAL05-RQST-CD                                    
LRM015        MOVE ACAT11IO-AMT-05-CREDIT-IND TO TWA-MBAL05-CREDIT-IND          
LRM015        MOVE ZEROS              TO TWA-MBAL05-9                           
LRM015     ELSE                                                                 
LRM015        MOVE ' ' TO TWA-MBAL05-RQST-CD                                    
LRM005        IF ACAT11IO-PCT-05 > 0.00                                         
LRM005           MOVE ACAT11IO-PCT-05    TO TWA-MBAL05-9                        
LRM005           MOVE 'Y' TO TWA-MBAL05-PCT-IND                                 
LRM005        ELSE                                                              
                 MOVE ACAT11IO-AMT-05    TO TWA-MBAL05-9                        
LRM005           MOVE ' ' TO TWA-MBAL05-PCT-IND                                 
LRM005     END-IF.                                                              
           IF ACAT11IO-AMT-05-CREDIT                                            
              COMPUTE TWA-MBAL05-9 = TWA-MBAL05-9 * -1                          
              END-COMPUTE.                                                      
           MOVE ACAT11IO-UPDT-TMSTP TO TWA-UPDT-TMSTP.                          
           IF TWA-INP-TFR-TYP = 'PTR'                                           
              MOVE ACAT11IO-RCV-OCC-BRKR-NBR TO TWA-OCC-BRKR                    
           ELSE                                                                 
LRM003        MOVE SPACES                    TO TWA-OCC-BRKR                    
LRM003****    MOVE '0'                       TO TWA-OCC-BRKR(1 : 1)             
LRM003****    MOVE ACAT11IO-RCV-NBR          TO TWA-OCC-BRKR(2 : 4)             
           END-IF.                                                              
LRM003     MOVE ACAT11IO-REJECT-CODE         TO TWA-MREJ TWA-ORIG-MREJ.         
LRM003     IF TWA-MREJ > '00'                                                   
LRM003        MOVE ACAT11IO-PTR-CMNT-TXT TO TWA-PTR-MCCMNT-X120                 
LRM003     ELSE                                                                 
LRM003        MOVE SPACES                TO TWA-PTR-MCCMNT-X120                 
LRM003     END-IF.                                                              
                                                                                
LRM003     MOVE ACAT11IO-TS-EXCEPTIONS       TO TWA-EXCEPTIONS.                 
LRM003     IF ACAT11IO-SETTLE-DATE NOT = '0001-01-01' AND SPACES                
LRM003        MOVE ACAT11IO-SETTLE-DATE  TO TWA-MSD                             
LRM003     ELSE                                                                 
LRM003        MOVE SPACES                TO TWA-MSD                             
LRM003     END-IF.                                                              
LRM019     MOVE ACAT11IO-STTLM-TM-CD     TO TWA-STTLM-TM-CD.                    
LRM021     IF ACAT11IO-GIFT-IND = '1'                                           
LRM021        MOVE 'Y'                   TO TWA-GIFT-IND                        
LRM021     ELSE                                                                 
LRM021        MOVE SPACE                 TO TWA-GIFT-IND.                       
                                                                                
     ****** ASSET SECTION:                                                      
       MOVE-ACAT11IO-ASSET-TO-TWA.                                              
DJ0001     IF   ACAT11IO-BEARER-BOND-CD = 'B'                                   
LRM012     AND TWA-MSLOC NOT = '35'                                             
DJ0001          MOVE '1' TO TWA-BOND-REG-CODE                                   
DJ0001     ELSE                                                                 
DJ0001          MOVE '0' TO TWA-BOND-REG-CODE                                   
DJ0001     END-IF                                                               
LRM043     IF  ACAT11IO-ISIN-CNTRY-CD > SPACES                                  
LRM043     AND ACAT11IO-ISIN-CNTRY-CD NOT = 'US' AND '  '                       
LRM043        MOVE ACAT11IO-KEY-FIELDS(1:2) TO TWA-ISIN-CNTRY-CD                
LRM043        MOVE ACAT11IO-KEY-FIELDS(3:9) TO TWA-ISIN-SEC-ISSUE-CD            
LRM043        MOVE ACAT11IO-KEY-FIELDS(12:1) TO TWA-ISIN-SEC-CDG-CD             
LRM043        MOVE ACAT11IO-KEY-FIELDS TO TWA-MSECR                             
LRM043                                     TWA-ORIG-SECR                        
LRM043                                     TWA-ORIG-MSECR                       
LRM043     ELSE                                                                 
              MOVE ACAT11IO-ISIN-CNTRY-CD      TO TWA-ISIN-CNTRY-CD             
              MOVE ACAT11IO-ISIN-SEC-ISSUE-CD  TO TWA-MSECR                     
                                                  TWA-ORIG-SECR                 
                                                  TWA-ORIG-MSECR                
              MOVE SPACES                      TO TWA-ISIN-SEC-CDG-CD           
LRM043     END-IF.                                                              
           MOVE ACAT11IO-STTLM-LCTN-CD      TO TWA-MSLOC                        
                                               TWA-ORIG-SLOC.                   
           MOVE ACAT11IO-ADP-NBR            TO TWA-ADP-NBR.                     
           MOVE ACAT11IO-ASSET-PRC-CTGY-CD  TO TWA-MCATGR.                      
                                                                                
           IF ACAT11IO-CASH-ASSET                                               
              MOVE '1' TO TWA-MTYPE                                             
           ELSE                                                                 
           IF ACAT11IO-MARGIN-ASSET                                             
              MOVE '2' TO TWA-MTYPE                                             
           ELSE                                                                 
LRM041     IF ACAT11IO-CSH-MGN-SHRT-CD = '4'                                    
LRM041        MOVE '4' TO TWA-MTYPE                                             
LRM041     ELSE                                                                 
           IF ACAT11IO-SHORT-ASSET                                              
              MOVE '5' TO TWA-MTYPE                                             
           ELSE                                                                 
              MOVE SPACES TO TWA-MTYPE                                          
           END-IF.                                                              
           MOVE TWA-MTYPE TO  TWA-ORIG-MTYPE                                    
                              TWA-ORIG-TYPE.                                    
                                                                                
LRM003***** SET SUBMIT YES/NO BASED ON ASSET FROM INITIAL TABLE IN              
LRM003***** MEMO DELIVERY MODE.  ALSO TWA-ACTION.                               
LRM003     IF TWA-INP-TFR-TYP = 'PTR'                                           
LRM003     AND TWA-MREJ NOT > '00'                                              
LRM003        IF (TWA-STTS-CD = '500' OR '510')                                 
LRM003        AND TWA-PTR-BEEN-FLIPPED                                          
LRM003        AND (ACAT11IO-NSCC-SUBMIT-ELIGIBLE                                
LRM003        OR ACAT11IO-NSCC-SUBMITTED)                                       
LRM003           MOVE 'Y'   TO TWA-MSUBM  MSUBMO                        02030002
LRM003        ELSE                                                              
LRM003           MOVE SPACES TO TWA-MSUBM MSUBMO                                
LRM003        END-IF                                                            
LRM003        IF ACAT11IO-NSCC-SUBMITTED                                        
                 MOVE 'B'        TO TWA-ACTION                                  
LRM003     END-IF.                                                              
                                                                                
******* NOTE: THE BATCH PROCESSING DID NOT CHANGE THE RQST FIELD BELOW          
*******  TO QTY AND CALC THIS BASED ON RQST- RECIEVED; THE EDIT SECTION         
*******  WILL REJECT ANY NON-QTY, AND FORCE USER TO ENTER THE QTY, AS           
*******  THERE MUST BE A REAL QTY ON THE DELIVERER SIDE.                        
*******  THIS MAY NEED TO BE COMPUTED HERE. LET USER SEE WHAT'S REALLY          
*******  ON FILE AT THIS TIME FOR PTR, AND FOR PTD, WHEN SCROLLING THRU         
*******  THE ASSETS, REPLACE TO QTY, AMOUNT AND REQUEST TYPE ONLY WHEN          
*******  THIS POSITION CAN BE MATCHED TO TO MARGIN.  ALL ASSETS THAT            
*******  WERE NOT UPDATED/CHANGED BY THE USER WILL NOT BE ELLIGABLE TO          
*******  SUBMIT.                                                                
LRM003     IF TWA-INP-TFR-TYP = 'PTR'                                           
LRM003     AND TWA-PTR-BEEN-FLIPPED                                             
           AND TWA-CONTROL-NBR > SPACES                                         
LRM003     AND (TWA-STTS-CD = '500' OR '510')                                   
           AND (ACAT11IO-RQST-ASSET-PCT                                         
            OR ACAT11IO-RQST-ASSET-AMT)                                         
              PERFORM REPLACE-ASSET-QTY-RTN                                     
                 THRU REPLACE-ASSET-QTY-EXIT.                                   
                                                                                
           MOVE ACAT11IO-ASSET-AMT  TO TWA-MAMT-9.                              
LRM003     IF TWA-STTS-CD NOT = '500' AND '510'                                 
LRM003        MOVE ' ' TO TWA-MCD                                               
LRM003        MOVE ACAT11IO-ASSET-QTY  TO TWA-MQTY-9                            
LRM003     ELSE                                                                 
           IF ACAT11IO-RQST-ASSET-AMT                                           
              MOVE 'V' TO TWA-MCD                                               
              MOVE ZEROS               TO TWA-MQTY-9                            
              MOVE ACAT11IO-ASSET-AMT  TO TWA-MQTY-9                            
           ELSE                                                                 
           IF ACAT11IO-RQST-ASSET-QTY                                           
              MOVE 'P' TO TWA-MCD                                               
              MOVE ACAT11IO-ASSET-QTY  TO TWA-MQTY-9                            
LRM025     ELSE                                                                 
LRM025     IF TWA-PTR-BEEN-FLIPPED                                              
LRM025     AND ACAT11IO-ASSET-QTY NOT = ZERO                                    
LRM025        MOVE 'P' TO TWA-MCD                                               
LRM025        MOVE ACAT11IO-ASSET-QTY  TO TWA-MQTY-9                            
           ELSE                                                                 
           IF ACAT11IO-RQST-ASSET-PCT                                           
              MOVE '%' TO TWA-MCD                                               
              MOVE ACAT11IO-ASSET-PCT TO TWA-MQTY-9                             
           ELSE                                                                 
LRM013     IF ACAT11IO-RQST-ASSET-FULL                                          
LRM013     AND TWA-INP-TFR-TYP = 'PTR'                                          
LRM013     AND NOT TWA-PTR-BEEN-FLIPPED                                         
LRM013     AND (TWA-STTS-CD = '500' OR '510')                                   
              MOVE 'F'    TO TWA-MCD                                            
              MOVE ZEROS           TO TWA-MQTY-9                                
           ELSE                                                                 
              MOVE ' '    TO TWA-MCD                                            
              MOVE ZEROS           TO TWA-MQTY-9                                
           END-IF.                                                              
                                                                                
******* ON PTR, ALWAYS DISPLAY THE REQUESTED VALUE IN THE QTY FIELD;            
******* THE AMOUNT FIELD WILL BE BLANK.                                         
******* OTHERWISE ON PTD, SHOW THE AMOUNT, IF ANY FROM TABLE.                   
           IF TWA-INP-TFR-TYP = 'PTR'                                           
LRM003     AND NOT TWA-PTR-BEEN-FLIPPED                                         
LRM003     AND (TWA-STTS-CD = '500' OR '510')                                   
               MOVE ZEROS              TO TWA-MAMT-9                            
           ELSE                                                                 
               MOVE ACAT11IO-ASSET-AMT TO TWA-MAMT-9.                           
                                                                                
    **** ACAT11IO-PSTN-CD BASED ON POSITIVE OR NEGATIVE QTY BELOW.              
    **** THERE IS NO SIGN ON DATABASE NUMERIC FIELDS.                           
           IF ACAT11IO-SHORT-ASSET-QTY                                          
              COMPUTE TWA-MQTY-9 = TWA-MQTY-9 * -1                              
              COMPUTE TWA-MAMT-9 = TWA-MAMT-9 * -1                              
              END-COMPUTE.                                                      
                                                                                
           MOVE ACAT11IO-CSH-MGN-SHRT-CD TO TWA-ORIG-TYPE.                      
           MOVE ACAT11IO-ASSET-SEQ-NBR   TO TWA-ASSET-SEQ.                      
                                                                                
           MOVE ACAT11IO-WHI-CD    TO TWA-MWI.                                  
LRM048     MOVE ACAT11IO-WHI-STTS-CD   TO TWA-MWI-STTS.                         
LRM008     MOVE ACAT11IO-NSCC-WTHLD-CD TO TWA-NSCC-WTHLD-CD                     
LRM048                                    TWA-ORIG-WTHLD-CD.                    
           MOVE ACAT11IO-MEMO-CD   TO TWA-MMEMO.                                
           MOVE ACAT11IO-SLOC-RSN  TO TWA-SLOCRSN.                              
           MOVE ACAT11IO-DESC-TXT  TO TWA-MDESC-GROUP.                          
CSG001* IN SOME CASES MSD DESCRIPTIONS CONTAIN SPECIAL CHARACTERS.              
CSG001* CORRECT THEM BY REPLACING SPECIAL CHARACTERS WITH SPACES.               
CSG001     MOVE TWA-MDESC-GROUP            TO W-ASSET-DESC-TXT-GRP              
CSG001     MOVE W-ASSET-DESC1-TXT          TO W-ASSET-DESC-TXT                  
CSG001     MOVE 30                         TO W-SUB3                            
CSG001     SET W-JUST-LEFT-REQ-Y           TO TRUE                              
CSG001     PERFORM EDIT-ASSET-DESC-TXT                                          
CSG001     MOVE W-ASSET-DESC-TXT           TO W-ASSET-DESC1-TXT                 
CSG001     MOVE W-ASSET-DESC2-TXT          TO W-ASSET-DESC-TXT                  
CSG001     MOVE 30                         TO W-SUB3                            
CSG001     SET W-JUST-LEFT-REQ-N           TO TRUE                              
CSG001     PERFORM EDIT-ASSET-DESC-TXT                                          
CSG001     MOVE W-ASSET-DESC-TXT           TO W-ASSET-DESC2-TXT                 
CSG001     MOVE W-ASSET-DESC3-TXT          TO W-ASSET-DESC-TXT                  
CSG001     MOVE 30                         TO W-SUB3                            
CSG001     SET W-JUST-LEFT-REQ-N           TO TRUE                              
CSG001     PERFORM EDIT-ASSET-DESC-TXT                                          
CSG001     MOVE W-ASSET-DESC-TXT           TO W-ASSET-DESC3-TXT                 
CSG001     MOVE SPACES                     TO TWA-MDESC-GROUP                   
CSG001     MOVE W-ASSET-DESC-TXT-GRP(1:90) TO TWA-MDESC-GROUP                   
CSG001                                                                          
           MOVE ACAT11IO-ASSET-CMNT-TXT  TO TWA-MSCMNT-X120.                    
                                                                                
XXX    REPLACE-ASSET-QTY-RTN.                                                   
           PERFORM OBTAIN-MARGIN-POSN-RTN                                       
                 THRU OBTAIN-MARGIN-POSN-EXIT.                                  
LRM025     IF  CHLD-WI-KEY = '1'                                                
LRM025         MOVE 'W'            TO TWA-MWI                                   
LRM025     ELSE                                                                 
LRM025         MOVE 'N'            TO TWA-MWI                                   
LRM025     END-IF                                                               
           IF ACAT11IO-FULL-QTY                                                 
              SET ACAT11IO-RQST-ASSET-QTY TO TRUE                               
              MOVE 'P' TO TWA-MCD                                               
              IF TWA-MTYPE = '1'                                                
                 MOVE WS-MRGN-POSN-QTY-TYPE1 TO TWA-MQTY-9              MRGIML03
              ELSE                                                              
              IF TWA-MTYPE = '2'                                                
                 MOVE WS-MRGN-POSN-QTY-TYPE2 TO TWA-MQTY-9              MRGIML03
              ELSE                                                              
              IF TWA-MTYPE = '5'                                                
                 MOVE WS-MRGN-POSN-QTY-TYPE5 TO TWA-MQTY-9              MRGIML03
              END-IF END-IF END-IF                                              
           ELSE                                                                 
           IF ACAT11IO-RQST-ASSET-AMT                                           
              MOVE 'P' TO TWA-MCD                                               
              SET ACAT11IO-RQST-ASSET-QTY TO TRUE                               
              IF TWA-MTYPE = '1'                                                
                 COMPUTE WS-CALC-PRICE ROUNDED =                                
                  WS-MRGN-POSN-MV-TYPE1 / WS-MRGN-POSN-QTY-TYPE1        MRGIPS05
                    ON SIZE ERROR MOVE ZEROS TO WS-CALC-PRICE                   
                 END-COMPUTE                                                    
                 COMPUTE TWA-MQTY-9 ROUNDED =                           MRGIML03
                      TWA-MAMT-9 / WS-CALC-PRICE                        MRGIML03
                    ON SIZE ERROR MOVE ZEROS TO TWA-MQTY-9                      
                 END-COMPUTE                                                    
              ELSE                                                              
              IF TWA-MTYPE = '2'                                                
                 COMPUTE WS-CALC-PRICE ROUNDED =                                
                  WS-MRGN-POSN-MV-TYPE2 / WS-MRGN-POSN-QTY-TYPE2        MRGIPS05
                    ON SIZE ERROR MOVE ZEROS TO WS-CALC-PRICE                   
                 END-COMPUTE                                                    
                 COMPUTE TWA-MQTY-9 ROUNDED =                           MRGIML03
                      TWA-MAMT-9 / WS-CALC-PRICE                        MRGIML03
                    ON SIZE ERROR MOVE ZEROS TO TWA-MQTY-9                      
                 END-COMPUTE                                                    
              ELSE                                                              
              IF TWA-MTYPE = '5'                                                
                 COMPUTE WS-CALC-PRICE ROUNDED =                                
                  WS-MRGN-POSN-MV-TYPE5 / WS-MRGN-POSN-QTY-TYPE5        MRGIPS05
                    ON SIZE ERROR MOVE ZEROS TO WS-CALC-PRICE                   
                 END-COMPUTE                                                    
                 COMPUTE TWA-MQTY-9 ROUNDED =                           MRGIML03
                      TWA-MAMT-9 / WS-CALC-PRICE                        MRGIML03
                    ON SIZE ERROR MOVE ZEROS TO TWA-MQTY-9                      
                 END-COMPUTE                                                    
              END-IF END-IF END-IF                                              
           ELSE                                                                 
           IF ACAT11IO-RQST-ASSET-PCT                                           
              MOVE 'P' TO TWA-MCD                                               
              SET ACAT11IO-RQST-ASSET-QTY TO TRUE                               
              IF TWA-MTYPE = '1'                                                
                 COMPUTE TWA-MQTY-9 ROUNDED =                           MRGIML03
                      WS-MRGN-POSN-QTY-TYPE1 *  TWA-MQTY-9              MRGIML03
              ELSE                                                              
              IF TWA-MTYPE = '2'                                                
                 COMPUTE TWA-MQTY-9 ROUNDED =                           MRGIML03
                      WS-MRGN-POSN-QTY-TYPE2 *  TWA-MQTY-9              MRGIML03
              ELSE                                                              
              IF TWA-MTYPE = '5'                                                
                 COMPUTE TWA-MQTY-9 ROUNDED =                           MRGIML03
                      WS-MRGN-POSN-QTY-TYPE5 *  TWA-MQTY-9              MRGIML03
              END-IF END-IF END-IF                                              
           END-IF.                                                              
       REPLACE-ASSET-QTY-EXIT. EXIT.                                            
                                                                                
       REFORMAT-SCREEN-DETAIL.                                                  
********   MOVE LOW-VALUES  TO ACAT11MO.                                        
           MOVE TWA-MBR     TO MBRO    ACAT-BR.                         02030002
           MOVE TWA-MAC     TO MACO    ACAT-AC.                         02030002
           MOVE TWA-MRR     TO MRRO.                                            
           MOVE TWA-MCTYPE  TO MCTYPEO.                                         
           MOVE TWA-MCBRKR  TO MCBRKRO                                          
                              ACATPPIO-BRKR.                                    
           SET ACATPPIO-READ TO TRUE                                            
           PERFORM LINK-TO-ACATPPIO-RTN                                         
           IF ACATPPIO-FOUND                                                    
              MOVE ACATPPIO-NAME TO TWA-MCBNAM  MCBNAMO                         
           ELSE                                                                 
              MOVE SPACES        TO TWA-MCBNAM  MCBNAMO                         
              IF ACATPPIO-DB-ERROR                                              
                 MOVE 'READ'            TO WS-DB2-PROBLEM-FUNCTION              
                 MOVE ACATPPIO-SQLCAID  TO WS-DB2-PROBLEM-TABLE                 
                 MOVE ACATPPIO-SQLCODE  TO WS-DB2-PROBLEM-ID                    
                 MOVE WS-DB2-PROBLEM-MSG TO SYSTEM-MSG                          
                 PERFORM DB2-ERROR-RTN                                          
           END-IF.                                                              
           MOVE TWA-MCACCT  TO MCACCTO.                                         
           MOVE TWA-MNAME   TO MNAMEO.                                          
           MOVE TWA-MNAME2  TO MNAME2O.                                         
           MOVE TWA-MSSN    TO MSSNO.                                           
           MOVE TWA-MSSN2   TO MSSN2O.                                          
           MOVE TWA-MACAT   TO MACATO.                                          
           MOVE TWA-MSTAT   TO MSTATO.                                          
           MOVE TWA-MSD     TO MSDO.                                            
           MOVE TWA-MNEXT   TO MNEXTO.                                          
           MOVE TWA-MSUBM   TO MSUBMO.                                          
           MOVE TWA-MREJ    TO MREJO.                                           
LRM028     IF TWA-INP-TFR-TYP = 'PTD' OR 'PTF'                                  
LRM021        MOVE TWA-GIFT-IND TO GIFTINDO                                     
LRM021        MOVE ATT-UNPROT   TO GIFTINDA                                     
LRM021        MOVE ATT-ASKIP    TO GIFTMSGA                                     
LRM021     END-IF.                                                              
                                                                                
LRM016     MOVE SPACES             TO PF4MSGO                                   
LRM007     IF TWA-INP-TFR-TYP = 'PTR'                                           
LRM003     IF TWA-STTS-CD < '500'                                               
LRM016        MOVE 'DLVY IN PROGRESS' TO PF4MSGO                                
LRM003     ELSE                                                                 
LRM003     IF (TWA-STTS-CD = '500' OR '510')                                    
LRM003        IF TWA-PTR-BEEN-FLIPPED                                           
LRM016           MOVE 'PTR DLVY FOUND' TO PF4MSGO                               
              ELSE                                                              
              IF ACAT-SIGN-ON-UPDATE                                            
              AND TWA-INP-TFR-TYP = 'PTR'                                       
LRM003        AND NOT TWA-PTR-BEEN-FLIPPED                                      
LRM003        AND TWA-STTS-CD = '500'                                           
                 IF TWA-MREJ NOT > '00'                                         
LRM016              MOVE 'PF4 TO CREATE DLVY'  TO PF4MSGO                       
                 ELSE                                                           
LRM016              MOVE 'MEMO REJECT FOUND '  TO PF4MSGO                       
                    MOVE ATT-UNPROT TO MSUBMA                                   
                 END-IF                                                         
                 MOVE ATT-UNPROT TO MREJA                                       
              END-IF                                                            
           END-IF.                                                              
                                                                                
LRM007     IF TWA-INP-TFR-TYP  = 'PTR'                                          
LRM011     IF TWA-CONTRA-TIF-CMNTM                                              
              MOVE 'TIF COMMENT' TO CMNTMSGO                                    
           ELSE                                                                 
           IF TWA-CONTRA-AST-CMNTM                                              
              MOVE 'ASSET COMMENT' TO CMNTMSGO                                  
           ELSE                                                                 
           IF TWA-CONTRA-BOTH-CMNTM                                             
              MOVE 'COMMENTS EXIST' TO CMNTMSGO                                 
           ELSE                                                                 
              MOVE SPACES           TO CMNTMSGO                                 
           END-IF.                                                              
                                                                                
           MOVE TWA-MCMNT   TO MCMNTO.                                          
           MOVE TWA-MDEL    TO MDELO.                                           
LRM015     IF TWA-MBAL01-RQST-CD = 'F'                                          
LRM015        MOVE ZEROS TO TWA-MBAL01-9                                        
LRM015        IF TWA-MBAL01-CREDIT-IND = 'C'                                    
LRM015           MOVE 'FULL-' TO MBAL01I TWA-MBAL01 TWA-ORIG-MBAL01             
LRM015        ELSE                                                              
LRM015           MOVE 'FULL'  TO MBAL01I TWA-MBAL01 TWA-ORIG-MBAL01             
LRM015     ELSE                                                                 
LRM005     IF TWA-MBAL01-9 NOT = ZEROS                                          
LRM005        IF TWA-MBAL01-PCT-IND = 'Y'                                       
LRM005           MOVE TWA-MBAL01-9 TO WS-PCT-BAL-ED                             
LRM005           MOVE WS-PCT-BAL   TO MBAL01I                                   
LRM005        ELSE                                                              
                 MOVE TWA-MBAL01-9 TO MBAL01O                                   
                 MOVE MBAL01O TO TWA-MBAL01 TWA-ORIG-MBAL01                     
           ELSE                                                                 
              MOVE SPACES       TO MBAL01I                                      
                              TWA-MBAL01 TWA-ORIG-MBAL01                        
           END-IF.                                                              
                                                                                
LRM015     IF TWA-MBAL02-RQST-CD = 'F'                                          
LRM015        MOVE ZEROS TO TWA-MBAL02-9                                        
LRM015        IF TWA-MBAL02-CREDIT-IND = 'C'                                    
LRM015           MOVE 'FULL-' TO MBAL02I TWA-MBAL02 TWA-ORIG-MBAL02             
LRM015        ELSE                                                              
LRM015           MOVE 'FULL'  TO MBAL02I TWA-MBAL02 TWA-ORIG-MBAL02             
LRM015     ELSE                                                                 
LRM005     IF TWA-MBAL02-9 NOT = ZEROS                                          
LRM005        IF TWA-MBAL02-PCT-IND = 'Y'                                       
LRM005           MOVE TWA-MBAL02-9 TO WS-PCT-BAL-ED                             
LRM005           MOVE WS-PCT-BAL   TO MBAL02I                                   
LRM005        ELSE                                                              
                 MOVE TWA-MBAL02-9 TO MBAL02O                                   
                 MOVE MBAL02O TO TWA-MBAL02 TWA-ORIG-MBAL02                     
           ELSE                                                                 
              MOVE SPACES       TO MBAL02I                                      
                              TWA-MBAL02 TWA-ORIG-MBAL02                        
           END-IF.                                                              
                                                                                
LRM015     IF TWA-MBAL05-RQST-CD = 'F'                                          
LRM015        MOVE ZEROS TO TWA-MBAL05-9                                        
LRM015        IF TWA-MBAL05-CREDIT-IND = 'C'                                    
LRM015           MOVE 'FULL-' TO MBAL05I TWA-MBAL05 TWA-ORIG-MBAL05             
LRM015        ELSE                                                              
LRM015           MOVE 'FULL'  TO MBAL05I TWA-MBAL05 TWA-ORIG-MBAL05             
LRM015     ELSE                                                                 
LRM005     IF TWA-MBAL05-9 NOT = ZEROS                                          
LRM005        IF TWA-MBAL05-PCT-IND = 'Y'                                       
LRM005           MOVE TWA-MBAL05-9 TO WS-PCT-BAL-ED                             
LRM005           MOVE WS-PCT-BAL   TO MBAL05I                                   
LRM005        ELSE                                                              
                 MOVE TWA-MBAL05-9 TO MBAL05O                                   
                 MOVE MBAL05O TO TWA-MBAL05 TWA-ORIG-MBAL05                     
           ELSE                                                                 
              MOVE SPACES       TO MBAL05I                                      
                              TWA-MBAL05 TWA-ORIG-MBAL05                        
           END-IF.                                                              
                                                                                
           MOVE TWA-CONTROL-NBR TO MACATO.                                      
LRM007     IF TWA-INP-TFR-TYP = 'PTD' OR 'PTF'                          04809710
LRM007        MOVE ATT-ASKIP TO MACATA.                                         
           PERFORM SET-STATUS-MSG-RTN.                                          
                                                                                
     **** FIELDS ON ASSET SECTION...                                            
                                                                                
       REFORMAT-SCREEN-ASSET.                                                   
           MOVE TWA-MSECR    TO MSECRO.                                         
           MOVE TWA-MCATGR   TO MCATGRO.                                        
           MOVE TWA-MSLOC    TO MSLOCO.                                         
           MOVE TWA-MCD      TO MCDO.                                           
           IF TWA-MQTY-9 NOT = ZEROS                                            
              MOVE TWA-MQTY-9 TO WS-MQTY-ED-D5                                  
              MOVE WS-MQTY-AREA TO MQTYO TWA-MQTY TWA-ORIG-MQTY                 
           ELSE                                                                 
              MOVE SPACES       TO MQTYO TWA-MQTY TWA-ORIG-MQTY                 
           END-IF.                                                              
                                                                                
           IF TWA-MAMT-9 = ZEROS                                                
              MOVE SPACES       TO MAMTO TWA-MAMT TWA-ORIG-MAMT                 
           ELSE                                                                 
              MOVE TWA-MAMT-9 TO WS-MQTY-ED-D2                                  
              MOVE WS-MQTY-AREA TO MAMTO TWA-MAMT TWA-ORIG-MAMT                 
           END-IF.                                                              
                                                                                
           MOVE TWA-MWI   TO MWIO.                                              
LRM008     IF TWA-NSCC-WTHLD-CD = 'W'                                           
LRM008********MOVE 'W'   TO MCDO.                                       02030002
LRM048        MOVE 'W'   TO MCDO  TWA-MCD.                              02030002
           MOVE TWA-MTYPE TO MTYPEO.                                            
           MOVE TWA-MMEMO TO MMEMOO.                                            
           MOVE TWA-SLOCRSN TO SLOCRSNO.                                        
           MOVE TWA-MDESC TO MDESCO.                                            
CSG001* IN SOME CASES MSD DESCRIPTIONS CONTAIN SPECIAL CHARACTERS.              
CSG001* CORRECT THEM BY REPLACING SPECIAL CHARACTERS WITH SPACES.               
CSG001     MOVE MDESCO                    TO W-ASSET-DESC-TXT                   
CSG001     MOVE 30                        TO W-SUB3                             
CSG001     SET W-JUST-LEFT-REQ-Y          TO TRUE                               
CSG001     PERFORM EDIT-ASSET-DESC-TXT                                          
CSG001     MOVE W-ASSET-DESC-TXT          TO MDESCO                             
           MOVE TWA-MDESC2 TO MDESC2O.                                          
CSG001     MOVE MDESC2O                   TO W-ASSET-DESC-TXT                   
CSG001     MOVE 30                        TO W-SUB3                             
CSG001     SET W-JUST-LEFT-REQ-N          TO TRUE                               
CSG001     PERFORM EDIT-ASSET-DESC-TXT                                          
CSG001     MOVE W-ASSET-DESC-TXT          TO MDESC2O                            
           MOVE TWA-MDESC3 TO MDESC3O.                                          
CSG001     MOVE MDESC3O                   TO W-ASSET-DESC-TXT                   
CSG001     MOVE 30                        TO W-SUB3                             
CSG001     SET W-JUST-LEFT-REQ-N          TO TRUE                               
CSG001     PERFORM EDIT-ASSET-DESC-TXT                                          
CSG001     MOVE W-ASSET-DESC-TXT          TO MDESC3O                            
                                                                                
LRM035     IF FIRST-TIME                                                        
LRM035        CONTINUE                                                          
LRM035     ELSE                                                                 
LRM035     IF TWA-ACTION NOT = 'C'                                              
LRM035     OR TWA-SECR-ACTION NOT = 'A'                                         
LRM035        MOVE ATT-ASKIP TO MEXPDTA MCALLA MLONGA MSTRIKEA                  
LRM035     END-IF.                                                              
                                                                                
           SKIP3                                                                
       SET-STATUS-MSG-RTN.                                                      
           IF TWA-STTS-CD NOT GREATER SPACES                            08505010
              MOVE SPACES TO MSTATO                                             
           ELSE                                                                 
           EVALUATE TWA-STTS-CD                                         08505010
               WHEN '100'                                               08506010
                    MOVE '100-REQUEST'               TO MSTATO          08507010
               WHEN '110'                                               08506010
                    MOVE '110-REQUEST ADJUST'        TO MSTATO          08507010
               WHEN '120'                                               08506010
                    MOVE '120-REQUEST ADJUST PAST'   TO MSTATO          08507010
               WHEN '130'                                               08506010
                    MOVE '130-REQUEST PAST'          TO MSTATO          08507010
               WHEN '140'                                               08506010
                    MOVE '140-REQUEST REJECT'        TO MSTATO          08507010
               WHEN '200'                                               08506010
                    MOVE '200-REVIEW'                TO MSTATO          08507010
               WHEN '210'                                               08507110
                    MOVE '210-REVIEW ADJUST'         TO MSTATO          08508010
               WHEN '220'                                               08509010
                    MOVE '220-REVIEW ERROR'          TO MSTATO          08509110
               WHEN '230'                                               08509010
                    MOVE '230-REVIEW ACCELERATE'     TO MSTATO          08509110
               WHEN '300'                                               08509210
                    MOVE '300-SETTLE PREP'   TO MSTATO                  08509310
               WHEN '310'                                               08509410
                    MOVE '310-SETTLE CLOSE'  TO MSTATO                  08509510
               WHEN '400'                                               08509710
                    MOVE '400-CLOSE PURGE'   TO MSTATO                  08509810
               WHEN '500'                                               08509910
                    MOVE '500-REQUEST'   TO MSTATO                      08510010
               WHEN '510'                                               08510110
                    MOVE '510-MEMO PURGE PARTIAL REQUEST' TO MSTATO     08510210
               WHEN '600'                                               08510110
                    MOVE '600-REJECT'    TO MSTATO                      08510210
               WHEN OTHER                                               08510110
                    MOVE TWA-STTS-CD     TO MSTATO                      08510210
           END-EVALUATE.                                                08510310
                                                                                
           EJECT                                                                
       PROCESS-MAP-ITEMS.                                                       
           IF TWA-INP-TFR-TYP NOT > SPACES                              04809710
              MOVE 'PTR' TO TWA-INP-TFR-TYP   MMTFRO.                           
                                                                                
           IF ACAT-SIGN-ON-UPDATE                                               
           AND TWA-INP-TFR-TYP = 'PTR'                                  04809710
LRM003     AND NOT TWA-PTR-BEEN-FLIPPED                                         
LRM003     AND TWA-STTS-CD = '500'                                              
              MOVE ATT-UNPROT TO MREJA                                          
              MOVE SPACES TO TWA-INTRAN-FLAG                            01940002
           END-IF.                                                              
                                                                                
LRM017     IF  TWA-STTS-CD = '600'                                              
LRM017        CONTINUE                                                          
LRM017     ELSE                                                                 
LRM003     IF TWA-MREJ GREATER SPACES                                           
LRM003        IF (TWA-MREJ < '01' OR TWA-MREJ > '09')                           
LRM003           MOVE ATT-UNPROT-BRT TO MREJA                                   
LRM003           IF NOT INPUT-ERROR                                             
LRM003              MOVE -1 TO MREJL                                            
LRM003              MOVE 'REJECT CODE MUST BE 01-09 OR SPACE'                   
LRM003                          TO SYSTEM-MSG                                   
LRM003              SET INPUT-ERROR TO TRUE                                     
LRM003           END-IF                                                         
LRM003        ELSE                                                              
LRM003        MOVE ATT-UNPROT TO MCMNTA                                         
LRM003        IF TWA-APPROVAL-AUTH                                              
LRM003           MOVE ATT-UNPROT TO MSUBMA                                      
LRM003     END-IF.                                                              
                                                                                
LRM003     IF TWA-PTR-BEEN-FLIPPED                                              
LRM007     OR (TWA-INP-TFR-TYP = 'PTD' OR 'PTF')                        04809710
LRM003        MOVE ATT-ASKIP TO MACATA                                          
LRM003     ELSE                                                                 
            MOVE ATT-UNPROT TO MACATA                                           
            IF TWA-MACAT > SPACES                                               
              IF TWA-INTRAN-BRW                                                 
                 PERFORM READ-ACTIVE-PTR-RTN                                    
                 IF ACAT11IO-FOUND                                              
                    IF ACAT11IO-TRNFR-TYPE-CD NOT = 'PTR'                       
                       MOVE ATT-UNPROT-BRT TO MACATA                            
                       IF NOT INPUT-ERROR                                       
                          MOVE -1 TO MACATL                                     
                          MOVE 'ACTIVE ACAT MUST BE PTR FOR THIS SCREEN'        
                             TO SYSTEM-MSG                                      
                          SET INPUT-ERROR TO TRUE                               
                       END-IF                                                   
                    ELSE                                                        
                       CONTINUE                                                 
                 ELSE                                                           
                 IF ACAT11IO-PTD-ACTIVE-FOUND                                   
                    MOVE '6' TO TWA-ACTION                                      
                    PERFORM MOVE-ACAT11IO-TO-TWA-RTN                            
                    PERFORM REFORMAT-SCREEN-DETAIL                              
                    PERFORM READ-NEXT-ASSET-RTN                                 
                    SET INPUT-ERROR TO TRUE                                     
                    MOVE 'PTR HAS ACTIVE PTD / BROWSE ONLY'                     
                        TO SYSTEM-MSG                                           
                 ELSE                                                           
                 IF ACAT11IO-PTD-INITIAL-FOUND                                  
                    PERFORM MOVE-ACAT11IO-TO-TWA-RTN                            
                    PERFORM REFORMAT-SCREEN-DETAIL                              
                    PERFORM READ-NEXT-ASSET-RTN                                 
                    SET INPUT-ERROR TO TRUE                                     
                    MOVE 'PTR POINTS TO EXISTING INITIAL PTD'                   
                        TO SYSTEM-MSG                                           
                 ELSE                                                           
                    MOVE ATT-UNPROT-BRT TO MACATA                               
                    IF NOT INPUT-ERROR                                          
                       MOVE -1 TO MACATL                                        
                       MOVE 'ACAT CONTROL NBR NOT FOUND ON ACTIVE FILE'         
                             TO SYSTEM-MSG                                      
                       SET INPUT-ERROR TO TRUE                                  
                    END-IF.                                                     
                                                                                
LRM017     IF ACAT-ACCOUNT-FREEZE-CLIENT                                        
LRM017     AND TWA-MBR > SPACES                                                 
LRM017     AND TWA-MAC > SPACES                                                 
LRM017        MOVE TWA-CLIENT-NO-X TO ACATRSIO-CLIENT-NBR                       
LRM017        MOVE TWA-MBR TO ACATRSIO-BRANCH                                   
LRM017        MOVE TWA-MAC TO ACATRSIO-ACCOUNT                                  
LRM017        SET ACATRSIO-LOOKUP-ACCOUNT-FREEZE TO TRUE                        
LRM017        PERFORM LINK-TO-ACATRSTIO-RTN                                     
LRM017        MOVE ACATRSIO-FREEZE-A TO TWA-FREEZE-CASH-DEBIT                   
LRM017        MOVE ACATRSIO-FREEZE-B TO TWA-FREEZE-CASH-CREDIT                  
LRM017        MOVE ACATRSIO-FREEZE-C TO TWA-FREEZE-SEC-SHORT                    
LRM017        MOVE ACATRSIO-FREEZE-D TO TWA-FREEZE-SEC-LONG                     
LRM017     ELSE                                                                 
LRM017        MOVE 'N' TO TWA-FREEZE-CASH-CREDIT                                
LRM017                    TWA-FREEZE-CASH-DEBIT                                 
LRM017                    TWA-FREEZE-SEC-LONG                                   
LRM017                    TWA-FREEZE-SEC-SHORT                                  
LRM017     END-IF.                                                              
                                                                                
LRM003     IF TWA-PTR-BEEN-FLIPPED                                              
LRM003        CONTINUE                                                          
LRM003     ELSE                                                                 
           IF TWA-INP-TFR-TYP = 'PTR'                                   04809710
           OR (TWA-ACTION NOT = 'A' AND 'C')                                    
LRM003***     IF TWA-APPROVAL-AUTH                                              
LRM003***        MOVE ATT-UNPROT TO MSUBMA                                      
LRM003***     END-IF                                                            
              GO TO PROCESS-MAP-ITEMS-EXIT.                                     
                                                                                
LRM003     IF TWA-PTR-BEEN-FLIPPED                                              
LRM017     OR TWA-STTS-CD = '600'                                               
LRM003        MOVE ATT-ASKIP TO MCTYPEA                                         
LRM003                          MCBRKRA                                         
LRM003                          MCBNAMA                                         
LRM003                          MCACCTA                                         
LRM003                          MNAMEA                                          
LRM003                          MNAME2A                                         
LRM003                          MSSNA                                           
LRM003                          MSSN2A                                          
LRM003                          MACATA                                          
LRM003                          MSTATA                                          
LRM003                          MSDA                                            
LRM003                          MREJA                                           
LRM003        GO TO SKIP-TIF-EDIT                                               
LRM003     END-IF.                                                              
                                                                                
           MOVE ATT-UNPROT TO MBRA.                                             
           IF TWA-MBR NOT GREATER SPACES                                        
              MOVE ATT-UNPROT-BRT TO MBRA                                       
              IF NOT INPUT-ERROR                                                
                 MOVE -1 TO MBRL                                                
                 IF TWA-MACAT NOT > SPACES                                      
                    MOVE                                                        
                    'EITHER BR/AC OR ACAT CONTROL NBR IS REQUIRED'              
                       TO SYSTEM-MSG                                            
                 END-IF                                                         
                 SET INPUT-ERROR TO TRUE.                                       
                                                                                
           MOVE ATT-UNPROT TO MACA.                                             
           IF TWA-MAC NOT GREATER SPACES                                        
              MOVE ATT-UNPROT-BRT TO MACA                                       
              IF NOT INPUT-ERROR                                                
                 MOVE -1 TO MACL                                                
                 MOVE 'ACCOUNT IS REQUIRED' TO SYSTEM-MSG                       
                 SET INPUT-ERROR TO TRUE.                                       
                                                                                
           IF NOT INPUT-ERROR                                                   
              SET ACATNAIO-NA-READ TO TRUE                                      
              MOVE TWA-CLIENT-NO-X(2 : 3) TO ACATNAIO-CLIENT                    
              MOVE TWA-MBR         TO ACATNAIO-BR                               
              MOVE TWA-MAC         TO ACATNAIO-AC                               
              PERFORM LINK-TO-ACATNAIO-RTN                                      
              IF ACATNAIO-NOT-FOUND                                             
                 MOVE ATT-UNPROT-BRT TO MBRA                                    
                                        MACA                                    
                 MOVE -1 TO MBRL                                                
                 MOVE 'BRANCH/ACCOUNT NOT ON N/A' TO SYSTEM-MSG                 
                 SET INPUT-ERROR TO TRUE                                        
              ELSE                                                              
LRM033*****      MOVE TWA-MBR TO ACAT-INP-BRANCH  ACAT-BR                       
LRM033*****      MOVE TWA-MAC TO ACAT-INP-ACCOUNT ACAT-AC                       
LRM033           MOVE TWA-MBR TO                  ACAT-BR                       
LRM033           MOVE TWA-MAC TO                  ACAT-AC                       
                 MOVE TWA-MRR  TO SRCH-INP-RR                                   
                 MOVE TWA-MBR  TO SRCH-INP-BRANCH                               
                 MOVE ACATNAIO-RR    TO TWA-MRR     MRRO                        
                 IF  ACAT-SUPER-SIGN-ON-UPDATE                                  
                 OR  ACAT-SUPER-SIGN-ON-BROWSE                                  
                    CONTINUE                                                    
                 ELSE                                                           
                    PERFORM SIGNON-SECR-CHECK-RTN                               
                    IF SRCH-SIGNON-SECR-CHECK-FAIL                              
                       MOVE ATT-UNPROT-BRT TO MBRA                              
                                              MACA                              
                       MOVE -1 TO MBRL                                          
                       MOVE SRCH-MSG TO SYSTEM-MSG                              
                       SET INPUT-ERROR TO TRUE                                  
                       PERFORM ERROR-RTN                                        
                    END-IF                                                      
                 END-IF                                                         
                 PERFORM CHECK-ACCOUNT-RESTRICTIONS-RTN                         
                 IF (TWA-MNAME NOT > SPACES                                     
LRM026           OR WS-NEW-ACCOUNT)                                             
LRM******           MOVE 'SN'           TO TWA-MCTYPE  MCTYPEO                  
                    IF ACATNAIO-SSN(1 : 1) GREATER SPACES                       
                       MOVE ACATNAIO-SSN(1 : 3) TO TWA-MSSN(1 : 3)              
                       MOVE '-'                 TO TWA-MSSN(4 : 1)              
                       MOVE ACATNAIO-SSN(4 : 2) TO TWA-MSSN(5 : 2)              
                       MOVE '-'                 TO TWA-MSSN(7 : 1)              
                       MOVE ACATNAIO-SSN(6 : 4) TO TWA-MSSN(8 : 4)              
                    ELSE                                                        
                       MOVE SPACES TO TWA-MSSN                                  
                    END-IF                                                      
                    MOVE TWA-MSSN TO MSSNO                                      
                    IF ACATNAIO-SSN2(1 : 1) GREATER SPACES                      
                       MOVE ACATNAIO-SSN2(1 : 3) TO TWA-MSSN2(1 : 3)            
                       MOVE '-'                  TO TWA-MSSN2(4 : 1)            
                       MOVE ACATNAIO-SSN2(4 : 2) TO TWA-MSSN2(5 : 2)            
                       MOVE '-'                  TO TWA-MSSN2(7 : 1)            
                       MOVE ACATNAIO-SSN2(6 : 4) TO TWA-MSSN2(8 : 4)            
                    ELSE                                                        
                       MOVE SPACES TO TWA-MSSN2                                 
                    END-IF                                                      
                    MOVE TWA-MSSN2 TO MSSN2O                                    
                    MOVE ACATNAIO-IRA   TO TWA-NA-IRA                           
                    MOVE ACATNAIO-NAME  TO TWA-MNAME   MNAMEO                   
                    MOVE ACATNAIO-NAME2 TO TWA-MNAME2  MNAME2O                  
LRM017           END-IF                                                         
LRM017           IF  TWA-FREEZE-CASH-CREDIT = 'Y'                               
LRM017           AND TWA-FREEZE-CASH-DEBIT  = 'Y'                               
LRM017           AND TWA-FREEZE-SEC-LONG    = 'Y'                               
LRM017           AND TWA-FREEZE-SEC-SHORT   = 'Y'                               
LRM017              MOVE ATT-UNPROT-BRT TO MBRA                                 
LRM017                                     MACA                                 
LRM017              IF NOT INPUT-ERROR                                          
LRM017                 SET INPUT-ERROR TO TRUE                                  
LRM017                 MOVE -1 TO MBRL                                          
LRM017                 MOVE WS-FULL-FREEZE-MSG TO SYSTEM-MSG                    
LRM017     END-IF.                                                              
                                                                                
LRM003 SKIP-TIF-EDIT.                                                           
           IF TWA-MBAL01 GREATER SPACES                                         
           OR TWA-MBAL02 GREATER SPACES                                         
           OR TWA-MBAL05 GREATER SPACES                                         
              PERFORM OBTAIN-MARGIN-BAL-RTN                                     
                 THRU OBTAIN-MARGIN-BAL-EXIT.                                   
                                                                                
           MOVE ATT-UNPROT TO MBAL01A.                                          
           IF TWA-MBAL01 GREATER SPACES                                         
LRM028        IF TWA-PRTCP-TYPE-CD = '3'                                        
LRM028           MOVE ATT-UNPROT-BRT TO MBAL01A                                 
LRM028           IF NOT INPUT-ERROR                                             
LRM028              MOVE -1 TO MBAL01L                                          
LRM028              SET INPUT-ERROR TO TRUE                                     
LRM028              MOVE 'CASH BALANCE INVALID ON PTF' TO SYSTEM-MSG            
LRM028           END-IF                                                         
LRM028        ELSE                                                              
LRM***********AND TWA-MBAL01 NOT = TWA-ORIG-MBAL01                              
                 MOVE TWA-MBAL01  TO WK-AMT-IN                                  
                 EXEC CICS LINK PROGRAM(WS-EDITMOD)                             
                             COMMAREA(EDIT-AMT-AREA)                            
                             LENGTH(LENGTH OF EDIT-AMT-AREA)                    
                 END-EXEC                                                       
                 IF WK-AMT-RET-CODE = SPACE                                     
                    IF WK-AMT-OUT = ZEROS                                       
                       MOVE SPACES     TO MBAL01I                               
                    ELSE                                                        
                       MOVE WK-AMT-OUT TO MBAL01O                               
                    END-IF                                                      
                    MOVE WK-AMT-OUT TO TWA-MBAL01-9                             
                    MOVE MBAL01I TO TWA-MBAL01                                  
                    IF TWA-MBAL01-9 NOT = ZEROS                                 
LRM011                 IF TWA-B1-434714 > '0'                                   
LRM011                 AND TWA-MBAL01 = TWA-ORIG-MBAL01                         
LRM011                   CONTINUE                                               
LRM011                 ELSE                                                     
LRM033                    MOVE TWA-MBAL01 TO TWA-ORIG-MBAL01                    
                          PERFORM VALIDATE-BAL01-WITH-MRGN                      
LRM011                 END-IF                                                   
LRM017                 IF TWA-FREEZE-CASH-CREDIT = 'Y'                          
LRM017                 AND TWA-FREEZE-CASH-DEBIT  = 'Y'                         
LRM017                 AND TWA-MBAL01-9 NOT = ZERO                              
LRM017                    MOVE ATT-UNPROT-BRT TO MBAL01A                        
LRM017                    IF NOT INPUT-ERROR                                    
LRM017                       MOVE -1 TO MBAL01L                                 
LRM017                       SET INPUT-ERROR TO TRUE                            
LRM017                       MOVE WS-CASH-FREEZE-FULL-MSG  TO SYSTEM-MSG        
LRM017                       MOVE SPACES TO TWA-ORIG-MBAL01                     
LRM017                    END-IF                                                
LRM017                 ELSE                                                     
LRM017                 IF TWA-FREEZE-CASH-CREDIT = 'Y'                          
LRM017                 AND TWA-MBAL01-9 > ZERO                                  
LRM017                    MOVE ATT-UNPROT-BRT TO MBAL01A                        
LRM017                    IF NOT INPUT-ERROR                                    
LRM017                       MOVE -1 TO MBAL01L                                 
LRM017                       SET INPUT-ERROR TO TRUE                            
LRM017                       MOVE WS-CASH-FREEZE-CR-MSG TO SYSTEM-MSG           
LRM017                       MOVE SPACES TO TWA-ORIG-MBAL01                     
LRM017                    END-IF                                                
LRM017                 ELSE                                                     
LRM017                 IF TWA-FREEZE-CASH-DEBIT  = 'Y'                          
LRM017                 AND TWA-MBAL01-9 < ZERO                                  
LRM017                    MOVE ATT-UNPROT-BRT TO MBAL01A                        
LRM017                    IF NOT INPUT-ERROR                                    
LRM017                       MOVE -1 TO MBAL01L                                 
LRM017                       SET INPUT-ERROR TO TRUE                            
LRM017                       MOVE WS-CASH-FREEZE-DB-MSG  TO SYSTEM-MSG          
LRM017                       MOVE SPACES TO TWA-ORIG-MBAL01                     
LRM017                    END-IF                                                
LRM017                 END-IF END-IF END-IF                                     
LRM033              ELSE                                                        
LRM033                 MOVE TWA-MBAL01 TO TWA-ORIG-MBAL01                       
                    END-IF                                                      
                 ELSE                                                           
                    MOVE ATT-UNPROT-BRT TO MBAL01A                              
                    IF NOT INPUT-ERROR                                          
                       MOVE -1 TO MBAL01L                                       
                       SET INPUT-ERROR TO TRUE                                  
                       MOVE 'BALANCE 01 IS INVALID'                             
                             TO SYSTEM-MSG                                      
                       MOVE SPACES TO TWA-ORIG-MBAL01                           
                    END-IF                                                      
                 END-IF                                                         
LRM*******    END-IF                                                            
           ELSE                                                                 
              MOVE ZEROS       TO TWA-MBAL01-9.                                 
                                                                        10870002
           MOVE ATT-UNPROT TO MBAL02A.                                          
           IF TWA-MBAL02 GREATER SPACES                                         
LRM028        IF TWA-PRTCP-TYPE-CD = '3'                                        
LRM028           MOVE ATT-UNPROT-BRT TO MBAL02A                                 
LRM028           IF NOT INPUT-ERROR                                             
LRM028              MOVE -1 TO MBAL02L                                          
LRM028              SET INPUT-ERROR TO TRUE                                     
LRM028              MOVE 'CASH BALANCE INVALID ON PTF' TO SYSTEM-MSG            
LRM028           END-IF                                                         
LRM028        ELSE                                                              
LRM********   IF TWA-MBAL02 NOT = TWA-ORIG-MBAL02                               
                 MOVE TWA-MBAL02  TO WK-AMT-IN                                  
                 EXEC CICS LINK PROGRAM(WS-EDITMOD)                             
                             COMMAREA(EDIT-AMT-AREA)                            
                             LENGTH(LENGTH OF EDIT-AMT-AREA)                    
                 END-EXEC                                                       
                 IF WK-AMT-RET-CODE = SPACE                                     
                    IF WK-AMT-OUT = ZEROS                                       
                       MOVE SPACES     TO MBAL02I                               
                    ELSE                                                        
                       MOVE WK-AMT-OUT TO MBAL02O                               
                    END-IF                                                      
                    MOVE WK-AMT-OUT TO TWA-MBAL02-9                             
                    MOVE MBAL02I TO TWA-MBAL02                                  
                    IF TWA-MBAL02-9 NOT = ZEROS                                 
LRM011                 IF TWA-B1-434714 > '0'                                   
LRM011                 AND TWA-MBAL02 = TWA-ORIG-MBAL02                         
LRM011                   CONTINUE                                               
LRM011                 ELSE                                                     
LRM033                   MOVE TWA-MBAL02 TO TWA-ORIG-MBAL02                     
                         PERFORM VALIDATE-BAL02-WITH-MRGN                       
LRM011                 END-IF                                                   
LRM017                 IF TWA-FREEZE-CASH-CREDIT = 'Y'                          
LRM017                 AND TWA-FREEZE-CASH-DEBIT  = 'Y'                         
LRM017                 AND TWA-MBAL02-9 NOT = ZERO                              
LRM017                    MOVE ATT-UNPROT-BRT TO MBAL02A                        
LRM017                    IF NOT INPUT-ERROR                                    
LRM017                       MOVE -1 TO MBAL02L                                 
LRM017                       SET INPUT-ERROR TO TRUE                            
LRM017                       MOVE WS-CASH-FREEZE-FULL-MSG  TO SYSTEM-MSG        
LRM017                       MOVE SPACES TO TWA-ORIG-MBAL02                     
LRM017                    END-IF                                                
LRM017                 ELSE                                                     
LRM017                 IF TWA-FREEZE-CASH-CREDIT = 'Y'                          
LRM017                 AND TWA-MBAL02-9 > ZERO                                  
LRM017                    MOVE ATT-UNPROT-BRT TO MBAL02A                        
LRM017                    IF NOT INPUT-ERROR                                    
LRM017                       MOVE -1 TO MBAL02L                                 
LRM017                       SET INPUT-ERROR TO TRUE                            
LRM017                       MOVE WS-CASH-FREEZE-CR-MSG TO SYSTEM-MSG           
LRM017                       MOVE SPACES TO TWA-ORIG-MBAL02                     
LRM017                    END-IF                                                
LRM017                 ELSE                                                     
LRM017                 IF TWA-FREEZE-CASH-DEBIT  = 'Y'                          
LRM017                 AND TWA-MBAL02-9 < ZERO                                  
LRM017                    MOVE ATT-UNPROT-BRT TO MBAL02A                        
LRM017                    IF NOT INPUT-ERROR                                    
LRM017                       MOVE -1 TO MBAL02L                                 
LRM017                       SET INPUT-ERROR TO TRUE                            
LRM017                       MOVE WS-CASH-FREEZE-DB-MSG  TO SYSTEM-MSG          
LRM017                       MOVE SPACES TO TWA-ORIG-MBAL02                     
LRM017                    END-IF                                                
LRM017                 END-IF END-IF END-IF                                     
LRM033              ELSE                                                        
LRM033                 MOVE TWA-MBAL02 TO TWA-ORIG-MBAL02                       
                    END-IF                                                      
                 ELSE                                                           
                    MOVE ATT-UNPROT-BRT TO MBAL02A                              
                    IF NOT INPUT-ERROR                                          
                       MOVE -1 TO MBAL02L                                       
                       SET INPUT-ERROR TO TRUE                                  
                       MOVE 'BALANCE 02 IS INVALID'                             
                             TO SYSTEM-MSG                                      
                       MOVE SPACES TO TWA-ORIG-MBAL02                           
                    END-IF                                                      
LRM********   END-IF                                                            
           ELSE                                                                 
              MOVE ZEROS       TO TWA-MBAL02-9.                                 
                                                                        10870002
           MOVE ATT-UNPROT TO MBAL05A.                                          
           IF TWA-MBAL05 GREATER SPACES                                         
LRM028        IF TWA-PRTCP-TYPE-CD = '3'                                        
LRM028           MOVE ATT-UNPROT-BRT TO MBAL05A                                 
LRM028           IF NOT INPUT-ERROR                                             
LRM028              MOVE -1 TO MBAL05L                                          
LRM028              SET INPUT-ERROR TO TRUE                                     
LRM028              MOVE 'CASH BALANCE INVALID ON PTF' TO SYSTEM-MSG            
LRM028           END-IF                                                         
LRM028        ELSE                                                              
LRM*******    IF TWA-MBAL05 NOT = TWA-ORIG-MBAL05                               
                 MOVE TWA-MBAL05  TO WK-AMT-IN                                  
                 EXEC CICS LINK PROGRAM(WS-EDITMOD)                             
                             COMMAREA(EDIT-AMT-AREA)                            
                             LENGTH(LENGTH OF EDIT-AMT-AREA)                    
                 END-EXEC                                                       
                 IF WK-AMT-RET-CODE = SPACE                                     
                    IF WK-AMT-OUT = ZEROS                                       
                       MOVE SPACES     TO MBAL05I                               
                    ELSE                                                        
                       MOVE WK-AMT-OUT TO MBAL05O                               
                    END-IF                                                      
                    MOVE WK-AMT-OUT TO TWA-MBAL05-9                             
                    MOVE MBAL05I TO TWA-MBAL05                                  
                    IF TWA-MBAL05-9 NOT = ZEROS                                 
LRM011                 IF TWA-B1-434714 > '0'                                   
LRM011                 AND TWA-MBAL05 = TWA-ORIG-MBAL05                         
LRM011                   CONTINUE                                               
LRM011                 ELSE                                                     
LRM033                   MOVE TWA-MBAL05 TO TWA-ORIG-MBAL05                     
                         PERFORM VALIDATE-BAL05-WITH-MRGN                       
LRM011                 END-IF                                                   
LRM017                 IF TWA-FREEZE-CASH-CREDIT = 'Y'                          
LRM017                 AND TWA-FREEZE-CASH-DEBIT  = 'Y'                         
LRM017                 AND TWA-MBAL05-9 NOT = ZERO                              
LRM017                    MOVE ATT-UNPROT-BRT TO MBAL05A                        
LRM017                    IF NOT INPUT-ERROR                                    
LRM017                       MOVE -1 TO MBAL05L                                 
LRM017                       SET INPUT-ERROR TO TRUE                            
LRM017                       MOVE WS-CASH-FREEZE-FULL-MSG  TO SYSTEM-MSG        
LRM017                       MOVE SPACES TO TWA-ORIG-MBAL05                     
LRM017                    END-IF                                                
LRM017                 ELSE                                                     
LRM017                 IF TWA-FREEZE-CASH-CREDIT = 'Y'                          
LRM017                 AND TWA-MBAL05-9 > ZERO                                  
LRM017                    MOVE ATT-UNPROT-BRT TO MBAL05A                        
LRM017                    IF NOT INPUT-ERROR                                    
LRM017                       MOVE -1 TO MBAL05L                                 
LRM017                       SET INPUT-ERROR TO TRUE                            
LRM017                       MOVE WS-CASH-FREEZE-CR-MSG TO SYSTEM-MSG           
LRM017                       MOVE SPACES TO TWA-ORIG-MBAL05                     
LRM017                    END-IF                                                
LRM017                 ELSE                                                     
LRM017                 IF TWA-FREEZE-CASH-DEBIT  = 'Y'                          
LRM017                 AND TWA-MBAL05-9 < ZERO                                  
LRM017                    MOVE ATT-UNPROT-BRT TO MBAL05A                        
LRM017                    IF NOT INPUT-ERROR                                    
LRM017                       MOVE -1 TO MBAL05L                                 
LRM017                       SET INPUT-ERROR TO TRUE                            
LRM017                       MOVE WS-CASH-FREEZE-DB-MSG  TO SYSTEM-MSG          
LRM017                       MOVE SPACES TO TWA-ORIG-MBAL05                     
LRM017                    END-IF                                                
LRM017                 END-IF END-IF END-IF                                     
LRM033              ELSE                                                        
LRM033                 MOVE TWA-MBAL05 TO TWA-ORIG-MBAL05                       
                    END-IF                                                      
                 ELSE                                                           
                    MOVE ATT-UNPROT-BRT TO MBAL05A                              
                    IF NOT INPUT-ERROR                                          
                       MOVE -1 TO MBAL05L                                       
                       SET INPUT-ERROR TO TRUE                                  
                       MOVE 'BALANCE 05 IS INVALID'                             
                             TO SYSTEM-MSG                                      
                       MOVE SPACES TO TWA-ORIG-MBAL05                           
                    END-IF                                                      
                 END-IF                                                         
LRM*********  END-IF                                                            
           ELSE                                                                 
              MOVE ZEROS       TO TWA-MBAL05-9.                                 
                                                                        10870002
LRM003     IF TWA-PTR-BEEN-FLIPPED                                              
LRM003        GO TO SKIP-TIF-EDIT2                                              
LRM003     END-IF.                                                              
                                                                                
           MOVE ATT-UNPROT TO MCTYPEA.                                          
           IF (TWA-MCTYPE NOT GREATER SPACES                                    
LRM027     OR (TWA-MCTYPE GREATER SPACES                                        
LRM027       AND WS-NEW-ACCOUNT                                                 
LRM027       AND NOT ACCOUNT-TYPE-CHANGED))                                     
           AND ACATNAIO-FOUND                                                   
              PERFORM SET-CUST-TYPE-B1-DEFAULT-RTN                              
              MOVE TWA-MCTYPE  TO MCTYPEO                                       
           END-IF.                                                              
                                                                                
           IF TWA-MCTYPE NOT GREATER SPACES                                     
              MOVE ATT-UNPROT-BRT TO MCTYPEA                                    
              IF NOT INPUT-ERROR                                                
                 MOVE -1 TO MCTYPEL                                             
                 MOVE                                                           
                   'CUST ACCOUNT TYPE IS REQUIRED; PRESS PF9 FOR LIST'          
                        TO SYSTEM-MSG                                           
                 SET INPUT-ERROR TO TRUE                                        
              END-IF                                                            
           ELSE                                                                 
LRM028        IF TWA-MCTYPE = 'SS'                                              
LRM028           CONTINUE                                                       
LRM028        ELSE                                                              
              MOVE 1 TO SUB                                                     
LRM039        PERFORM UNTIL SUB > WS-ACCOUNT-TYPE-CHOICES                       
                        OR WS-ACCOUNT-TYPE(SUB) = TWA-MCTYPE                    
                 ADD 1 TO SUB                                                   
              END-PERFORM                                                       
LRM039        IF SUB > WS-ACCOUNT-TYPE-CHOICES                                  
                 MOVE ATT-UNPROT-BRT TO MCTYPEA                                 
                 IF NOT INPUT-ERROR                                             
                    MOVE -1 TO MCTYPEL                                          
                    MOVE                                                        
                        'CUST ACCOUNT TYPE IS INVALID; ENTER ? FOR LIST'        
                            TO SYSTEM-MSG                                       
                    SET INPUT-ERROR TO TRUE.                                    
                                                                                
           MOVE ATT-UNPROT TO MCBRKRA.                                          
           IF TWA-MCBRKR NOT GREATER SPACES                                     
              MOVE ATT-UNPROT-BRT TO MCBRKRA                                    
              IF NOT INPUT-ERROR                                                
                 MOVE -1 TO MCBRKRL                                             
                 MOVE 'CONTRA BROKER IS REQUIRED' TO SYSTEM-MSG                 
                 SET INPUT-ERROR TO TRUE                                        
              END-IF                                                            
           ELSE                                                                 
           IF TWA-MCBRKR = ACAT-ADP-BROKER                                      
              MOVE ATT-UNPROT-BRT TO MCBRKRA                                    
              IF NOT INPUT-ERROR                                                
                 MOVE -1 TO MCBRKRL                                             
                 MOVE 'CONTRA BROKER CANNOT BE YOURSELF' TO SYSTEM-MSG          
                 SET INPUT-ERROR TO TRUE                                        
              END-IF                                                            
           ELSE                                                                 
              MOVE TWA-MCBRKR TO ACATPPIO-BRKR                                  
              SET ACATPPIO-READ TO TRUE                                         
              PERFORM LINK-TO-ACATPPIO-RTN                                      
              IF ACATPPIO-FOUND                                                 
                 MOVE ACATPPIO-NAME TO TWA-MCBNAM  MCBNAMO                      
LRM028           MOVE ACATPPIO-PRTCP-TYPE-CD TO TWA-PRTCP-TYPE-CD               
LRM028           IF TWA-SECR-ACTION = 'A'                                       
LRM028              IF ACATPPIO-PRTCP-TYPE-CD = '3'                             
LRM028                 IF TWA-INP-TFR-TYP NOT = 'PTF'                           
LRM028                    MOVE 'CHANGED TO PTF MODE' TO PF4MSGO                 
LRM028                 ELSE                                                     
LRM028                    MOVE 'PTF MODE'            TO PF4MSGO                 
LRM028                 END-IF                                                   
LRM028                 MOVE 'PTF' TO TWA-INP-TFR-TYP MMTFRO                     
LRM028              ELSE                                                        
LRM028                 MOVE 'PTD' TO TWA-INP-TFR-TYP MMTFRO                     
LRM028                 MOVE SPACES                   TO PF4MSGO                 
LRM028              END-IF                                                      
LRM028           ELSE                                                           
LRM028              MOVE TWA-INP-TFR-TYP TO MMTFRO                              
              ELSE                                                              
                 MOVE SPACES        TO TWA-MCBNAM  MCBNAMO                      
                 MOVE ATT-UNPROT-BRT TO MCBRKRA                                 
                 IF NOT INPUT-ERROR                                             
                    MOVE -1 TO MCBRKRL                                          
                    SET INPUT-ERROR TO TRUE                                     
                    IF ACATPPIO-NOT-FOUND                                       
                       MOVE 'CONTRA BROKER IS INVALID' TO SYSTEM-MSG            
                    ELSE                                                        
                    IF ACATPPIO-DB-ERROR                                        
                       MOVE 'READ'            TO WS-DB2-PROBLEM-FUNCTION        
                       MOVE ACATPPIO-SQLCAID  TO WS-DB2-PROBLEM-TABLE           
                       MOVE ACATPPIO-SQLCODE  TO WS-DB2-PROBLEM-ID              
                       MOVE WS-DB2-PROBLEM-MSG TO SYSTEM-MSG                    
                       PERFORM DB2-ERROR-RTN.                                   
                                                                                
LRM028     IF TWA-MCTYPE = 'SS'                                                 
LRM028     AND TWA-INP-TFR-TYP NOT = 'PTF'                                      
LRM028        MOVE ATT-UNPROT-BRT TO MCTYPEA                                    
LRM028        IF NOT INPUT-ERROR                                                
LRM028           MOVE -1 TO MCTYPEL                                             
LRM028           MOVE                                                           
LRM028             'CUST ACCOUNT TYPE SS ONLY VALID ON PTF'                     
LRM028                     TO SYSTEM-MSG                                        
LRM028             SET INPUT-ERROR TO TRUE.                                     
                                                                                
           MOVE ATT-UNPROT TO MCACCTA.                                          
LRM014     MOVE SPACES TO MCACMSGO.                                             
           PERFORM JUSTIFY-LEFT-MCACCT.                                         
           IF MCACCT-ERROR                                                      
              MOVE ATT-UNPROT-BRT TO MCACCTA                                    
              IF NOT INPUT-ERROR                                                
                 MOVE -1 TO MCACCTL                                             
                 MOVE 'CONTRA ACCOUNT CHARACTERS NOT A THRU Z, 0 THRU 9'        
                                TO SYSTEM-MSG                                   
                 SET INPUT-ERROR TO TRUE                                        
              END-IF                                                            
           ELSE                                                                 
           IF TWA-MCACCT(1 : 1) NOT GREATER SPACES                              
              MOVE ATT-UNPROT-BRT TO MCACCTA                                    
              IF NOT INPUT-ERROR                                                
                 MOVE -1 TO MCACCTL                                             
                 MOVE 'CONTRA ACCOUNT IS REQUIRED' TO SYSTEM-MSG                
                 SET INPUT-ERROR TO TRUE                                        
              END-IF                                                            
           ELSE                                                                 
              MOVE TWA-MCACCT TO MCACCTO                                        
LRM014        IF TWA-MCACCT > SPACES                                            
LRM014        AND TWA-MCBRKR > SPACES                                           
LRM014           MOVE TWA-CLIENT-NO-X TO ACATRSIO-CLIENT-NBR                    
LRM014           SET ACATRSIO-EDIT-CONTRA-ACCT TO TRUE                          
LRM014           MOVE TWA-MCBRKR TO ACATRSIO-BRKR-CONTRA-NBR                    
LRM014           MOVE TWA-MCACCT TO ACATRSIO-CONTRA-ACCT                        
LRM014           PERFORM LINK-TO-ACATRSTIO-RTN                                  
LRM014           IF ACATRSIO-CONTRA-EDIT-FAIL                                   
LRM014              MOVE ATT-ASKIP-BRT  TO MCACMSGA                             
LRM014              MOVE 'ACCOUNT EDIT WARNING' TO MCACMSGO                     
LRM014              IF ACATRSIO-CONTRA-ACCT-FAIL-NBR > '00'                     
LRM014                 MOVE ACATRSIO-CONTRA-ACCT-FAIL-NBR                       
LRM014                                          TO MCACMSGO (22 : 2)            
LRM014              END-IF                                                      
LRM014              IF (TWA-ACTION = 'A' OR LOW-VALUES)                         
LRM014              AND (TWA-MCACCT NOT = TWA-EDIT-MCACCT                       
LRM014               OR TWA-MCBRKR NOT = TWA-EDIT-MCBRKR)                       
LRM014                 MOVE ATT-UNPROT-BRT TO MCACCTA                           
LRM014                 MOVE TWA-MCACCT TO TWA-EDIT-MCACCT                       
LRM014                 MOVE TWA-MCBRKR TO TWA-EDIT-MCBRKR                       
LRM014                 IF NOT INPUT-ERROR                                       
LRM014                    MOVE -1 TO MCACCTL                                    
LRM014                    MOVE                                                  
LRM014                   'PRESS ENTER TO BYPASS CONTRA ACCOUNT WARNING'         
LRM014                       TO SYSTEM-MSG                                      
LRM014                    SET INPUT-ERROR TO TRUE                               
LRM014     END-IF.                                                              
                                                                                
LRM003 SKIP-TIF-EDIT2.                                                          
      *---------------------------------------------------------------*         
      * THE ACTION DETERMINATION LOGIC BELOW ASSUMES (INSERT) WHEN TIF          
      * NOT FOUND AND (UPDATE) WHEN FOUND.  ONCE A RECORD IS DISPLAYED,         
      * THEN CHANGES TO BR/AC IS A LOGICAL KEY CHANGE (NEW SESSION),            
      * CHANGES TO DLVR BRKR/ACCT IS AN (UPDATE) TO THIS RECORD.                
      *---------------------------------------------------------------*         
******** ON KEY CHANGE, SEE WHAT'S ON FILE...                                   
           IF NOT INPUT-ERROR                                                   
           AND (TWA-INTRAN-BRW                                          04809810
             OR TWA-MCBRKR NOT = TWA-ORIG-RCV-NBR                               
             OR TWA-MCACCT NOT = TWA-ORIG-RCV-ACCT)                             
              PERFORM READ-ACAT-RTN                                             
              IF (ACAT11IO-NOT-FOUND                                            
              OR (ACAT11IO-ACTIVE-FOUND                                         
                 AND ACAT11IO-STTS-CD = '140' OR '600'))                        
                 IF ACAT-SIGN-ON-UPDATE                                         
                    MOVE 'A' TO TWA-ACTION TWA-SECR-ACTION                      
                 ELSE                                                           
                    SET TWA-INTRAN-BRW TO TRUE                                  
                    MOVE ATT-UNPROT-BRT TO MCBRKRA                              
                                           MCACCTA                              
                    IF NOT INPUT-ERROR                                          
                       MOVE -1 TO MCBRKRL                                       
                       MOVE                                                     
                       'TIF NOT FOUND; USE PA1 FOR GENERIC BROWSE'              
                                TO SYSTEM-MSG                                   
                       SET INPUT-ERROR TO TRUE                                  
                    END-IF                                                      
              ELSE                                                              
  ********** FOUND...                                                           
                 IF NOT TWA-INTRAN-BRW                                          
                 AND TWA-ACTION = 'C'                                           
                 AND TWA-ORIG-RCV-NBR > SPACES                                  
                 AND (TWA-ORIG-RCV-NBR NOT = TWA-MCBRKR                         
                   OR TWA-ORIG-RCV-ACCT NOT = TWA-MCACCT)                       
                    MOVE ATT-UNPROT-BRT TO MCBRKRA                              
                                           MCACCTA                              
                    IF NOT INPUT-ERROR                                          
                       MOVE -1 TO MCBRKRL                                       
                       MOVE                                                     
                     'CONTRA BRKR/ACCOUNT ALREADY EXISTS ON ANOTHER TIF'        
                                TO SYSTEM-MSG                                   
                       SET INPUT-ERROR TO TRUE                                  
                    END-IF                                                      
                 ELSE                                                           
LRM007              MOVE 'PF2 TO CREATE ADDITIONAL TIF' TO CMNTMSGO             
LRM007              IF TWA-DUPE-FOUND NOT = 'Y'                                 
                       PERFORM READ-NEXT-ASSET-RTN                              
LRM007              END-IF                                                      
LRM007              MOVE 'Y'  TO TWA-DUPE-FOUND                                 
                    IF TWA-INTRAN-BRW                                           
                    OR (TWA-ACTION NOT = 'B' AND 'C')                           
                       PERFORM MOVE-ACAT11IO-TO-TWA-RTN                         
                       PERFORM REFORMAT-SCREEN-DETAIL                           
                       MOVE 'TRANSFER DISPLAYED' TO SYSTEM-MSG                  
                       SET TWA-INTRAN-BRW TO TRUE                               
                       IF (NOT ACAT11IO-ACTIVE-FOUND                            
LRM003                 AND NOT ACAT11IO-NSCC-SUBMITTED)                         
                       OR (ACAT11IO-ACTIVE-FOUND                                
                          AND (ACAT11IO-STTS-CD = '140' OR '600'))              
ASSET                  OR (ACAT11IO-ASSET-FOUND                                 
                          AND (ACAT11IO-NSCC-SUBMIT-ELIGIBLE                    
                            OR ACAT11IO-NSCC-SUBMIT-HOLD))                      
                          MOVE 'C' TO TWA-ACTION                                
                          MOVE -1 TO MNAMEL                                     
                          MOVE ACAT11IO-RCV-NBR   TO TWA-ORIG-RCV-NBR           
                          MOVE ACAT11IO-RCV-ACCT TO TWA-ORIG-RCV-ACCT           
                          IF TWA-MSUBM = 'Y'                                    
                             MOVE 'TIF DISPLAYED / AWAITNG NSCC XMIT'           
                                  TO SYSTEM-MSG                                 
                          ELSE                                                  
                             MOVE 'TIF DISPLAYED / SUBMIT PENDING'              
                                  TO SYSTEM-MSG                                 
                          END-IF                                                
                          MOVE -1 TO MNAMEL                                     
                       ELSE                                                     
                          MOVE 'B' TO TWA-ACTION                                
                          MOVE -1 TO MBRL                                       
                          SET INPUT-ERROR TO TRUE                               
                          IF ACAT11IO-NSCC-ACKNOWLEDGEMENT                      
                             MOVE WS-ACKNOWLEDGE-MSG TO SYSTEM-MSG              
                          ELSE                                                  
                          IF ACAT11IO-NSCC-SUBMITTED                            
LRM024                       IF ACAT-ASCENDIS-CLIENT                            
LRM024                          MOVE WS-FRWD-ASCENDIS-MSG TO SYSTEM-MSG         
LRM024                       ELSE                                               
                                MOVE WS-SUBMITTED-MSG TO SYSTEM-MSG             
                          ELSE                                                  
                          IF ACAT11IO-ACTIVE-FOUND                              
LRM024                       IF ACAT-ASCENDIS-CLIENT                            
LRM024                       MOVE                                               
LRM024            'ACTIVE TRANSFER DISPLAYED / BROWSE ONLY / ASCENDIS'          
LRM024                            TO SYSTEM-MSG                                 
LRM024                       ELSE                                               
                             MOVE                                               
                               'ACTIVE TRANSFER DISPLAYED / BROWSE ONLY'        
                                  TO SYSTEM-MSG                                 
                          ELSE                                                  
LRM024                       IF ACAT-ASCENDIS-CLIENT                            
LRM024                       MOVE                                               
LRM024                    'TRANSFER DISPLAYED / BROWSE ONLY / ASCENDIS'         
LRM024                            TO SYSTEM-MSG                                 
LRM024                       ELSE                                               
                             MOVE 'TRANSFER DISPLAYED / BROWSE ONLY'            
                                  TO SYSTEM-MSG.                                
                                                                                
LRM003     IF TWA-PTR-BEEN-FLIPPED                                              
LRM003        GO TO SKIP-TIF-EDIT3                                              
LRM003     END-IF.                                                              
                                                                                
           MOVE ATT-UNPROT TO  MNAMEA                                           
                               MNAME2A.                                         
                                                                                
           MOVE ATT-UNPROT TO  MSSNA.                                           
           IF TWA-MSSN = SPACES                                                 
              MOVE ATT-UNPROT-BRT TO MSSNA                                      
              IF NOT INPUT-ERROR                                                
                 MOVE -1 TO MSSNL                                               
                 MOVE 'TAX ID NUMBER IS REQUIRED' TO SYSTEM-MSG                 
                 SET INPUT-ERROR TO TRUE                                        
              END-IF                                                            
           ELSE                                                                 
              MOVE TWA-MSSN TO WS-SSN-EDIT                                      
              PERFORM SSN-EDIT-RTN                                              
              IF SSN-INVALID                                                    
                 MOVE ATT-UNPROT-BRT TO MSSNA                                   
                 IF NOT INPUT-ERROR                                             
                    MOVE -1 TO MSSNL                                            
                    MOVE 'TAX ID NUMBER IS INVALID' TO SYSTEM-MSG               
                    SET INPUT-ERROR TO TRUE                                     
                 END-IF                                                         
              ELSE                                                              
                 MOVE WS-SSN-EDIT TO TWA-MSSN MSSNO.                            
                                                                                
LRM028     IF TWA-INP-TFR-TYP = 'PTD' OR 'PTF'                          04809710
LRM021        MOVE ATT-UNPROT TO  GIFTINDA                                      
LRM021        IF TWA-GIFT-IND NOT = 'N' AND 'Y' AND ' '                         
LRM021           MOVE ATT-UNPROT-BRT TO GIFTINDA                                
LRM021           IF NOT INPUT-ERROR                                             
LRM021              MOVE -1 TO GIFTINDL                                         
LRM021              MOVE                                                        
LRM028              'GIFT INDICATOR (PTD/PTF) MUST BE Y, N OR SPACE'            
LRM021                                      TO SYSTEM-MSG                       
LRM021              SET INPUT-ERROR TO TRUE                                     
LRM021           END-IF                                                         
LRM021     END-IF.                                                              
                                                                                
           MOVE ATT-UNPROT TO  MSSN2A.                                          
           IF TWA-MSSN2 NOT = SPACES AND LOW-VALUES                             
              MOVE TWA-MSSN2 TO WS-SSN-EDIT                                     
              PERFORM SSN-EDIT-RTN                                              
              IF SSN-INVALID                                                    
                 MOVE ATT-UNPROT-BRT TO MSSN2A                                  
                 IF NOT INPUT-ERROR                                             
                    MOVE -1 TO MSSN2L                                           
                    MOVE '2ND TAX ID NUMBER IS INVALID' TO SYSTEM-MSG           
                    SET INPUT-ERROR TO TRUE                                     
                 END-IF                                                         
              ELSE                                                              
                 MOVE WS-SSN-EDIT TO TWA-MSSN2 MSSN2O.                          
                                                                                
LRM003 SKIP-TIF-EDIT3.                                                          
           MOVE ATT-UNPROT TO MCMNTA.                                           
           IF TWA-MCMNT GREATER SPACES                                          
           AND TWA-MCMNT NOT = 'Y' AND 'N'                                      
              MOVE ATT-UNPROT-BRT TO MCMNTA                                     
              IF NOT INPUT-ERROR                                                
                 MOVE -1 TO MCMNTL                                              
                 MOVE 'COMMENT INDICATOR MUST BE Y OR SPACE'                    
                             TO SYSTEM-MSG                                      
                 SET INPUT-ERROR TO TRUE.                                       
                                                                                
           MOVE ATT-UNPROT TO MSUBMA.                                           
           IF TWA-MSUBM GREATER SPACES                                          
           AND TWA-MSUBM NOT = 'Y' AND 'N'                                      
              MOVE ATT-UNPROT-BRT TO MSUBMA                                     
              IF NOT INPUT-ERROR                                                
                 MOVE -1 TO MSUBML                                              
                 MOVE 'SUBMIT INDICATOR MUST BE Y, N OR SPACE'                  
                             TO SYSTEM-MSG                                      
                 SET INPUT-ERROR TO TRUE                                        
LRM029        END-IF                                                            
LRM029     ELSE                                                                 
LRM029     IF TWA-MSUBM = SPACES                                                
LRM029     AND NOT FIRST-TIME                                                   
LRM029     AND TWA-ACTION = 'A'                                                 
LRM029     AND ACAT-DEFAULT-TO-SUBMIT-IND = '1'                                 
LRM029        MOVE 'Y' TO TWA-MSUBM MSUBMO                                      
LRM029     END-IF.                                                              
                                                                                
           MOVE ATT-UNPROT TO MDELA.                                            
           IF TWA-MDEL GREATER SPACES                                           
           AND TWA-MDEL NOT = 'Y' AND 'N'                                       
              MOVE ATT-UNPROT-BRT TO MDELA                                      
              IF NOT INPUT-ERROR                                                
                 MOVE -1 TO MDELL                                               
                 MOVE 'DELETE INDICATOR MUST BE Y, N OR SPACE'                  
                             TO SYSTEM-MSG                                      
                 SET INPUT-ERROR TO TRUE.                                       
                                                                                
           IF TWA-ACTION NOT = 'C'                                              
              MOVE ATT-ASKIP TO MDELA.                                          
                                                                                
******** ALLOW USER TO DELETE ANY EXISTING PTD OR DLVY PTR.                     
           IF TWA-MDEL = 'Y'                                                    
           AND TWA-ACTION = 'C'                                                 
LRM028     AND ((TWA-INP-TFR-TYP = 'PTD' OR 'PTF')                              
LRM003      OR (TWA-INP-TFR-TYP = 'PTR' AND TWA-PTR-BEEN-FLIPPED))              
              MOVE 'N' TO INPUT-ERROR-FLAG                              00970002
              GO TO PROCESS-MAP-ITEMS-EXIT.                                     
                                                                                
     **** FIELDS ON ASSET SECTION...                                            
LRM003     IF TWA-SECR-ACTION = 'A'                                             
              MOVE ATT-UNPROT TO MSECRA                                         
LRM035        IF TWA-ORIG-MSECR NOT > SPACES                                    
LRM035           MOVE ATT-UNPROT TO MEXPDTA MCALLA MLONGA MSTRIKEA              
LRM035        ELSE                                                              
LRM035           MOVE ATT-ASKIP  TO MEXPDTA MCALLA MLONGA MSTRIKEA              
LRM035        END-IF                                                            
LRM003     ELSE                                                                 
LRM003        MOVE ATT-ASKIP  TO MSECRA                                         
LRM035                           MEXPDTA MCALLA MLONGA MSTRIKEA                 
LRM003     END-IF.                                                              
           IF TWA-MSECR NOT GREATER SPACES                                      
              CONTINUE                                                          
           ELSE                                                                 
           IF TWA-SECR-ACTION NOT = 'A'                                         
KEYCH      AND TWA-MSECR NOT = TWA-ORIG-MSECR                                   
              PERFORM BROWSE-ASSET-RTN                                          
           ELSE                                                                 
           IF TWA-SECR-ACTION = 'A'                                             
LRM017        IF TWA-FREEZE-SEC-LONG = 'Y'                                      
LRM017        AND TWA-FREEZE-SEC-SHORT = 'Y'                                    
LRM017        AND (TWA-MSECR GREATER SPACES                                     
LRM017         OR TWA-MDESC(1 : 10) GREATER SPACES                              
LRM017         OR TWA-MCATGR > SPACES                                           
LRM017         OR TWA-MSLOC > SPACES                                            
LRM017         OR TWA-MQTY > SPACES                                             
LRM017         OR TWA-MCD > SPACES                                              
LRM017         OR TWA-MTYPE > SPACES)                                           
LRM017            MOVE ATT-UNPROT-BRT TO MSECRA                                 
LRM017            IF NOT INPUT-ERROR                                            
LRM017               MOVE -1 TO MSECRL                                          
LRM017               MOVE WS-SEC-FREEZE-FULL-MSG TO SYSTEM-MSG                  
LRM017               SET INPUT-ERROR TO TRUE                                    
LRM017            END-IF                                                        
LRM017        END-IF                                                            
LRM028        PERFORM VARYING SUB FROM 1 BY 1                                   
LRM028              UNTIL SUB GREATER 12                                        
LRM028           IF TWA-MSECR(SUB : 1) < ' '                                    
LRM028              MOVE SPACE TO TWA-MSECR (SUB : 1)                           
LRM028           END-IF                                                         
LRM028        END-PERFORM                                                       
LRM035        IF TWA-MEXPDT  > SPACES                                           
LRM035        OR TWA-MCALL   > SPACES                                           
LRM035        OR TWA-MLONG   > SPACES                                           
LRM035        OR TWA-MSTRIKE > SPACES                                           
LRM035        OR TWA-MLONG > SPACES                                             
LRM035        OR TWA-MSTRIKE > SPACES                                           
LRM035           PERFORM LOOKUP-OPTION-BY-KEYS-RTN                              
LRM035           IF WS-OPTION-NOT-FOUND                                         
LRM035              GO TO SKIP-MSD-READ                                         
LRM035           END-IF                                                         
LRM035        END-IF                                                            
              SET ACATMSD-MSD-READ TO TRUE                                      
LRM043* RETAIN THE SAME ADP NUMBER WHEN THE ISIS IS ON HTE SCREEN AND           
LRM043*   IT WAS NOT CHANGED.                                                   
LRM043        IF TWA-MSECR > SPACES                                             
LRM043        AND TWA-MSECR = TWA-ORIG-MSECR                                    
LRM043        AND TWA-MSECR(1:2) NOT = 'US'                                     
LRM043        AND TWA-MSECR(10:1) > SPACES                                      
LRM043        AND TWA-MSECR(11:1) > SPACES                                      
LRM043        AND TWA-MSECR(12:1) > SPACES                                      
LRM043           MOVE TWA-ADP-NBR TO TWA-MSECR                                  
LRM043        END-IF                                                            
LRM043        MOVE TWA-MSECR TO ACATMSD-SEARCH-KEY                              
              PERFORM LINK-TO-ACATMSDIO-RTN                                     
              IF ACATMSD-FOUND                                                  
                 MOVE ACATMSD-ADP-NBR TO TWA-ADP-NBR                            
                 MOVE ACATMSD-BOND-REG-CODE TO TWA-BOND-REG-CODE                
                 IF TWA-MDESC(1 : 1) NOT GREATER SPACES                         
                 OR TWA-MSECR NOT = TWA-ORIG-MSECR                              
LRM045              IF ACATMSD-CUSIP > SPACES                                   
LRM045              AND (ACATMSD-CUSIP(1:2) NOT = 'XX'                          
LRM045               OR (ACATMSD-CUSIP(1:2) = 'XX'                              
LRM045              AND  ACATMSD-ISIN NOT > SPACES))                            
LRM045                 MOVE ACATMSD-CUSIP   TO TWA-MSECR MSECRO                 
LRM045                                         TWA-ORIG-MSECR                   
LRM045                                         TWA-ORIG-SECR                    
LRM045                 MOVE SPACES          TO TWA-KEY-FIELDS                   
LRM043              ELSE                                                        
LRM043              IF  ACATMSD-ISIN > SPACES                                   
LRM045******        AND ACATMSD-ISIN(1:2) NOT = 'US'                            
LRM043                 MOVE ACATMSD-ISIN TO TWA-MSECR MSECRO                    
LRM043                                         TWA-ORIG-MSECR                   
LRM043                                         TWA-ORIG-SECR                    
LRM045                                         TWA-KEY-FIELDS                   
LRM045              ELSE                                                        
LRM045                 MOVE 'XX' TO TWA-MSECR                                   
LRM045                 MOVE ACATMSD-ADP-NBR TO TWA-MSECR (3 : 7)                
LRM045                 MOVE TWA-MSECR    TO MSECRO                              
LRM045                                      TWA-ORIG-MSECR                      
LRM045                                      TWA-ORIG-SECR                       
LRM045                 MOVE SPACES          TO TWA-KEY-FIELDS                   
LRM045              END-IF END-IF                                               
LRM035              MOVE SPACES TO TWA-MEXPDT MEXPDTO                           
LRM035                             TWA-MCALL  MCALLO                            
LRM035                             TWA-MLONG  MLONGO                            
LRM035                             TWA-MSTRIKE MSTRIKEO                         
LRM035              MOVE ATT-ASKIP TO MEXPDTA MCALLA MLONGA MSTRIKEA            
LRM012**************OPTION ASSET BOOKS W/WRONG ADP NBR.                         
LRM012              MOVE ACATMSD-CLASS-CD TO WK-MS-CLASS                        
LRM012              IF  (TWA-ADP-NBR (1:1) = '8' OR '9')                        
LRM012              AND (WK-MS-CLASS-1-2-3 = '664' OR '665')                    
LRM012                 MOVE 'XX' TO TWA-MSECR                                   
LRM012                 MOVE ACATMSD-ADP-NBR TO TWA-MSECR (3 : 7)                
LRM012                 MOVE TWA-MSECR    TO MSECRO                              
LRM012                                      TWA-ORIG-MSECR                      
LRM012                                      TWA-ORIG-SECR                       
LRM012              END-IF                                                      
                    IF TWA-MDESC(1 : 1) NOT GREATER SPACES                      
                       MOVE ACATMSD-DESC    TO TWA-MDESC MDESCO                 
CSG001* IN SOME CASES MSD DESCRIPTIONS CONTAIN SPECIAL CHARACTERS.              
CSG001* CORRECT THEM BY REPLACING SPECIAL CHARACTERS WITH SPACES.               
CSG001                 MOVE ACATMSD-DESC      TO W-ASSET-DESC-TXT               
CSG001                 MOVE 30                TO W-SUB3                         
CSG001                 SET W-JUST-LEFT-REQ-Y  TO TRUE                           
CSG001                 PERFORM EDIT-ASSET-DESC-TXT                              
CSG001                 MOVE W-ASSET-DESC-TXT  TO TWA-MDESC MDESCO               
                       MOVE ACATMSD-DESC2   TO TWA-MDESC2 MDESC2O               
CSG001                 MOVE ACATMSD-DESC2     TO W-ASSET-DESC-TXT               
CSG001                 MOVE 30                TO W-SUB3                         
CSG001                 SET W-JUST-LEFT-REQ-N  TO TRUE                           
CSG001                 PERFORM EDIT-ASSET-DESC-TXT                              
CSG001                 MOVE W-ASSET-DESC-TXT  TO TWA-MDESC2 MDESC2O             
                       MOVE ACATMSD-DESC3   TO TWA-MDESC3 MDESC3O               
CSG001                 MOVE ACATMSD-DESC3     TO W-ASSET-DESC-TXT               
CSG001                 MOVE 30                TO W-SUB3                         
CSG001                 SET W-JUST-LEFT-REQ-N  TO TRUE                           
CSG001                 PERFORM EDIT-ASSET-DESC-TXT                              
CSG001                 MOVE W-ASSET-DESC-TXT  TO TWA-MDESC3 MDESC3O             
                    END-IF                                                      
                 END-IF                                                         
                 PERFORM CHECK-ISIN-RESTRICTIONS-RTN                            
                 IF TWA-MCATGR NOT GREATER SPACES                               
                 OR TWA-MSECR NOT = TWA-ORIG-MSECR                              
                    PERFORM 5440-ASSET-PRICING-CATEGORY                         
                       THRU 5440-EXIT                                           
                 END-IF                                                         
LRM003           IF TWA-MSLOC NOT GREATER SPACES                                
LRM003              PERFORM 5450-SETTLE-LOC-RTN                                 
LRM003           END-IF                                                         
              ELSE                                                              
              IF ACATMSD-NOT-FOUND                                              
                 MOVE ATT-UNPROT-BRT TO MSECRA                                  
                 IF NOT INPUT-ERROR                                             
                    MOVE -1 TO MSECRL                                           
                    MOVE 'SECURITY NOT FOUND ON MSD' TO SYSTEM-MSG              
                    SET INPUT-ERROR TO TRUE                                     
                 END-IF                                                         
              ELSE                                                              
              IF ACATMSD-NOT-AVAIL                                              
                 MOVE ATT-UNPROT-BRT TO MSECRA                                  
                 IF NOT INPUT-ERROR                                             
                    MOVE -1 TO MSECRL                                           
                    MOVE 'MSD FILE IS NOT AVAILABLE' TO SYSTEM-MSG              
                    SET INPUT-ERROR TO TRUE                                     
                 END-IF                                                         
              ELSE                                                              
              IF ACATMSD-ERROR                                                  
                 MOVE ATT-UNPROT-BRT TO MSECRA                                  
                 IF NOT INPUT-ERROR                                             
                    MOVE -1 TO MSECRL                                           
LRM023              MOVE 'MSD FILE PROBLEM / CALL HELP DESK'                    
LRM023                            TO SYSTEM-MSG                                 
                    SET INPUT-ERROR TO TRUE                                     
                 END-IF.                                                        
                                                                                
LRM035 SKIP-MSD-READ.                                                           
           IF TWA-MSECR NOT GREATER SPACES                                      
              IF (TWA-MDESC > SPACES                                            
                OR TWA-MCATGR > SPACES                                          
                OR TWA-MSLOC > SPACES                                           
                OR TWA-MMEMO > SPACES                                           
                OR TWA-SLOCRSN > SPACES                                         
                OR TWA-MQTY > SPACES                                            
                OR TWA-MAMT > SPACES                                            
                OR TWA-MCD > SPACES                                             
                OR TWA-MTYPE > SPACES)                                          
                   MOVE ATT-UNPROT-BRT TO MSECRA                                
                   IF NOT INPUT-ERROR                                           
                      MOVE -1 TO MSECRL                                         
                      MOVE                                                      
               'CUSIP IS REQUIRED WHEN OTHER ASSET FIELDS ARE PRESENT'          
                            TO SYSTEM-MSG                                       
                      SET INPUT-ERROR TO TRUE                                   
                   END-IF                                                       
              ELSE                                                              
                 GO TO SKIP-ASSET-EDIT.                                         
                                                                                
           MOVE ATT-UNPROT TO MCATGRA.                                          
           IF TWA-MCATGR > SPACES                                               
              IF (TWA-MCATGR = 'ANNU' OR 'CDCP' OR 'CORP' OR 'EQU '             
                  OR 'FCUR' OR 'FDEB' OR 'FEQU'                                 
                  OR 'GOVT' OR 'LPAR' OR 'MBS '                                 
                  OR 'MFMM' OR 'MFNM' OR 'MUNI' OR 'OTH ' OR 'UARP'             
                  OR 'UDSC' OR 'UIT ' OR 'ZERO')                                
                     CONTINUE                                                   
              ELSE                                                              
                 MOVE ATT-UNPROT-BRT TO MCATGRA                                 
                 IF NOT INPUT-ERROR                                             
                    MOVE -1 TO MCATGRL                                          
                    MOVE 'CATEGORY CODE IS INVALID' TO SYSTEM-MSG               
                    SET INPUT-ERROR TO TRUE.                                    
                                                                                
LRM028     IF TWA-MCATGR > SPACES                                               
LRM028     AND TWA-INP-TFR-TYP = 'PTF'                                          
LRM028        IF (TWA-MCATGR NOT = 'MFMM' AND 'MFNM')                           
LRM028           MOVE ATT-UNPROT-BRT TO MCATGRA                                 
LRM028           IF NOT INPUT-ERROR                                             
LRM028              MOVE -1 TO MCATGRL                                          
LRM028              MOVE 'CATEGORY CODE MUST BE MFMM OR MFNM ON PTF'            
LRM028                       TO SYSTEM-MSG                                      
LRM028              SET INPUT-ERROR TO TRUE.                                    
                                                                                
           IF (TWA-MCATGR = 'MFMM' OR 'MFNM')                                   
           AND TWA-MSLOC NOT GREATER SPACES                                     
              MOVE '10' TO TWA-MSLOC MSLOCO                                     
           END-IF.                                                              
LRM003     IF TWA-SECR-ACTION = 'A'                                             
              MOVE ATT-UNPROT TO MSLOCA                                         
LRM003     ELSE                                                                 
LRM003        MOVE ATT-ASKIP  TO MSLOCA                                         
LRM003     END-IF.                                                              
           IF TWA-MSLOC NOT GREATER SPACES                                      
              MOVE '00' TO TWA-MSLOC MSLOCO                                     
           ELSE                                                                 
           IF (TWA-MSLOC = '00' OR '05' OR '10' OR '15' OR '20' OR '25'         
                        OR '30' OR '35' OR '40' OR '45' OR '50')                
              CONTINUE                                                          
           ELSE                                                                 
              MOVE ATT-UNPROT-BRT TO MSLOCA                                     
              IF NOT INPUT-ERROR                                                
                 MOVE -1 TO MSLOCL                                              
                 MOVE 'LOCATION CODE IS INALID' TO SYSTEM-MSG                   
                 SET INPUT-ERROR TO TRUE                                        
              END-IF.                                                           
                                                                                
LRM041     IF TWA-MTYPE = '4'                                                   
LRM041     AND TWA-CLIENT-NO-X(2 : 3) = '010'                                   
LRM041        IF TWA-MSLOC NOT =  '50'                                          
LRM041           MOVE ATT-UNPROT-BRT TO MSLOCA                                  
LRM041           IF NOT INPUT-ERROR                                             
LRM041              MOVE -1 TO MSLOCL                                           
LRM041              MOVE 'LOCATION CODE MUST BE 50 WITH ASET TYPE 4'            
LRM041                       TO SYSTEM-MSG                                      
LRM041              SET INPUT-ERROR TO TRUE                                     
LRM041           END-IF                                                         
LRM041     END-IF.                                                              
                                                                                
LRM028     IF TWA-INP-TFR-TYP = 'PTF'                                           
LRM028     AND TWA-MSLOC > SPACES                                               
LRM028     AND TWA-MSLOC NOT = '10'                                             
LRM028        MOVE ATT-UNPROT-BRT TO MSLOCA                                     
LRM028        IF NOT INPUT-ERROR                                                
LRM028           MOVE -1 TO MSLOCL                                              
LRM028           MOVE 'SETTLE LOCATION CODE MUST BE "10" ON PTF'                
LRM028                       TO SYSTEM-MSG                                      
LRM028           SET INPUT-ERROR TO TRUE                                        
LRM028        END-IF.                                                           
                                                                                
           IF TWA-MCATGR = 'MFMM'                                               
           AND (TWA-MSLOC NOT = '10' AND '50')                                  
              MOVE ATT-UNPROT-BRT TO MSLOCA                                     
              IF NOT INPUT-ERROR                                                
                 MOVE -1 TO MSLOCL                                              
                 MOVE                                                           
              'LOCATION CODE MUST BE 10 OR 50 FOR CATEGORY MFMM'                
                    TO SYSTEM-MSG                                               
                 SET INPUT-ERROR TO TRUE                                        
           END-IF.                                                              
           IF TWA-MCATGR = 'MFNM'                                               
           AND (TWA-MSLOC NOT = '05' AND '10' AND '50')                         
              MOVE ATT-UNPROT-BRT TO MSLOCA                                     
              IF NOT INPUT-ERROR                                                
                 MOVE -1 TO MSLOCL                                              
                 MOVE                                                           
              'LOCATION CODE MUST BE 05,10 OR 50 FOR CATEGORY MFNM'             
                    TO SYSTEM-MSG                                               
                 SET INPUT-ERROR TO TRUE                                        
           END-IF.                                                              
           MOVE ATT-UNPROT TO MWIA.                                             
           IF TWA-MWI NOT > SPACES                                              
              MOVE 'N' TO TWA-MWI MWIO                                          
           ELSE                                                                 
           IF TWA-MWI NOT = 'W' AND 'N'                                         
              MOVE ATT-UNPROT-BRT TO MWIA                                       
              IF NOT INPUT-ERROR                                                
                 MOVE -1 TO MWIL                                                
                 MOVE 'WHEN-ISSUE INDICATOR MUST BE W OR N'                     
                        TO SYSTEM-MSG                                           
                 SET INPUT-ERROR TO TRUE                                        
              END-IF.                                                           
                                                                                
LRM042     IF TWA-SECR-ACTION = 'A'                                             
LRM042     AND TWA-MSLOC = '10'                                                 
LRM042     AND (TWA-MTYPE = '1' OR '2' OR '5')                                  
LRM042     AND ACATMSD-FOUND                                                    
LRM042        MOVE TWA-CLIENT-NO   TO B1-CLIENT-NO B1-CLIENT            03580002
LRM042        MOVE 434743          TO B1-CARD-NO                        03590002
LRM042        PERFORM READ-B1-RTN                                       03600002
LRM042        IF EIBRESP  = +0                                          03610002
LRM042        AND B1-RETURN-VALUE(1 : 1) = '0'                                  
LRM042           PERFORM LOOKUP-NETWORK-LVL-RTN                                 
LRM042             THRU  LOOKUP-NETWORK-LVL-EXIT                                
LRM042     END-IF.                                                              
LRM003     IF TWA-SECR-ACTION = 'A'                                             
              MOVE ATT-UNPROT TO MTYPEA                                         
LRM003     ELSE                                                                 
LRM003        MOVE ATT-ASKIP  TO MTYPEA                                         
LRM003     END-IF.                                                              
           IF TWA-MTYPE NOT GREATER SPACES                                      
              MOVE ATT-UNPROT-BRT TO MTYPEA                                     
              IF NOT INPUT-ERROR                                                
                 MOVE -1 TO MTYPEL                                              
                 MOVE 'ASSET TYPE IS REQUIRED' TO SYSTEM-MSG                    
                 SET INPUT-ERROR TO TRUE                                        
              END-IF                                                            
           ELSE                                                                 
LRM041        IF TWA-MTYPE = '4'                                                
LRM041        AND TWA-CLIENT-NO-X(2 : 3) = '010'                                
LRM041          CONTINUE                                                        
LRM041        ELSE                                                              
              IF TWA-MTYPE NOT = '1' AND '2' AND '5'                            
                 MOVE ATT-UNPROT-BRT TO MTYPEA                                  
                 IF NOT INPUT-ERROR                                             
                    MOVE -1 TO MTYPEL                                           
                    MOVE 'ASSET TYPE MUST BE 1, 2 OR 5' TO SYSTEM-MSG           
                    SET INPUT-ERROR TO TRUE                                     
                 END-IF.                                                        
                                                                                
           MOVE ATT-UNPROT TO MMEMOA.                                           
           IF TWA-MMEMO GREATER SPACES                                          
           AND TWA-MMEMO NOT = 'SK'                                             
              MOVE ATT-UNPROT-BRT TO MMEMOA                                     
              IF NOT INPUT-ERROR                                                
                 MOVE -1 TO MMEMOL                                              
                 MOVE 'ONLY MEMO CODE MUST BE SK OR SPACE'                      
                    TO SYSTEM-MSG                                               
                 SET INPUT-ERROR TO TRUE                                        
              END-IF.                                                           
                                                                                
           MOVE ATT-UNPROT TO SLOCRSNA.                                         
           IF TWA-SLOCRSN GREATER SPACES                                        
           AND TWA-MSLOC = '35'                                                 
            IF (TWA-SLOCRSN = 'EXPO' OR 'OPT ' OR 'USEC')                       
              SET SLOCRSN-VALID TO TRUE                                         
            ELSE                                                                
              MOVE ATT-UNPROT-BRT TO SLOCRSNA                                   
              IF NOT INPUT-ERROR                                                
                 MOVE -1 TO SLOCRSNL                                            
                 MOVE                                                           
                 'SETL LOC RSN MUST BE EXPO OPT USEC W/SETL LOC=35'             
                    TO SYSTEM-MSG                                               
                 SET INPUT-ERROR TO TRUE                                        
              END-IF                                                            
           END-IF.                                                              
                                                                                
           IF TWA-SLOCRSN GREATER SPACES                                        
           AND TWA-MSLOC = '45'                                                 
            IF (TWA-SLOCRSN = 'CASH' OR 'COMT' OR 'USEC')                       
              SET SLOCRSN-VALID TO TRUE                                         
            ELSE                                                                
              MOVE ATT-UNPROT-BRT TO SLOCRSNA                                   
              IF NOT INPUT-ERROR                                                
                 MOVE -1 TO SLOCRSNL                                            
                 MOVE                                                           
                 'SETL LOC RSN MUST BE CASH COMT USEC W/SETL LOC=45'            
                    TO SYSTEM-MSG                                               
                 SET INPUT-ERROR TO TRUE                                        
           END-IF.                                                              
                                                                                
LRM042     IF TWA-SLOCRSN GREATER SPACES                                        
LRM042     AND TWA-SLOCRSN(4 : 1) = LOW-VALUES                                  
LRM042        MOVE SPACES TO TWA-SLOCRSN(4 : 1)                                 
LRM042     END-IF.                                                              
           IF TWA-SLOCRSN GREATER SPACES                                        
           AND TWA-MSLOC = '50'                                                 
            IF (TWA-SLOCRSN = 'RSEC' OR 'SFK ' OR 'XSET'                        
                           OR 'GSCC' OR 'FCUR' OR 'GSCC')                       
              SET SLOCRSN-VALID TO TRUE                                         
            ELSE                                                                
              MOVE ATT-UNPROT-BRT TO SLOCRSNA                                   
              IF NOT INPUT-ERROR                                                
                 MOVE -1 TO SLOCRSNL                                            
                 MOVE                                                           
                 'SETL LOC RSN MUST BE RSEC SFK XSET GSCC FCUR GSCC W/SE        
      -      'TL LOC=50'                                                        
                    TO SYSTEM-MSG                                               
                 SET INPUT-ERROR TO TRUE                                        
           END-IF.                                                              
                                                                                
           IF TWA-SLOCRSN GREATER SPACES                                        
           AND NOT SLOCRSN-VALID                                                
              MOVE ATT-UNPROT-BRT TO SLOCRSNA                                   
              IF NOT INPUT-ERROR                                                
                 MOVE -1 TO SLOCRSNL                                            
                 MOVE                                                           
                 'SETL LOC RSN ONLY ALLOWED WITH SETL LOC 35,45,50'             
                    TO SYSTEM-MSG                                               
                 SET INPUT-ERROR TO TRUE                                        
           END-IF.                                                              
                                                                                
           IF (TWA-MSLOC = '35' OR '45' OR '50')                                
           AND TWA-SLOCRSN NOT GREATER SPACES                                   
              MOVE ATT-UNPROT-BRT TO SLOCRSNA                                   
              IF NOT INPUT-ERROR                                                
                 MOVE -1 TO SLOCRSNL                                            
                 MOVE                                                           
                 'SETL LOC RSN REQUIRED WITH SETL LOC 35,45,50'                 
                    TO SYSTEM-MSG                                               
                 SET INPUT-ERROR TO TRUE                                        
           END-IF.                                                              
                                                                                
           MOVE ATT-UNPROT TO  MCDA.                                            
           IF TWA-MCD = 'D'                                                     
              IF TWA-SECR-ACTION = 'C'                                          
                 MOVE 'D' TO TWA-SECR-ACTION                                    
              ELSE                                                              
                 MOVE ATT-UNPROT-BRT TO MCDA                                    
                 IF NOT INPUT-ERROR                                             
                    MOVE -1 TO MCDL                                             
                    MOVE 'DELETE (D) ONLY ALLOWED ON AN EXISTING ASSET'         
                         TO SYSTEM-MSG                                          
                    SET INPUT-ERROR TO TRUE                                     
                 END-IF                                                         
           ELSE                                                                 
           IF TWA-MQTY > SPACES                                                 
           AND TWA-MCD NOT > SPACES                                             
              MOVE 'P' TO TWA-MCD MCDI                                          
           ELSE                                                                 
LRM017     IF TWA-MSLOC = '45'                                                  
LRM017     AND TWA-MCD NOT > SPACES                                             
LRM017        MOVE 'P' TO TWA-MCD MCDI                                          
LRM017     ELSE                                                                 
           IF (TWA-MCD > SPACES                                                 
             OR TWA-MQTY > SPACES)                                              
LRM008     AND (TWA-MCD NOT = 'P' AND 'W')                                      
              MOVE ATT-UNPROT-BRT TO MCDA                                       
              IF NOT INPUT-ERROR                                                
                 MOVE -1 TO MCDL                                                
                 MOVE                                                           
              'NUMERIC OPTION CD MUST BE P(SHARES) OR W(WITHHOLD)'              
                      TO SYSTEM-MSG                                             
                 SET INPUT-ERROR TO TRUE                                        
              END-IF.                                                           
                                                                                
LRM048     IF TWA-ORIG-WTHLD-CD = 'W'                                           
LRM048     AND TWA-MCD > SPACES                                                 
LRM048     AND TWA-MCD NOT = 'W'                                                
LRM048     AND TWA-MWI-STTS = 'C'                                               
LRM048        MOVE ATT-UNPROT-BRT TO MCDA                                       
LRM048        IF NOT INPUT-ERROR                                                
LRM048           MOVE -1 TO MCDL                                                
LRM048           MOVE                                                           
LRM048           'WARNING - SUBMITTING CONTRA CUSIP'                            
LRM048                TO SYSTEM-MSG                                             
LRM048           SET INPUT-ERROR TO TRUE                                        
LRM048        END-IF                                                            
LRM048        MOVE SPACES TO TWA-MWI-STTS                                       
LRM048     END-IF.                                                              
                                                                                
           MOVE ATT-UNPROT TO  MQTYA.                                           
LRM017     IF TWA-MSLOC = '45'                                                  
LRM017     AND TWA-MQTY NOT GREATER SPACES                                      
LRM017        MOVE '0.00' TO TWA-MQTY                                           
LRM017     END-IF.                                                              
           IF TWA-MQTY GREATER SPACES                                           
LRM008        IF (TWA-MCD = 'P' OR ' ' OR 'W')                                  
                 PERFORM EDIT-QTY-RTN                                           
              ELSE                                                              
              IF TWA-MCD = 'D'                                                  
                 CONTINUE                                                       
              ELSE                                                              
                 MOVE ATT-UNPROT-BRT TO MQTYA                                   
                 IF NOT INPUT-ERROR                                             
                    MOVE -1 TO MQTYL                                            
                    SET INPUT-ERROR TO TRUE                                     
                    MOVE                                                        
            'QTY FIELD NOT ALLOWED WITHOUT CD / ERASE FOR FULL POSITION'        
                                TO SYSTEM-MSG                                   
                 END-IF                                                         
           ELSE                                                                 
***********   IF TWA-MCD = 'P' OR 'V' OR '%'                                    
                 MOVE ATT-UNPROT-BRT TO MQTYA                                   
                 IF NOT INPUT-ERROR                                             
                    MOVE -1 TO MQTYL                                            
                    MOVE 'NUMBER OF SHARES IS REQUIRED'                         
                       TO SYSTEM-MSG                                            
                 SET INPUT-ERROR TO TRUE                                        
              END-IF.                                                           
********** DON'T EDIT ANY OTHER ASSET FIELDS WHEN MARKED FOR DELETE             
********** ON EXISTING ASSET.                                                   
           IF TWA-MCD = 'D'                                                     
              AND (TWA-ORIG-MSECR > SPACES                                      
               OR  TWA-ORIG-SLOC  > SPACES                                      
               OR  TWA-ORIG-MTYPE > SPACES)                                     
              GO TO SKIP-ASSET-EDIT.                                            
                                                                                
           MOVE ATT-UNPROT TO MDESCA.                                           
           IF TWA-MDESC(1 : 1) NOT GREATER SPACES                               
              MOVE ATT-UNPROT-BRT TO MDESCA                                     
              IF NOT INPUT-ERROR                                                
                 MOVE -1 TO MDESCL                                              
                 MOVE 'THE FIRST DESCRIPTION IS REQUIRED' TO SYSTEM-MSG         
                 SET INPUT-ERROR TO TRUE                                        
              END-IF                                                            
LRM006     ELSE                                                                 
LRM006        PERFORM VARYING SUB FROM 1 BY 1                                   
LRM006              UNTIL SUB GREATER 30                                        
LRM006           IF TWA-MDESC(SUB : 1) < ' '                                    
LRM006              MOVE SPACE TO TWA-MDESC (SUB : 1)                           
LRM006           END-IF                                                         
LRM006           IF TWA-MDESC2(SUB : 1) < ' '                                   
LRM006              MOVE SPACE TO TWA-MDESC2 (SUB : 1)                          
LRM006           END-IF                                                         
LRM006           IF TWA-MDESC3(SUB : 1) < ' '                                   
LRM006              MOVE SPACE TO TWA-MDESC3 (SUB : 1)                          
LRM006           END-IF                                                         
LRM006        END-PERFORM.                                                      
                                                                                
   ****** ON ASSET KEY CHANGE, MAKE SURE THE TARGET ASSET KEY IS NOT            
   ****** ALREADY ON FILE:                                                      
              IF NOT INPUT-ERROR                                                
              AND (TWA-MSECR NOT = TWA-ORIG-MSECR                               
                OR TWA-MSLOC NOT =  TWA-ORIG-SLOC                               
                OR TWA-MTYPE NOT =  TWA-ORIG-MTYPE)                             
                  MOVE 'A' TO TWA-SECR-ACTION                                   
                  PERFORM READ-ASSET-RTN                                        
                  IF ACAT11IO-ASSET-FOUND                                       
                     MOVE ATT-UNPROT-BRT TO MSECRA                              
                                            MSLOCA                              
                                            MTYPEA                              
                     IF NOT INPUT-ERROR                                         
                        MOVE -1 TO MSECRL                                       
                        MOVE                                                    
              'ASSET KEYS SECR/LOC/TYPE ALREADY EXISTS; DELETE FIRST'           
                            TO SYSTEM-MSG                                       
                        SET INPUT-ERROR TO TRUE                                 
                     END-IF                                                     
           END-IF.                                                              
                                                                                
           MOVE ATT-UNPROT TO MAMTA.                                            
           IF TWA-MAMT GREATER SPACES                                           
              PERFORM EDIT-AMT-RTN                                              
           END-IF.                                                              
                                                                                
           MOVE ATT-UNPROT TO MDESC2A                                           
                              MDESC3A.                                          
                                                                                
       SKIP-ASSET-EDIT.                                                         
   ****** ASSURE AT LEAST ONE ASSET (BALANCE OR ASSET RECORD EXISTS).           
           IF  TWA-MBAL01 NOT > SPACES                                          
           AND TWA-MBAL02 NOT > SPACES                                          
           AND TWA-MBAL05 NOT > SPACES                                          
           AND TWA-MDESC(1 : 1) NOT > SPACES                                    
LRM028     IF TWA-INP-TFR-TYP = 'PTF'                                           
LRM028        MOVE ATT-UNPROT-BRT TO MSECRA                                     
LRM028        IF NOT INPUT-ERROR                                                
LRM028           MOVE -1 TO MSECRL                                              
LRM028           MOVE 'AT LEAST ONE ASSET IS REQUIRED ON TIF'                   
LRM028              TO SYSTEM-MSG                                               
LRM028           SET INPUT-ERROR TO TRUE                                        
LRM028        END-IF                                                            
LRM028     ELSE                                                                 
              MOVE ATT-UNPROT-BRT TO MBAL01A                                    
              IF NOT INPUT-ERROR                                                
                 MOVE -1 TO MBAL01L                                             
                 MOVE 'AT LEAST ONE BALANCE OR ASSET IS REQUIRED ON TIF'        
                    TO SYSTEM-MSG                                               
                 SET INPUT-ERROR TO TRUE                                        
LRM038           IF TWA-STTLM-TM-CD = 'L'                                       
LRM038              MOVE ' - WARNING: PLEASE TAKE ACTION'                       
LRM038                 TO SYSTEM-MSG (49:)                                      
LRM038           END-IF                                                         
              END-IF.                                                           
                                                                                
           IF TWA-ACTION = '6'                                                  
              PERFORM ASKIP-MAP-RTN                                             
              MOVE 'TIF DISPLAYED FROM ACTIVE TABLE'  TO SYSTEM-MSG             
              MOVE -1 TO MBRL                                                   
           ELSE                                                                 
           IF TWA-ACTION = 'B' OR 'R'                                           
           OR NOT ACAT-SIGN-ON-UPDATE                                           
              PERFORM ASKIP-MAP-RTN                                             
LRM024        IF ACAT-ASCENDIS-CLIENT                                           
LRM024        MOVE 'TIF DISPLAYED / BROWSE ONLY / ASCENDIS'                     
LRM024            TO SYSTEM-MSG                                                 
LRM024        ELSE                                                              
              MOVE 'TIF DISPLAYED / BROWSE ONLY'  TO SYSTEM-MSG                 
              END-IF                                                            
              MOVE -1 TO MBRL                                                   
           ELSE                                                                 
           IF EIBAID = DFHPF2                                                   
              MOVE -1 TO MBRL                                                   
              MOVE 'PLEASE ENTER NEW TIF' TO SYSTEM-MSG                         
           ELSE                                                                 
           IF EIBAID = DFHPF5                                                   
LRM001        MOVE -1 TO MSECRL                                                 
LRM001        MOVE SPACES TO MSECRO                                             
LRM001                       MCATGRO                                    04809210
LRM001                       MSLOCO                                     04809210
LRM001                       MCDO                                       04809210
LRM001                       MQTYO                                      04809210
LRM001                       MAMTO                                              
LRM001                       MDESCO                                     04809210
LRM001                       MWIO                                       04809210
LRM001                       MMEMOO                                     04809210
LRM001                       SLOCRSNO                                   04809210
LRM001                       MTYPEO                                     04809210
LRM001                       MDESC2O                                    04809210
LRM001                       MDESC3O                                    04809210
LRM001        MOVE 'A' TO TWA-SECR-ACTION                                       
LRM001        MOVE SPACES TO TWA-INTRAN-FLAG                            01940002
LRM028        IF TWA-INP-TFR-TYP = 'PTF'                                        
LRM028        AND TWA-DUPE-FOUND = 'Y'                                          
LRM028           MOVE 'ENTERING NEXT PTF ASSET GENERATES SEPERATE TIF'          
LRM028                                          TO SYSTEM-MSG                   
LRM028        ELSE                                                              
                 MOVE 'PLEASE ENTER NEXT ASSET' TO SYSTEM-MSG                   
           ELSE                                                                 
           IF NOT INPUT-ERROR                                                   
           AND SYSTEM-MSG = SPACES                                              
           AND EIBAID = DFHENTER                                                
              MOVE 'NO ERRORS FOUND' TO SYSTEM-MSG                              
              MOVE -1 TO MNAMEL.                                                
                                                                                
            IF ((TWA-ACTION = 'A' OR 'C')                                       
LRM003      OR TWA-MREJ > '00' AND < '10')                                      
            AND TWA-APPROVAL-AUTH                                               
               MOVE ATT-UNPROT TO MSUBMA                                        
            ELSE                                                                
               MOVE ATT-ASKIP TO MSUBMA                                         
            END-IF.                                                             
       PROCESS-MAP-ITEMS-EXIT. EXIT.                                            
                                                                                
LRM042 LOOKUP-NETWORK-LVL-RTN.                                                  
LRM042     INITIALIZE MFAINTW-COMM-AREA.                                        
LRM042     MOVE TWA-CLIENT-NO             TO MFAINTW-CLIENT.                    
LRM042     MOVE ACATMSD-CUSIP             TO MFAINTW-CUSIP-9.                   
LRM042     MOVE ACATMSD-SYMBOL            TO MFAINTW-SYMBOL.                    
LRM042     MOVE ZERO                      TO MFAINTW-ACCT-ID.                   
LRM042     MOVE TWA-MBR                   TO MFAINTW-BRANCH-3.                  
LRM042     MOVE TWA-MAC                   TO MFAINTW-ACCT-5.                    
LRM042     MOVE TWA-MTYPE                 TO MFAINTW-ACCT-TYPE                  
LRM042     MOVE TWA-MBR                      TO WK-ACCT-IN1-8(1:3)              
LRM042     MOVE TWA-MAC                      TO WK-ACCT-IN1-8(4:5)              
LRM042     MOVE MFAINTW-ACCT-TYPE            TO WK-ACCT-IN1-TYPE                
LRM042     MOVE  'X'                         TO WK-ACCT-IN1-CHK-DIG.            
LRM042     MOVE  ZEROS                       TO WK-ACCT-OUT1.                   
LRM042     MOVE  SPACES                      TO WK-ACCT-RET-CODE1.              
LRM042     EXEC CICS LINK PROGRAM(WS-ORIG-EDITMOD)                              
LRM042                    COMMAREA(EDITMOD-WORK-AREA1)                          
LRM042                    LENGTH (LENGTH OF EDITMOD-WORK-AREA1)                 
LRM042                    END-EXEC.                                             
LRM042     IF WK-ACCT-RET-CODE1 = ' '                                           
LRM042        MOVE WK-ACCT-OUT1-CHK-DIG      TO MFAINTW-A-CHK-DIGIT             
LRM042     ELSE                                                                 
LRM042        MOVE 0                         TO MFAINTW-A-CHK-DIGIT             
LRM042     END-IF.                                                              
LRM042                                                                          
LRM042     EXEC CICS LINK PROGRAM  (MFAINTW)                                    
LRM042                    COMMAREA (MFAINTW-COMM-AREA)                          
LRM042                    RESP     (WS-CICS-RESP)                               
LRM042     END-EXEC.                                                            
LRM042                                                                          
LRM042     IF WS-CICS-RESP = DFHRESP(NORMAL)                                    
LRM042     AND MFAINTW-RETURN-OK                                                
LRM042     AND MFAINTW-MATRIX-LEVEL = '4'                                       
LRM042        MOVE ATT-UNPROT-BRT TO MSECRA                                     
LRM042        IF NOT INPUT-ERROR                                                
LRM042           MOVE -1 TO MSECRL                                              
LRM042           MOVE 'NETWORK LEVEL 4 FUND NOT ALLOWED' TO SYSTEM-MSG          
LRM042           SET INPUT-ERROR TO TRUE                                        
LRM042     END-IF.                                                              
LRM042 LOOKUP-NETWORK-LVL-EXIT. EXIT.                                           
                                                                                
LRM035 LOOKUP-OPTION-BY-KEYS-RTN.                                               
LRM035     MOVE ATT-UNPROT TO MEXPDTA                                           
LRM035     IF TWA-MEXPDT NOT > SPACES                                           
LRM035        MOVE ATT-UNPROT-BRT TO MEXPDTA                                    
LRM035        MOVE 'N' TO WS-OPTION-SW                                          
LRM035        IF NOT INPUT-ERROR                                                
LRM035           MOVE -1 TO MEXPDTL                                             
LRM035           MOVE 'OPTION EXPIRATION DATE MMDDYY IS REQUIRED'               
LRM035                                                  TO SYSTEM-MSG           
LRM035           SET INPUT-ERROR TO TRUE                                        
LRM035        END-IF                                                            
LRM035     ELSE                                                                 
LRM035        IF (TWA-MEXPDT NOT NUMERIC                                        
LRM035        OR (TWA-MEXPDT(1 : 2) < '01' OR > '12')                           
LRM035        OR (TWA-MEXPDT(3 : 2) < '01' OR > '31'))                          
LRM035           MOVE ATT-UNPROT-BRT TO MEXPDTA                                 
LRM035           MOVE 'N' TO WS-OPTION-SW                                       
LRM035           IF NOT INPUT-ERROR                                             
LRM035              MOVE -1 TO MEXPDTL                                          
LRM035              MOVE 'OPTION EXPIRATION DATE MMDDYY IS INVALID'             
LRM035                                                  TO SYSTEM-MSG           
LRM035              SET INPUT-ERROR TO TRUE                                     
LRM035           END-IF                                                         
LRM035        END-IF                                                            
LRM035     END-IF.                                                              
                                                                                
LRM035     MOVE ATT-UNPROT TO MCALLA                                            
LRM035     IF TWA-MCALL NOT > SPACES                                            
LRM035        MOVE ATT-UNPROT-BRT TO MCALLA                                     
LRM035        MOVE 'N' TO WS-OPTION-SW                                          
LRM035        IF NOT INPUT-ERROR                                                
LRM035           MOVE -1 TO MCALLL                                              
LRM035           MOVE 'OPTION PUT/CALL IS REQUIRED'  TO SYSTEM-MSG              
LRM035           SET INPUT-ERROR TO TRUE                                        
LRM035        END-IF                                                            
LRM035     ELSE                                                                 
LRM035        IF (TWA-MCALL NOT = 'P' AND 'C')                                  
LRM035           MOVE ATT-UNPROT-BRT TO MCALLA                                  
LRM035           MOVE 'N' TO WS-OPTION-SW                                       
LRM035           IF NOT INPUT-ERROR                                             
LRM035              MOVE -1 TO MCALLL                                           
LRM035              MOVE 'OPTION PUT/CALL MUST BE P OR C'  TO SYSTEM-MSG        
LRM035              SET INPUT-ERROR TO TRUE                                     
LRM035           END-IF                                                         
LRM035        END-IF                                                            
LRM035     END-IF.                                                              
LRM035                                                                          
LRM035     MOVE ATT-UNPROT TO MLONGA                                            
LRM035     IF TWA-MLONG NOT > SPACES                                            
LRM035        MOVE ATT-UNPROT-BRT TO MLONGA                                     
LRM035        MOVE 'N' TO WS-OPTION-SW                                          
LRM035        IF NOT INPUT-ERROR                                                
LRM035           MOVE -1 TO MLONGL                                              
LRM035           MOVE 'OPTION LONG/SORT IS REQUIRED'  TO SYSTEM-MSG             
LRM035           SET INPUT-ERROR TO TRUE                                        
LRM035        END-IF                                                            
LRM035     ELSE                                                                 
LRM035        IF (TWA-MLONG NOT = 'L' AND 'S')                                  
LRM035           MOVE ATT-UNPROT-BRT TO MLONGA                                  
LRM035           MOVE 'N' TO WS-OPTION-SW                                       
LRM035           IF NOT INPUT-ERROR                                             
LRM035              MOVE -1 TO MLONGL                                           
LRM035              MOVE 'OPTION LONG/SORT MUST BE L OR S' TO SYSTEM-MSG        
LRM035              SET INPUT-ERROR TO TRUE                                     
LRM035           END-IF                                                         
LRM035        END-IF                                                            
LRM035     END-IF.                                                              
LRM035                                                                          
LRM035     MOVE ATT-UNPROT TO MSTRIKEA                                          
LRM035     IF TWA-MSTRIKE NOT > SPACES                                          
LRM035        MOVE ATT-UNPROT-BRT TO MSTRIKEA                                   
LRM035        MOVE 'N' TO WS-OPTION-SW                                          
LRM035        IF NOT INPUT-ERROR                                                
LRM035           MOVE -1 TO MSTRIKEL                                            
LRM035           MOVE 'OPTION STRIKE PRICE IS REQUIRED'                         
LRM035                                               TO SYSTEM-MSG              
LRM035           SET INPUT-ERROR TO TRUE                                        
LRM035        END-IF                                                            
LRM035     ELSE                                                                 
LRM035        MOVE TWA-MSTRIKE TO WK-STRK-IN                                    
LRM035        EXEC CICS LINK PROGRAM(WS-EDITMOD)                                
LRM035                 COMMAREA(EDIT-STRK-AREA)                                 
LRM035                 LENGTH(LENGTH OF EDIT-STRK-AREA)                         
LRM035        END-EXEC                                                          
LRM035        IF WK-STRK-RET-CODE = SPACE                                       
LRM035           MOVE WK-STRK-OUT   TO WS-MSTRK-ED-D3 TWA-MSTRIKE-9             
LRM035           MOVE WS-MSTRK-AREA TO MSTRIKEO                                 
LRM035        ELSE                                                              
LRM035           MOVE ATT-UNPROT-BRT TO MSTRIKEA                                
LRM035           MOVE 'N' TO WS-OPTION-SW                                       
LRM035           IF NOT INPUT-ERROR                                             
LRM035              MOVE -1 TO MSTRIKEL                                         
LRM035              MOVE 'OPTION STRIKE PRICE IS INVALID'                       
LRM035                                                  TO SYSTEM-MSG           
LRM035              SET INPUT-ERROR TO TRUE                                     
LRM035           END-IF                                                         
LRM035        END-IF                                                            
LRM035     END-IF.                                                              
                                                                                
LRM035     IF WS-OPTION-SW NOT = 'N'                                            
LRM035     AND TWA-MEXPDT > SPACES                                              
LRM035        MOVE ' '                   TO GETADP-COMMAREA                     
LRM035        MOVE TWA-CLIENT-NO         TO GETADP-CLIENT-NBR                   
LRM035        MOVE TWA-MSECR             TO GETADP-OPTION-UNDSEC                
LRM035        MOVE TWA-MCALL             TO GETADP-OPTION-PC                    
LRM035        MOVE TWA-MLONG             TO GETADP-OPTION-LS                    
LRM035        MOVE TWA-MSTRIKE-9         TO GETADP-OPTION-STRIKE                
LRM035        MOVE TWA-MEXPDT(1:2)       TO GETADP-OPTION-MONTH                 
LRM035        MOVE TWA-MEXPDT(3:2)       TO GETADP-OPTION-DAY                   
LRM035        MOVE TWA-MEXPDT(5:2)       TO GETADP-OPTION-YR                    
LRM035        EXEC CICS LINK PROGRAM('GETADPOL')                                
LRM035               COMMAREA(GETADP-COMMAREA)                                  
LRM035               LENGTH(LENGTH OF GETADP-COMMAREA)                          
LRM035        END-EXEC                                                          
LRM035        EVALUATE TRUE                                                     
LRM035        WHEN GETADP-RET-CODE  = ' '                                       
LRM035             MOVE 'XX'            TO WS-OPTION-MSECR                      
LRM035             MOVE GETADP-ADP-NBR  TO WS-OPTION-MSECR (3 : 7)              
LRM035             MOVE WS-OPTION-MSECR TO TWA-MSECR                            
LRM035****                                 TWA-ORIG-MSECR                       
LRM035****                                 TWA-ORIG-SECR                        
LRM035             MOVE 'Y' TO WS-OPTION-SW                                     
LRM035        WHEN GETADP-RET-CODE  = 'N'                                       
LRM035*            'N' = NOT FOUND / NO KEY PASSED                              
LRM035             MOVE ATT-UNPROT-BRT TO MSECRA MEXPDTA MSTRIKEA               
LRM035                                    MCALLA MLONGA                         
LRM035             MOVE 'N' TO WS-OPTION-SW                                     
LRM035             IF NOT INPUT-ERROR                                           
LRM035                MOVE 'OPTION NOT FOUND ON MSD' TO SYSTEM-MSG              
LRM035                MOVE -1 TO MSECRL                                         
LRM035                SET INPUT-ERROR TO TRUE                                   
LRM035             END-IF                                                       
LRM035        WHEN GETADP-RET-CODE  = 'D'                                       
LRM035*            'D' = BAD DB2/SQL RETURN CODE                                
LRM035             MOVE ATT-UNPROT-BRT TO MSECRA MEXPDTA MSTRIKEA               
LRM035                                    MCALLA MLONGA                         
LRM035             MOVE 'N' TO WS-OPTION-SW                                     
LRM035             IF NOT INPUT-ERROR                                           
LRM035                MOVE ' GETOPTNO:BAD DB2/SQL RC' TO SYSTEM-MSG             
LRM035                MOVE -1 TO MSECRL                                         
LRM035                SET INPUT-ERROR TO TRUE                                   
LRM035             END-IF                                                       
LRM035        WHEN GETADP-RET-CODE  = 'E'                                       
LRM035*            'E' = BAD COMMAREA LENGTH                                    
LRM035             MOVE ATT-UNPROT-BRT TO MSECRA MEXPDTA MSTRIKEA               
LRM035                                    MCALLA MLONGA                         
LRM035             MOVE 'N' TO WS-OPTION-SW                                     
LRM035             IF NOT INPUT-ERROR                                           
LRM035                MOVE ' GETOPTNO:BAD COMMAREA LENGTH' TO SYSTEM-MSG        
LRM035                MOVE -1 TO MSECRL                                         
LRM035                SET INPUT-ERROR TO TRUE                                   
LRM035             END-IF                                                       
LRM035        WHEN GETADP-RET-CODE  = 'I'                                       
LRM035*            'I' = BAD RETURN FROM MSDISIN READ                           
LRM035             MOVE ATT-UNPROT-BRT TO MSECRA MEXPDTA MSTRIKEA               
LRM035                                    MCALLA MLONGA                         
LRM035             MOVE 'N' TO WS-OPTION-SW                                     
LRM035             IF NOT INPUT-ERROR                                           
LRM035                MOVE ' GETOPTNO:BAD MSDISIN READ' TO SYSTEM-MSG           
LRM035                MOVE -1 TO MSECRL                                         
LRM035                SET INPUT-ERROR TO TRUE                                   
LRM035             END-IF                                                       
LRM035        WHEN GETADP-RET-CODE  = 'B'                                       
LRM035*            'B' = BAD RETURN FROM B1 FILE READ                           
LRM035             MOVE ATT-UNPROT-BRT TO MSECRA MEXPDTA MSTRIKEA               
LRM035                                    MCALLA MLONGA                         
LRM035             MOVE 'N' TO WS-OPTION-SW                                     
LRM035             IF NOT INPUT-ERROR                                           
LRM035                MOVE ' GETOPTNO:BAD B1 FILE READ' TO SYSTEM-MSG           
LRM035                MOVE -1 TO MSECRL                                         
LRM035                SET INPUT-ERROR TO TRUE                                   
LRM035             END-IF                                                       
LRM035        WHEN GETADP-RET-CODE  = 'C'                                       
LRM035*            'C' = NO CLIENT NUMBER PASSED                                
LRM035             MOVE ATT-UNPROT-BRT TO MSECRA MEXPDTA MSTRIKEA               
LRM035                                    MCALLA MLONGA                         
LRM035             MOVE 'N' TO WS-OPTION-SW                                     
LRM035             IF NOT INPUT-ERROR                                           
LRM035                MOVE ' GETOPTNO:NO CLIENT NUMBER' TO SYSTEM-MSG           
LRM035                MOVE -1 TO MSECRL                                         
LRM035                SET INPUT-ERROR TO TRUE                                   
LRM035             END-IF                                                       
LRM035        WHEN OTHER                                                        
LRM035             MOVE ATT-UNPROT-BRT TO MSECRA MEXPDTA MSTRIKEA               
LRM035                                    MCALLA MLONGA                         
LRM035             MOVE 'N' TO WS-OPTION-SW                                     
LRM035             IF NOT INPUT-ERROR                                           
LRM035                MOVE ' GETOPTNO:I/O ERROR' TO SYSTEM-MSG                  
LRM035                MOVE -1 TO MSECRL                                         
LRM035                SET INPUT-ERROR TO TRUE                                   
LRM035             END-IF                                                       
LRM035        END-EVALUATE                                                      
LRM035     END-IF.                                                              
                                                                                
       SIGNON-SECR-CHECK-RTN.                                                   
           SET SECURITY-LOOKUP TO TRUE.                                         
           EXEC CICS LINK PROGRAM (WS-ACATSRCH)                         02890002
                COMMAREA(ACAT-SRCH-COMM-AREA)                           02900002
                LENGTH(LENGTH OF ACAT-SRCH-COMM-AREA)                   02910002
           END-EXEC.                                                    02920002
                                                                                
       JUSTIFY-LEFT-MCACCT.                                                     
           MOVE 1 TO SUB SUB2.                                                  
           MOVE SPACES TO WS-MCACCT.                                            
           PERFORM UNTIL SUB GREATER 20                                         
              IF TWA-MCACCT(SUB : 1) NOT = SPACES AND LOW-VALUES                
                 IF ((TWA-MCACCT(SUB : 1) >= 'A' AND <= 'Z')                    
                  OR (TWA-MCACCT(SUB : 1) >= '0' AND <= '9'))                   
                    MOVE TWA-MCACCT(SUB : 1) TO WS-MCACCT(SUB2 : 1)             
                    ADD 1 TO SUB2                                               
                 ELSE                                                           
                    SET MCACCT-ERROR TO TRUE                                    
                    MOVE 20 TO SUB                                              
                 END-IF                                                         
              END-IF                                                            
              ADD 1 TO SUB                                                      
           END-PERFORM.                                                         
                                                                                
           IF NOT MCACCT-ERROR                                                  
              MOVE WS-MCACCT TO TWA-MCACCT.                                     
                                                                                
       SSN-EDIT-RTN.                                                            
           IF (WS-SSN-EDIT(1 : 3) NUMERIC                                       
           AND WS-SSN-EDIT(4 : 1) = '-'                                         
           AND WS-SSN-EDIT(7 : 1) = '-'                                         
           AND WS-SSN-EDIT(5 : 2) NUMERIC                                       
           AND WS-SSN-EDIT(8 : 4) NUMERIC)                                      
              SET SSN-VALID TO TRUE                                             
           ELSE                                                                 
           IF (WS-SSN-EDIT(1 : 9) NUMERIC                                       
           AND WS-SSN-EDIT(10 : 2) = SPACES)                                    
              MOVE WS-SSN-EDIT(8 : 2) TO WS-SSN-EDIT(10 : 2)                    
              MOVE WS-SSN-EDIT(6 : 2) TO WS-SSN-EDIT(8 : 2)                     
              MOVE WS-SSN-EDIT(5 : 1) TO WS-SSN-EDIT(6 : 1)                     
              MOVE WS-SSN-EDIT(4 : 1) TO WS-SSN-EDIT(5 : 1)                     
              MOVE '-'                TO WS-SSN-EDIT(4 : 1)                     
                                         WS-SSN-EDIT(7 : 1)                     
              SET SSN-VALID TO TRUE                                             
           ELSE                                                                 
              SET SSN-INVALID TO TRUE                                           
           END-IF.                                                              
                                                                                
       EDIT-QTY-RTN.                                                            
           MOVE TWA-MQTY  TO WK-QTY-IN                                          
           EXEC CICS LINK PROGRAM(WS-EDITMOD)                                   
                       COMMAREA(EDIT-QTY-AREA)                                  
                       LENGTH(LENGTH OF EDIT-QTY-AREA)                          
           END-EXEC                                                             
           IF WK-QTY-RET-CODE = SPACE                                           
              MOVE WK-QTY-OUT TO WS-MQTY-ED-D5 TWA-MQTY-9                       
              MOVE WS-MQTY-AREA TO MQTYO TWA-ORIG-MQTY                          
LRM017       IF TWA-MSLOC NOT = '45'                                            
              PERFORM OBTAIN-MARGIN-POSN-RTN                                    
                 THRU OBTAIN-MARGIN-POSN-EXIT                                   
              PERFORM VALIDATE-QTY-WITH-MRGN-POSN                               
LRM017        IF TWA-FREEZE-SEC-LONG = 'Y'                                      
LRM017        AND TWA-FREEZE-SEC-SHORT = 'Y'                                    
LRM017        AND TWA-MQTY-9 NOT = ZERO                                         
LRM017           MOVE ATT-UNPROT-BRT TO MQTYA                                   
LRM017           IF NOT INPUT-ERROR                                             
LRM017              MOVE -1 TO MQTYL                                            
LRM017              SET INPUT-ERROR TO TRUE                                     
LRM017              MOVE WS-SEC-FREEZE-FULL-MSG   TO SYSTEM-MSG                 
LRM017              MOVE SPACES TO TWA-ORIG-MQTY                                
LRM017           END-IF                                                         
LRM017         ELSE                                                             
LRM017         IF TWA-FREEZE-SEC-LONG  = 'Y'                                    
LRM017         AND TWA-MQTY-9 < ZERO                                            
LRM017            MOVE ATT-UNPROT-BRT TO MQTYA                                  
LRM017            IF NOT INPUT-ERROR                                            
LRM017               MOVE -1 TO MQTYL                                           
LRM017               SET INPUT-ERROR TO TRUE                                    
LRM017               MOVE WS-SEC-FREEZE-SHORT-MSG TO SYSTEM-MSG                 
LRM017               MOVE SPACES TO TWA-ORIG-MQTY                               
LRM017            END-IF                                                        
LRM017         ELSE                                                             
LRM017         IF TWA-FREEZE-SEC-SHORT = 'Y'                                    
LRM017         AND TWA-MQTY-9 > ZERO                                            
LRM017            MOVE ATT-UNPROT-BRT TO MQTYA                                  
LRM017            IF NOT INPUT-ERROR                                            
LRM017               MOVE -1 TO MQTYL                                           
LRM017               SET INPUT-ERROR TO TRUE                                    
LRM017               MOVE WS-SEC-FREEZE-LONG-MSG   TO SYSTEM-MSG                
LRM017               MOVE SPACES TO TWA-ORIG-MQTY                               
LRM017            END-IF                                                        
LRM017         END-IF END-IF END-IF                                             
LRM017       END-IF                                                             
           ELSE                                                                 
              MOVE ATT-UNPROT-BRT TO MQTYA                                      
              IF NOT INPUT-ERROR                                                
                 MOVE -1 TO MQTYL                                               
                 SET INPUT-ERROR TO TRUE                                        
                 MOVE 'QTY FIELD (INTENDED TO BE SHARES) IS INVALID'            
                             TO SYSTEM-MSG                                      
           END-IF.                                                              
                                                                                
       EDIT-AMT-RTN.                                                            
           MOVE TWA-MAMT  TO WK-AMT-IN                                          
           EXEC CICS LINK PROGRAM(WS-EDITMOD)                                   
                       COMMAREA(EDIT-AMT-AREA)                                  
                       LENGTH(LENGTH OF EDIT-AMT-AREA)                          
           END-EXEC                                                             
           IF WK-AMT-RET-CODE = SPACE                                           
              MOVE WK-AMT-OUT    TO WS-MQTY-ED-D2  TWA-MAMT-9                   
              MOVE WS-MQTY-AREA TO MAMTO TWA-ORIG-MAMT                          
           ELSE                                                                 
              MOVE ATT-UNPROT-BRT TO MAMTA                                      
              IF NOT INPUT-ERROR                                                
                 MOVE -1 TO MAMTL                                               
                 SET INPUT-ERROR TO TRUE                                        
                 MOVE 'AMOUNT FIELD IS INVALID'                                 
                             TO SYSTEM-MSG                                      
           END-IF.                                                              
                                                                                
       VALIDATE-BAL01-WITH-MRGN.                                                
******** WHEN MRGN BAL IS CREDIT, SO MUST DELIVER BAL.                          
******** WHEN MRGN BAL IS DEBIT,  SO MUST DELIVER BAL.                          
******** THE BAL CAN'T EXCEED MRGN.                                             
           IF TWA-MBAL01-9 < ZERO                                               
              IF WS-MRGN-BAL-TYPE1 < ZERO                               MRGIML03
                 IF TWA-MBAL01-9 < WS-MRGN-BAL-TYPE1                    MRGIML03
                    MOVE ATT-UNPROT-BRT TO MBAL01A                              
                    MOVE SPACES TO TWA-ORIG-MBAL01                              
                    IF NOT INPUT-ERROR                                          
                       MOVE -1 TO MBAL01L                                       
                       SET INPUT-ERROR TO TRUE                                  
                       MOVE 'BALANCE 01 CREDIT EXCEEDS MARGIN CREDIT'           
                             TO WS-MRGN-MSG-LIT                                 
                       MOVE WS-MRGN-BAL-TYPE1 TO WS-MRGN-MSG-AMT        MRGIML03
                       MOVE WS-MRGN-MSG TO SYSTEM-MSG                           
                    END-IF                                                      
                 END-IF                                                         
              ELSE                                                              
                 MOVE ATT-UNPROT-BRT TO MBAL01A                                 
                 MOVE SPACES TO TWA-ORIG-MBAL01                                 
                 IF NOT INPUT-ERROR                                             
                    MOVE -1 TO MBAL01L                                          
                    SET INPUT-ERROR TO TRUE                                     
                    MOVE 'MARGIN DOES NOT CARRY A CREDIT CASH BALANCE'          
                             TO WS-MRGN-MSG-LIT                                 
                    MOVE WS-MRGN-BAL-TYPE1 TO WS-MRGN-MSG-AMT           MRGIML03
                    MOVE WS-MRGN-MSG TO SYSTEM-MSG                              
                 END-IF                                                         
           ELSE                                                                 
********  TWA-MBAL01-9 >= ZERO                                                  
              IF WS-MRGN-BAL-TYPE1 > ZERO                               MRGIML03
                 IF TWA-MBAL01-9 > WS-MRGN-BAL-TYPE1                    MRGIML03
                    MOVE ATT-UNPROT-BRT TO MBAL01A                              
                    MOVE SPACES TO TWA-ORIG-MBAL01                              
                    IF NOT INPUT-ERROR                                          
                       MOVE -1 TO MBAL01L                                       
                       SET INPUT-ERROR TO TRUE                                  
                       MOVE 'BALANCE 01 DEBIT EXCEEDS MARGIN DEBIT'             
                             TO WS-MRGN-MSG-LIT                                 
                       MOVE WS-MRGN-BAL-TYPE1 TO WS-MRGN-MSG-AMT        MRGIML03
                       MOVE WS-MRGN-MSG TO SYSTEM-MSG                           
                    END-IF                                                      
                 END-IF                                                         
              ELSE                                                              
                 MOVE ATT-UNPROT-BRT TO MBAL01A                                 
                 MOVE SPACES TO TWA-ORIG-MBAL01                                 
                 IF NOT INPUT-ERROR                                             
                    MOVE -1 TO MBAL01L                                          
                    SET INPUT-ERROR TO TRUE                                     
                    MOVE 'MARGIN DOES NOT CARRY A DEBIT CASH BALANCE'           
                             TO WS-MRGN-MSG-LIT                                 
                    MOVE WS-MRGN-BAL-TYPE1 TO WS-MRGN-MSG-AMT           MRGIML03
                    MOVE WS-MRGN-MSG TO SYSTEM-MSG                              
                 END-IF                                                         
           END-IF.                                                              
                                                                                
       VALIDATE-BAL02-WITH-MRGN.                                                
******** WHEN MRGN BAL IS CREDIT, SO MUST DELIVER BAL.                          
******** WHEN MRGN BAL IS DEBIT,  SO MUST DELIVER BAL.                          
******** THE BAL CAN'T EXCEED MRGN.                                             
           IF TWA-MBAL02-9 < ZERO                                               
              IF WS-MRGN-BAL-TYPE2 < ZERO                               MRGIML03
                 IF TWA-MBAL02-9 < WS-MRGN-BAL-TYPE2                    MRGIML03
                    MOVE ATT-UNPROT-BRT TO MBAL02A                              
                    MOVE SPACES TO TWA-ORIG-MBAL02                              
                    IF NOT INPUT-ERROR                                          
                       MOVE -1 TO MBAL02L                                       
                       SET INPUT-ERROR TO TRUE                                  
                       MOVE 'BALANCE 02 CREDIT EXCEEDS MARGIN CREDIT'           
                             TO WS-MRGN-MSG-LIT                                 
                       MOVE WS-MRGN-BAL-TYPE2 TO WS-MRGN-MSG-AMT        MRGIML03
                       MOVE WS-MRGN-MSG TO SYSTEM-MSG                           
                    END-IF                                                      
                 END-IF                                                         
              ELSE                                                              
                 MOVE ATT-UNPROT-BRT TO MBAL02A                                 
                 MOVE SPACES TO TWA-ORIG-MBAL02                                 
                 IF NOT INPUT-ERROR                                             
                    MOVE -1 TO MBAL02L                                          
                    SET INPUT-ERROR TO TRUE                                     
                    MOVE 'MARGIN DOES NOT CARRY A CREDIT CASH BALANCE'          
                             TO WS-MRGN-MSG-LIT                                 
                    MOVE WS-MRGN-BAL-TYPE2 TO WS-MRGN-MSG-AMT           MRGIML03
                    MOVE WS-MRGN-MSG TO SYSTEM-MSG                              
                 END-IF                                                         
           ELSE                                                                 
********  TWA-MBAL02-9 >= ZERO                                                  
              IF WS-MRGN-BAL-TYPE2 > ZERO                               MRGIML03
                 IF TWA-MBAL02-9 > WS-MRGN-BAL-TYPE2                    MRGIML03
                    MOVE ATT-UNPROT-BRT TO MBAL02A                              
                    MOVE SPACES TO TWA-ORIG-MBAL02                              
                    IF NOT INPUT-ERROR                                          
                       MOVE -1 TO MBAL02L                                       
                       SET INPUT-ERROR TO TRUE                                  
                       MOVE 'BALANCE 02 DEBIT EXCEEDS MARGIN DEBIT'             
                             TO WS-MRGN-MSG-LIT                                 
                       MOVE WS-MRGN-BAL-TYPE2 TO WS-MRGN-MSG-AMT        MRGIML03
                       MOVE WS-MRGN-MSG TO SYSTEM-MSG                           
                    END-IF                                                      
                 END-IF                                                         
              ELSE                                                              
                 MOVE ATT-UNPROT-BRT TO MBAL02A                                 
                 MOVE SPACES TO TWA-ORIG-MBAL02                                 
                 IF NOT INPUT-ERROR                                             
                    MOVE -1 TO MBAL02L                                          
                    SET INPUT-ERROR TO TRUE                                     
                    MOVE 'MARGIN DOES NOT CARRY A DEBIT CASH BALANCE'           
                             TO WS-MRGN-MSG-LIT                                 
                    MOVE WS-MRGN-BAL-TYPE2 TO WS-MRGN-MSG-AMT           MRGIML03
                    MOVE WS-MRGN-MSG TO SYSTEM-MSG                              
                 END-IF                                                         
           END-IF.                                                              
                                                                                
       VALIDATE-BAL05-WITH-MRGN.                                                
******** WHEN MRGN BAL IS CREDIT, SO MUST DELIVER BAL.                          
******** WHEN MRGN BAL IS DEBIT,  SO MUST DELIVER BAL.                          
******** THE BAL CAN'T EXCEED MRGN.                                             
           IF TWA-MBAL05-9 < ZERO                                               
              IF WS-MRGN-BAL-TYPE5 < ZERO                               MRGIML03
                 IF TWA-MBAL05-9 < WS-MRGN-BAL-TYPE5                    MRGIML03
                    MOVE ATT-UNPROT-BRT TO MBAL05A                              
                    MOVE SPACES TO TWA-ORIG-MBAL02                              
                    IF NOT INPUT-ERROR                                          
                       MOVE -1 TO MBAL05L                                       
                       SET INPUT-ERROR TO TRUE                                  
                       MOVE 'BALANCE 05 CREDIT EXCEEDS MARGIN CREDIT'           
                             TO WS-MRGN-MSG-LIT                                 
                       MOVE WS-MRGN-BAL-TYPE5 TO WS-MRGN-MSG-AMT        MRGIML03
                       MOVE WS-MRGN-MSG TO SYSTEM-MSG                           
                    END-IF                                                      
                 END-IF                                                         
              ELSE                                                              
                 MOVE ATT-UNPROT-BRT TO MBAL05A                                 
                 MOVE SPACES TO TWA-ORIG-MBAL02                                 
                 IF NOT INPUT-ERROR                                             
                    MOVE -1 TO MBAL05L                                          
                    SET INPUT-ERROR TO TRUE                                     
                    MOVE 'MARGIN DOES NOT CARRY A CREDIT CASH BALANCE'          
                             TO WS-MRGN-MSG-LIT                                 
                    MOVE WS-MRGN-BAL-TYPE5 TO WS-MRGN-MSG-AMT           MRGIML03
                    MOVE WS-MRGN-MSG TO SYSTEM-MSG                              
                 END-IF                                                         
           ELSE                                                                 
********  TWA-MBAL05-9 >= ZERO                                                  
              IF WS-MRGN-BAL-TYPE5 > ZERO                               MRGIML03
                 IF TWA-MBAL05-9 > WS-MRGN-BAL-TYPE5                    MRGIML03
                    MOVE ATT-UNPROT-BRT TO MBAL05A                              
                    MOVE SPACES TO TWA-ORIG-MBAL02                              
                    IF NOT INPUT-ERROR                                          
                       MOVE -1 TO MBAL05L                                       
                       SET INPUT-ERROR TO TRUE                                  
                       MOVE 'BALANCE 05 DEBIT EXCEEDS MARGIN DEBIT'             
                             TO WS-MRGN-MSG-LIT                                 
                       MOVE WS-MRGN-BAL-TYPE5 TO WS-MRGN-MSG-AMT        MRGIML03
                       MOVE WS-MRGN-MSG TO SYSTEM-MSG                           
                    END-IF                                                      
                 END-IF                                                         
              ELSE                                                              
                 MOVE ATT-UNPROT-BRT TO MBAL05A                                 
                 MOVE SPACES TO TWA-ORIG-MBAL02                                 
                 IF NOT INPUT-ERROR                                             
                    MOVE -1 TO MBAL05L                                          
                    SET INPUT-ERROR TO TRUE                                     
                    MOVE 'MARGIN DOES NOT CARRY A DEBIT CASH BALANCE'           
                             TO WS-MRGN-MSG-LIT                                 
                    MOVE WS-MRGN-BAL-TYPE5 TO WS-MRGN-MSG-AMT           MRGIML03
                    MOVE WS-MRGN-MSG TO SYSTEM-MSG                              
                 END-IF                                                         
           END-IF.                                                              
                                                                                
       VALIDATE-QTY-WITH-MRGN-POSN.                                             
           IF TWA-MTYPE = '1'                                                   
             IF TWA-MQTY-9 < ZERO                                               
              IF WS-MRGN-POSN-QTY-TYPE1 < ZERO                          MRGIML03
                 IF TWA-MQTY-9 < WS-MRGN-POSN-QTY-TYPE1                 MRGIML03
                    MOVE ATT-UNPROT-BRT TO MQTYA                                
                    IF NOT INPUT-ERROR                                          
                       MOVE -1 TO MQTYL                                         
                       SET INPUT-ERROR TO TRUE                                  
                       MOVE 'QTY (SHORT) EXCEEDS MARGIN TYPE 01 QTY'            
                             TO WS-MRGN-MSG-LIT-QTY                             
                       MOVE WS-MRGN-POSN-QTY-TYPE1 TO WS-MRGN-MSG-QTY   MRGIML03
                       MOVE WS-MRGN-QTY-MSG TO SYSTEM-MSG                       
                    END-IF                                                      
                 END-IF                                                         
              ELSE                                                              
                 MOVE ATT-UNPROT-BRT TO MQTYA                                   
                 IF NOT INPUT-ERROR                                             
                    MOVE -1 TO MQTYL                                            
                    SET INPUT-ERROR TO TRUE                                     
                    MOVE 'MARGIN DOES NOT HAVE A SHORT TYPE 01 POSITION'        
                             TO WS-MRGN-MSG-LIT-QTY                             
                    MOVE WS-MRGN-POSN-QTY-TYPE1 TO WS-MRGN-MSG-QTY      MRGIML03
                    MOVE WS-MRGN-QTY-MSG TO SYSTEM-MSG                          
                 END-IF                                                         
             ELSE                                                               
********  TWA-MQTY-9 >= ZERO                                                    
              IF WS-MRGN-POSN-QTY-TYPE1 > ZERO                          MRGIML03
                 IF TWA-MQTY-9 > WS-MRGN-POSN-QTY-TYPE1                 MRGIML03
                    MOVE ATT-UNPROT-BRT TO MQTYA                                
                    IF NOT INPUT-ERROR                                          
                       MOVE -1 TO MQTYL                                         
                       SET INPUT-ERROR TO TRUE                                  
                       MOVE 'QTY (LONG) EXCEEDS MARGIN TYPE 01 QTY'             
                             TO WS-MRGN-MSG-LIT-QTY                             
                       MOVE WS-MRGN-POSN-QTY-TYPE1 TO WS-MRGN-MSG-QTY   MRGIML03
                       MOVE WS-MRGN-QTY-MSG TO SYSTEM-MSG                       
                    END-IF                                                      
                 END-IF                                                         
              ELSE                                                              
                 MOVE ATT-UNPROT-BRT TO MQTYA                                   
                 IF NOT INPUT-ERROR                                             
                    MOVE -1 TO MQTYL                                            
                    SET INPUT-ERROR TO TRUE                                     
                    MOVE 'MARGIN DOES NOT HAVE A LONG TYPE 01 POSITION'         
                             TO WS-MRGN-MSG-LIT-QTY                             
                    MOVE WS-MRGN-POSN-QTY-TYPE1 TO WS-MRGN-MSG-QTY      MRGIML03
                    MOVE WS-MRGN-QTY-MSG TO SYSTEM-MSG                          
                 END-IF                                                         
             END-IF                                                             
           ELSE                                                                 
           IF TWA-MTYPE = '2'                                                   
             IF TWA-MQTY-9 < ZERO                                               
              IF WS-MRGN-POSN-QTY-TYPE2 < ZERO                          MRGIML03
                 IF TWA-MQTY-9 < WS-MRGN-POSN-QTY-TYPE2                 MRGIML03
                    MOVE ATT-UNPROT-BRT TO MQTYA                                
                    IF NOT INPUT-ERROR                                          
                       MOVE -1 TO MQTYL                                         
                       SET INPUT-ERROR TO TRUE                                  
                       MOVE 'QTY (SHORT) EXCEEDS MARGIN TYPE 02 QTY'            
                             TO WS-MRGN-MSG-LIT-QTY                             
                       MOVE WS-MRGN-POSN-QTY-TYPE2 TO WS-MRGN-MSG-QTY   MRGIML03
                       MOVE WS-MRGN-QTY-MSG TO SYSTEM-MSG                       
                    END-IF                                                      
                 END-IF                                                         
              ELSE                                                              
                 MOVE ATT-UNPROT-BRT TO MQTYA                                   
                 IF NOT INPUT-ERROR                                             
                    MOVE -1 TO MQTYL                                            
                    SET INPUT-ERROR TO TRUE                                     
                    MOVE 'MARGIN DOES NOT HAVE A SHORT TYPE 02 POSITION'        
                             TO WS-MRGN-MSG-LIT-QTY                             
                    MOVE WS-MRGN-POSN-QTY-TYPE2 TO WS-MRGN-MSG-QTY      MRGIML03
                    MOVE WS-MRGN-QTY-MSG TO SYSTEM-MSG                          
                 END-IF                                                         
             ELSE                                                               
********  TWA-MQTY-9 >= ZERO                                                    
              IF WS-MRGN-POSN-QTY-TYPE2 > ZERO                          MRGIML03
                 IF TWA-MQTY-9 > WS-MRGN-POSN-QTY-TYPE2                 MRGIML03
                    MOVE ATT-UNPROT-BRT TO MQTYA                                
                    IF NOT INPUT-ERROR                                          
                       MOVE -1 TO MQTYL                                         
                       SET INPUT-ERROR TO TRUE                                  
                       MOVE 'QTY (LONG) EXCEEDS MARGIN TYPE 02 QTY'             
                             TO WS-MRGN-MSG-LIT-QTY                             
                       MOVE WS-MRGN-POSN-QTY-TYPE2 TO WS-MRGN-MSG-QTY   MRGIML03
                       MOVE WS-MRGN-QTY-MSG TO SYSTEM-MSG                       
                    END-IF                                                      
                 END-IF                                                         
              ELSE                                                              
                 MOVE ATT-UNPROT-BRT TO MQTYA                                   
                 IF NOT INPUT-ERROR                                             
                    MOVE -1 TO MQTYL                                            
                    SET INPUT-ERROR TO TRUE                                     
                    MOVE 'MARGIN DOES NOT HAVE A LONG TYPE 02 POSITION'         
                             TO WS-MRGN-MSG-LIT-QTY                             
                    MOVE WS-MRGN-POSN-QTY-TYPE2 TO WS-MRGN-MSG-QTY      MRGIML03
                    MOVE WS-MRGN-QTY-MSG TO SYSTEM-MSG                          
                 END-IF                                                         
             END-IF                                                             
           ELSE                                                                 
LRM041     IF TWA-MTYPE = '4'                                                   
LRM041     AND TWA-CLIENT-NO-X(2 : 3) = '010'                                   
LRM041       IF TWA-MQTY-9 < ZERO                                               
LRM041        IF WS-MRGN-POSN-QTY-TYPE4 < ZERO                          MRGIML03
LRM041           IF TWA-MQTY-9 < WS-MRGN-POSN-QTY-TYPE4                 MRGIML03
LRM041              MOVE ATT-UNPROT-BRT TO MQTYA                                
LRM041              IF NOT INPUT-ERROR                                          
LRM041                 MOVE -1 TO MQTYL                                         
LRM041                 SET INPUT-ERROR TO TRUE                                  
LRM041                 MOVE 'QTY (SHORT) EXCEEDS MARGIN TYPE 04 QTY'            
LRM041                       TO WS-MRGN-MSG-LIT-QTY                             
LRM041                 MOVE WS-MRGN-POSN-QTY-TYPE4 TO WS-MRGN-MSG-QTY   MRGIML03
LRM041                 MOVE WS-MRGN-QTY-MSG TO SYSTEM-MSG                       
LRM041              END-IF                                                      
LRM041           END-IF                                                         
LRM041        ELSE                                                              
LRM041           MOVE ATT-UNPROT-BRT TO MQTYA                                   
LRM041           IF NOT INPUT-ERROR                                             
LRM041              MOVE -1 TO MQTYL                                            
LRM041              SET INPUT-ERROR TO TRUE                                     
LRM041              MOVE 'MARGIN DOES NOT HAVE A SHORT TYPE 04 POSITION'        
LRM041                       TO WS-MRGN-MSG-LIT-QTY                             
LRM041              MOVE WS-MRGN-POSN-QTY-TYPE4 TO WS-MRGN-MSG-QTY      MRGIML03
LRM041              MOVE WS-MRGN-QTY-MSG TO SYSTEM-MSG                          
LRM041           END-IF                                                         
LRM041       ELSE                                                               
********  TWA-MQTY-9 >= ZERO                                                    
LRM041        IF WS-MRGN-POSN-QTY-TYPE4 > ZERO                          MRGIML03
LRM041           IF TWA-MQTY-9 > WS-MRGN-POSN-QTY-TYPE4                 MRGIML03
LRM041              MOVE ATT-UNPROT-BRT TO MQTYA                                
LRM041              IF NOT INPUT-ERROR                                          
LRM041                 MOVE -1 TO MQTYL                                         
LRM041                 SET INPUT-ERROR TO TRUE                                  
LRM041                 MOVE 'QTY (LONG) EXCEEDS MARGIN TYPE 04 QTY'             
LRM041                       TO WS-MRGN-MSG-LIT-QTY                             
LRM041                 MOVE WS-MRGN-POSN-QTY-TYPE4 TO WS-MRGN-MSG-QTY   MRGIML03
LRM041                 MOVE WS-MRGN-QTY-MSG TO SYSTEM-MSG                       
LRM041              END-IF                                                      
LRM041           END-IF                                                         
LRM041        ELSE                                                              
LRM041           MOVE ATT-UNPROT-BRT TO MQTYA                                   
LRM041           IF NOT INPUT-ERROR                                             
LRM041              MOVE -1 TO MQTYL                                            
LRM041              SET INPUT-ERROR TO TRUE                                     
LRM041              MOVE 'MARGIN DOES NOT HAVE A LONG TYPE 04 POSITION'         
LRM041                       TO WS-MRGN-MSG-LIT-QTY                             
LRM041              MOVE WS-MRGN-POSN-QTY-TYPE4 TO WS-MRGN-MSG-QTY      MRGIML03
LRM041              MOVE WS-MRGN-QTY-MSG TO SYSTEM-MSG                          
LRM041           END-IF                                                         
LRM041       END-IF                                                             
LRM041     ELSE                                                                 
           IF TWA-MTYPE = '5'                                                   
             IF TWA-MQTY-9 < ZERO                                               
              IF WS-MRGN-POSN-QTY-TYPE5 < ZERO                          MRGIML03
                 IF TWA-MQTY-9 < WS-MRGN-POSN-QTY-TYPE5                 MRGIML03
                    MOVE ATT-UNPROT-BRT TO MQTYA                                
                    IF NOT INPUT-ERROR                                          
                       MOVE -1 TO MQTYL                                         
                       SET INPUT-ERROR TO TRUE                                  
                       MOVE 'QTY (SHORT) EXCEEDS MARGIN TYPE 05 QTY'            
                             TO WS-MRGN-MSG-LIT-QTY                             
                       MOVE WS-MRGN-POSN-QTY-TYPE5 TO WS-MRGN-MSG-QTY   MRGIML03
                       MOVE WS-MRGN-QTY-MSG TO SYSTEM-MSG                       
                    END-IF                                                      
                 END-IF                                                         
              ELSE                                                              
                 MOVE ATT-UNPROT-BRT TO MQTYA                                   
                 IF NOT INPUT-ERROR                                             
                    MOVE -1 TO MQTYL                                            
                    SET INPUT-ERROR TO TRUE                                     
                    MOVE 'MARGIN DOES NOT HAVE A SHORT TYPE 05 POSITION'        
                             TO WS-MRGN-MSG-LIT-QTY                             
                    MOVE WS-MRGN-POSN-QTY-TYPE5 TO WS-MRGN-MSG-QTY      MRGIML03
                    MOVE WS-MRGN-QTY-MSG TO SYSTEM-MSG                          
                 END-IF                                                         
             ELSE                                                               
********  TWA-MQTY-9 >= ZERO                                                    
              IF WS-MRGN-POSN-QTY-TYPE5 > ZERO                          MRGIML03
                 IF TWA-MQTY-9 > WS-MRGN-POSN-QTY-TYPE5                 MRGIML03
                    MOVE ATT-UNPROT-BRT TO MQTYA                                
                    IF NOT INPUT-ERROR                                          
                       MOVE -1 TO MQTYL                                         
                       SET INPUT-ERROR TO TRUE                                  
                       MOVE 'QTY (LONG) EXCEEDS MARGIN TYPE 05 QTY'             
                             TO WS-MRGN-MSG-LIT-QTY                             
                       MOVE WS-MRGN-POSN-QTY-TYPE5 TO WS-MRGN-MSG-QTY   MRGIML03
                       MOVE WS-MRGN-QTY-MSG TO SYSTEM-MSG                       
                    END-IF                                                      
                 END-IF                                                         
              ELSE                                                              
                 MOVE ATT-UNPROT-BRT TO MQTYA                                   
                 IF NOT INPUT-ERROR                                             
                    MOVE -1 TO MQTYL                                            
                    SET INPUT-ERROR TO TRUE                                     
                    MOVE 'MARGIN DOES NOT HAVE A LONG TYPE 05 POSITION'         
                             TO WS-MRGN-MSG-LIT-QTY                             
                    MOVE WS-MRGN-POSN-QTY-TYPE5 TO WS-MRGN-MSG-QTY      MRGIML03
                    MOVE WS-MRGN-QTY-MSG TO SYSTEM-MSG                          
                 END-IF                                                         
             END-IF                                                             
           END-IF.                                                              
                                                                                
******** AMOUNT MAY NOT BE PRESENT ON NSCC PTR ASSET RECORD...                  
******** USE % OF MARGIN MARKET VALUE FOR DEFAULT.                              
           IF NOT INPUT-ERROR                                                   
           AND TWA-MAMT-9 = ZERO                                                
              IF TWA-MTYPE = '1'                                                
LRM044           IF WS-MRGN-POSN-MV-TYPE1 > ZERO                                
                    COMPUTE TWA-MAMT-9 = WS-MRGN-POSN-MV-TYPE1 *                
                       (TWA-MQTY-9 / WS-MRGN-POSN-QTY-TYPE1)            MRGIML03
                       ON SIZE ERROR MOVE 1.00  TO TWA-MAMT-9                   
                    END-COMPUTE                                                 
LRM044           ELSE                                                           
LRM044              COMPUTE TWA-MAMT-9 =                                        
LRM044                 (TWA-MQTY-9 / 100)                               MRGIML03
LRM044                 ON SIZE ERROR MOVE 1.00  TO TWA-MAMT-9                   
LRM044              END-COMPUTE                                                 
LRM044           END-IF                                                         
LRM044           IF TWA-MAMT-9 < 1.00                                           
LRM044              MOVE 1.00 TO TWA-MAMT-9                                     
LRM044           END-IF                                                         
              ELSE                                                              
              IF TWA-MTYPE = '2'                                                
LRM044           IF WS-MRGN-POSN-MV-TYPE2 > ZERO                                
                    COMPUTE TWA-MAMT-9 = WS-MRGN-POSN-MV-TYPE2 *                
                       (TWA-MQTY-9 / WS-MRGN-POSN-QTY-TYPE2)            MRGIML03
                       ON SIZE ERROR MOVE 1.00  TO TWA-MAMT-9                   
                    END-COMPUTE                                                 
LRM044           ELSE                                                           
LRM044              COMPUTE TWA-MAMT-9 =                                        
LRM044                 (TWA-MQTY-9 / 100)                               MRGIML03
LRM044                 ON SIZE ERROR MOVE 1.00  TO TWA-MAMT-9                   
LRM044              END-COMPUTE                                                 
LRM044           END-IF                                                         
LRM044           IF TWA-MAMT-9 < 1.00                                           
LRM044              MOVE 1.00 TO TWA-MAMT-9                                     
LRM044           END-IF                                                         
              ELSE                                                              
              IF TWA-MTYPE = '5'                                                
LRM044           IF WS-MRGN-POSN-MV-TYPE5 > ZERO                                
                    COMPUTE TWA-MAMT-9 = WS-MRGN-POSN-MV-TYPE5 *                
                       (TWA-MQTY-9 / WS-MRGN-POSN-QTY-TYPE5)            MRGIML03
                       ON SIZE ERROR MOVE 1.00  TO TWA-MAMT-9                   
                    END-COMPUTE                                                 
LRM044           ELSE                                                           
LRM044              COMPUTE TWA-MAMT-9 =                                        
LRM044                 (TWA-MQTY-9 / 100)                               MRGIML03
LRM044                 ON SIZE ERROR MOVE 1.00  TO TWA-MAMT-9                   
LRM044              END-COMPUTE                                                 
LRM044           END-IF                                                         
LRM044           IF TWA-MAMT-9 < 1.00                                           
LRM044              MOVE 1.00 TO TWA-MAMT-9                                     
LRM044           END-IF                                                         
              END-IF END-IF END-IF                                              
              IF TWA-MAMT-9 = ZEROS                                             
                 MOVE 1.00       TO TWA-MAMT-9                                  
              END-IF                                                            
              MOVE TWA-MAMT-9 TO WS-MQTY-ED-D2                                  
              MOVE WS-MQTY-AREA TO MAMTO TWA-MAMT TWA-ORIG-MAMT                 
           END-IF.                                                              
                                                                                
       SET-CUST-TYPE-B1-DEFAULT-RTN.                                            
           MOVE TWA-CLIENT-NO   TO B1-CLIENT-NO B1-CLIENT.              03580002
           MOVE 434531          TO B1-CARD-NO.                          03590002
           PERFORM READ-B1-RTN.                                         03600002
           IF EIBRESP  = +0                                             03610002
           AND B1-RETURN-VALUE(1 : 2) GREATER SPACES                            
               MOVE B1-RETURN-VALUE(1 : 2) TO TWA-MCTYPE                        
                                        BH-ACAT-DEFAULT-CUSTOMER-TYPE           
           END-IF.                                                              
           IF  BH-ACAT-DEFAULT-CUSTOMER-TYPE > ' '                      CAT513  
               MOVE BH-ACAT-DEFAULT-CUSTOMER-TYPE TO TWA-MCTYPE         CAT513  
           ELSE                                                         CAT513  
               MOVE 'SN'                          TO TWA-MCTYPE         CAT513  
           END-IF.                                                      CAT513  
                                                                        CAT513  
***********PERFORM 5314-CHECK-RETIRE-RANGE THRU 5314-EXIT.              CAT513  
                                                                        CAT513  
           PERFORM 5315-CHECK-IRA-BR-RANGE THRU 5315-EXIT.              CAT513  
           IF  W-IRA-BR-RANGE-SW = 'Y'                                  CAT513  
               CONTINUE                                                 CAT513  
           ELSE                                                         CAT513  
               PERFORM 5316-CHECK-IRA-BR-ACT-RANGE THRU 5316-EXIT       CAT513  
           END-IF.                                                      CAT513  
                                                                                
           MOVE 434534          TO B1-CARD-NO.                          03590002
           MOVE ZERO TO EIBRESP.                                        03610002
           MOVE 1 TO B1-SEQUENCE.                                       00630002
           PERFORM UNTIL EIBRESP NOT = ZERO                                     
                    OR B1-SEQUENCE > 40                                 CAT513  
              PERFORM READ-B1-RTN                                       03600002
              IF EIBRESP  = +0                                          03610002
                 IF B1-RETURN-VALUE(1 : 1) GREATER SPACES                       
                    ADD 1 TO BH-ACAT-RETIRE-ACT-SUB-CTG-NO              CAT513  
                    MOVE B1-RETURN-VALUE(1 : 4) TO                              
                         BH-ACAT-RETIRE-ACT-SUB-CTG-ENT(B1-SEQUENCE)    BHACAT  
                 END-IF                                                         
                 ADD 1 TO B1-SEQUENCE                                   00630002
              END-IF                                                            
           END-PERFORM.                                                 BHACAT  
           MOVE 1 TO B1-SEQUENCE.                                       00630002
                                                                                
           MOVE 434504          TO B1-CARD-NO.                          03590002
           PERFORM READ-B1-RTN.                                         03600002
           IF EIBRESP  = +0                                             03610002
           AND B1-RETURN-VALUE(1 : 1) GREATER SPACES                            
               MOVE B1-RETURN-VALUE(1 : 1) TO                                   
                   BH-ACAT-DEFINE-CUSTOMER-TYPE                         CAT513  
           END-IF.                                                              
                                                                                
           IF  BH-ACAT-RETIRE-ACT-SUB-CTG-NO > 0                        CAT513  
           AND ACATNAIO-IRA > ' '                                       CAT513  
               PERFORM 5311-EDIT-IRA-IND THRU 5311-EXIT                 CAT513  
           ELSE                                                         CAT513  
LRM020         PERFORM 5312-LOAD-CLASS-CODE-B1                                  
               IF  BH-ACAT-DEFINE-CUSTOMER-TYPE = '0'                   CAT513  
                   PERFORM 5312-EDIT-CLASS-CODE THRU 5312-EXIT          CAT513  
               ELSE                                                     CAT513  
                   IF  BH-ACAT-DEFINE-CUSTOMER-TYPE = '1'               CAT513  
                       PERFORM 5313-EDIT-ADT-CUST-TYPE THRU 5313-EXIT   CAT513  
                   END-IF                                               CAT513  
               END-IF                                                   CAT513  
           END-IF.                                                      CAT513  
                                                                        CAT513  
                                                                        CAT513  
       5311-EDIT-IRA-IND.                                               CAT513  
           MOVE 434534          TO B1-CARD-NO.                          03590002
           MOVE ZERO TO EIBRESP.                                        03610002
           MOVE 1 TO B1-SEQUENCE.                                       00630002
           PERFORM UNTIL EIBRESP NOT = ZERO                                     
                    OR B1-SEQUENCE > 40                                 CAT513  
              PERFORM READ-B1-RTN                                       03600002
              IF EIBRESP  = +0                                          03610002
                 ADD 1 TO BH-ACAT-RETIRE-ACT-SUB-CTG-NO                 CAT513  
                 MOVE B1-RETURN-VALUE(1 : 4) TO                                 
                        BH-ACAT-RETIRE-ACT-SUB-CTG-ENT(B1-SEQUENCE)     BHACAT  
                 ADD 1 TO B1-SEQUENCE                                   00630002
              END-IF                                                            
           END-PERFORM.                                                 BHACAT  
           MOVE 1 TO B1-SEQUENCE.                                       00630002
                                                                                
           MOVE 'N' TO W-IRA-B1-SW.                                     CAT513  
           MOVE 1 TO W-SUB1.                                            CAT513  
       5311-LOOP.                                                       CAT513  
           IF  BH-ACAT-RETIRE-ACT-IRA-CODE (W-SUB1) = ' '               CAT513  
               GO TO 5311-EXIT                                          CAT513  
           END-IF                                                       CAT513  
           IF  BH-ACAT-RETIRE-ACT-IRA-CODE (W-SUB1) =                   CAT513  
                                             ACATNAIO-IRA               CAT513  
               MOVE BH-ACAT-RETIRE-ACT-CUST-TYPE (W-SUB1)               CAT513  
                                             TO TWA-MCTYPE              CAT513  
               MOVE 'Y' TO W-IRA-B1-SW                                  CAT513  
           END-IF                                                       CAT513  
           IF  W-SUB1 < BH-ACAT-RETIRE-ACT-SUB-CTG-NO                   CAT513  
               ADD 1 TO W-SUB1                                          CAT513  
               GO TO 5311-LOOP                                          CAT513  
           END-IF.                                                      CAT513  
                                                                        CAT513  
       5311-EXIT. EXIT.                                                 CAT513  
      /                                                                 CAT513  
LRM020 5312-LOAD-CLASS-CODE-B1.                                                 
           MOVE 434535          TO B1-CARD-NO.                          03590002
           MOVE ZERO TO EIBRESP.                                        03610002
           MOVE 1 TO B1-SEQUENCE.                                       00630002
           PERFORM UNTIL EIBRESP NOT = ZERO                                     
                    OR B1-SEQUENCE > 100                                BHACAT  
              PERFORM READ-B1-RTN                                       03600002
              IF EIBRESP  = +0                                          03610002
LRM004           IF B1-RETURN-VALUE(1 : 3) > SPACES                     CAT513  
                    ADD 1 TO  BH-ACAT-CUST-TYPE-VALUE-NO                        
                    MOVE B1-RETURN-VALUE(1 : 6) TO                      BHACAT  
                        BH-ACAT-CUST-TYPE-VALUE-ENTRY(B1-SEQUENCE)      00630002
LRM024              ADD 1 TO B1-SEQUENCE                                        
LRM024           ELSE                                                           
LRM024              MOVE +13 TO EIBRESP                                         
LRM004           END-IF                                                         
              END-IF                                                            
           END-PERFORM.                                                 BHACAT  
           MOVE 1 TO B1-SEQUENCE.                                       00630002
                                                                        CAT513  
       5312-EDIT-CLASS-CODE.                                            CAT513  
           MOVE 'N' TO W-CLASS-CODE-B1-SW.                              CAT513  
           MOVE 1 TO W-SUB1.                                            CAT513  
       5312-LOOP.                                                       CAT513  
           IF  W-SUB1 > BH-ACAT-CUST-TYPE-VALUE-NO                      CAT513  
           OR  BH-ACAT-CUST-TYPE-FROM-NA (W-SUB1) = ' '                 CAT513  
           OR  W-CLASS-CODE-B1-SW  = 'Y'                                CAT513  
               GO TO 5312-EXIT                                          CAT513  
           END-IF                                                       CAT513  
           IF  BH-ACAT-CUST-TYPE-FROM-NA (W-SUB1)                       CAT513  
                                           = ACATNAIO-ACCT-CLASS-EXP    CAT513  
               MOVE BH-ACAT-CUST-ACCT-TYPE (W-SUB1)                     CAT513  
                                                 TO TWA-MCTYPE          CAT513  
               MOVE 'Y' TO W-CLASS-CODE-B1-SW                           CAT513  
LRM020         GO TO 5312-EXIT                                                  
           END-IF                                                       CAT513  
           IF  W-SUB1 < BH-ACAT-CUST-TYPE-VALUE-NO                      CAT513  
           AND W-CLASS-CODE-B1-SW NOT = 'Y'                             CAT513  
               ADD 1 TO W-SUB1                                          CAT513  
               GO TO 5312-LOOP                                          CAT513  
           END-IF.                                                      CAT513  
                                                                        CAT513  
       5312-EXIT. EXIT.                                                 CAT513  
      /                                                                 CAT513  
       5313-EDIT-ADT-CUST-TYPE.                                         CAT513  
                                                                        CAT513  
LRM020     IF BH-ACAT-CUST-TYPE-VALUE-NO = 0                                    
              EVALUATE ACATNAIO-ADT-CUSTOMER-TYPE                       CAT513  
                    WHEN  000     CONTINUE                              CAT513  
                    WHEN  001     MOVE 'TR' TO TWA-MCTYPE               CAT513  
                    WHEN  003     MOVE 'CU' TO TWA-MCTYPE               CAT513  
                    WHEN  004     MOVE 'CO' TO TWA-MCTYPE               CAT513  
                    WHEN  008     MOVE 'SN' TO TWA-MCTYPE               CAT513  
                    WHEN  011     MOVE 'JT' TO TWA-MCTYPE               CAT513  
                    WHEN  012     MOVE 'JT' TO TWA-MCTYPE               CAT513  
                    WHEN  013     MOVE 'AG' TO TWA-MCTYPE               CAT513  
                    WHEN  015     MOVE 'QP' TO TWA-MCTYPE               CAT513  
                    WHEN  018     MOVE 'TR' TO TWA-MCTYPE               CAT513  
                    WHEN  021     MOVE '21' TO TWA-MCTYPE               CAT513  
                    WHEN OTHER    MOVE 'OT' TO TWA-MCTYPE               CAT513  
              END-EVALUATE                                              CAT513  
LRM020        GO TO 5313-EXIT                                                   
LRM020     END-IF.                                                              
LRM020                                                                          
LRM020     MOVE 'N' TO W-CUST-TYPE-B1-SW.                                       
LRM020     MOVE 1 TO W-SUB1.                                                    
LRM020     MOVE ACATNAIO-ADT-CUSTOMER-TYPE TO W-ADT-CUSTOMER-TYPE-9.            
LRM020 5313-LOOP.                                                               
LRM020     IF  BH-ACAT-CUST-TYPE-FROM-NA (W-SUB1) = ' '                         
LRM020         GO TO 5313-EXIT                                                  
LRM020     END-IF                                                               
LRM020     IF  BH-ACAT-CUST-TYPE-FROM-NA (W-SUB1)                               
LRM020                               =  W-ADT-CUSTOMER-TYPE                     
LRM020         MOVE BH-ACAT-CUST-ACCT-TYPE (W-SUB1)                             
LRM020                                           TO TWA-MCTYPE                  
LRM020         MOVE 'Y' TO W-CUST-TYPE-B1-SW                                    
LRM020         GO TO 5313-EXIT                                                  
LRM020     END-IF                                                               
LRM020     IF  W-SUB1 < BH-ACAT-CUST-TYPE-VALUE-NO                              
LRM020         ADD 1 TO W-SUB1                                                  
LRM020         GO TO 5313-LOOP                                                  
LRM020     END-IF.                                                              
LRM020                                                                          
       5313-EXIT. EXIT.                                                 CAT513  
      /                                                                 CAT513  
       5315-CHECK-IRA-BR-RANGE.                                         CAT513  
           MOVE 009125          TO B1-CARD-NO.                          03590002
           MOVE ZERO TO EIBRESP.                                        03610002
           MOVE 1 TO B1-SEQUENCE.                                       00630002
           PERFORM UNTIL EIBRESP NOT = ZERO                                     
                    OR B1-SEQUENCE > 49                                 BHACAT  
              PERFORM READ-B1-RTN                                       03600002
              IF EIBRESP  = +0                                          03610002
                 IF B1-RETURN-VALUE(1 : 3) > SPACES                             
                    ADD 1 TO BH-MGCA-IRA-BR-RANGE-NO                    CAT513  
                    MOVE B1-RETURN-VALUE(1 : 7) TO                              
                        BH-MGCA-IRA-BR-RANGE-ENTRY(B1-SEQUENCE)         BHMGCA  
                    ADD 1 TO B1-SEQUENCE                                00630002
                 ELSE                                                           
                    MOVE +13 TO EIBRESP                                         
                 END-IF                                                         
              END-IF                                                            
           END-PERFORM.                                                 BHACAT  
           MOVE 1 TO B1-SEQUENCE.                                       00630002
                                                                        CAT513  
           MOVE 'N' TO W-IRA-BR-RANGE-SW.                               CAT513  
           IF  BH-MGCA-IRA-BR-RANGE-NO = 0                              CAT513  
               GO TO 5315-EXIT.                                         CAT513  
           MOVE 1 TO W-SUB1.                                            CAT513  
       5315-LOOP.                                                       CAT513  
           IF  TWA-MBR  >= BH-MGCA-IRA-BR-RANGE-LO (W-SUB1) AND         CAT513  
               TWA-MBR  <= BH-MGCA-IRA-BR-RANGE-HI (W-SUB1)             CAT513  
               MOVE 'IR'  TO TWA-MCTYPE                                 CAT513  
               MOVE 'Y' TO W-IRA-BR-RANGE-SW                            CAT513  
***************DISPLAY*'***IRA-BR*FOUND*'*******************************CAT513  
*********************'*LO='*BH-MGCA-IRA-BR-RANGE-LO*(W-SUB1)************CAT513  
*********************'*HI='*BH-MGCA-IRA-BR-RANGE-HI*(W-SUB1)************CAT513  
           ELSE                                                         CAT513  
               IF  W-SUB1 < BH-MGCA-IRA-BR-RANGE-NO                     CAT513  
                   ADD 1 TO W-SUB1                                      CAT513  
               GO TO 5315-LOOP                                          CAT513  
           END-IF.                                                      CAT513  
                                                                        CAT513  
       5315-EXIT. EXIT.                                                 CAT513  
      /                                                                 CAT513  
       5316-CHECK-IRA-BR-ACT-RANGE.                                     CAT513  
           MOVE 009126          TO B1-CARD-NO.                          03590002
           MOVE ZERO TO EIBRESP.                                        03610002
           MOVE 1 TO B1-SEQUENCE.                                       00630002
           PERFORM UNTIL EIBRESP NOT = ZERO                                     
                    OR B1-SEQUENCE > 49                                 BHACAT  
              PERFORM READ-B1-RTN-LONG                                  03600002
              IF EIBRESP  = +0                                          03610002
                 IF B1-RETURN-VALUE(1 : 3) > SPACES                             
                    ADD 1 TO BH-MGCA-IRA-BR-ACT-RANGE-NO                BHMGCA  
                    MOVE B1-RETURN-VALUE(1 : 19) TO                             
                        BH-MGCA-IRA-BR-ACT-RANGE-ENTRY(B1-SEQUENCE)     BHMGCA  
                    ADD 1 TO B1-SEQUENCE                                00630002
                 ELSE                                                           
                    MOVE +13 TO EIBRESP                                         
                 END-IF                                                         
              END-IF                                                            
           END-PERFORM.                                                 BHACAT  
           MOVE 1 TO B1-SEQUENCE.                                       00630002
                                                                        CAT513  
           MOVE 'N' TO W-IRA-BR-ACT-RANGE-SW.                           CAT513  
           IF  BH-MGCA-IRA-BR-ACT-RANGE-NO = 0                          CAT513  
               GO TO 5316-EXIT.                                         CAT513  
           MOVE 1 TO W-SUB1.                                            CAT513  
       5316-LOOP.                                                       CAT513  
           IF  (TWA-MBR >= BH-MGCA-IRA-BR-ACT-BR-LO (W-SUB1) AND        CAT513  
                TWA-MBR <= BH-MGCA-IRA-BR-ACT-BR-HI (W-SUB1))           CAT513  
           AND (TWA-MAC >= BH-MGCA-IRA-BR-ACT-ACT-LO (W-SUB1) AND       CAT513  
                TWA-MAC <= BH-MGCA-IRA-BR-ACT-ACT-HI (W-SUB1))          CAT513  
                  MOVE 'IR'  TO TWA-MCTYPE                              CAT513  
                  MOVE 'Y' TO W-IRA-BR-ACT-RANGE-SW                     CAT513  
******************DISPLAY*'***IRA-BR-ACT*FOUND*'************************CAT513  
*********************'*LO='*BH-MGCA-IRA-BR-ACT-BR-LO*(W-SUB1)***********CAT513  
*********************'*HI='*BH-MGCA-IRA-BR-ACT-BR-HI*(W-SUB1)***********CAT513  
*********************'*LO='*BH-MGCA-IRA-BR-ACT-ACT-LO*(W-SUB1)**********CAT513  
*********************'*HI='*BH-MGCA-IRA-BR-ACT-ACT-HI*(W-SUB1)**********CAT513  
           ELSE                                                         CAT513  
               IF  W-SUB1 < BH-MGCA-IRA-BR-ACT-RANGE-NO                 CAT513  
                   ADD 1 TO W-SUB1                                      CAT513  
               GO TO 5316-LOOP                                          CAT513  
           END-IF.                                                      CAT513  
                                                                        CAT513  
       5316-EXIT. EXIT.                                                 CAT513  
                                                                                
       CHECK-ISIN-RESTRICTIONS-RTN.                                             
           SET ACATRSIO-VERIFY-ISIN-SEC TO TRUE.                                
           SET ACATRSIO-DELIVERER TO TRUE.                                      
           MOVE TWA-CLIENT-NO-X TO ACATRSIO-CLIENT-NBR.                         
           MOVE TWA-MSECR       TO ACATRSIO-ISIN-SEC.                           
           MOVE TWA-ADP-NBR     TO ACATRSIO-ADP-NBR.                            
           MOVE TWA-MCBRKR      TO ACATRSIO-BRKR-CONTRA-NBR.                    
           PERFORM LINK-TO-ACATRSTIO-RTN.                                       
           IF ACATRSIO-DB2-ERROR                                                
              MOVE 'RSS-RD'          TO WS-DB2-PROBLEM-FUNCTION                 
              MOVE ACATRSIO-SQLCAID  TO WS-DB2-PROBLEM-TABLE                    
              MOVE ACATRSIO-SQLCODE  TO WS-DB2-PROBLEM-ID                       
              MOVE WS-DB2-PROBLEM-MSG TO SYSTEM-MSG                             
              PERFORM DB2-ERROR-RTN.                                            
                                                                                
           IF ACATRSIO-FOUND                                                    
              MOVE ATT-UNPROT-BRT TO MSECRA                                     
              IF NOT INPUT-ERROR                                                
                 MOVE -1 TO MSECRL                                              
LRM030           MOVE TWA-ADP-NBR TO WS-CUSIP-RESTRICTED-ADP-NO                 
LRM030           MOVE WS-CUSIP-RESTRICTED-MSG                                   
LRM030*************'CUSIP NUMBER FOUND ON RESTRICTED SECURITY TABLE'            
                            TO SYSTEM-MSG                                       
                 SET INPUT-ERROR TO TRUE                                        
              END-IF                                                            
           ELSE                                                                 
           IF ACATRSIO-PRIVATE-RANGE-FOUND                                      
              MOVE ATT-UNPROT-BRT TO MSECRA                                     
              IF NOT INPUT-ERROR                                                
                 MOVE -1 TO MSECRL                                              
LRM023           MOVE 'BRD SEC NUMBER FOUND ON PRIVATE RANGE FILE'              
                            TO SYSTEM-MSG                                       
                 SET INPUT-ERROR TO TRUE                                        
           END-IF.                                                              
                                                                                
*********      ACATRSIO-PRIVATE-RANGE-IOERR                                     
*********      07  ACATRSIO-PRNGFL-RESP        PIC S9(8) COMP.                  
                                                                                
                                                                                
       CHECK-ACCOUNT-RESTRICTIONS-RTN.                                          
           SET ACATRSIO-VERIFY-ACCOUNT TO TRUE.                                 
           MOVE TWA-CLIENT-NO-X TO ACATRSIO-CLIENT-NBR.                         
           MOVE TWA-MBR         TO ACATRSIO-BRANCH.                             
           MOVE TWA-MAC         TO ACATRSIO-ACCOUNT.                            
           PERFORM LINK-TO-ACATRSTIO-RTN.                                       
           IF ACATRSIO-DB2-ERROR                                                
              MOVE 'RSB-RD'          TO WS-DB2-PROBLEM-FUNCTION                 
              MOVE ACATRSIO-SQLCAID  TO WS-DB2-PROBLEM-TABLE                    
              MOVE ACATRSIO-SQLCODE  TO WS-DB2-PROBLEM-ID                       
              MOVE WS-DB2-PROBLEM-MSG TO SYSTEM-MSG                             
              PERFORM DB2-ERROR-RTN.                                            
                                                                                
           IF ACATRSIO-FOUND                                                    
              MOVE ATT-UNPROT-BRT TO MBRA  MACA                                 
              IF NOT INPUT-ERROR                                                
                 MOVE -1 TO MBRL                                                
LRM023           MOVE 'BRD BRANCH/ACCOUNT IS RESTRICTED'                        
                            TO SYSTEM-MSG                                       
                 SET INPUT-ERROR TO TRUE                                        
              END-IF.                                                           
                                                                                
                                                                                
                                                                                
       5440-ASSET-PRICING-CATEGORY.                                             
LRM003***-------------------------------------------------------------*         
LRM003**** - AS COPIED FROM CAT519....                                          
LRM003***-------------------------------------------------------------*         
      * ASSET PRICING CATEGORY - BASED ON MSD CLASS CODE              *         
      *---------------------------------------------------------------*         
      * CATEGORY                            MSD CLASS CODE            *         
      * ----------------------------------  --------------            *         
      * ANNU - ANNUITY                      6XXXXX7; 6XXXXX8          *         
      * CDCP - CD & COMMERCIAL PAPER        27XXXX5; 27XXXX6;         *         
      *                                     27XXXX7; 27XXXX9;         *         
      * CORP - CORPORATE BOND               POS 1 = 2 (EXCLUDE 2XX21X;*         
      *                                     2XX71X; 29XX1X; 2XXX701;  *         
      *                                     2XX702; 2XX703            *         
      *                                                               *         
      * EQU  - EQUITIES                     1XXXXXX; 65XXXXX          *         
      * FCUR - FOREIGN CURRENCY             -------                   *         
      * FDEB - FOREIGN DEBT                 2XXXXXX; 3XXXXXX; 4XXXXXX;*         
      *                                     7XXXXXX; AND FIRST THREE  *         
      *                                     CHARACTERS OF DESCRIPTION *         
      *                                     EQUAL TO '***'            *         
      * FEQU - FOREIGN EQUITY               1XXXXXX; AND FIRST THREE  *         
      *                                     CHARACTERS OF DESCRIPTION *         
      *                                     EQUAL TO '***'            *         
      * GOVT - US GOVT & GOVT AGENCY        3XXX211; 3XXX711; 2XXX210;*         
      *                                     2XXX710                   *         
      * LPAR - LIMITED PARTNERSHIPS         6XXXXX1; 1XXXXX1          *         
      * MBS  - FHLMC, FNMA, GNMA            2XXXXX1; 2XXXXX2; 2XXXXX3 *         
      * MFMM - MUTUAL FD MONEY MKT          63XXXX6                   *         
      * MFNM - MUTUAL FD NON-MONEY MKT      POS 1 & 2 = 63 AND        *         
      *                                     POS 7 IS NOT EQUAL TO 6   *         
      * MUNI - MUNICIPAL BONDS              4XXXXXX                   *         
      * UARP - ACTION RATE PREFERRED - UIT  -------                   *         
      * UDSC - DEFERRED SALES CHARGE - UIT  -------                   *         
      * UIT  - UNIT INVESTMENT TRUST        7XXXXXX                   *         
      * ZERO - ZERO COUPON BONDS            29XXXXX; 39XXXXX; 49XXXXX *         
      * OTH  - OTHER                        NOT DEFINED ABOVE         *         
      *****************************************************************         
                                                                                
           MOVE ACATMSD-CLASS-CD TO WK-MS-CLASS.                                
           MOVE 'OTH'  TO TWA-MCATGR MCATGRO                                    
      ***OPTIONS = 'OTH'                                                        
           IF  (TWA-ADP-NBR (1:1) = '8' OR '9')                                 
                   AND                                                          
               (WK-MS-CLASS-1-2-3 = '664' OR '665')                             
               GO TO 5440-EXIT                                                  
           END-IF.                                                              
                                                                                
           IF  WK-MS-CLASS-1 = '1'  AND                                         
               TWA-MDESC (1:3) = '***'                                          
               MOVE 'FEQU' TO TWA-MCATGR MCATGRO                                
               GO TO 5440-EXIT                                                  
           END-IF.                                                              
                                                                                
           IF (WK-MS-CLASS-1 = '2' OR '3' OR '4' OR '7') AND                    
               TWA-MDESC (1:3) = '***'                                          
               MOVE 'FDEB' TO TWA-MCATGR MCATGRO                                
               GO TO 5440-EXIT                                                  
           END-IF.                                                              
                                                                                
           IF (WK-MS-CLASS-1 = '4')                                             
               MOVE 'MUNI' TO TWA-MCATGR MCATGRO                                
               GO TO 5440-EXIT                                                  
           END-IF.                                                              
                                                                                
           IF (WK-MS-CLASS-1 = '7')                                             
               MOVE 'UIT ' TO TWA-MCATGR MCATGRO                                
               GO TO 5440-EXIT                                                  
           END-IF.                                                              
                                                                                
           IF (WK-MS-CLASS-1-2 = '29' OR '39' OR '49')                          
               MOVE 'ZERO' TO TWA-MCATGR MCATGRO                                
               GO TO 5440-EXIT                                                  
           END-IF.                                                              
                                                                                
           IF  WK-MS-CLASS-1-2 = '27'   AND                                     
              (WK-MS-CLASS-7 = '5' OR '6' OR '7' OR '9')                        
               MOVE 'CDCP' TO TWA-MCATGR MCATGRO                                
               GO TO 5440-EXIT                                                  
           END-IF.                                                              
                                                                                
           IF (WK-MS-CLASS-1 = '2'  AND                                         
              (WK-MS-CLASS-7 = '1' OR '2' OR '3'))                              
               MOVE 'MBS ' TO TWA-MCATGR MCATGRO                                
               GO TO 5440-EXIT                                                  
           END-IF.                                                              
                                                                                
           IF (WK-MS-CLASS-1 = '3'  AND                                         
               WK-MS-CLASS-5-6-7 = '211' OR '711')                              
           OR (WK-MS-CLASS-1 = '2'  AND                                         
               WK-MS-CLASS-5-6-7 = '210' OR '710')                              
               MOVE 'GOVT' TO TWA-MCATGR MCATGRO                                
               GO TO 5440-EXIT                                                  
           END-IF.                                                              
                                                                                
           IF  WK-MS-CLASS-1 = '2'                                              
           AND (WK-MS-CLASS-4-5   NOT = '21' AND '71')                          
           AND (WK-MS-CLASS-2     NOT = '9'                                     
           AND  WK-MS-CLASS-5     NOT = '1')                                    
           AND (WK-MS-CLASS-5-6-7 NOT = '701' AND '702' AND '703')              
               MOVE 'CORP' TO TWA-MCATGR MCATGRO                                
               GO TO 5440-EXIT                                                  
           END-IF.                                                              
                                                                                
           IF  WK-MS-CLASS-1 = '6'      AND                                     
              (WK-MS-CLASS-7 = '7' OR '8')                                      
               MOVE 'ANNU' TO TWA-MCATGR MCATGRO                                
               GO TO 5440-EXIT                                                  
           END-IF.                                                              
                                                                                
           IF (WK-MS-CLASS-1 = '6'  AND                                         
               WK-MS-CLASS-7 = '1')                                             
           OR (WK-MS-CLASS-1 = '1'  AND                                         
               WK-MS-CLASS-7 = '1')                                             
               MOVE 'LPAR' TO TWA-MCATGR MCATGRO                                
               GO TO 5440-EXIT                                                  
           END-IF.                                                              
                                                                                
           IF (WK-MS-CLASS-1-2 = '63') AND                                      
               WK-MS-CLASS-7 = '6'                                              
               MOVE 'MFMM' TO TWA-MCATGR MCATGRO                                
               GO TO 5440-EXIT                                                  
           END-IF.                                                              
                                                                                
           IF (WK-MS-CLASS-1-2 = '63') AND                                      
              (WK-MS-CLASS-7 NOT = '6')                                         
               MOVE 'MFNM' TO TWA-MCATGR MCATGRO                                
               GO TO 5440-EXIT                                                  
           END-IF.                                                              
                                                                                
           IF  WK-MS-CLASS-1 = '1'                                              
           OR  WK-MS-CLASS-1-2 = '65'                                           
               MOVE 'EQU ' TO TWA-MCATGR MCATGRO                                
               GO TO 5440-EXIT                                                  
           END-IF.                                                              
       5440-EXIT. EXIT.                                                         
                                                                                
LRM003 5450-SETTLE-LOC-RTN.                                                     
           EVALUATE WK-MS-CLASS (1:1)                                           
               WHEN '1'                                                         
                     IF (WK-MS-CLASS (5:1) = '5' OR '6')                        
                         MOVE  'Y'       TO WK-CNS-IND                          
                     END-IF                                                     
               WHEN '2'                                                         
                     IF (WK-MS-CLASS (5:1) = '2' OR '5' OR '6')                 
                         MOVE  'Y'       TO WK-CNS-IND                          
                     END-IF                                                     
               WHEN '3'                                                         
                     IF  (WK-MS-CLASS (5:1) = '2' OR '6')                       
                         MOVE  'Y'       TO WK-CNS-IND                          
                     END-IF                                                     
               WHEN '4'                                                         
                     IF  WK-MS-CLASS (5:1) = '6'                                
                         MOVE  'Y'       TO WK-CNS-IND                          
                     END-IF                                                     
               WHEN '6'                                                         
                     IF  WK-MS-CLASS (2:1) = '6'                                
                         CONTINUE                                               
                     ELSE                                                       
                       IF  (WK-MS-CLASS (5:1) = '5' OR '6')                     
                           MOVE  'Y'     TO WK-CNS-IND                          
                       END-IF                                                   
                     END-IF                                                     
               WHEN '7'                                                         
                     IF  WK-MS-CLASS (5:1) = '6'                                
                         MOVE  'Y'       TO WK-CNS-IND                          
                     END-IF                                                     
               WHEN OTHER                                                       
                    CONTINUE                                                    
           END-EVALUATE                                                         
                                                                                
           MOVE '00' TO  TWA-MSLOC MSLOCO                                       
                         TWA-ORIG-SLOC                                          
                                                                                
           IF (WK-MS-CLASS (4:1) = '2' OR '3' OR '4'                            
                                OR '5' OR '6' OR '7')                           
               MOVE  'Y'       TO WK-DTC-IND                                    
           END-IF.                                                              
                                                                                
           IF  WK-DTC-IND = 'Y'                                                 
               MOVE '25'           TO TWA-MSLOC MSLOCO                          
                                      TWA-ORIG-SLOC                             
           END-IF.                                                              
           IF  WK-CNS-IND = 'Y'                                                 
               MOVE '05'           TO TWA-MSLOC MSLOCO                          
                                      TWA-ORIG-SLOC                             
           END-IF                                                               
LRM003***  IF  BH-ACAT-MF-FUND-SERV-CLIENT = '1'                                
           IF  (TWA-MCATGR = 'MFMM' OR 'MFNM')                                  
               MOVE '10'           TO TWA-MSLOC MSLOCO                          
                                       TWA-ORIG-SLOC                            
           END-IF                                                               
           IF  (TWA-ADP-NBR (1:1) = '8' OR '9')                                 
                    AND                                                         
                (WK-MS-CLASS-1-2-3 = '664' OR '665')                            
              MOVE '35' TO  TWA-MSLOC MSLOCO                                    
                            TWA-ORIG-SLOC                                       
           END-IF.                                                              
       EJECT                                                            06080002
       OBTAIN-MARGIN-POSN-RTN.                                                  
HOLIO**--------------------------------------------------------------*          
     **  UNTIL ALPHANUMERIC BRANCH ACCOUNT OF HOLIO IS AVAILABLE, WE            
     **  HAVE TO USE NUMERIC BRANCH/ACCOUNTS (PACKED KEYS HERE).                
HOLIO**--------------------------------------------------------------*          
00548      MOVE TWA-CLIENT-NO         TO KEY-CLIENT.                    MRGIPS05
00549      MOVE TWA-MBR               TO KEY-BRANCH.                    MRGIPS05
00550      MOVE TWA-MAC               TO KEY-ACCNT.                     MRGIPS05
00551      MOVE ZEROS                 TO KEY-CURR-CODE.                 MRGIPS05
00552      MOVE 'B'                   TO IOH-SHADOW-IND.                MRGIPS05
00552      MOVE 'N'                   TO IOH-FUNC-CODE.                 MRGIPS05
00553      MOVE 'N'                   TO IOH-FUNC-CODE-NEW.             MRGIPS05
00554      MOVE '01'                  TO KEY-REC-TYPE.                  MRGIPS05
LRM025     IF TWA-MWI = 'W'                                                     
LRM025        MOVE '1'                TO KEY-WIC-KEY                    MRGIPS05
LRM025     END-IF.                                                      MRGIPS05
LRM025     MOVE ZEROS                 TO WS-MRGN-POSN-QTY-TYPE1         MRGIPS05
LRM025                                   WS-MRGN-POSN-MV-TYPE1          MRGIPS05
LRM025                                   WS-MRGN-POSN-QTY-TYPE2         MRGIPS05
LRM025                                   WS-MRGN-POSN-MV-TYPE2          MRGIPS05
LRM041                                   WS-MRGN-POSN-QTY-TYPE4         MRGIPS05
LRM041                                   WS-MRGN-POSN-MV-TYPE4          MRGIPS05
LRM025                                   WS-MRGN-POSN-QTY-TYPE5         MRGIPS05
LRM025                                   WS-MRGN-POSN-MV-TYPE5          MRGIPS05
00555      MOVE '0'                   TO ZERO-ACCNT.                    MRGIPS05
00556      MOVE TWA-ADP-NBR           TO KEY-CUSIP-NUM.                 MRGIPS05
           MOVE TWA-MTYPE             TO PS-ACCNT-TYPE.                 MRGIPS05
                                                                                
           MOVE PSKEY                 TO IOH-HOL-KEY                    MRGIPS05
                                         SAVEKEY.                               
           SET IOH-MEMO-REQUEST TO TRUE.                                        
*********  SET IO-READ-XREF         TO TRUE.                                    
       GET-MRGN-POSN-RECORD.                                            MRGIPS05
           MOVE B1-CARD-OPTION      TO IOH-XREF-B1-CARD-OPTION.                 
           SET IOH-ENTERED-SECURITY  TO TRUE.                                   
LRM        MOVE ALL '0' TO WS-99-MEMO-SUBS-AREA.                                
LRM        SET IOH-MEMO-REQUEST TO TRUE.                                        
                                                                                
00590      EXEC CICS LINK PROGRAM ('CUSHOLIO')                          MRGIPS05
00591                     COMMAREA(IOH-COMMAREA)                        MRGIPS05
00592                     LENGTH  (LENGTH OF IOH-COMMAREA)              MRGIPS05
00593      END-EXEC.                                                    MRGIPS05
00594                                                                   MRGIPS05
                                                                                
00595      MOVE IOH-RET-CODE        TO REAL-CODE.                       MRGIPS05
           IF IOH-OTHER-ERROR                                                   
              NEXT SENTENCE                                                     
           ELSE                                                                 
00596         ADD 1                TO REAL-CODE.                        MRGIPS05
00597                                                                   MRGIPS05
00598                                                                   MRGIPS05
00599      IF REAL-CODE GREATER THAN 6                                  MRGIPS05
00600               GO TO IOERROR                                       MRGIPS05
00601      ELSE                                                         MRGIPS05
00602               GO TO  HOLGO-RTN,                                   MRGIPS05
00603                      INVREQERR,                                   MRGIPS05
00604                      OPENERR,                                     MRGIPS05
00605                      OBTAIN-MARGIN-POSN-EXIT,                     MRGIPS05
00606                      OBTAIN-MARGIN-POSN-EXIT,                     MRGIPS05
00607                      OBTAIN-MARGIN-POSN-EXIT,                     MRGIPS05
00608               DEPENDING ON REAL-CODE.                             MRGIPS05
00609                                                                   MRGIPS05
00610  HOLGO-RTN.                                                       MRGIPS05
00611      SET ADDRESS OF CHLD-SUMMARY-SEGMENT   TO IOH-RECORD-POINTER. MRGIPS05
00612       MOVE CHLD-KEY          TO TEMPKEY.                          MRGIPS05
00613       MOVE IOH-HOL-KEY        TO PSKEY.                           MRGIPS05
                                                                                
            MOVE IOH-XREF-B1-CARD-OPTION  TO B1-CARD-OPTION.                    
                                                                                
00614       IF (CHLD-KEY = HIGH-VALUE)                                  MRGIPS05
00615          OR                                                       MRGIPS05
00616             (SAV-KEY NOT = TEMP-KEY)                              MRGIPS05
               OR                                                               
                  (KEY-CURCOD NOT = '000000')                           MRGIPS05
00617                     GO TO OBTAIN-MARGIN-POSN-EXIT.                MRGIPS05
00618       IF CHLD-SECURITY-NUMBER = HIGH-VALUE                        MRGIPS05
               GO TO SET-NEXT-HOLIO-ACCT-TYPE.                                  
      *------------------------------------------------------------             
      *   THIS RTN. IS CHECK ENTERED CURRENCY CODE AND SECURITY                 
00636  CHECK-OPEN-ORDER.                                                MRGIPS05
00623       IF KEY-REC-TYPE = '21'                                      MRGIPS05
00624        SET ADDRESS OF CHOO-SUMMARY-SEGMENT TO IOH-RECORD-POINTER  MRGIPS05
00626        SET ADDRESS OF CHLD-SUMMARY-SEGMENT TO IOH-RECORD-POINTER. MRGIPS05
00628                                                                   MRGIPS05
00643  CHECK-KEY.                                                       MRGIPS05
00644       IF MAIN-SAVKEY = MAIN-TEMPKEY                               MRGIPS05
00645          GO TO CHECK-SEC.                                         MRGIPS05
                                                                                
            GO TO OBTAIN-MARGIN-POSN-EXIT.                                      
                                                                                
00663  CHECK-SEC.                                                       MRGIPS05
00666       MOVE CHLD-ACCOUNT-TYPE     TO UNPK-TYPE.                    MRGIPS05
00664       IF TWA-ADP-NBR NOT = CHLD-SECURITY-NUMBER                   MRGIPS05
               GO TO SET-NEXT-HOLIO-ACCT-TYPE.                                  
00667       IF WK-PS-TYPE = HIGH-VALUE                                  MRGIPS05
00668                      GO TO OBTAIN-MARGIN-POSN-EXIT.               MRGIPS05
            IF WK-PS-TYPE = '1'                                                 
LRM025        ADD  CHLD-YESTERDAY-TOTAL-UNITS TO WS-MRGN-POSN-QTY-TYPE1 MRGIPS05
LRM025        ADD  CHLD-MARKET-VALUE          TO WS-MRGN-POSN-MV-TYPE1  MRGIPS05
            ELSE                                                                
            IF WK-PS-TYPE = '2'                                                 
LRM025        ADD  CHLD-YESTERDAY-TOTAL-UNITS TO WS-MRGN-POSN-QTY-TYPE2 MRGIPS05
LRM025        ADD  CHLD-MARKET-VALUE          TO WS-MRGN-POSN-MV-TYPE2  MRGIPS05
            ELSE                                                                
LRM041      IF WK-PS-TYPE = '4'                                                 
LRM041      AND TWA-CLIENT-NO-X(2 : 3) = '010'                                  
LRM041        ADD  CHLD-YESTERDAY-TOTAL-UNITS TO WS-MRGN-POSN-QTY-TYPE4 MRGIPS05
LRM041        ADD  CHLD-MARKET-VALUE          TO WS-MRGN-POSN-MV-TYPE4  MRGIPS05
LRM041      ELSE                                                                
            IF WK-PS-TYPE = '5'                                                 
LRM025        ADD  CHLD-YESTERDAY-TOTAL-UNITS TO WS-MRGN-POSN-QTY-TYPE5 MRGIPS05
LRM025        ADD  CHLD-MARKET-VALUE          TO WS-MRGN-POSN-MV-TYPE5  MRGIPS05
            END-IF.                                                             
       SET-NEXT-HOLIO-ACCT-TYPE.                                                
LRM025      IF KEY-WIC-KEY = '1'                                        MRGIPS05
LRM025      AND TWA-ADP-NBR = CHLD-SECURITY-NUMBER                      MRGIPS05
LRM025         GO TO GET-MRGN-POSN-RECORD.                                      
            IF WK-PS-TYPE = '1'                                                 
               MOVE '02' TO IOH-HOL-ACCT-TYPE                                   
               GO TO GET-MRGN-POSN-RECORD.                                      
LRM041      IF WK-PS-TYPE = '2'                                                 
LRM041      AND TWA-CLIENT-NO-X(2 : 3) = '010'                                  
LRM041         MOVE '04' TO IOH-HOL-ACCT-TYPE                                   
LRM041         GO TO GET-MRGN-POSN-RECORD.                                      
            IF WK-PS-TYPE < '5'                                                 
               MOVE '05' TO IOH-HOL-ACCT-TYPE                                   
               GO TO GET-MRGN-POSN-RECORD.                                      
       OBTAIN-MARGIN-POSN-EXIT. EXIT.                                           
                                                                                
01402  INVREQERR.                                                       MRGIPS05
            MOVE EIBDS                   TO ERR-EIBDS.                          
01403       MOVE 'POSN FILE INVALID REQUEST ERROR'                      MRGIPS05
                  TO ERR-MSG2                                                   
01404        GO TO DISPERR.                                             MRGIPS05
01405                                                                   MRGIPS05
01406  IOERROR.                                                         MRGIPS05
             MOVE EIBDS                   TO ERR-EIBDS.                         
01407        MOVE 'POSN FILE I/O ERROR'   TO ERR-MSG2.                  MRGIPS05
01408        GO TO DISPERR.                                             MRGIPS05
01409                                                                   MRGIPS05
01410  OPENERR.                                                         MRGIPS05
             MOVE EIBDS                   TO ERR-EIBDS.                         
01411        MOVE 'POSN FILE IS CLOSED'   TO ERR-MSG2.                  MRGIPS05
01412        GO TO DISPERR.                                             MRGIPS05
                                                                                
       DISPERR.                                                         MRGIPS05
             MOVE ERR-MSG TO SYSTEM-MSG.                                        
             PERFORM ERROR-RTN.                                         10220002
                                                                        MRGIPS05
062700 EJECT                                                            06080002
       OBTAIN-MARGIN-BAL-RTN.                                                   
                                                                                
00267      MOVE LOW-VALUES                      TO IOB-COMMAREA.        MRGIML03
00268      MOVE 'R'                             TO IOB-FUNC-CODE.       MRGIML03
00553      MOVE 'N'                             TO IOB-FUNC-CODE-NEW.   MRGIPS05
00269      MOVE TWA-CLIENT-NO                   TO WS-BALNC-CLIENT.     MRGIML03
00270      MOVE TWA-MBR                         TO WS-BALNC-BRANCH.     MRGIML03
00271      MOVE TWA-MAC                         TO WS-BALNC-ACCOUNT.    MRGIML03
00273      MOVE ZERO                            TO WS-BALNC-CURR.       MRGIML03
00274      MOVE WS-BALNC-KEY                    TO IOB-BAL-KEY.         MRGIML03
00275      MOVE 'B'                             TO IOB-SHADOW-IND.      MRGIML03
00276                                                                   MRGIML03
00277      EXEC CICS LINK PROGRAM('CUSBALIO')                           MRGIML03
00278                     COMMAREA(IOB-COMMAREA)                        MRGIML03
00279                     LENGTH(LENGTH OF IOB-COMMAREA)                MRGIML03
00280                     END-EXEC.                                     MRGIML03
00281                                                                   MRGIML03
00282      IF IOB-INV-FUNC                                              MRGIML03
00283         GO TO BALIO-INVREQ.                                       MRGIML03
00284      IF IOB-FILE-CLOSED                                           MRGIML03
00285         GO TO BALIO-NOTOPEN.                                      MRGIML03
00286      IF IOB-NOT-FOUND                                             MRGIML03
              GO TO OBTAIN-MARGIN-BAL-EXIT.                                     
           IF IOB-GOOD-RETURN                                           MRGIML03
**********    IF TWA-CLIENT-NO = +3                                             
***********      GO TO   A200-ADVEST-MASTER-ONLY.                               
***********   ELSE                                                              
                 GO TO SET-ADDRESS.                                             
                                                                                
00288      IF NOT IOB-GOOD-RETURN                                       MRGIML03
00289         GO TO BALIO-ILLOGIC.                                      MRGIML03
00290                                                                   MRGIML03
       SET-ADDRESS.                                                     MRGIML03
00291      SET ADDRESS OF CMBL-CUSTOMER-BALANCE-SEGMENT                 MRGIML03
00292                                           TO IOB-RECORD-POINTER.  MRGIML03
                                                                                
           IF WS-BALNC-KEY(1:19) NOT = CMBL-KEY(1:19)                   MRGIML03
           OR CMBL-CURRENCY-CODE NOT = '000000'                                 
              GO TO OBTAIN-MARGIN-BAL-EXIT.                                     
******** MOVE BALANCES...                                                       
           IF CMBL-ACTYP1-PRESENT = 1                                   MRGIML03
              MOVE CMBL1-TRADE-DATE-BAL-YSTDY (1) TO WS-MRGN-BAL-TYPE1  MRGIML03
              IF CMBL-MM-FUND-YEST NUMERIC                                      
                 SUBTRACT CMBL-MM-FUND-YEST     FROM WS-MRGN-BAL-TYPE1          
           END-IF.                                                              
LRM047     PERFORM READ-BANK-DEPOSIT-RTN.                                       
           IF CMBL-ACTYP2-PRESENT = 1                                   MRGIML03
              MOVE CMBL2-TRADE-DATE-BAL-YSTDY (1) TO WS-MRGN-BAL-TYPE2  MRGIML03
           END-IF.                                                              
           IF CMBL-ACTYP5-PRESENT = 1                                   MRGIML03
              MOVE CMBL5-TRADE-DATE-BAL-YSTDY (1) TO WS-MRGN-BAL-TYPE5  MRGIML03
           END-IF.                                                              
       OBTAIN-MARGIN-BAL-EXIT. EXIT.                                            
                                                                                
01402  BALIO-INVREQ.                                                    MRGIPS05
            MOVE EIBDS                   TO ERR-EIBDS.                          
01403       MOVE 'BALIO INVALID REQUEST ERROR'                          MRGIPS05
                  TO ERR-MSG2                                                   
01404        GO TO DISPERR.                                             MRGIPS05
01405                                                                   MRGIPS05
       BALIO-ILLOGIC.                                                   MRGIML03
             MOVE EIBDS                   TO ERR-EIBDS.                         
01407        MOVE 'BALIO I/O ERROR'       TO ERR-MSG2.                  MRGIPS05
01408        GO TO DISPERR.                                             MRGIPS05
01409                                                                   MRGIPS05
01410  BALIO-NOTOPEN.                                                   MRGIPS05
             MOVE EIBDS                   TO ERR-EIBDS.                         
01411        MOVE 'BALIO IS CLOSED'       TO ERR-MSG2.                  MRGIPS05
01412        GO TO DISPERR.                                             MRGIPS05
                                                                                
           EJECT                                                                
LRM047 READ-BANK-DEPOSIT-RTN.                                                   
LRM047     MOVE LOW-VALUE    TO LBB-COMMAREA                                    
LRM047     MOVE TWA-CLIENT-NO-X  TO ACATRSIO-CLIENT-NBR                         
LRM047     MOVE TWA-MBR        TO LBB-COMM-BRANCH                               
LRM047     MOVE TWA-MAC        TO LBB-COMM-ACCOUNT                              
TEMP********  OBTAIN LIST OF BDF ADP NUMBERS FROM VRSTSEC M### ROWS             
LRM047     SET ACATRSIO-LOOKUP-BANK-DEPOSIT TO TRUE.                            
LRM047     MOVE ZERO TO ACATRSIO-BDF-COUNT                                      
LRM047     PERFORM LINK-TO-ACATRSTIO-RTN.                                       
LRM047     IF ACATRSIO-FOUND                                                    
LRM047        MOVE TWA-CLIENT-NO-X(2:3)  TO LBB-COMM-CLIENT-NO                  
LRM047        MOVE ACATRSIO-BDF-AREA     TO WS-BDF-SECURITY-TABLE               
LRM047        PERFORM VARYING SUB FROM 1 BY 1                                   
LRM047                UNTIL SUB > WS-BDF-COUNT                                  
LRM047           MOVE WS-BDF-SEC-ENTRY(SUB) TO LBB-COMM-SECURITY                
LRM047           EXEC CICS LINK PROGRAM(WS-MRGRLBB)                             
LRM047               COMMAREA(LB-BANK-COMM-AREA)                                
LRM047               LENGTH(LENGTH OF LB-BANK-COMM-AREA)                        
LRM047           END-EXEC                                                       
LRM047           IF LBB-COMM-GOOD-RETURN                                        
LRM047              SUBTRACT LBB-COMM-YEST-TOT-UNITS                            
LRM047                                         FROM WS-MRGN-BAL-TYPE1           
LRM047           END-IF                                                         
LRM047        END-PERFORM                                                       
LRM047     END-IF.                                                              
       EJECT                                                                    
       RETURN-FROM-DETAIL-RTN.                                                  
031100     PERFORM DELETE-TSQ-RTN.                                      02800002
031200     SET FIRST-TIME TO TRUE.                                      02810002
070900                                                                  06740002
071000 EJECT                                                            06750002
       CALL-SECLINK-RTN.                                                AEISAC07
00442      EXEC CICS LINK PROGRAM ('SECLINK')                           AEISAC07
                COMMAREA(SECLINK-LIST)                                          
00443           LENGTH(LENGTH OF SECLINK-LIST)                          AEISAC07
           END-EXEC.                                                            
                                                                                
           EJECT                                                                
087100                                                                  07220110
       INVOKE-DETAIL-PROGRAM-RTN.                                       07225010
           EXEC CICS XCTL PROGRAM(CALLED-PROGRAM-NAME)                          
                          COMMAREA(ACATCOMM-COMMAREA)                           
           END-EXEC.                                                            
  ******** MOVE 'Y' TO ACAT-NOTFND-FLAG.                                        
           MOVE CALLED-PROGRAM-NAME TO ERROR-PROG-NAME.                         
           MOVE 'J' TO ACAT-NEXT.                                               
           MOVE ERROR-PROG-MSG    TO SYSTEM-MSG.                                
           MOVE LOW-VALUE TO ACAT11MO.                                          
           MOVE SPACES     TO ACAT-CALLING-PROG-NAME.                           
                                                                                
096300     EJECT                                                        07630002
096400                                                                  07640002
   500 INIT-MAP-RTN.                                                    07650005
096600     MOVE SPACES     TO ACAT11MO                                  07660002
                              TWA-MAP-TABLE.                            02000002
           MOVE ZEROS TO TWA-MBAL01-9                                           
                         TWA-MBAL02-9                                           
                         TWA-MBAL05-9.                                          
098100     EJECT                                                        07770002
                                                                                
           SKIP3                                                                
       ASKIP-MAP-RTN.                                                           
           MOVE ATT-ASKIP TO MCTYPEA                                            
                             MCBRKRA                                            
                             MBAL01A                                    04809610
                             MBAL02A                                    04809610
                             MBAL05A                                    04809610
                             MCBNAMA                                            
                             MCACCTA                                            
                             MNAMEA                                             
                             MNAME2A                                            
LRM028                       GIFTINDA                                           
                             MSSNA                                              
                             MSSN2A                                             
                             MACATA                                             
                             MSTATA                                             
                             MSDA                                               
                             MSUBMA                                             
                             MREJA                                              
                             MCMNTA.                                            
                                                                                
           PERFORM ASKIP-MAP-SECURITY-SECTION.                                  
                                                                                
       ASKIP-MAP-SECURITY-SECTION.                                              
           MOVE ATT-ASKIP TO MSECRA                                             
LRM035                       MEXPDTA MCALLA MLONGA MSTRIKEA                     
                             MCATGRA                                            
                             MSLOCA                                             
                             MQTYA                                              
                             MMEMOA                                             
                             SLOCRSNA                                           
                             MAMTA                                              
                             MCDA                                               
                             MWIA                                               
                             MTYPEA                                             
                             MDESCA                                             
                             MDESC2A                                            
                             MDESC3A.                                           
********                     MACMNTA.                                           
102000 EJECT                                                            07940002
102100                                                                  07950002
103000 SEND-MAP-RETURN.                                                 08040002
           MOVE -1 TO MBRL.                                                     
103600     IF (LINE-COUNT = 0)                                          08120002
103700     AND DATA-ONLY                                                08130002
104000        EVALUATE TRUE                                             08140002
104100           WHEN EIBAID = DFHPA1                                   08150002
104200               SET ALARM-NEEDED TO TRUE                           08160002
104300               MOVE 'BOTTOM OF DATA.         ' TO SYSTEM-MSG      08170002
104400           WHEN EIBAID = DFHPA2                                   08180002
104500               SET ALARM-NEEDED TO TRUE                           08190002
104600               MOVE 'TOP OF DATA.            ' TO SYSTEM-MSG      08200002
104700           WHEN OTHER                                             08210002
104800               PERFORM ACAT-IT-NOT-FOUND-RTN                      08220002
104900        END-EVALUATE                                              08230002
105000     END-IF.                                                      08240002
           PERFORM INIT-MAP-INPUT-AREA.                                         
           MOVE ATT-UNPROT TO MNEXTA                                    02480002
105100     SET TWA-INTRAN-NO-CHANGE TO TRUE.                            08250002
105100     MOVE 'N' TO  TWA-ACAT-NOT-FOUND-FLAG.                        08250002
105200     MOVE SYSTEM-MSG     TO  TRLMSGO.                             08260002
105300     IF  SYSTEM-MSG NOT = SPACES                                  08270002
105400         MOVE ATT-ASKIP-BRT  TO  TRLMSGA                          08280002
105500     END-IF.                                                      08290002
127200     PERFORM WRITE-TSQ-RTN.                                       10790002
    00     IF  DATA-ONLY                                                08300002
105700         PERFORM SEND-MAP-DATA-ONLY                               08310002
105800     ELSE                                                         08320002
105900         PERFORM SEND-MAP-ERASE                                   08330002
           END-IF.                                                              
           MOVE 'ACAT11PT' TO ACAT-PROGRAM-NAME.                        08340002
106000     PERFORM RETURN-TO-CICS.                                      08350002
106100                                                                  08360002
106200     EJECT                                                        08370002
106100                                                                  08360002
       INIT-MAP-INPUT-AREA.                                                     
           MOVE ACAT-INP-BRANCH      TO MBRO.                                   
           MOVE ACAT-INP-ACCOUNT     TO MACO.                                   
           MOVE TWA-CLIENT-NO-X(2 : 3) TO MCLINBO.                              
029700     MOVE WSTIME            TO MTIMEO.                            02740002
029800     MOVE WSMMDDYY          TO MDATEO.                            02750002
106100                                                                  08360002
106200     EJECT                                                        08370002
106100                                                                  08360002
       ACAT-IT-NOT-FOUND-RTN.                                                   
           IF EIBAID = DFHPF10                                                  
           OR WS-DELETE                                                         
           OR FIRST-TIME                                                        
           OR TWA-INTRAN-BRW                                                    
              MOVE LOW-VALUE TO ACAT11MO                                        
              PERFORM INIT-MAP-RTN                                              
              MOVE LOW-VALUE TO TWA-MAP-TABLE                                   
                                ACAT11MO.                                       
           MOVE ZEROS TO TWA-MBAL01-9                                           
                         TWA-MBAL02-9                                           
                         TWA-MBAL05-9.                                          
           MOVE SPACES TO TWA-CONTROL-NBR.                                      
                                                                                
           PERFORM INIT-MAP-INPUT-AREA.                                         
           MOVE ATT-UNPROT TO MNEXTA.                                   02480002
           MOVE ATT-UNPROT-BRT TO MBRA                                  02490002
           MOVE -1 TO MBRL                                                      
           IF NOT ACAT-SIGN-ON-UPDATE                                           
              PERFORM ASKIP-MAP-RTN.                                            
           IF WS-DELETE                                                         
              MOVE 'RECORD DELETED / NO RECORDS FOUND' TO TRLMSGO       08220002
           ELSE                                                                 
              MOVE 'NO RECORDS FOUND' TO TRLMSGO.                       08220002
           MOVE ATT-ASKIP-BRT  TO  TRLMSGA                              08280002
           IF FIRST-TIME                                                        
           OR WS-DELETE                                                         
              MOVE 'ACAT11PT' TO ACAT-PROGRAM-NAME                      08340002
              PERFORM SEND-MAP-ERASE                                    08330002
           ELSE                                                                 
              PERFORM SEND-MAP-DATA-ONLY.                                       
                                                                                
           PERFORM WRITE-TSQ-RTN                                        10790002
           PERFORM RETURN-TO-CICS.                                      08350002
                                                                                
106200     EJECT                                                        08370002
106100                                                                  08360002
106400 SEND-MAP-ERASE.                                                  08390002
027000     MOVE 'ACAX'        TO MTRANSO.                               08400002
           MOVE TWA-CLIENT-NO-X(2 : 3) TO MCLINBO.                              
029700     MOVE WSTIME        TO MTIMEO.                                02740002
029800     MOVE WSMMDDYY      TO MDATEO.                                02750002
106500     EXEC CICS SEND MAP('HDRMAP')                                 08410002
106600               MAPSET('ACAT00M')                                  08420002
106700               FROM(HDRMAPO)                                      08430002
106800               ACCUM                                              08440002
                     CURSOR                                                     
106900               ERASE                                              08450002
107000     END-EXEC.                                                    08460002
106500     EXEC CICS SEND MAP('ACAT11M')                                08410002
106600               MAPSET('ACAT11M')                                  08420002
106700               FROM(ACAT11MO)                                     08430002
106800               ACCUM                                              08440002
                     CURSOR                                                     
107000     END-EXEC.                                                    08460002
LRM017     IF TWA-FREEZE-CASH-CREDIT = 'Y'                                      
LRM017     OR TWA-FREEZE-CASH-DEBIT  = 'Y'                                      
LRM017     OR TWA-FREEZE-SEC-LONG    = 'Y'                                      
LRM017     OR TWA-FREEZE-SEC-SHORT   = 'Y'                                      
LRM017        MOVE 'ACCT FREEZE' TO SYSTEM-MSG (68 : 11)                        
LRM017     END-IF.                                                              
           MOVE SYSTEM-MSG TO TRLMSGO.                                          
106500     EXEC CICS SEND MAP('TRLMAP')                                 08410002
106600               MAPSET('ACAT00M')                                  08420002
106700               FROM(TRLMAPO)                                      08430002
106800               ACCUM                                              08440002
107000     END-EXEC.                                                    08460002
106500     EXEC CICS SEND PAGE                                          08410002
107000     END-EXEC.                                                    08460002
107100                                                                  08470002
107200 EJECT                                                            08480002
107300                                                                  08490002
107400 SEND-MAP-DATA-ONLY.                                              08500002
027000     MOVE 'ACAX'         TO MTRANSO.                              08510002
           MOVE TWA-CLIENT-NO-X(2 : 3) TO MCLINBO.                              
029700     MOVE WSTIME         TO MTIMEO.                               02740002
029800     MOVE WSMMDDYY       TO MDATEO.                               02750002
    ***    IF FIRST-TIME                                                        
    ***    AND (WK-CURSOR NOT = 0)                                              
              EXEC CICS SEND MAP('HDRMAP')                              08410002
                        MAPSET('ACAT00M')                               08420002
                        FROM(HDRMAPO)                                   08430002
                        ACCUM                                           08440002
                        CURSOR                                          08550002
                        DATAONLY                                        08560002
               END-EXEC                                                 08460002
107600         EXEC CICS SEND MAP('ACAT11M')                            08520002
107700                   MAPSET('ACAT11M')                              08530002
107800                   FROM(ACAT11MO)                                 08540002
107900                   CURSOR                                         08550002
108000                   DATAONLY                                       08560002
                         ACCUM                                             08440
108100         END-EXEC                                                         
LRM017         IF TWA-FREEZE-CASH-CREDIT = 'Y'                                  
LRM017         OR TWA-FREEZE-CASH-DEBIT  = 'Y'                                  
LRM017         OR TWA-FREEZE-SEC-LONG    = 'Y'                                  
LRM017         OR TWA-FREEZE-SEC-SHORT   = 'Y'                                  
LRM017            MOVE 'ACCT FREEZE' TO SYSTEM-MSG (68 : 11)                    
LRM017         END-IF                                                           
               MOVE SYSTEM-MSG TO TRLMSGO                                       
               EXEC CICS SEND MAP('TRLMAP')                                08410
                         MAPSET('ACAT00M')                                 08420
                         FROM(TRLMAPO)                                     08430
                         DATAONLY                                       08560002
                         ACCUM                                             08440
               END-EXEC                                                    08460
               EXEC CICS SEND PAGE                                      08410002
               END-EXEC.                                                08460002
108200                                                                  08580002
       SEND-POPUP-MAP-RTN.                                                      
                                                                                
           IF TWA-SCREEN NOT = 'A'                                              
           AND EIBAID = DFHPF1                                                  
LRM003        IF TWA-MREJ > '00'                                                
LRM003           MOVE 'A' TO TWA-SCREEN                                         
LRM003        ELSE                                                              
              IF EIBCPOSN >= 602 AND < 640                                      
                 MOVE '1' TO TWA-SCREEN                                         
              ELSE                                                              
              IF EIBCPOSN >= 682 AND < 720                                      
                 MOVE '2' TO TWA-SCREEN                                         
              ELSE                                                              
              IF EIBCPOSN >= 762 AND < 800                                      
                 MOVE '5' TO TWA-SCREEN                                         
              ELSE                                                              
              IF EIBCPOSN < 1120                                                
                 MOVE 'A' TO TWA-SCREEN                                         
              ELSE                                                              
                 MOVE 'S' TO TWA-SCREEN                                         
           END-IF.                                                              
                                                                                
           MOVE SPACES TO TWA-MCMNT.                                            
           PERFORM WRITE-TSQ-RTN.                                       10790002
           MOVE 'J' TO ACAT-INP-SEL.                                            
           PERFORM WRITE-ACAT90CM-TS-RTN.                                       
           MOVE '$' TO WS-ACAT-NEXT.                                            
           MOVE 'ACAT90CM' TO CALLED-PROGRAM-NAME.                              
           PERFORM INVOKE-DETAIL-PROGRAM-RTN.                           07225010
                                                                                
       WRITE-ACAT90CM-TS-RTN.                                                   
           IF ACAT-SIGN-ON-UPDATE                                               
           AND ((TWA-ACTION = 'A' OR 'C')                                       
LRM003       OR TWA-MREJ > '00')                                                
              MOVE 'Y' TO TWA-ACAT90CM-UPDATE-IND.                      02030002
                                                                                
LRM003*** DO NOT ALLOW USER TO ADD COMMENTS TO AN AREA THAT DON'T EXIST,        
LRM003*** LIKE ACCOUNT LEVEL PTR (NON REJECT), OR NO BALANCE, ETC               
LRM003      IF ((TWA-INP-TFR-TYP = 'PTR' AND TWA-PTR-BEEN-FLIPPED)              
LRM003      OR (TWA-INP-TFR-TYP = 'PTD' OR 'PTF'))                              
LRM003        IF TWA-SCREEN = 'A'                                               
LRM003        AND TWA-MREJ NOT > '00'                                           
LRM003        AND TWA-INP-TFR-TYP = 'PTR'                                       
LRM003          MOVE 'ACCOUNT LEVEL COMMENTS NOT ALLOWED ON PTR DLVY'           
LRM003             TO SYSTEM-MSG                                        03650002
LRM010          MOVE SPACE TO TWA-SCREEN                                        
LRM003          PERFORM  ERROR-RTN                                      03650002
LRM003        ELSE                                                              
LRM003        IF TWA-SCREEN = '1'                                               
LRM003        AND TWA-MBAL01 NOT > SPACES                                       
LRM003          MOVE 'BALANCE 01 COMMENTS NOT ALLOWED WHEN NO BALANCE'          
LRM003             TO SYSTEM-MSG                                        03650002
LRM003          PERFORM  ERROR-RTN                                      03650002
LRM003        ELSE                                                              
LRM003        IF TWA-SCREEN = '2'                                               
LRM003        AND TWA-MBAL02 NOT > SPACES                                       
LRM003          MOVE 'BALANCE 02 COMMENTS NOT ALLOWED WHEN NO BALANCE'          
LRM003             TO SYSTEM-MSG                                        03650002
LRM003          PERFORM  ERROR-RTN                                      03650002
LRM003        ELSE                                                              
LRM003        IF TWA-SCREEN = '5'                                               
LRM003        AND TWA-MBAL05 NOT > SPACES                                       
LRM003          MOVE 'BALANCE 05 COMMENTS NOT ALLOWED WHEN NO BALANCE'          
LRM003             TO SYSTEM-MSG                                        03650002
LRM003          PERFORM  ERROR-RTN                                      03650002
LRM003        ELSE                                                              
LRM003        IF TWA-SCREEN = 'S'                                               
LRM003        AND TWA-SECR-ACTION = 'A'                                         
LRM003          MOVE 'SECURITY COMMENTS NOT ALLOWED WHEN NO ASSET'              
LRM003             TO SYSTEM-MSG                                        03650002
LRM003          PERFORM  ERROR-RTN                                      03650002
LRM003     END-IF.                                                              
                                                                                
           MOVE 'ACA$'   TO TRAN-ID.                                    02410002
           EXEC CICS DELETEQ TS QUEUE(TSQ-NAME)                         10490002
           END-EXEC.                                                    10500002
                                                                        10510002
LRM016     IF EIBAID NOT = DFHPF6                                               
              MOVE TWA-MAP-TABLE TO ACAT90CM-TS-AREA.                           
           IF TWA-SCREEN = 'A'                                                  
LRM003      IF TWA-MREJ > '00'                                                  
LRM036      AND TWA-PTR-MCCMNT-X120 > SPACES                                    
LRM003        MOVE TWA-PTR-MCCMNT-X120 TO ACAT90CM-TS-MCCMNT-X120               
LRM003      ELSE                                                                
LRM041        IF TWA-MTYPE = '4'                                                
LRM041        AND TWA-CLIENT-NO-X(2 : 3) = '010'                                
LRM041        AND TWA-MCCMNT-X120 NOT > SPACES                                  
LRM041           MOVE                                                           
LRM041           'RESIDUAL PHYSICAL SECURITY DELIVERY FROM FULL ACAT'           
LRM041                       TO TWA-MCCMNT-X120                                 
LRM041        END-IF                                                            
              MOVE TWA-MCCMNT-X120 TO ACAT90CM-TS-MCCMNT-X120                   
           ELSE                                                                 
           IF TWA-SCREEN = '1'                                                  
              MOVE TWA-M1CMNT-X120 TO ACAT90CM-TS-MCCMNT-X120                   
           ELSE                                                                 
           IF TWA-SCREEN = '2'                                                  
              MOVE TWA-M2CMNT-X120 TO ACAT90CM-TS-MCCMNT-X120                   
           ELSE                                                                 
           IF TWA-SCREEN = '5'                                                  
              MOVE TWA-M5CMNT-X120 TO ACAT90CM-TS-MCCMNT-X120                   
           ELSE                                                                 
           IF TWA-SCREEN = 'M'                                                  
              MOVE TWA-MMCMNT-X120 TO ACAT90CM-TS-MCCMNT-X120                   
           ELSE                                                                 
           IF TWA-SCREEN = 'S'                                                  
              MOVE TWA-MSCMNT-X120 TO ACAT90CM-TS-MCCMNT-X120                   
              MOVE TWA-MDESC       TO ACAT90CM-TS-MNAME                         
CSG001* IN SOME CASES MSD DESCRIPTIONS CONTAIN SPECIAL CHARACTERS.              
CSG001* CORRECT THEM BY REPLACING SPECIAL CHARACTERS WITH SPACES.               
CSG001        MOVE ACAT90CM-TS-MNAME    TO W-ASSET-DESC-TXT                     
CSG001        MOVE 30                   TO W-SUB3                               
CSG001        SET W-JUST-LEFT-REQ-Y     TO TRUE                                 
CSG001        PERFORM EDIT-ASSET-DESC-TXT                                       
CSG001        MOVE W-ASSET-DESC-TXT     TO ACAT90CM-TS-MNAME                    
              MOVE TWA-MDESC2      TO ACAT90CM-TS-MNAME2                        
CSG001        MOVE ACAT90CM-TS-MNAME2   TO W-ASSET-DESC-TXT                     
CSG001        MOVE 30                   TO W-SUB3                               
CSG001        SET W-JUST-LEFT-REQ-N     TO TRUE                                 
CSG001        PERFORM EDIT-ASSET-DESC-TXT                                       
CSG001        MOVE W-ASSET-DESC-TXT     TO ACAT90CM-TS-MNAME2                   
              MOVE TWA-MDESC3      TO ACAT90CM-TS-MNAME3                        
CSG001        MOVE ACAT90CM-TS-MNAME3   TO W-ASSET-DESC-TXT                     
CSG001        MOVE 30                   TO W-SUB3                               
CSG001        SET W-JUST-LEFT-REQ-N     TO TRUE                                 
CSG001        PERFORM EDIT-ASSET-DESC-TXT                                       
CSG001        MOVE W-ASSET-DESC-TXT     TO ACAT90CM-TS-MNAME3                   
           END-IF.                                                              
124700     EXEC CICS WRITEQ TS QUEUE(TSQ-NAME)                          10530002
124800                         FROM(ACAT90CM-TS-AREA)                   10540002
124900                         LENGTH(LENGTH OF ACAT90CM-TS-AREA)       10550002
                               ITEM(ITEM-NUM)                           10560002
125000     END-EXEC.                                                    10570002
125100     IF EIBRESP NOT = +0                                          10580002
              MOVE LOW-VALUE TO ACAT11MO                                        
125200        MOVE 'ACAT11 WRITE TSQ ERROR ON ACA$'                     10590002
125300          TO SYSTEM-MSG                                           10600002
125500     END-IF.                                                      10620002
                                                                                
123600 READ-ACAT90CM-TS-RTN.                                            10350002
           MOVE 'ACA$'   TO TRAN-ID.                                    02410002
           EXEC CICS READQ TS QUEUE(TSQ-NAME)                           10360002
                              INTO(ACAT90CM-TS-AREA)                    10370002
                              LENGTH(LENGTH OF ACAT90CM-TS-AREA)        10380002
                              ITEM(ITEM-NUM)                            10390002
124000     END-EXEC.                                                    10400002
125100     IF EIBRESP = +0                                              10410002
              IF ACAT90CM-TS-SCREEN = 'A'                                       
LRM003           IF TWA-MREJ > '00'                                             
LRM036            IF (ACAT90CM-TS-MCCMNT-X120 = SPACES                          
LRM036            OR  ACAT90CM-TS-MCCMNT-X120 NOT =  TWA-MCCMNT-X120)           
LRM003             MOVE ACAT90CM-TS-MCCMNT-X120 TO TWA-PTR-MCCMNT-X120          
LRM036            END-IF                                                        
LRM003           ELSE                                                           
                   MOVE ACAT90CM-TS-MCCMNT-X120 TO TWA-MCCMNT-X120              
LRM003           END-IF                                                         
                 MOVE ACAT90CM-TS-MSUBM       TO TWA-MSUBM                      
              ELSE                                                              
              IF ACAT90CM-TS-SCREEN = '1'                                       
                 MOVE ACAT90CM-TS-MCCMNT-X120 TO TWA-M1CMNT-X120                
                 MOVE ACAT90CM-TS-MSUBM       TO TWA-MSUBM                      
              ELSE                                                              
              IF ACAT90CM-TS-SCREEN = '2'                                       
                 MOVE ACAT90CM-TS-MCCMNT-X120 TO TWA-M2CMNT-X120                
                 MOVE ACAT90CM-TS-MSUBM       TO TWA-MSUBM                      
              ELSE                                                              
              IF ACAT90CM-TS-SCREEN = '5'                                       
                 MOVE ACAT90CM-TS-MCCMNT-X120 TO TWA-M5CMNT-X120                
                 MOVE ACAT90CM-TS-MSUBM       TO TWA-MSUBM                      
              ELSE                                                              
              IF ACAT90CM-TS-SCREEN = 'M'                                       
                 MOVE ACAT90CM-TS-MCCMNT-X120 TO TWA-MMCMNT-X120                
                 MOVE ACAT90CM-TS-MSUBM       TO TWA-MSUBM                      
              ELSE                                                              
              IF ACAT90CM-TS-SCREEN = 'S'                                       
                 MOVE ACAT90CM-TS-MCCMNT-X120 TO TWA-MSCMNT-X120                
                 MOVE ACAT90CM-TS-MSUBM       TO TWA-MSUBM                      
              ELSE                                                              
              IF ACAT90CM-TS-SCREEN = 'T'                                       
                 MOVE ACAT90CM-TS-MCTYPE TO TWA-MCTYPE                          
           END-IF.                                                              
           MOVE SPACES   TO TWA-SCREEN.                                         
           MOVE 'ACAX'   TO TRAN-ID.                                    02410002
108300 EJECT                                                            08590002
108400                                                                  08600002
108500 PAGE-FORWARD-RTN.                                                08610002
           MOVE TWA-CLIENT-NO-X   TO ACAT11IO-CLIENT-NBR.                       
           MOVE TWA-MCBRKR        TO ACAT11IO-RCV-NBR.                          
           MOVE TWA-MCACCT        TO ACAT11IO-RCV-ACCT.                         
           MOVE ACAT-ADP-BROKER   TO ACAT11IO-DLVR-NBR.                         
LRM003***  MOVE TWA-MBR           TO ACAT11IO-DLVR-ACCT.                        
LRM003***  MOVE TWA-MBR           TO ACAT11IO-DLVR-ACCT.                        
LRM003     MOVE TWA-DLVR-ACCT     TO ACAT11IO-DLVR-ACCT.                        
           MOVE TWA-CURRENT-ASSET-KEY TO ACAT11IO-CURRENT-ASSET-KEY.            
           MOVE TWA-ASSET-SEQ     TO ACAT11IO-ASSET-SEQ-NBR.                    
LRM010     MOVE TWA-CONTROL-NBR TO ACAT11IO-CONTROL-NBR                         
                                                                                
LRM003     IF TWA-INP-TFR-TYP = 'PTR'                                           
LRM003     AND (TWA-STTS-CD = '500' OR '510')                                   
LRM003     AND TWA-MREJ NOT > '00'                                              
LRM003     AND TWA-PTR-BEEN-FLIPPED                                             
LRM003        MOVE 'PTR'             TO ACAT11IO-TRNFR-TYPE-CD                  
LRM003        SET ACAT11IO-IT-READNEXT-VINITAST TO TRUE                         
LRM003     ELSE                                                                 
           IF TWA-INP-TFR-TYP = 'PTR'                                           
           OR TWA-ACTION = '6'                                                  
           OR TWA-ACTIVE-DB = 'Y'                                               
              MOVE 'PTR'             TO ACAT11IO-TRNFR-TYPE-CD                  
              SET ACAT11IO-IT-READNEXT-VASSET TO TRUE                           
              MOVE TWA-CONTROL-NBR TO ACAT11IO-CONTROL-NBR                      
              IF NOT ACAT-SIGN-ON-UPDATE                                        
                 MOVE -1 TO MACATL                                              
              END-IF                                                            
           ELSE                                                                 
LRM028     IF TWA-INP-TFR-TYP = 'PTF'                                           
LRM028        MOVE 'PTF'             TO ACAT11IO-TRNFR-TYPE-CD                  
LRM028*****   IF TWA-CONTROL-NBR > SPACES                                       
LRM031        IF TWA-CONTROL-NBR(1:1) > '1'                                     
LRM028           SET ACAT11IO-GET-NEXT-PTD-A TO TRUE                            
LRM028        ELSE                                                              
LRM028           SET ACAT11IO-IT-READNEXT-VINITAST TO TRUE                      
LRM028     ELSE                                                                 
              MOVE 'PTD'             TO ACAT11IO-TRNFR-TYPE-CD                  
LRM028*****   IF TWA-CONTROL-NBR > SPACES                                       
LRM031        IF TWA-CONTROL-NBR(1:1) > '1'                                     
LRM028           SET ACAT11IO-GET-NEXT-PTD-A TO TRUE                            
LRM028        ELSE                                                              
                 SET ACAT11IO-IT-READNEXT-VINITAST TO TRUE                      
           END-IF.                                                              
           PERFORM LINK-TO-ACAT11IO-RTN.                                        
           IF ACAT11IO-ASSET-NOT-FOUND                                          
LRM003**** CODE - INTENDED FOR FLIPPED ASSETS FOUND - NG...                     
LRM003***     IF TWA-PTR-BEEN-FLIPPED                                           
LRM003***     AND ACAT11IO-IT-READNEXT-VINITAST                                 
LRM003***        MOVE 'Y' TO TWA-ACTIVE-DB                                      
LRM003***        GO TO PAGE-FORWARD-RTN                                 08610002
LRM003***     END-IF                                                            
LRM016        IF EIBAID = DFHPF4 OR DFHPF7                                      
                 CONTINUE                                                       
              ELSE                                                              
LRM003***     IF TWA-INP-TFR-TYP = 'PTR'                                        
LRM003***     AND (TWA-STTS-CD = '500' OR '510')                                
LRM003***     AND TWA-PTR-BEEN-FLIPPED                                          
LRM003***        CONTINUE                                                       
LRM003***     ELSE                                                              
LRM003        IF EIBAID = DFHPA1                                                
LRM003           MOVE ATT-ASKIP TO MSECRA MSLOCA MTYPEA                         
LRM003           MOVE 'BOTTOM OF ASSET DATA' TO SYSTEM-MSG                      
LRM003           PERFORM  ERROR-RTN                                     03650002
LRM003        ELSE                                                              
LRM003           MOVE 'C' TO TWA-SECR-ACTION                                    
LRM003           PERFORM PROCESS-MAP-ITEMS THRU PROCESS-MAP-ITEMS-EXIT          
           ELSE                                                                 
           IF NOT ACAT11IO-ASSET-FOUND                                          
              MOVE LOW-VALUE TO ACAT11MO                                03620002
              MOVE 'NX-AS'           TO WS-DB2-PROBLEM-FUNCTION                 
              MOVE ACAT11IO-SQLCAID  TO WS-DB2-PROBLEM-TABLE                    
              MOVE ACAT11IO-SQLCODE  TO WS-DB2-PROBLEM-ID                       
              MOVE WS-DB2-PROBLEM-MSG TO SYSTEM-MSG                             
              PERFORM DB2-ERROR-RTN.                                            
                                                                                
DJ0002     IF ACAT11IO-ASSET-FOUND                                              
DJ0002        PERFORM MOVE-ACAT11IO-ASSET-TO-TWA                                
DJ0002        PERFORM REFORMAT-SCREEN-ASSET                                     
LRM003        IF ACAT11IO-NSCC-SUBMITTED                                        
LRM003           MOVE 'B' TO TWA-ACTION TWA-SECR-ACTION                         
LRM003        ELSE                                                              
DJ0002           MOVE 'C' TO TWA-SECR-ACTION                                    
LRM003        END-IF                                                            
LRM003        PERFORM PROCESS-MAP-ITEMS THRU PROCESS-MAP-ITEMS-EXIT             
LRM003     ELSE                                                                 
LRM003     IF TWA-INP-TFR-TYP = 'PTR'                                           
LRM003     AND (TWA-STTS-CD = '500' OR '510')                                   
LRM003     AND TWA-PTR-BEEN-FLIPPED                                             
LRM003        MOVE 'A' TO TWA-SECR-ACTION                                       
LRM003        PERFORM PROCESS-MAP-ITEMS THRU PROCESS-MAP-ITEMS-EXIT             
DJ0002     END-IF.                                                              
                                                                                
LRM016     IF EIBAID = DFHPF4 OR DFHPF7                                         
              GO TO PAGE-FORWARD-RTN-EXIT.                                      
                                                                                
           IF TWA-INP-TFR-TYP = 'PTR'                                           
LRM038        IF ACAT-SIGN-ON-UPDATE                                            
LRM038        AND TWA-STTS-CD = '500'                                           
LRM038        AND NOT TWA-PTR-BEEN-FLIPPED                                      
LRM038        AND TWA-STTLM-TM-CD = 'L'                                         
LRM038        AND TWA-MREJ NOT > '00'                                           
LRM038           MOVE 'WARNING: PLEASE TAKE ACTION - REJECT OR FULFILL'         
LRM038                                          TO SYSTEM-MSG                   
LRM038        ELSE                                                              
LRM003        IF ACAT11IO-NSCC-SUBMITTED                                        
LRM024           IF ACAT-ASCENDIS-CLIENT                                        
LRM024              MOVE WS-FRWD-ASCENDIS-MSG   TO SYSTEM-MSG                   
LRM024           ELSE                                                           
LRM003              MOVE WS-ASSET-SUBMITTED-MSG TO SYSTEM-MSG                   
LRM003        ELSE                                                              
              IF FIRST-TIME                                                     
                 MOVE 'PTR DISPLAYED' TO SYSTEM-MSG                             
              ELSE                                                              
                 IF EIBAID = DFHPF7                                             
                    MOVE 'PRIOR PTR DISPLAYED' TO SYSTEM-MSG                    
                 ELSE                                                           
                 IF EIBAID = DFHPF8                                             
                    MOVE 'NEXT PTR DISPLAYED' TO SYSTEM-MSG                     
                 ELSE                                                           
                    MOVE 'NEXT PTR ASSET DISPLAYED' TO SYSTEM-MSG               
           ELSE                                                                 
LRM028     IF TWA-INP-TFR-TYP = 'PTF'                                           
LRM028        IF FIRST-TIME                                                     
LRM028           MOVE 'PTF DISPLAYED' TO SYSTEM-MSG                             
LRM028        ELSE                                                              
LRM028           IF EIBAID = DFHPF7                                             
LRM028              MOVE 'PRIOR PTF DISPLAYED' TO SYSTEM-MSG                    
LRM028           ELSE                                                           
LRM028           IF EIBAID = DFHPF8                                             
LRM028              MOVE 'NEXT PTF DISPLAYED' TO SYSTEM-MSG                     
LRM028           ELSE                                                           
LRM028              MOVE 'NEXT PTF ASSET DISPLAYED' TO SYSTEM-MSG               
LRM028     ELSE                                                                 
              IF FIRST-TIME                                                     
                 MOVE 'PTD DISPLAYED' TO SYSTEM-MSG                             
              ELSE                                                              
                 IF EIBAID = DFHPF7                                             
                    MOVE 'PRIOR PTD DISPLAYED' TO SYSTEM-MSG                    
                 ELSE                                                           
                 IF EIBAID = DFHPF8                                             
                    MOVE 'NEXT PTD DISPLAYED' TO SYSTEM-MSG                     
                 ELSE                                                           
                    MOVE 'NEXT PTD ASSET DISPLAYED' TO SYSTEM-MSG               
           END-IF.                                                              
                                                                                
           IF FIRST-TIME                                                        
              PERFORM SEND-MAP-ERASE                                            
           ELSE                                                                 
              PERFORM SEND-MAP-DATA-ONLY.                               10250002
           PERFORM WRITE-TSQ-RTN.                                       10790002
           PERFORM RETURN-TO-CICS.                                      08350002
       PAGE-FORWARD-RTN-EXIT. EXIT.                                             
                                                                        08960002
       BROWSE-ASSET-RTN.                                                        
           MOVE TWA-CLIENT-NO-X   TO ACAT11IO-CLIENT-NBR.                       
LRM003     MOVE TWA-INP-TFR-TYP   TO ACAT11IO-TRNFR-TYPE-CD.                    
           MOVE TWA-MCBRKR        TO ACAT11IO-RCV-NBR.                          
           MOVE TWA-MCACCT        TO ACAT11IO-RCV-ACCT.                         
           MOVE ACAT-ADP-BROKER   TO ACAT11IO-DLVR-NBR.                         
LRM003***  MOVE TWA-MBR           TO ACAT11IO-DLVR-ACCT.                        
LRM003***  MOVE TWA-MAC           TO ACAT11IO-DLVR-ACCT(4 : 5).                 
LRM003     MOVE TWA-DLVR-ACCT     TO ACAT11IO-DLVR-ACCT.                02030002
******* WHEN THE USER CHANGES CUSIP/ADP/SYMBOL ON SCREEN, TRY TO OBTAIN         
******* THE ASSOCIATED CUSIP NBR TO USE FOR BROWSING. IF NOT FOUND, USE         
******* THIS FIELD ASIS (EG. 123 ) AS THE STARTING POINT.                       
           IF TWA-MSECR NOT = TWA-ORIG-SECR                                     
              SET ACATMSD-MSD-READ TO TRUE                                      
              MOVE TWA-MSECR TO ACATMSD-SEARCH-KEY                              
              PERFORM LINK-TO-ACATMSDIO-RTN                                     
              IF ACATMSD-FOUND                                                  
                 MOVE ACATMSD-CUSIP   TO ACAT11IO-CURRENT-SECR                  
              ELSE                                                              
                 MOVE TWA-MSECR TO ACAT11IO-CURRENT-SECR                02030002
           ELSE                                                                 
              MOVE TWA-MSECR TO ACAT11IO-CURRENT-SECR                   02030002
           END-IF.                                                              
                                                                                
           MOVE TWA-MSLOC TO ACAT11IO-CURRENT-SLOC.                             
           IF TWA-MTYPE = '1'                                                   
              SET ACAT11IO-CASH-ASSET TO TRUE                                   
           ELSE                                                                 
           IF TWA-MTYPE = '2'                                                   
              SET ACAT11IO-MARGIN-ASSET TO TRUE                                 
           ELSE                                                                 
LRM041     IF TWA-MTYPE = '4'                                                   
LRM041        MOVE TWA-MTYPE TO ACAT11IO-CSH-MGN-SHRT-CD                        
LRM041     ELSE                                                                 
           IF TWA-MTYPE = '5'                                                   
              SET ACAT11IO-SHORT-ASSET TO TRUE                                  
           ELSE                                                                 
              MOVE SPACES TO ACAT11IO-CSH-MGN-SHRT-CD                           
           END-IF.                                                              
           MOVE ACAT11IO-CSH-MGN-SHRT-CD TO WS-TYPE.                    02030002
LRM***** BACK SUBTRACT 1 BIT FROM TYPE (LAST KEY FIELD) TO CAUSE                
******** GREATER THEN LOGIC TO READ PROPPER RECORD.                             
           COMPUTE WS-TYPE-9 = WS-TYPE-9 - 1.                                   
           MOVE WS-TYPE TO ACAT11IO-CURRENT-TYPE.                       02030002
                                                                                
           SET ACAT11IO-IT-READNEXT-VINITAST TO TRUE                            
           PERFORM LINK-TO-ACAT11IO-RTN.                                        
           IF ACAT11IO-ASSET-NOT-FOUND                                          
              MOVE 'BOTTOM OF ASSET DATA' TO SYSTEM-MSG                         
              PERFORM  ERROR-RTN                                        03650002
           ELSE                                                                 
           IF NOT ACAT11IO-ASSET-FOUND                                          
              MOVE LOW-VALUE TO ACAT11MO                                03620002
              MOVE 'BR-AS'           TO WS-DB2-PROBLEM-FUNCTION                 
              MOVE ACAT11IO-SQLCAID  TO WS-DB2-PROBLEM-TABLE                    
              MOVE ACAT11IO-SQLCODE  TO WS-DB2-PROBLEM-ID                       
              MOVE WS-DB2-PROBLEM-MSG TO SYSTEM-MSG                             
              PERFORM DB2-ERROR-RTN.                                            
                                                                                
           PERFORM MOVE-ACAT11IO-ASSET-TO-TWA.                                  
           PERFORM REFORMAT-SCREEN-ASSET.                                       
           PERFORM PROCESS-MAP-ITEMS THRU PROCESS-MAP-ITEMS-EXIT.               
                                                                                
LRM043*****IF ACAT11IO-ISIN-SEC-ISSUE-CD NOT = ACAT11IO-CURRENT-SECR    02030002
LRM043     IF ACAT11IO-KEY-FIELDS NOT = ACAT11IO-CURRENT-ASSET-KEY      02030002
           OR ACAT11IO-STTLM-LCTN-CD     NOT = ACAT11IO-CURRENT-SLOC            
           OR ACAT11IO-CSH-MGN-SHRT-CD   NOT = ACAT11IO-CURRENT-TYPE            
              MOVE 'NEXT ASSET NOT FOUND; GENERIC BROWSE ASSUMED'               
                  TO SYSTEM-MSG                                                 
           ELSE                                                                 
              MOVE 'NEXT ASSET DISPLAYED' TO SYSTEM-MSG                         
           END-IF.                                                              
           PERFORM SEND-MAP-DATA-ONLY.                                  10250002
           PERFORM WRITE-TSQ-RTN.                                       10790002
           PERFORM RETURN-TO-CICS.                                      08350002
                                                                        08960002
111200     EJECT                                                        08970002
111300                                                                  08980002
111400 PAGE-BACKWARD-RTN.                                               08990002
           MOVE TWA-CLIENT-NO-X   TO ACAT11IO-CLIENT-NBR.                       
LRM028     IF TWA-INP-TFR-TYP = 'PTF'                                           
LRM028        MOVE 'PTF'          TO ACAT11IO-TRNFR-TYPE-CD                     
LRM028     ELSE                                                                 
              MOVE 'PTD'          TO ACAT11IO-TRNFR-TYPE-CD.                    
           MOVE TWA-CLIENT-NO-X   TO ACAT11IO-CLIENT-NBR.                       
           MOVE TWA-MCBRKR        TO ACAT11IO-RCV-NBR.                          
           MOVE TWA-MCACCT        TO ACAT11IO-RCV-ACCT.                         
           MOVE ACAT-ADP-BROKER   TO ACAT11IO-DLVR-NBR.                         
LRM003***  MOVE TWA-MBR           TO ACAT11IO-DLVR-ACCT.                        
LR0003***  MOVE TWA-MAC           TO ACAT11IO-DLVR-ACCT(4 : 5).                 
LRM003     MOVE TWA-DLVR-ACCT     TO ACAT11IO-DLVR-ACCT.                02030002
           MOVE TWA-CURRENT-ASSET-KEY TO ACAT11IO-CURRENT-ASSET-KEY.            
           MOVE TWA-ASSET-SEQ     TO ACAT11IO-ASSET-SEQ-NBR.                    
LRM010     MOVE TWA-CONTROL-NBR TO ACAT11IO-CONTROL-NBR                         
                                                                                
LRM003     IF TWA-INP-TFR-TYP = 'PTR'                                           
LRM003     AND (TWA-STTS-CD = '500' OR '510')                                   
LRM003     AND TWA-MREJ NOT > '00'                                              
LRM003     AND TWA-PTR-BEEN-FLIPPED                                             
LRM003        MOVE 'PTR'             TO ACAT11IO-TRNFR-TYPE-CD                  
LRM003        SET ACAT11IO-IT-READ-PREV4 TO TRUE                                
LRM003     ELSE                                                                 
           IF TWA-INP-TFR-TYP = 'PTR'                                           
           OR TWA-ACTION = '6'                                                  
           OR TWA-ACTIVE-DB = 'Y'                                               
              MOVE 'PTR'             TO ACAT11IO-TRNFR-TYPE-CD                  
              SET ACAT11IO-IT-READ-PREV4A TO TRUE                               
              IF NOT ACAT-SIGN-ON-UPDATE                                        
                 MOVE -1 TO MACATL                                              
              END-IF                                                            
           ELSE                                                                 
LRM028     IF TWA-INP-TFR-TYP = 'PTF'                                           
LRM028        MOVE 'PTF'             TO ACAT11IO-TRNFR-TYPE-CD                  
LRM028        SET ACAT11IO-IT-READ-PREV4 TO TRUE                                
LRM028     ELSE                                                                 
              MOVE 'PTD'             TO ACAT11IO-TRNFR-TYPE-CD                  
              SET ACAT11IO-IT-READ-PREV4 TO TRUE                                
           END-IF.                                                              
                                                                                
           PERFORM LINK-TO-ACAT11IO-RTN.                                        
           IF ACAT11IO-ASSET-NOT-FOUND                                          
LRM016        IF EIBAID = DFHPF4 OR DFHPF7                                      
                 CONTINUE                                                       
              ELSE                                                              
LRM003        IF EIBAID = DFHPA2                                                
LRM003           MOVE ATT-ASKIP TO MSECRA MSLOCA MTYPEA                         
LRM003           MOVE 'TOP OF ASSET DATA' TO SYSTEM-MSG                         
LRM003           PERFORM  ERROR-RTN                                     03650002
LRM003        ELSE                                                              
LRM003           MOVE 'C' TO TWA-SECR-ACTION                                    
LRM003           PERFORM PROCESS-MAP-ITEMS THRU PROCESS-MAP-ITEMS-EXIT          
           ELSE                                                                 
           IF NOT ACAT11IO-ASSET-FOUND                                          
              MOVE LOW-VALUE TO ACAT11MO                                03620002
              MOVE 'PR-AS'           TO WS-DB2-PROBLEM-FUNCTION                 
              MOVE ACAT11IO-SQLCAID  TO WS-DB2-PROBLEM-TABLE                    
              MOVE ACAT11IO-SQLCODE  TO WS-DB2-PROBLEM-ID                       
              MOVE WS-DB2-PROBLEM-MSG TO SYSTEM-MSG                             
              PERFORM DB2-ERROR-RTN.                                            
                                                                                
           PERFORM MOVE-ACAT11IO-ASSET-TO-TWA.                                  
           PERFORM REFORMAT-SCREEN-ASSET.                                       
           IF TWA-INP-TFR-TYP = 'PTR'                                           
LRM003     AND NOT TWA-PTR-BEEN-FLIPPED                                         
              MOVE 'PREV PTR ASSET DISPLAYED' TO SYSTEM-MSG                     
           ELSE                                                                 
              PERFORM PROCESS-MAP-ITEMS THRU PROCESS-MAP-ITEMS-EXIT             
              MOVE 'PREV ASSET DISPLAYED' TO SYSTEM-MSG.                        
           PERFORM SEND-MAP-DATA-ONLY.                                  10250002
           PERFORM WRITE-TSQ-RTN.                                       10790002
           PERFORM RETURN-TO-CICS.                                      08350002
                                                                        08960002
           EJECT                                                        09240002
033800 PAGE-FORWARD-TIF.                                                03920002
           MOVE TWA-CLIENT-NO-X   TO ACAT11IO-CLIENT-NBR.                       
           MOVE TWA-MCBRKR        TO ACAT11IO-RCV-NBR.                          
           MOVE TWA-MCACCT        TO ACAT11IO-RCV-ACCT.                         
           MOVE ACAT-ADP-BROKER   TO ACAT11IO-DLVR-NBR.                         
LRM009     MOVE SPACES TO TWA-INTRAN-FLAG.                                      
LRM009     IF WS-NEW-ACCOUNT                                            04809410
LRM009        MOVE ACAT-INP-BRANCH  TO ACAT11IO-DLVR-ACCT               04809410
LRM009        MOVE ACAT-INP-ACCOUNT TO ACAT11IO-DLVR-ACCT(4 : 5)        04809410
LRM009     ELSE                                                                 
LRM003        MOVE TWA-DLVR-ACCT     TO ACAT11IO-DLVR-ACCT.             02030002
           MOVE TWA-CURRENT-ASSET-KEY TO ACAT11IO-CURRENT-ASSET-KEY.            
LRM009     MOVE TWA-EXCEPTION-ONLY-MODE TO ACAT11IO-EXCEPTION-ONLY.             
LRM009     IF TWA-EXCEPTION-ONLY-MODE = 'Y'                                     
LRM009     AND TWA-MMSTAT = SPACES                                              
LRM009     AND TWA-INP-TFR-TYP = 'PTR'                                          
LRM009        MOVE 'INT' TO TWA-MMSTAT  MMSTATO                                 
LRM009     END-IF.                                                              
                                                                                
LRM008     EVALUATE TWA-MMSTAT                                                  
LRM008         WHEN 'RQR'  MOVE '140'   TO ACAT11IO-PASS-STAT-FR                
LRM008                                     ACAT11IO-PASS-STAT-TO                
LRM008         WHEN 'REV'  MOVE '200'   TO ACAT11IO-PASS-STAT-FR                
LRM008                                     ACAT11IO-PASS-STAT-TO                
LRM008         WHEN 'RVA'  MOVE '210'   TO ACAT11IO-PASS-STAT-FR                
LRM008                                     ACAT11IO-PASS-STAT-TO                
LRM008         WHEN 'RVE'  MOVE '220'   TO ACAT11IO-PASS-STAT-FR                
LRM008                                     ACAT11IO-PASS-STAT-TO                
LRM008         WHEN 'RVX'  MOVE '230'   TO ACAT11IO-PASS-STAT-FR                
LRM008                                     ACAT11IO-PASS-STAT-TO                
LRM008         WHEN 'STP'  MOVE '300'   TO ACAT11IO-PASS-STAT-FR                
LRM008                                     ACAT11IO-PASS-STAT-TO                
LRM008         WHEN 'STC'  MOVE '310'   TO ACAT11IO-PASS-STAT-FR                
LRM008                                     ACAT11IO-PASS-STAT-TO                
LRM008         WHEN 'INT'  MOVE '500'   TO ACAT11IO-PASS-STAT-FR                
LRM008                                     ACAT11IO-PASS-STAT-TO                
LRM008         WHEN 'PUR'  MOVE '510'   TO ACAT11IO-PASS-STAT-FR                
LRM008                                     ACAT11IO-PASS-STAT-TO                
LRM008         WHEN 'REJ'  MOVE '600'   TO ACAT11IO-PASS-STAT-FR                
LRM008                                     ACAT11IO-PASS-STAT-TO                
LRM008         WHEN OTHER  MOVE '   '   TO ACAT11IO-PASS-STAT-FR                
LRM008                     MOVE '600'   TO ACAT11IO-PASS-STAT-TO                
LRM008     END-EVALUATE.                                                        
                                                                                
           IF TWA-INP-TFR-TYP = 'PTR'                                           
              MOVE 'PTR'          TO ACAT11IO-TRNFR-TYPE-CD                     
LRM003        IF TWA-MACAT NOT = TWA-CONTROL-NBR                                
LRM003        AND TWA-MACAT > SPACES                                            
LRM003           MOVE TWA-MACAT       TO ACAT11IO-CONTROL-NBR                   
LRM003           MOVE SPACES TO TWA-MACAT                                       
LRM003           SUBTRACT 1 FROM ACAT11IO-CONTROL-NBR-9                         
LRM006           SET ACAT11IO-GET-NEXT-PTR-CN TO TRUE                           
LRM003        ELSE                                                              
                 MOVE TWA-CONTROL-NBR TO ACAT11IO-CONTROL-NBR                   
LRM006           SET ACAT11IO-GET-NEXT-PTR TO TRUE                              
LRM003        END-IF                                                            
              IF NOT ACAT-SIGN-ON-UPDATE                                        
                 MOVE -1         TO  MACATL                                     
              END-IF                                                            
           ELSE                                                                 
LRM028        IF TWA-INP-TFR-TYP = 'PTF'                                        
LRM028           MOVE 'PTF'        TO ACAT11IO-TRNFR-TYPE-CD                    
LRM028        ELSE                                                              
LRM028           MOVE 'PTD'        TO ACAT11IO-TRNFR-TYPE-CD                    
LRM028        END-IF                                                            
LRM007        MOVE TWA-CONTROL-NBR TO ACAT11IO-CONTROL-NBR                      
LRM016        IF TWA-INIT-DB                                                    
LRM016           SET ACAT11IO-GET-NEXT-PTD-CN TO TRUE                           
LRM016        ELSE                                                              
LRM016           SET ACAT11IO-GET-NEXT-PTD-A TO TRUE                            
           END-IF.                                                              
           PERFORM LINK-TO-ACAT11IO-RTN.                                        
           IF ACAT11IO-NOT-FOUND                                                
              MOVE 'BOTTOM OF TIF(S)' TO SYSTEM-MSG                             
              PERFORM  ERROR-RTN                                        03650002
           ELSE                                                                 
           IF NOT ACAT11IO-FOUND                                                
              MOVE LOW-VALUE TO ACAT11MO                                03620002
              MOVE 'NX-AC'           TO WS-DB2-PROBLEM-FUNCTION                 
              MOVE ACAT11IO-SQLCAID  TO WS-DB2-PROBLEM-TABLE                    
              MOVE ACAT11IO-SQLCODE  TO WS-DB2-PROBLEM-ID                       
              MOVE WS-DB2-PROBLEM-MSG TO SYSTEM-MSG                             
              PERFORM DB2-ERROR-RTN.                                            
                                                                                
LRM003***  SET TWA-INTRAN-BRW TO TRUE.                                          
           PERFORM MOVE-ACAT11IO-TO-TWA-RTN.                                    
           IF TWA-INP-TFR-TYP = 'PTR'                                           
              IF (NOT ACAT-SIGN-ON-UPDATE                                       
LRM003        OR ACAT11IO-NSCC-SUBMITTED)                                       
                 MOVE 'B'        TO TWA-ACTION                                  
              ELSE                                                              
LRM003        IF TWA-PTR-BEEN-FLIPPED                                           
                 MOVE 'C'        TO TWA-ACTION                                  
              ELSE                                                              
                 MOVE 'R'        TO TWA-ACTION                                  
           END-IF.                                                              
           IF (TWA-INP-TFR-TYP = 'PTD' OR 'PTF')                                
LRM001        IF ACAT-SIGN-ON-UPDATE                                            
LRM003        AND NOT ACAT11IO-NSCC-SUBMITTED                                   
LRM016        AND TWA-INIT-DB                                                   
LRM001           MOVE 'C'        TO TWA-ACTION                                  
LRM001        ELSE                                                              
LRM001           MOVE 'B'        TO TWA-ACTION                                  
LRM001     END-IF.                                                              
           PERFORM ASKIP-MAP-RTN                                                
           PERFORM REFORMAT-SCREEN-DETAIL.                                      
LRM001     IF NOT ACAT-SIGN-ON-UPDATE                                           
LRM003     OR (TWA-INP-TFR-TYP = 'PTR'                                          
LRM003     AND (TWA-STTS-CD NOT = '500' AND '510'))                             
              MOVE 'R'        TO TWA-ACTION                                     
           END-IF.                                                              
           MOVE ZEROS      TO TWA-ASSET-SEQ                                     
LRM320     MOVE SPACES     TO TWA-ASSET-AREA                                    
LRM320     MOVE LOW-VALUES TO TWA-CURRENT-ASSET-KEY                     02030002
LRM320     MOVE ZEROS TO TWA-MQTY-9                                             
LRM320                   TWA-MAMT-9                                             
LRM320     PERFORM REFORMAT-SCREEN-ASSET                                        
           PERFORM PAGE-FORWARD-RTN                                     03900002
              THRU PAGE-FORWARD-RTN-EXIT                                        
           PERFORM PROCESS-MAP-ITEMS THRU PROCESS-MAP-ITEMS-EXIT                
                                                                                
LRM003     IF WS-DELETE                                                         
LRM003        MOVE 'DLVY RESPONSE DELETED' TO SYSTEM-MSG                        
LRM003     ELSE                                                                 
           IF TWA-INP-TFR-TYP = 'PTR'                                           
              MOVE 'NEXT PTR TIF DISPLAYED' TO SYSTEM-MSG                       
           ELSE                                                                 
LRM028     IF TWA-INP-TFR-TYP = 'PTF'                                           
LRM028        MOVE 'NEXT PTF TIF DISPLAYED' TO SYSTEM-MSG                       
LRM028     ELSE                                                                 
              MOVE 'NEXT PTD TIF DISPLAYED' TO SYSTEM-MSG                       
           END-IF.                                                              
           PERFORM SEND-MAP-DATA-ONLY.                                  10250002
           PERFORM WRITE-TSQ-RTN.                                       10790002
           PERFORM RETURN-TO-CICS.                                      08350002
                                                                        08960002
033800 PAGE-BACKWARD-TIF.                                               03920002
           MOVE TWA-CLIENT-NO-X   TO ACAT11IO-CLIENT-NBR.                       
LRM028     IF TWA-INP-TFR-TYP = 'PTF'                                           
LRM028        MOVE 'PTF'          TO ACAT11IO-TRNFR-TYPE-CD                     
LRM028     ELSE                                                                 
              MOVE 'PTD'          TO ACAT11IO-TRNFR-TYPE-CD.                    
           MOVE TWA-MCBRKR        TO ACAT11IO-RCV-NBR.                          
           MOVE TWA-MCACCT        TO ACAT11IO-RCV-ACCT.                         
           MOVE ACAT-ADP-BROKER   TO ACAT11IO-DLVR-NBR.                         
LRM003***  MOVE TWA-MBR           TO ACAT11IO-DLVR-ACCT.                        
LRM003***  MOVE TWA-MAC           TO ACAT11IO-DLVR-ACCT(4 : 5).                 
LRM003     MOVE TWA-DLVR-ACCT     TO ACAT11IO-DLVR-ACCT.                02030002
           MOVE TWA-CURRENT-ASSET-KEY TO ACAT11IO-CURRENT-ASSET-KEY.            
LRM009     MOVE TWA-EXCEPTION-ONLY-MODE TO ACAT11IO-EXCEPTION-ONLY.             
LRM009     IF TWA-EXCEPTION-ONLY-MODE = 'Y'                                     
LRM009     AND TWA-MMSTAT = SPACES                                              
LRM009     AND TWA-INP-TFR-TYP = 'PTR'                                          
LRM009        MOVE 'INT' TO TWA-MMSTAT  MMSTATO                                 
LRM009     END-IF.                                                              
                                                                                
LRM008     EVALUATE TWA-MMSTAT                                                  
LRM008         WHEN 'RQR'  MOVE '140'   TO ACAT11IO-PASS-STAT-FR                
LRM008                                     ACAT11IO-PASS-STAT-TO                
LRM008         WHEN 'REV'  MOVE '200'   TO ACAT11IO-PASS-STAT-FR                
LRM008                                     ACAT11IO-PASS-STAT-TO                
LRM008         WHEN 'RVA'  MOVE '210'   TO ACAT11IO-PASS-STAT-FR                
LRM008                                     ACAT11IO-PASS-STAT-TO                
LRM008         WHEN 'RVE'  MOVE '220'   TO ACAT11IO-PASS-STAT-FR                
LRM008                                     ACAT11IO-PASS-STAT-TO                
LRM008         WHEN 'RVX'  MOVE '230'   TO ACAT11IO-PASS-STAT-FR                
LRM008                                     ACAT11IO-PASS-STAT-TO                
LRM008         WHEN 'STP'  MOVE '300'   TO ACAT11IO-PASS-STAT-FR                
LRM008                                     ACAT11IO-PASS-STAT-TO                
LRM008         WHEN 'STC'  MOVE '310'   TO ACAT11IO-PASS-STAT-FR                
LRM008                                     ACAT11IO-PASS-STAT-TO                
LRM008         WHEN 'INT'  MOVE '500'   TO ACAT11IO-PASS-STAT-FR                
LRM008                                     ACAT11IO-PASS-STAT-TO                
LRM008         WHEN 'PUR'  MOVE '510'   TO ACAT11IO-PASS-STAT-FR                
LRM008                                     ACAT11IO-PASS-STAT-TO                
LRM008         WHEN 'REJ'  MOVE '600'   TO ACAT11IO-PASS-STAT-FR                
LRM008                                     ACAT11IO-PASS-STAT-TO                
LRM008         WHEN OTHER  MOVE '   '   TO ACAT11IO-PASS-STAT-FR                
LRM008                     MOVE '600'   TO ACAT11IO-PASS-STAT-TO                
LRM008     END-EVALUATE.                                                        
                                                                                
           IF TWA-INP-TFR-TYP = 'PTR'                                           
              SET ACAT11IO-GET-PREV-PTR TO TRUE                                 
              MOVE 'PTR'          TO ACAT11IO-TRNFR-TYPE-CD                     
              MOVE TWA-CONTROL-NBR TO ACAT11IO-CONTROL-NBR                      
LRM003        IF NOT ACAT-SIGN-ON-UPDATE                                        
                 MOVE -1         TO  MACATL                                     
              END-IF                                                            
           ELSE                                                                 
LRM028        IF TWA-INP-TFR-TYP = 'PTF'                                        
LRM028           MOVE 'PTF'        TO ACAT11IO-TRNFR-TYPE-CD                    
LRM028        ELSE                                                              
LRM028           MOVE 'PTD'        TO ACAT11IO-TRNFR-TYPE-CD                    
LRM028        END-IF                                                            
LRM007        MOVE TWA-CONTROL-NBR TO ACAT11IO-CONTROL-NBR                      
LRM016        IF TWA-INIT-DB                                                    
LRM016           SET ACAT11IO-GET-PREV-PTD-CN TO TRUE                           
LRM016        ELSE                                                              
LRM016           SET ACAT11IO-GET-PREV-PTD-A TO TRUE                            
           END-IF.                                                              
                                                                                
           PERFORM LINK-TO-ACAT11IO-RTN.                                        
           IF ACAT11IO-NOT-FOUND                                                
              MOVE 'TOP OF TIF(S)' TO SYSTEM-MSG                                
              PERFORM  ERROR-RTN                                        03650002
           ELSE                                                                 
           IF NOT ACAT11IO-FOUND                                                
              MOVE LOW-VALUE TO ACAT11MO                                03620002
              MOVE 'PV-AC'           TO WS-DB2-PROBLEM-FUNCTION                 
              MOVE ACAT11IO-SQLCAID  TO WS-DB2-PROBLEM-TABLE                    
              MOVE ACAT11IO-SQLCODE  TO WS-DB2-PROBLEM-ID                       
              MOVE WS-DB2-PROBLEM-MSG TO SYSTEM-MSG                             
              PERFORM DB2-ERROR-RTN.                                            
                                                                                
LRM003***  SET TWA-INTRAN-BRW TO TRUE.                                          
           PERFORM MOVE-ACAT11IO-TO-TWA-RTN.                                    
           IF TWA-INP-TFR-TYP = 'PTR'                                           
              IF (NOT ACAT-SIGN-ON-UPDATE                                       
LRM003        OR ACAT11IO-NSCC-SUBMITTED)                                       
                 MOVE 'B'        TO TWA-ACTION                                  
              ELSE                                                              
LRM003        IF TWA-PTR-BEEN-FLIPPED                                           
                 MOVE 'C'        TO TWA-ACTION                                  
              ELSE                                                              
                 MOVE 'R'        TO TWA-ACTION                                  
           END-IF.                                                              
           IF (TWA-INP-TFR-TYP = 'PTD' OR 'PTF')                                
LRM001        IF ACAT-SIGN-ON-UPDATE                                            
LRM003        AND NOT ACAT11IO-NSCC-SUBMITTED                                   
LRM016        AND TWA-INIT-DB                                                   
LRM001           MOVE 'C'        TO TWA-ACTION                                  
LRM001        ELSE                                                              
LRM001           MOVE 'B'        TO TWA-ACTION                                  
LRM001     END-IF.                                                              
           PERFORM ASKIP-MAP-RTN                                                
           PERFORM REFORMAT-SCREEN-DETAIL.                                      
LRM001     IF NOT ACAT-SIGN-ON-UPDATE                                           
LRM003     OR (TWA-INP-TFR-TYP = 'PTR'                                          
LRM003     AND (TWA-STTS-CD NOT = '500' AND '510'))                             
              MOVE 'R'        TO TWA-ACTION                                     
           END-IF.                                                              
           MOVE ZEROS      TO TWA-ASSET-SEQ                                     
LRM320     MOVE SPACES     TO TWA-ASSET-AREA                                    
LRM320     MOVE LOW-VALUES TO TWA-CURRENT-ASSET-KEY                     02030002
LRM320     MOVE ZEROS TO TWA-MQTY-9                                             
LRM320                   TWA-MAMT-9                                             
LRM320     PERFORM REFORMAT-SCREEN-ASSET                                        
           PERFORM PAGE-FORWARD-RTN                                     03900002
              THRU PAGE-FORWARD-RTN-EXIT                                        
           PERFORM PROCESS-MAP-ITEMS THRU PROCESS-MAP-ITEMS-EXIT.               
                                                                                
           MOVE 'PRIOR TIF DISPLAYED' TO SYSTEM-MSG.                            
           PERFORM SEND-MAP-DATA-ONLY.                                  10250002
           PERFORM WRITE-TSQ-RTN.                                       10790002
           PERFORM RETURN-TO-CICS.                                      08350002
                                                                        09250002
           EJECT                                                        09510002
       LINK-TO-ACATNAIO-RTN.                                                    
00442      EXEC CICS LINK PROGRAM (WS-ACATNAIO)                         02890002
                COMMAREA(ACATNAIO-CALL-AREA)                            02900002
00443           LENGTH(LENGTH OF ACATNAIO-CALL-AREA)                    02910002
           END-EXEC.                                                    02920002
                                                                                
       LINK-TO-ACATPPIO-RTN.                                                    
00442      EXEC CICS LINK PROGRAM (WS-ACATPPIO)                         02890002
                COMMAREA(ACATPPIO-CALL-AREA)                            02900002
00443           LENGTH(LENGTH OF ACATPPIO-CALL-AREA)                    02910002
           END-EXEC.                                                    02920002
                                                                                
       LINK-TO-ACATMSDIO-RTN.                                                   
00442      EXEC CICS LINK PROGRAM (WS-ACATMSD)                          02890002
                COMMAREA(ACATMSDIO-CALL-AREA)                           02900002
00443           LENGTH(LENGTH OF ACATMSDIO-CALL-AREA)                   02910002
           END-EXEC.                                                    02920002
                                                                                
       LINK-TO-ACATRSTIO-RTN.                                                   
00442      EXEC CICS LINK PROGRAM (WS-ACATRST)                          02890002
                COMMAREA(ACATRSTIO-CALL-AREA)                           02900002
00443           LENGTH(LENGTH OF ACATRSTIO-CALL-AREA)                   02910002
           END-EXEC.                                                    02920002
                                                                                
       LINK-TO-ACAT11IO-RTN.                                                    
LRM017     MOVE TWA-FREEZE-CASH-CREDIT TO ACAT11IO-CURR-FREEZE-CASH-CR          
LRM017     MOVE TWA-FREEZE-CASH-DEBIT  TO ACAT11IO-CURR-FREEZE-CASH-DB          
LRM017     MOVE TWA-FREEZE-SEC-SHORT TO ACAT11IO-CURR-FREEZE-SEC-SHORT          
LRM017     MOVE TWA-FREEZE-SEC-LONG TO ACAT11IO-CURR-FREEZE-SEC-LONG            
00442      EXEC CICS LINK PROGRAM (WS-ACAT11DB)                         02890002
                COMMAREA(ACAT11IO-CALL-AREA)                            02900002
00443           LENGTH(LENGTH OF ACAT11IO-CALL-AREA)                    02910002
           END-EXEC.                                                    02920002
       UPDATE-ACAT-IT-RTN.                                                      
           MOVE ACAT-SIGN-ON-ID TO ACAT11IO-SIGN-ON-ID.                         
              IF TWA-INP-TFR-TYP = 'PTR'                                        
LRM017        AND TWA-MDEL NOT = 'Y'                                            
              AND (TWA-MREJ NOT = TWA-ORIG-MREJ                                 
                OR TWA-MREJ > SPACES)                                           
                 PERFORM UPDATE-ACAT-IT-RECORD                                  
              ELSE                                                              
              IF TWA-ACTION = 'A'                                               
                 PERFORM CREATE-ACAT-IT-RECORD                                  
              ELSE                                                              
              MOVE TWA-CURRENT-ASSET-KEY TO ACAT11IO-CURRENT-ASSET-KEY  02030002
              IF TWA-ACTION = 'C'                                               
                 IF TWA-MDEL = 'Y'                                              
                    PERFORM DELETE-ACAT-IT-RECORD                               
                 ELSE                                                           
                    PERFORM UPDATE-ACAT-IT-RECORD                               
              END-IF END-IF END-IF.                                             
                                                                                
           EJECT                                                        09870002
       CREATE-ACAT-IT-RECORD.                                                   
           SET ACAT11IO-IT-ISRT TO TRUE.                                        
           MOVE TWA-CLIENT-NO-X   TO ACAT11IO-CLIENT-NBR.                       
           MOVE TWA-MCBRKR        TO ACAT11IO-RCV-NBR.                          
           MOVE TWA-MCACCT        TO ACAT11IO-RCV-ACCT.                         
           MOVE ACAT-ADP-BROKER   TO ACAT11IO-DLVR-NBR.                         
           MOVE TWA-MBR           TO TWA-DLVR-ACCT                              
           MOVE TWA-MAC           TO TWA-DLVR-ACCT(4 : 5).                      
LRM003     MOVE TWA-DLVR-ACCT     TO ACAT11IO-DLVR-ACCT.                        
LRM028     IF TWA-INP-TFR-TYP = 'PTF'                                           
LRM028        MOVE 'PTF'          TO ACAT11IO-TRNFR-TYPE-CD                     
LRM028     ELSE                                                                 
              MOVE 'PTD'          TO ACAT11IO-TRNFR-TYPE-CD.                    
LRM041     IF TWA-MTYPE = '4'                                                   
LRM041     AND TWA-CLIENT-NO-X(2 : 3) = '010'                                   
LRM041     AND TWA-MCCMNT-X120 NOT > SPACES                                     
LRM041        MOVE                                                              
LRM041           'RESIDUAL PHYSICAL SECURITY DELIVERY FROM FULL ACAT'           
LRM041                       TO TWA-MCCMNT-X120.                                
           MOVE TWA-MCCMNT-X120   TO ACAT11IO-CMNT-TXT.                         
           MOVE TWA-M1CMNT-X120   TO ACAT11IO-ASSET-CMNT1-TXT.                  
           MOVE TWA-M2CMNT-X120   TO ACAT11IO-ASSET-CMNT2-TXT.                  
           MOVE TWA-M5CMNT-X120   TO ACAT11IO-ASSET-CMNT5-TXT.                  
           MOVE TWA-MMCMNT-X120   TO ACAT11IO-ASSET-CMNTM-TXT.                  
LRM007     MOVE TWA-DUPE-FOUND    TO ACAT11IO-DUPE-FOUND.                       
           MOVE TWA-OCC-BRKR      TO ACAT11IO-RCV-OCC-BRKR-NBR.                 
           MOVE TWA-MRR           TO ACAT11IO-RR-CD.                    02030002
           MOVE TWA-MCTYPE        TO ACAT11IO-RCV-ACCT-TYPE-CD.         02030002
           MOVE TWA-MNAME         TO ACAT11IO-RCV-CUST-NM.              02030002
           MOVE TWA-MNAME2        TO ACAT11IO-RCV-CUST-NM(31 : 30).     02030002
           MOVE TWA-MSSN(1 : 3)   TO ACAT11IO-RCV-SS-PRIM-NBR(1 : 3).   02030002
           MOVE TWA-MSSN(5 : 2)   TO ACAT11IO-RCV-SS-PRIM-NBR(4 : 2).   02030002
           MOVE TWA-MSSN(8 : 4)   TO ACAT11IO-RCV-SS-PRIM-NBR(6 : 4).   02030002
           IF TWA-MSSN2(1 : 1) NOT GREATER SPACES                               
              MOVE SPACES           TO ACAT11IO-RCV-SS-SCNDY-NBR                
           ELSE                                                                 
              MOVE TWA-MSSN2(1 : 3) TO ACAT11IO-RCV-SS-SCNDY-NBR(1 : 3)         
              MOVE TWA-MSSN2(5 : 2) TO ACAT11IO-RCV-SS-SCNDY-NBR(4 : 2)         
              MOVE TWA-MSSN2(8 : 4) TO ACAT11IO-RCV-SS-SCNDY-NBR(6 : 4)         
           END-IF.                                                              
           IF TWA-MSUBM = 'Y'                                           02030002
              SET ACAT11IO-NSCC-SUBMIT-ELIGIBLE TO TRUE                         
           ELSE                                                                 
              SET ACAT11IO-NSCC-SUBMIT-HOLD     TO TRUE.                        
LRM021     IF TWA-GIFT-IND = 'Y'                                                
LRM021        MOVE '1'               TO ACAT11IO-GIFT-IND                       
LRM021     ELSE                                                                 
LRM021        MOVE ' '               TO ACAT11IO-GIFT-IND                       
LRM021     END-IF.                                                              
                                                                                
           IF TWA-MREJ > '00'                                                   
              SET ACAT11IO-IT-REJECT TO TRUE                                    
           END-IF.                                                              
                                                                                
LRM028********MOVE 'PTD' TO ACAT11IO-TRNFR-TYPE-CD                              
LRM028     MOVE TWA-INP-TFR-TYP   TO ACAT11IO-TRNFR-TYPE-CD                     
LRM043     IF  ACAT11IO-ISIN-CNTRY-CD > SPACES                                  
LRM043     AND ACAT11IO-ISIN-CNTRY-CD NOT = 'US' AND '  '                       
LRM043        MOVE ACAT11IO-KEY-FIELDS TO TWA-MSECR                             
LRM043                                     TWA-ORIG-SECR                        
LRM043                                     TWA-ORIG-MSECR                       
LRM043     ELSE                                                                 
              MOVE 'US'  TO ACAT11IO-ISIN-CNTRY-CD                              
              MOVE TWA-MSECR TO ACAT11IO-ISIN-SEC-ISSUE-CD                      
              MOVE SPACES TO ACAT11IO-ISIN-SEC-CDG-CD                           
LRM043     END-IF.                                                              
           MOVE TWA-MSLOC  TO ACAT11IO-STTLM-LCTN-CD.                           
           MOVE TWA-ADP-NBR TO ACAT11IO-ADP-NBR.                                
           MOVE TWA-MCATGR  TO ACAT11IO-ASSET-PRC-CTGY-CD.                      
           MOVE 'P' TO ACAT11IO-ASSET-RQST-QTY-CD.                              
LRM007     MOVE SPACES TO ACAT11IO-REJECT-CODE                                  
    **** SET ACAT11IO-PSTN-CD BASED ON POSITIVE OR NEGATIVE QTY BELOW.          
           IF TWA-MQTY-9 < ZERO                                                 
              SET ACAT11IO-SHORT-ASSET-QTY TO TRUE                              
           ELSE                                                                 
           IF TWA-MQTY-9 > ZERO                                                 
              SET ACAT11IO-LONG-ASSET-QTY TO TRUE                               
           ELSE                                                                 
              SET ACAT11IO-NA-ASSET-QTY TO TRUE                                 
           END-IF.                                                              
                                                                                
           MOVE ZEROS              TO ACAT11IO-ASSET-AMT                        
                                      ACAT11IO-ASSET-QTY                        
                                      ACAT11IO-ASSET-PCT.                       
                                                                                
           IF TWA-MQTY-9 LESS ZERO                                              
              COMPUTE WS-MQTY-9-UNSIGNED =  TWA-MQTY-9 * -1                     
              END-COMPUTE                                                       
           ELSE                                                                 
              MOVE TWA-MQTY-9      TO WS-MQTY-9-UNSIGNED                        
           END-IF.                                                              
           IF TWA-MCD = 'V'                                                     
              SET ACAT11IO-RQST-ASSET-AMT TO TRUE                               
              MOVE WS-MQTY-9-UNSIGNED TO ACAT11IO-ASSET-AMT                     
           ELSE                                                                 
LRM008     IF TWA-MCD = 'P' OR 'W'                                              
              SET ACAT11IO-RQST-ASSET-QTY TO TRUE                               
              MOVE WS-MQTY-9-UNSIGNED TO ACAT11IO-ASSET-QTY                     
           ELSE                                                                 
           IF TWA-MCD = '%'                                                     
              SET ACAT11IO-RQST-ASSET-PCT TO TRUE                               
              MOVE WS-MQTY-9-UNSIGNED TO ACAT11IO-ASSET-PCT                     
           ELSE                                                                 
              MOVE SPACES TO ACAT11IO-AST-RQST-TRANS-CD                         
              MOVE 'F' TO ACAT11IO-ASSET-RQST-QTY-CD                            
              MOVE ZEROS           TO ACAT11IO-ASSET-QTY                        
              SET ACAT11IO-NA-ASSET-QTY TO TRUE                                 
           END-IF.                                                              
           MOVE TWA-MAMT-9         TO ACAT11IO-ASSET-AMT.                       
                                                                                
           IF TWA-MTYPE = '1'                                                   
              SET ACAT11IO-CASH-ASSET TO TRUE                                   
           ELSE                                                                 
           IF TWA-MTYPE = '2'                                                   
              SET ACAT11IO-MARGIN-ASSET TO TRUE                                 
           ELSE                                                                 
LRM041     IF TWA-MTYPE = '4'                                                   
LRM041        MOVE TWA-MTYPE TO ACAT11IO-CSH-MGN-SHRT-CD                        
LRM041     ELSE                                                                 
           IF TWA-MTYPE = '5'                                                   
              SET ACAT11IO-SHORT-ASSET TO TRUE                                  
           ELSE                                                                 
              MOVE SPACES TO ACAT11IO-CSH-MGN-SHRT-CD                           
           END-IF.                                                              
                                                                                
           MOVE TWA-MMEMO       TO ACAT11IO-MEMO-CD.                            
           MOVE TWA-SLOCRSN     TO ACAT11IO-SLOC-RSN.                           
           MOVE TWA-MWI         TO ACAT11IO-WHI-CD.                             
LRM008     IF TWA-MCD = 'W'                                                     
LRM008        MOVE 'W' TO  TWA-NSCC-WTHLD-CD                                    
LRM008                     ACAT11IO-NSCC-WTHLD-CD                               
LRM008     ELSE                                                                 
LRM008        MOVE ' ' TO  TWA-NSCC-WTHLD-CD                                    
LRM008                     ACAT11IO-NSCC-WTHLD-CD.                              
           MOVE TWA-MDESC-GROUP TO ACAT11IO-DESC-TXT.                           
LRM012     IF TWA-ADP-NBR > SPACES                                              
LRM012        MOVE 'ADP-SEC:'  TO ACAT11IO-DESC-TXT(121 : 8)                    
LRM012        MOVE TWA-ADP-NBR TO ACAT11IO-DESC-TXT(129 : 7)                    
LRM012     END-IF.                                                              
CSG001* IN SOME CASES MSD DESCRIPTIONS CONTAIN SPECIAL CHARACTERS.              
CSG001* CORRECT THEM BY REPLACING SPECIAL CHARACTERS WITH SPACES.               
CSG001     MOVE ACAT11IO-DESC-TXT     TO W-ASSET-DESC-TXT-GRP                   
CSG001     MOVE W-ASSET-DESC1-TXT     TO W-ASSET-DESC-TXT                       
CSG001     MOVE 30                    TO W-SUB3                                 
CSG001     SET W-JUST-LEFT-REQ-Y      TO TRUE                                   
CSG001     PERFORM EDIT-ASSET-DESC-TXT                                          
CSG001     MOVE W-ASSET-DESC-TXT      TO W-ASSET-DESC1-TXT                      
CSG001     MOVE W-ASSET-DESC2-TXT     TO W-ASSET-DESC-TXT                       
CSG001     MOVE 30                    TO W-SUB3                                 
CSG001     SET W-JUST-LEFT-REQ-N      TO TRUE                                   
CSG001     PERFORM EDIT-ASSET-DESC-TXT                                          
CSG001     MOVE W-ASSET-DESC-TXT      TO W-ASSET-DESC2-TXT                      
CSG001     MOVE W-ASSET-DESC3-TXT     TO W-ASSET-DESC-TXT                       
CSG001     MOVE 30                    TO W-SUB3                                 
CSG001     SET W-JUST-LEFT-REQ-N      TO TRUE                                   
CSG001     PERFORM EDIT-ASSET-DESC-TXT                                          
CSG001     MOVE W-ASSET-DESC-TXT      TO W-ASSET-DESC3-TXT                      
CSG001     MOVE W-ASSET-DESC4-TXT     TO W-ASSET-DESC-TXT                       
CSG001     MOVE 30                    TO W-SUB3                                 
CSG001     SET W-JUST-LEFT-REQ-N      TO TRUE                                   
CSG001     PERFORM EDIT-ASSET-DESC-TXT                                          
CSG001     MOVE W-ASSET-DESC-TXT      TO W-ASSET-DESC4-TXT                      
CSG001     MOVE W-ASSET-DESC5-TXT     TO W-ASSET-DESC-TXT                       
CSG001     MOVE 20                    TO W-SUB3                                 
CSG001     SET W-JUST-LEFT-REQ-N      TO TRUE                                   
CSG001     PERFORM EDIT-ASSET-DESC-TXT                                          
CSG001     MOVE W-ASSET-DESC-TXT      TO W-ASSET-DESC5-TXT                      
CSG001                                                                          
CSG001     MOVE W-ASSET-DESC-TXT-GRP  TO ACAT11IO-DESC-TXT                      
CSG001                                                                          
           IF TWA-MBAL01-9 < ZERO                                               
              SET ACAT11IO-AMT-01-CREDIT TO TRUE                                
              COMPUTE WS-MQTY-9-UNSIGNED =  TWA-MBAL01-9 * -1                   
              END-COMPUTE                                                       
              MOVE WS-MQTY-9-UNSIGNED TO ACAT11IO-AMT-01                        
           ELSE                                                                 
              MOVE SPACES TO ACAT11IO-AMT-01-CREDIT-IND                         
              MOVE TWA-MBAL01-9    TO ACAT11IO-AMT-01                           
           END-IF.                                                              
           IF TWA-MBAL02-9 < ZERO                                               
              SET ACAT11IO-AMT-02-CREDIT TO TRUE                                
              COMPUTE WS-MQTY-9-UNSIGNED =  TWA-MBAL02-9 * -1                   
              END-COMPUTE                                                       
              MOVE WS-MQTY-9-UNSIGNED TO ACAT11IO-AMT-02                        
           ELSE                                                                 
              MOVE SPACES TO ACAT11IO-AMT-02-CREDIT-IND                         
              MOVE TWA-MBAL02-9    TO ACAT11IO-AMT-02                           
           END-IF.                                                              
           IF TWA-MBAL05-9 < ZERO                                               
              SET ACAT11IO-AMT-05-CREDIT TO TRUE                                
              COMPUTE WS-MQTY-9-UNSIGNED =  TWA-MBAL05-9 * -1                   
              END-COMPUTE                                                       
              MOVE WS-MQTY-9-UNSIGNED TO ACAT11IO-AMT-05                        
           ELSE                                                                 
              MOVE SPACES TO ACAT11IO-AMT-05-CREDIT-IND                         
              MOVE TWA-MBAL05-9    TO ACAT11IO-AMT-05                           
           END-IF.                                                              
           MOVE ZEROS           TO ACAT11IO-AMT-SMA.                            
           MOVE TWA-MSCMNT-X120 TO ACAT11IO-ASSET-CMNT-TXT.                     
           IF TWA-INP-TFR-TYP = 'PTR'                                           
              MOVE TWA-MACAT TO ACAT11IO-CONTROL-NBR                            
              MOVE 'S' TO ACAT11IO-ACCT-RJCT-RSBM-IND                           
           ELSE                                                                 
LRM007        IF TWA-DUPE-FOUND = 'Y'                                           
LRM007           MOVE TWA-CONTROL-NBR  TO ACAT11IO-CONTROL-NBR                  
LRM007        ELSE                                                              
                 MOVE SPACES    TO ACAT11IO-CONTROL-NBR                         
                                   TWA-CONTROL-NBR                              
LRM007        END-IF                                                            
              MOVE SPACES TO ACAT11IO-ACCT-RJCT-RSBM-IND                        
           END-IF.                                                              
           IF TWA-BOND-REG-CODE = '1'                                           
LRM012     AND TWA-MSLOC NOT = '35'                                             
              MOVE 'B' TO ACAT11IO-BEARER-BOND-CD                               
           ELSE                                                                 
              MOVE 'N' TO ACAT11IO-BEARER-BOND-CD                               
           END-IF.                                                              
LRM017     MOVE ACAT-CICS-NETNAME    TO ACAT11IO-NETNAME                        
LRM017     MOVE ACAT-CICS-USER-ID    TO ACAT11IO-USER-ID                        
LRM017     MOVE ACAT-CICS-USER-NAME  TO ACAT11IO-USER-NAME                      
LRM017     MOVE TWA-ORIG-FREEZE-IND  TO ACAT11IO-VTRNFR-FREEZE-IND              
           PERFORM LINK-TO-ACAT11IO-RTN.                                        
           IF ACAT11IO-GOOD-RESP                                                
              MOVE -1 TO MSUBML                                                 
              IF TWA-MSUBM = 'Y'                                                
LRM029           MOVE 'RECORD CREATED SUCCESSFULLY / AWAITING NSCC XMIT'        
                                                         TO SYSTEM-MSG          
              ELSE                                                              
LRM037           MOVE -1 TO MBRL                                                
                 MOVE 'RECORD RETAINED / SUBMIT PENDING' TO SYSTEM-MSG          
              END-IF                                                            
LRM040        IF (ACAT11IO-DUPE-DLVY-ASSSET-IND = 'C' OR 'P')                   
LRM040           MOVE 'WARNING - DUPE DLVY POS/BAL' TO CMNTMSGO                 
LRM040        END-IF                                                            
LRM040        MOVE SPACES TO ACAT11IO-DUPE-DLVY-ASSSET-IND                      
              MOVE 'C' TO TWA-ACTION  TWA-SECR-ACTION                           
LRM003        MOVE ATT-ASKIP TO MSECRA MSLOCA MTYPEA                            
LRM035                          MEXPDTA MCALLA MLONGA MSTRIKEA                  
              MOVE ACAT11IO-RCV-NBR   TO TWA-ORIG-RCV-NBR                       
              MOVE ACAT11IO-RCV-ACCT TO TWA-ORIG-RCV-ACCT                       
              MOVE TWA-MSECR TO  TWA-ORIG-MSECR                                 
                                 TWA-ORIG-SECR                                  
              MOVE TWA-MSLOC TO  TWA-ORIG-SLOC                                  
              MOVE TWA-MTYPE TO  TWA-ORIG-MTYPE                                 
              MOVE ACAT11IO-CSH-MGN-SHRT-CD TO TWA-ORIG-TYPE                    
              MOVE ATT-UNPROT TO MDELA                                          
              MOVE ACAT11IO-UPDT-TMSTP TO TWA-UPDT-TMSTP                        
LRM007        IF TWA-DUPE-FOUND = 'Y'                                           
LRM007           MOVE ACAT11IO-CONTROL-NBR TO TWA-CONTROL-NBR                   
LRM007           MOVE TWA-CONTROL-NBR TO MACATO                                 
LRM007           MOVE ATT-ASKIP       TO MACATA                                 
LRM007        END-IF                                                            
LRM007        MOVE 'N'  TO TWA-DUPE-FOUND                                       
              PERFORM  ERROR-RTN                                        03650002
           ELSE                                                                 
              MOVE LOW-VALUE TO ACAT11MO                                03620002
              MOVE 'WRITE'           TO WS-DB2-PROBLEM-FUNCTION                 
              MOVE ACAT11IO-SQLCAID  TO WS-DB2-PROBLEM-TABLE                    
              MOVE ACAT11IO-SQLCODE  TO WS-DB2-PROBLEM-ID                       
              MOVE WS-DB2-PROBLEM-MSG TO SYSTEM-MSG                             
              PERFORM DB2-ERROR-RTN.                                            
                                                                                
           SKIP3                                                                
                                                                                
       UPDATE-ACAT-IT-RECORD.                                                   
           SET ACAT11IO-IT-UPD  TO TRUE.                                        
           MOVE TWA-CLIENT-NO-X   TO ACAT11IO-CLIENT-NBR.                       
           MOVE TWA-MCBRKR        TO ACAT11IO-RCV-NBR.                          
           MOVE TWA-MCACCT        TO ACAT11IO-RCV-ACCT.                         
           MOVE ACAT-ADP-BROKER   TO ACAT11IO-DLVR-NBR.                         
LRM003***  MOVE TWA-MBR           TO ACAT11IO-DLVR-ACCT.                        
LRM003***  MOVE TWA-MAC           TO ACAT11IO-DLVR-ACCT(4 : 5).                 
LRM003     MOVE TWA-DLVR-ACCT     TO ACAT11IO-DLVR-ACCT.                        
LRM041     IF TWA-MTYPE = '4'                                                   
LRM041     AND TWA-CLIENT-NO-X(2 : 3) = '010'                                   
LRM041     AND TWA-SECR-ACTION = 'A'                                            
LRM041     AND TWA-MCCMNT-X120 NOT > SPACES                                     
LRM041        MOVE                                                              
LRM041           'RESIDUAL PHYSICAL SECURITY DELIVERY FROM FULL ACAT'           
LRM041                       TO TWA-MCCMNT-X120.                                
           MOVE TWA-MCCMNT-X120   TO ACAT11IO-CMNT-TXT.                         
           MOVE TWA-M1CMNT-X120   TO ACAT11IO-ASSET-CMNT1-TXT.                  
           MOVE TWA-M2CMNT-X120   TO ACAT11IO-ASSET-CMNT2-TXT.                  
           MOVE TWA-M5CMNT-X120   TO ACAT11IO-ASSET-CMNT5-TXT.                  
           MOVE TWA-MMCMNT-X120   TO ACAT11IO-ASSET-CMNTM-TXT.                  
LRM003     MOVE TWA-PTR-MCCMNT-X120 TO ACAT11IO-PTR-CMNT-TXT.                   
           MOVE TWA-MRR           TO ACAT11IO-RR-CD.                    02030002
           MOVE TWA-MCTYPE        TO ACAT11IO-RCV-ACCT-TYPE-CD.         02030002
           MOVE TWA-MNAME         TO ACAT11IO-RCV-CUST-NM.              02030002
           MOVE TWA-MNAME2        TO ACAT11IO-RCV-CUST-NM(31 : 30).     02030002
           MOVE TWA-MSSN(1 : 3)   TO ACAT11IO-RCV-SS-PRIM-NBR(1 : 3).   02030002
           MOVE TWA-MSSN(5 : 2)   TO ACAT11IO-RCV-SS-PRIM-NBR(4 : 2).   02030002
           MOVE TWA-MSSN(8 : 4)   TO ACAT11IO-RCV-SS-PRIM-NBR(6 : 4).   02030002
           IF TWA-MSSN2(1 : 1) NOT GREATER SPACES                               
              MOVE SPACES           TO ACAT11IO-RCV-SS-SCNDY-NBR                
           ELSE                                                                 
              MOVE TWA-MSSN2(1 : 3) TO ACAT11IO-RCV-SS-SCNDY-NBR(1 : 3)         
              MOVE TWA-MSSN2(5 : 2) TO ACAT11IO-RCV-SS-SCNDY-NBR(4 : 2)         
              MOVE TWA-MSSN2(8 : 4) TO ACAT11IO-RCV-SS-SCNDY-NBR(6 : 4)         
           END-IF.                                                              
           MOVE TWA-OCC-BRKR      TO ACAT11IO-RCV-OCC-BRKR-NBR.                 
           IF TWA-MSUBM = 'Y'                                           02030002
              SET ACAT11IO-NSCC-SUBMIT-ELIGIBLE TO TRUE                         
           ELSE                                                                 
              SET ACAT11IO-NSCC-SUBMIT-HOLD     TO TRUE.                        
                                                                                
           IF TWA-MREJ NOT = TWA-ORIG-MREJ                                      
           OR TWA-MREJ > SPACES                                                 
              MOVE TWA-MREJ TO ACAT11IO-REJECT-CODE                             
              SET ACAT11IO-IT-REJECT TO TRUE                                    
              MOVE SPACES TO TWA-SECR-ACTION                                    
              MOVE 'PTR' TO ACAT11IO-TRNFR-TYPE-CD                              
              MOVE SPACES          TO ACAT11IO-RCV-OCC-BRKR-NBR                 
              IF TWA-MREJ NOT > '00'                                            
                 MOVE SPACES TO MSUBMO TWA-MSUBM                                
                 MOVE ATT-ASKIP TO MSUBMA                                       
              END-IF                                                            
           ELSE                                                                 
LRM003     IF TWA-PTR-BEEN-FLIPPED                                              
LRM003        MOVE 'PTR' TO ACAT11IO-TRNFR-TYPE-CD                              
LRM003        MOVE TWA-CONTROL-NBR   TO ACAT11IO-CONTROL-NBR                    
LRM003     ELSE                                                                 
LRM028        IF TWA-INP-TFR-TYP = 'PTF'                                        
LRM028           MOVE 'PTF'          TO ACAT11IO-TRNFR-TYPE-CD                  
LRM028        ELSE                                                              
                 MOVE 'PTD'          TO ACAT11IO-TRNFR-TYPE-CD                  
LRM028        END-IF                                                            
LRM003        MOVE SPACES            TO ACAT11IO-CONTROL-NBR                    
           END-IF.                                                              
LRM007     MOVE TWA-CONTROL-NBR   TO ACAT11IO-CONTROL-NBR                       
                                                                                
           MOVE ' '   TO ACAT11IO-ACCT-RJCT-RSBM-IND.                           
                                                                                
           MOVE TWA-ORIG-RCV-NBR   TO ACAT11IO-ORIG-RCV-NBR.                    
           MOVE TWA-ORIG-RCV-ACCT TO ACAT11IO-ORIG-RCV-ACCT.                    
LRM021     IF TWA-GIFT-IND = 'Y'                                                
LRM021        MOVE '1'               TO ACAT11IO-GIFT-IND                       
LRM021     ELSE                                                                 
LRM021        MOVE ' '               TO ACAT11IO-GIFT-IND                       
LRM021     END-IF.                                                              
                                                                                
LRM043     IF TWA-ISIN-CNTRY-CD NOT = 'US' AND '  '                             
LRM043        MOVE TWA-MSECR(1:2) TO ACAT11IO-ISIN-CNTRY-CD                     
LRM043        MOVE TWA-MSECR(3:9) TO ACAT11IO-ISIN-SEC-ISSUE-CD                 
LRM043        MOVE TWA-MSECR(12:1) TO ACAT11IO-ISIN-SEC-CDG-CD                  
LRM043     ELSE                                                                 
              MOVE  TWA-ISIN-CNTRY-CD    TO ACAT11IO-ISIN-CNTRY-CD              
              MOVE TWA-MSECR TO ACAT11IO-ISIN-SEC-ISSUE-CD                      
              MOVE SPACES TO ACAT11IO-ISIN-SEC-CDG-CD                           
LRM043     END-IF.                                                              
           MOVE TWA-MSLOC  TO ACAT11IO-STTLM-LCTN-CD.                           
           MOVE TWA-ADP-NBR TO ACAT11IO-ADP-NBR.                                
           MOVE TWA-MCATGR  TO ACAT11IO-ASSET-PRC-CTGY-CD.                      
           MOVE 'P' TO ACAT11IO-ASSET-RQST-QTY-CD.                              
    **** SET ACAT11IO-PSTN-CD BASED ON POSITIVE OR NEGATIVE QTY BELOW.          
           IF TWA-MQTY-9 < ZERO                                                 
              SET ACAT11IO-SHORT-ASSET-QTY TO TRUE                              
           ELSE                                                                 
           IF TWA-MQTY-9 > ZERO                                                 
              SET ACAT11IO-LONG-ASSET-QTY TO TRUE                               
           ELSE                                                                 
              SET ACAT11IO-NA-ASSET-QTY TO TRUE                                 
           END-IF.                                                              
                                                                                
           MOVE ZEROS              TO ACAT11IO-ASSET-AMT                        
                                      ACAT11IO-ASSET-QTY                        
                                      ACAT11IO-ASSET-PCT.                       
                                                                                
           IF TWA-MQTY-9 LESS ZERO                                              
              COMPUTE WS-MQTY-9-UNSIGNED =  TWA-MQTY-9 * -1                     
              END-COMPUTE                                                       
           ELSE                                                                 
              MOVE TWA-MQTY-9      TO WS-MQTY-9-UNSIGNED                        
           END-IF.                                                              
           IF TWA-MCD = 'V'                                                     
              SET ACAT11IO-RQST-ASSET-AMT TO TRUE                               
              MOVE WS-MQTY-9-UNSIGNED TO ACAT11IO-ASSET-AMT                     
           ELSE                                                                 
LRM008     IF TWA-MCD = 'P' OR 'W'                                              
              SET ACAT11IO-RQST-ASSET-QTY TO TRUE                               
              MOVE WS-MQTY-9-UNSIGNED TO ACAT11IO-ASSET-QTY                     
           ELSE                                                                 
           IF TWA-MCD = '%'                                                     
              SET ACAT11IO-RQST-ASSET-PCT TO TRUE                               
              MOVE WS-MQTY-9-UNSIGNED TO ACAT11IO-ASSET-PCT                     
           ELSE                                                                 
              MOVE SPACES TO ACAT11IO-AST-RQST-TRANS-CD                         
              MOVE 'F' TO ACAT11IO-ASSET-RQST-QTY-CD                            
              MOVE ZEROS           TO ACAT11IO-ASSET-QTY                        
              SET ACAT11IO-NA-ASSET-QTY TO TRUE                                 
           END-IF.                                                              
           MOVE TWA-MAMT-9         TO ACAT11IO-ASSET-AMT.                       
           IF ACAT11IO-ASSET-AMT < ZERO                                         
              COMPUTE ACAT11IO-ASSET-AMT =                                      
                      ACAT11IO-ASSET-AMT * -1                                   
              END-COMPUTE.                                                      
                                                                                
           IF TWA-MTYPE = '1'                                                   
              SET ACAT11IO-CASH-ASSET TO TRUE                                   
           ELSE                                                                 
           IF TWA-MTYPE = '2'                                                   
              SET ACAT11IO-MARGIN-ASSET TO TRUE                                 
           ELSE                                                                 
LRM041     IF TWA-MTYPE = '4'                                                   
LRM041        MOVE TWA-MTYPE TO ACAT11IO-CSH-MGN-SHRT-CD                        
LRM041     ELSE                                                                 
           IF TWA-MTYPE = '5'                                                   
              SET ACAT11IO-SHORT-ASSET TO TRUE                                  
           ELSE                                                                 
              MOVE SPACES TO ACAT11IO-CSH-MGN-SHRT-CD                           
           END-IF.                                                              
                                                                                
           MOVE TWA-MMEMO       TO ACAT11IO-MEMO-CD.                            
           MOVE TWA-SLOCRSN     TO ACAT11IO-SLOC-RSN.                           
           MOVE TWA-MWI         TO ACAT11IO-WHI-CD.                             
LRM008     IF TWA-MCD = 'W'                                                     
LRM008        MOVE 'W' TO  TWA-NSCC-WTHLD-CD                                    
LRM008                     ACAT11IO-NSCC-WTHLD-CD                               
LRM008     ELSE                                                                 
LRM008        MOVE ' ' TO  TWA-NSCC-WTHLD-CD                                    
LRM008                     ACAT11IO-NSCC-WTHLD-CD.                              
           MOVE TWA-MDESC-GROUP TO ACAT11IO-DESC-TXT.                           
LRM012     IF TWA-ADP-NBR > SPACES                                              
LRM012        MOVE 'ADP-SEC:'  TO ACAT11IO-DESC-TXT(121 : 8)                    
LRM012        MOVE TWA-ADP-NBR TO ACAT11IO-DESC-TXT(129 : 7)                    
LRM012     END-IF.                                                              
                                                                                
CSG001* IN SOME CASES MSD DESCRIPTIONS CONTAIN SPECIAL CHARACTERS.              
CSG001* CORRECT THEM BY REPLACING SPECIAL CHARACTERS WITH SPACES.               
CSG001     MOVE ACAT11IO-DESC-TXT     TO W-ASSET-DESC-TXT-GRP                   
CSG001     MOVE W-ASSET-DESC1-TXT     TO W-ASSET-DESC-TXT                       
CSG001     MOVE 30                    TO W-SUB3                                 
CSG001     SET W-JUST-LEFT-REQ-Y      TO TRUE                                   
CSG001     PERFORM EDIT-ASSET-DESC-TXT                                          
CSG001     MOVE W-ASSET-DESC-TXT      TO W-ASSET-DESC1-TXT                      
CSG001     MOVE W-ASSET-DESC2-TXT     TO W-ASSET-DESC-TXT                       
CSG001     MOVE 30                    TO W-SUB3                                 
CSG001     SET W-JUST-LEFT-REQ-N      TO TRUE                                   
CSG001     PERFORM EDIT-ASSET-DESC-TXT                                          
CSG001     MOVE W-ASSET-DESC-TXT      TO W-ASSET-DESC2-TXT                      
CSG001     MOVE W-ASSET-DESC3-TXT     TO W-ASSET-DESC-TXT                       
CSG001     MOVE 30                    TO W-SUB3                                 
CSG001     SET W-JUST-LEFT-REQ-N      TO TRUE                                   
CSG001     PERFORM EDIT-ASSET-DESC-TXT                                          
CSG001     MOVE W-ASSET-DESC-TXT      TO W-ASSET-DESC3-TXT                      
CSG001     MOVE W-ASSET-DESC4-TXT     TO W-ASSET-DESC-TXT                       
CSG001     MOVE 30                    TO W-SUB3                                 
CSG001     SET W-JUST-LEFT-REQ-N      TO TRUE                                   
CSG001     PERFORM EDIT-ASSET-DESC-TXT                                          
CSG001     MOVE W-ASSET-DESC-TXT      TO W-ASSET-DESC4-TXT                      
CSG001     MOVE W-ASSET-DESC5-TXT     TO W-ASSET-DESC-TXT                       
CSG001     MOVE 20                    TO W-SUB3                                 
CSG001     SET W-JUST-LEFT-REQ-N      TO TRUE                                   
CSG001     PERFORM EDIT-ASSET-DESC-TXT                                          
CSG001     MOVE W-ASSET-DESC-TXT      TO W-ASSET-DESC5-TXT                      
CSG001                                                                          
CSG001     MOVE W-ASSET-DESC-TXT-GRP  TO ACAT11IO-DESC-TXT                      
CSG001                                                                          
           IF TWA-MBAL01-9 < ZERO                                               
              SET ACAT11IO-AMT-01-CREDIT TO TRUE                                
              COMPUTE WS-MQTY-9-UNSIGNED =  TWA-MBAL01-9 * -1                   
              END-COMPUTE                                                       
              MOVE WS-MQTY-9-UNSIGNED TO ACAT11IO-AMT-01                        
           ELSE                                                                 
              MOVE SPACES TO ACAT11IO-AMT-01-CREDIT-IND                         
              MOVE TWA-MBAL01-9    TO ACAT11IO-AMT-01                           
           END-IF.                                                              
           IF TWA-MBAL02-9 < ZERO                                               
              SET ACAT11IO-AMT-02-CREDIT TO TRUE                                
              COMPUTE WS-MQTY-9-UNSIGNED =  TWA-MBAL02-9 * -1                   
              END-COMPUTE                                                       
              MOVE WS-MQTY-9-UNSIGNED TO ACAT11IO-AMT-02                        
           ELSE                                                                 
              MOVE SPACES TO ACAT11IO-AMT-02-CREDIT-IND                         
              MOVE TWA-MBAL02-9    TO ACAT11IO-AMT-02                           
           END-IF.                                                              
           IF TWA-MBAL05-9 < ZERO                                               
              SET ACAT11IO-AMT-05-CREDIT TO TRUE                                
              COMPUTE WS-MQTY-9-UNSIGNED =  TWA-MBAL05-9 * -1                   
              END-COMPUTE                                                       
              MOVE WS-MQTY-9-UNSIGNED TO ACAT11IO-AMT-05                        
           ELSE                                                                 
              MOVE SPACES TO ACAT11IO-AMT-05-CREDIT-IND                         
              MOVE TWA-MBAL05-9    TO ACAT11IO-AMT-05                           
           END-IF.                                                              
           MOVE ZEROS           TO ACAT11IO-AMT-SMA.                            
           MOVE TWA-MSCMNT-X120 TO ACAT11IO-ASSET-CMNT-TXT.                     
           IF TWA-BOND-REG-CODE = '1'                                           
LRM012     AND TWA-MSLOC NOT = '35'                                             
              MOVE 'B' TO ACAT11IO-BEARER-BOND-CD                               
           ELSE                                                                 
              MOVE 'N' TO ACAT11IO-BEARER-BOND-CD                               
           END-IF.                                                              
           MOVE TWA-UPDT-TMSTP  TO ACAT11IO-UPDT-TMSTP.                         
LRM017     MOVE ACAT-SIGN-ON-ID      TO ACAT11IO-SIGN-ON-ID                     
LRM017     MOVE ACAT-CICS-NETNAME    TO ACAT11IO-NETNAME                        
LRM017     MOVE ACAT-CICS-USER-ID    TO ACAT11IO-USER-ID                        
LRM017     MOVE ACAT-CICS-USER-NAME  TO ACAT11IO-USER-NAME                      
LRM017     MOVE TWA-ORIG-FREEZE-IND  TO ACAT11IO-VTRNFR-FREEZE-IND              
                                                                                
           PERFORM LINK-TO-ACAT11IO-RTN.                                        
           IF ACAT11IO-GOOD-RESP                                                
              MOVE ACAT11IO-UPDT-TMSTP TO TWA-UPDT-TMSTP                        
              IF (TWA-MSECR > SPACES OR TWA-MDESC(1 : 1) > SPACES)              
              AND (TWA-SECR-ACTION = 'A' OR 'C' OR 'D')                         
                 PERFORM UPDATE-ASSET-RTN                                       
              END-IF                                                            
LRM040        IF (ACAT11IO-DUPE-DLVY-ASSSET-IND = 'C' OR 'P')                   
LRM040           MOVE 'WARNING - DUPE DLVY POS/BAL' TO CMNTMSGO                 
LRM040        END-IF                                                            
LRM040        MOVE SPACES TO ACAT11IO-DUPE-DLVY-ASSSET-IND                      
              IF TWA-MREJ NOT = TWA-ORIG-MREJ                                   
               MOVE TWA-MREJ TO TWA-ORIG-MREJ                                   
               IF TWA-MREJ = SPACES                                             
                 MOVE -1 TO MBRL                                                
                 MOVE 'REJECT REQUEST DELETED'                                  
                      TO SYSTEM-MSG                                             
LRM016           MOVE SPACES TO MSUBMO TWA-MSUBM PF4MSGO                        
               ELSE                                                             
LRM016         MOVE SPACES TO PF4MSGO                                           
               IF TWA-MSUBM = 'Y'                                               
                 MOVE -1 TO MSUBML                                              
LRM022           IF TWA-STTLM-TM-CD = 'L'                                       
LRM032           AND WS-TIME-HHMM > WS-CYCLE3-HHMM                              
LRM022              MOVE 'WARNING-PAST CUTOFF TIME;SUBMITTING WILL CAUSE        
LRM022-                    ' NSCC ERROR' TO SYSTEM-MSG                          
LRM022           ELSE                                                           
                 MOVE 'REJECT CREATED SUCCESSFULLY / AWAITNG NSCC XMIT'         
                      TO SYSTEM-MSG                                             
LRM022           END-IF                                                         
               ELSE                                                             
                 MOVE -1 TO MSUBML                                              
                   MOVE 'REJECT RETAINED / SUBMIT PENDING' TO SYSTEM-MSG        
               END-IF END-IF                                                    
              ELSE                                                              
               IF TWA-MSUBM = 'Y'                                               
                 MOVE -1 TO MSUBML                                              
LRM022           IF TWA-STTLM-TM-CD = 'L'                                       
LRM032           AND WS-TIME-HHMM > WS-CYCLE3-HHMM                              
LRM022              MOVE 'WARNING-PAST CUTOFF TIME;SUBMITTING WILL CAUSE        
LRM022-                    ' NSCC ERROR' TO SYSTEM-MSG                          
LRM022           ELSE                                                           
                 MOVE 'RECORD UPDATED SUCCESSFULLY / AWAITNG NSCC XMIT'         
                      TO SYSTEM-MSG                                             
LRM022           END-IF                                                         
               ELSE                                                             
                 MOVE -1 TO MSUBML                                              
                 MOVE 'UPDATE RETAINED / SUBMIT PENDING' TO SYSTEM-MSG          
              END-IF END-IF                                                     
              PERFORM  ERROR-RTN                                        03650002
           ELSE                                                                 
           IF ACAT11IO-UPDT-TMSTP-NG                                            
           OR ACAT11IO-NSCC-PEND-NG                                             
           OR ACAT11IO-NOT-FOUND                                                
              PERFORM UPDATE-FAIL-RTN                                           
           ELSE                                                                 
              MOVE LOW-VALUE TO ACAT11MO                                03620002
              MOVE 'REPL '           TO WS-DB2-PROBLEM-FUNCTION                 
              MOVE ACAT11IO-SQLCAID  TO WS-DB2-PROBLEM-TABLE                    
              MOVE ACAT11IO-SQLCODE  TO WS-DB2-PROBLEM-ID                       
              MOVE WS-DB2-PROBLEM-MSG TO SYSTEM-MSG                             
              PERFORM DB2-ERROR-RTN.                                            
           MOVE ATT-UNPROT TO MDELA.                                            
                                                                                
       UPDATE-FAIL-RTN.                                                         
           IF ACAT11IO-NOT-FOUND                                                
              MOVE                                                              
             'UPDATE REJECTED; THIS TIF WAS DELETED BY SOMEONE ELSE'            
                TO SYSTEM-MSG                                                   
              MOVE ' ' TO TWA-ACTION                                            
              MOVE SPACES TO TWA-MAP-TABLE                              02000002
              MOVE LOW-VALUES TO ACAT11MO                                       
              MOVE -1 TO MBRL                                                   
              MOVE ACAT11IO-RCV-NBR   TO TWA-MCBRKR                             
              MOVE ACAT11IO-RCV-ACCT  TO TWA-MCACCT                             
              MOVE ACAT11IO-DLVR-ACCT   TO TWA-MBR                              
              MOVE ACAT11IO-DLVR-ACCT(4 : 5)   TO TWA-MAC                       
              SET FIRST-TIME TO TRUE                                            
              PERFORM ERROR-RTN                                         10220002
           END-IF.                                                              
                                                                                
           IF ACAT11IO-UPDT-TMSTP-NG                                            
              MOVE                                                              
             'UPDATE REJECTED; OTHER CHANGE MADE PRIOR TO THIS REQUEST;         
      -      'SCREEN REFRESHED'                                                 
                TO SYSTEM-MSG                                                   
           ELSE                                                                 
           IF ACAT11IO-NSCC-PEND-NG                                             
              MOVE                                                              
             'UPDATE REJECTED; THIS TIF ALREADY SENT TO NSCC; SCREEN REF        
      -      'RESHED'                                                           
                TO SYSTEM-MSG                                                   
           ELSE                                                                 
              MOVE  'UPDATE REJECTED; SCREEN REFRESHED'  TO SYSTEM-MSG          
           END-IF.                                                              
                                                                                
LRM003     IF TWA-PTR-BEEN-FLIPPED                                              
LRM003        PERFORM ERROR-RTN.                                        10220002
   ***** REREAD RECORD, MOVE TO TWA AND SCREEN, DISPLAY:                        
           PERFORM READ-ACAT-RTN.                                               
           PERFORM MOVE-ACAT11IO-TO-TWA-RTN.                                    
           PERFORM REFORMAT-SCREEN-DETAIL.                                      
           PERFORM ERROR-RTN.                                           10220002
                                                                                
           EJECT                                                                
       CREATE-DLVY-FROM-MEMO-RTN.                                               
           IF NOT ACAT-SIGN-ON-UPDATE                                           
LRM016        MOVE 'USER DOES NOT HAVE CREATE AUTHORITY; PF4 IGNORED'           
                 TO SYSTEM-MSG                                                  
              MOVE -1 TO MACATL                                                 
              PERFORM ERROR-RTN                                                 
           END-IF.                                                              
           IF TWA-ACTION NOT = 'R'                                              
           OR TWA-INP-TFR-TYP NOT = 'PTR'                                       
LRM003     OR TWA-STTS-CD NOT = '500'                                           
LRM016        MOVE 'PF4 KEY IS ONLY VALID WHEN A VALID PTR IS DISPLAYED'        
                 TO SYSTEM-MSG                                                  
              MOVE -1 TO MACATL                                                 
              PERFORM ERROR-RTN                                                 
           END-IF.                                                              
                                                                                
           IF TWA-MREJ > '00'                                                   
LRM016        MOVE 'MEMO REJECT MUST BE DELETED PRIOR TO PF4'                   
                 TO SYSTEM-MSG                                                  
              MOVE -1 TO MREJL                                                  
              MOVE ATT-UNPROT-BRT TO MREJA                                      
              PERFORM ERROR-RTN                                                 
           END-IF.                                                              
                                                                                
*******    IF ACAT11IO-ACCT-RJCT-RSBM-IND = 'S'                                 
LRM016*       MOVE 'PTD ALREADY CREATED FOR THIS PTR; PF4 KEY INVALID'          
*******          TO SYSTEM-MSG                                                  
*******       MOVE -1 TO MACATL                                                 
*******       PERFORM ERROR-RTN                                                 
*******    END-IF.                                                              
                                                                                
      * THERE IS A VALID PTR DISPLAYED AT THIS POINT...                         
      * INSERT PTD HEADER AND MONEY BALANCES. ACAT11DB WILL PROCESS             
      * ASSETS ONE-BY-ONE, TRYING TO COPY ALL TO INITIAL DB.                    
                                                                                
           MOVE ACAT-SIGN-ON-ID   TO ACAT11IO-SIGN-ON-ID                        
           MOVE TWA-CLIENT-NO-X   TO ACAT11IO-CLIENT-NBR.                       
           MOVE TWA-CONTROL-NBR   TO ACAT11IO-CONTROL-NBR                       
           MOVE TWA-MCBRKR        TO ACAT11IO-RCV-NBR.                          
           MOVE TWA-MCACCT        TO ACAT11IO-RCV-ACCT.                         
           MOVE ACAT-ADP-BROKER   TO ACAT11IO-DLVR-NBR.                         
LRM003***  MOVE TWA-MBR           TO ACAT11IO-DLVR-ACCT.                        
LRM003***  MOVE TWA-MAC           TO ACAT11IO-DLVR-ACCT(4 : 5).                 
LRM003     MOVE TWA-DLVR-ACCT     TO ACAT11IO-DLVR-ACCT.                02030002
LRM003     MOVE 'PTR'             TO ACAT11IO-TRNFR-TYPE-CD                     
           MOVE TWA-MCTYPE        TO ACAT11IO-RCV-ACCT-TYPE-CD.         02030002
           MOVE TWA-MNAME         TO ACAT11IO-RCV-CUST-NM.              02030002
           MOVE TWA-MNAME2        TO ACAT11IO-RCV-CUST-NM(31 : 30).     02030002
           MOVE TWA-MSSN(1 : 3)   TO ACAT11IO-RCV-SS-PRIM-NBR(1 : 3).   02030002
           MOVE TWA-MSSN(5 : 2)   TO ACAT11IO-RCV-SS-PRIM-NBR(4 : 2).   02030002
           MOVE TWA-MSSN(8 : 4)   TO ACAT11IO-RCV-SS-PRIM-NBR(6 : 4).   02030002
           IF TWA-MSSN2(1 : 1) NOT GREATER SPACES                               
              MOVE SPACES           TO ACAT11IO-RCV-SS-SCNDY-NBR                
           ELSE                                                                 
              MOVE TWA-MSSN2(1 : 3) TO ACAT11IO-RCV-SS-SCNDY-NBR(1 : 3)         
              MOVE TWA-MSSN2(5 : 2) TO ACAT11IO-RCV-SS-SCNDY-NBR(4 : 2)         
              MOVE TWA-MSSN2(8 : 4) TO ACAT11IO-RCV-SS-SCNDY-NBR(6 : 4)         
           END-IF.                                                              
           SET ACAT11IO-NSCC-SUBMIT-HOLD     TO TRUE.                           
           MOVE TWA-MRR           TO ACAT11IO-RR-CD.                    02030002
                                                                                
           IF ACAT-OCC-BROKER > '000'                                           
              MOVE '0'             TO ACAT11IO-RCV-OCC-BRKR-NBR(1 : 1)          
              MOVE ACAT-OCC-BROKER TO ACAT11IO-RCV-OCC-BRKR-NBR(2 : 4)          
           ELSE                                                                 
              MOVE SPACES          TO ACAT11IO-RCV-OCC-BRKR-NBR.                
           IF TWA-APPROVAL-AUTH                                                 
              SET ACAT11IO-NSCC-SUBMIT-ELIGIBLE TO TRUE                         
              MOVE 'Y'   TO TWA-MSUBM                                   02030002
           END-IF.                                                              
           MOVE ZEROS     TO ACAT11IO-ASSET-SEQ-NBR                             
LRM003                       ACAT11IO-PTD-ASSETS-CREATED.                       
           MOVE SPACES TO TWA-MCCMNT-X120                                       
                          TWA-M1CMNT-X120                                       
                          TWA-M2CMNT-X120                                       
                          TWA-M5CMNT-X120                                       
                          TWA-MMCMNT-X120                                       
                          TWA-MSCMNT-X120.                                      
           MOVE EIBTRMID  TO ACAT11IO-EIBTRMID.                                 
LRM003     MOVE TWA-STTS-CD TO ACAT11IO-STTS-CD.                                
                                                                                
LRM017     IF ACAT-ACCOUNT-FREEZE-CLIENT                                        
LRM017        MOVE TWA-CLIENT-NO-X TO ACATRSIO-CLIENT-NBR                       
LRM017        MOVE TWA-MBR TO ACATRSIO-BRANCH                                   
LRM017        MOVE TWA-MAC TO ACATRSIO-ACCOUNT                                  
LRM017        SET ACATRSIO-LOOKUP-ACCOUNT-FREEZE TO TRUE                        
LRM017        PERFORM LINK-TO-ACATRSTIO-RTN                                     
LRM017        MOVE ACATRSIO-FREEZE-A TO TWA-FREEZE-CASH-DEBIT                   
LRM017                                  ACAT11IO-CURR-FREEZE-CASH-DB            
LRM017        MOVE ACATRSIO-FREEZE-B TO TWA-FREEZE-CASH-CREDIT                  
LRM017                                  ACAT11IO-CURR-FREEZE-CASH-CR            
LRM017        MOVE ACATRSIO-FREEZE-C TO TWA-FREEZE-SEC-SHORT                    
LRM017                                  ACAT11IO-CURR-FREEZE-SEC-SHORT          
LRM017        MOVE ACATRSIO-FREEZE-D TO TWA-FREEZE-SEC-LONG                     
LRM017                                  ACAT11IO-CURR-FREEZE-SEC-LONG           
LRM017     END-IF.                                                              
                                                                                
           SET ACAT11IO-COPY-ACTIVE-PTR TO TRUE.                                
LRM022     MOVE TWA-STTLM-TM-CD TO ACAT11IO-STTLM-TM-CD.                        
LRM040     MOVE SPACES TO ACAT11IO-DUPE-DLVY-ASSSET-IND.                        
           PERFORM LINK-TO-ACAT11IO-RTN.                                        
           IF ACAT11IO-HOLIO-ERROR                                              
              MOVE 'PTR DLVY NOT CREATED;' TO SYSTEM-MSG                        
              MOVE ACAT11IO-SQLERRMC  TO SYSTEM-MSG (22 : 58)                   
              PERFORM SEND-MAP-DATA-ONLY                                10250002
              PERFORM WRITE-TSQ-RTN                                     10790002
              PERFORM RETURN-TO-CICS                                    08350002
           END-IF.                                                              
           IF ACAT11IO-SQLCODE = -803                                           
              SET DUPLICATE-PTD TO TRUE                                         
******** REREAD THE PTR FROM THE INITIAL DB TO OBTAIN CORRECT VALUES.           
              SET ACAT11IO-IT-READ TO TRUE                                      
              PERFORM LINK-TO-ACAT11IO-RTN                                      
           ELSE                                                                 
           IF ACAT11IO-DB2-ERROR                                                
              MOVE 'COPY P'          TO WS-DB2-PROBLEM-FUNCTION                 
              MOVE ACAT11IO-SQLCAID  TO WS-DB2-PROBLEM-TABLE                    
              MOVE ACAT11IO-SQLCODE  TO WS-DB2-PROBLEM-ID                       
              MOVE WS-DB2-PROBLEM-MSG TO SYSTEM-MSG                             
              PERFORM DB2-ERROR-RTN.                                            
                                                                                
LRM003     MOVE 'PTR' TO TWA-INP-TFR-TYP  MMTFRO.                               
                                                                                
LRM003*****IF ACAT11IO-PTD-ASSETS-CREATED = ZERO IS RESULT OF                   
LRM003***** ACAT11DB NOT ABLE TO FULFILL ANY (AT LEAST ONE) ASSET.              
                                                                                
           MOVE SPACES TO TWA-ACTIVE-DB.                                        
           MOVE 'C' TO TWA-ACTION.                                              
           PERFORM MOVE-ACAT11IO-TO-TWA-RTN.                                    
LRM003     IF ACAT11IO-PTD-ASSETS-CREATED = ZERO                                
LRM018********MOVE 'R' TO TWA-ACTION                                            
LRM018        CONTINUE                                                          
LRM016     ELSE                                                                 
LRM003        SET TWA-PTR-BEEN-FLIPPED TO TRUE                                  
LRM016     END-IF.                                                              
           MOVE ACAT11IO-RCV-NBR  TO TWA-ORIG-RCV-NBR                           
           MOVE ACAT11IO-RCV-ACCT TO TWA-ORIG-RCV-ACCT                          
           PERFORM REFORMAT-SCREEN-DETAIL                                       
           MOVE SPACES TO TWA-INTRAN-FLAG                               01940002
******** READ FIRST ASSET.                                                      
           MOVE LOW-VALUES TO TWA-CURRENT-ASSET-KEY.                    02030002
           INITIALIZE ACAT11IO-PT-ASSET-FIELDS.                                 
           PERFORM PAGE-FORWARD-RTN                                     08610002
              THRU PAGE-FORWARD-RTN-EXIT.                                       
           IF ACAT11IO-ASSET-FOUND                                              
              MOVE 'C' TO TWA-SECR-ACTION                                       
           ELSE                                                                 
              MOVE SPACES TO TWA-ASSET-AREA                                     
              MOVE ZEROS  TO TWA-MQTY-9                                         
                             TWA-MAMT-9                                         
              MOVE 'A' TO TWA-SECR-ACTION                                       
LRM003        PERFORM REFORMAT-SCREEN-ASSET                                     
           END-IF.                                                              
                                                                                
           PERFORM PROCESS-MAP-ITEMS THRU PROCESS-MAP-ITEMS-EXIT.               
           IF DUPLICATE-PTD                                                     
              MOVE 'DLVY FOUND FOR THIS PTR' TO SYSTEM-MSG                      
           ELSE                                                                 
              MOVE 'DLVY CREATED; REVIEW ALL ASSETS' TO SYSTEM-MSG              
              IF ACAT11IO-PTD-ASSETS-CREATED > ZERO                             
                 MOVE ACAT11IO-PTD-ASSETS-CREATED TO WS-ASSET-ED                
                 MOVE WS-ASSET-X TO SYSTEM-MSG(32 : 4)                          
LRM040           IF (ACAT11IO-DUPE-DLVY-ASSSET-IND = 'C' OR 'P')                
LRM040              MOVE 'WARNING - DUPE DLVY POS/BAL' TO CMNTMSGO              
LRM040           END-IF                                                         
LRM040           MOVE SPACES TO ACAT11IO-DUPE-DLVY-ASSSET-IND                   
              ELSE                                                              
                 MOVE                                                           
                 'DLVY NOT CREATED; NO REQUESTED ASSETS FULFILLED'              
                                                     TO SYSTEM-MSG              
LRM003           MOVE -1 TO MREJL                                               
LRM029           MOVE ATT-UNPROT TO MREJA MSUBMA                                
LRM029           MOVE ATT-ASKIP  TO MDELA                                       
           END-IF.                                                              
                                                                                
           PERFORM SEND-MAP-DATA-ONLY.                                  10250002
           PERFORM WRITE-TSQ-RTN.                                       10790002
           PERFORM RETURN-TO-CICS.                                      08350002
                                                                        08960002
           EJECT                                                                
       UPDATE-ASSET-RTN.                                                        
LRM028     IF TWA-INP-TFR-TYP = 'PTF'                                           
LRM028        MOVE 'PTF'             TO ACAT11IO-TRNFR-TYPE-CD                  
LRM028     ELSE                                                                 
LRM028     IF TWA-INP-TFR-TYP = 'PTD'                                           
LRM028        MOVE 'PTD'             TO ACAT11IO-TRNFR-TYPE-CD                  
LRM028     ELSE                                                                 
LRM028        MOVE 'PTR'             TO ACAT11IO-TRNFR-TYPE-CD                  
LRM028     END-IF.                                                              
                                                                                
           IF TWA-SECR-ACTION = 'A'                                             
              SET ACAT11IO-IT-ISRT-ASSET TO TRUE                                
              PERFORM LINK-TO-ACAT11IO-RTN                                      
              MOVE 'C' TO TWA-SECR-ACTION                                       
LRM003        MOVE ATT-ASKIP TO MSECRA MSLOCA MTYPEA                            
LRM035                          MEXPDTA MCALLA MLONGA MSTRIKEA                  
LRM003        IF ACAT11IO-DUPE-ASSET-RETURN                                     
LRM003           PERFORM MOVE-ACAT11IO-ASSET-TO-TWA                             
LRM003           PERFORM REFORMAT-SCREEN-ASSET                                  
LRM003           MOVE                                                           
LRM003     'ASSET ALREADY EXISTS; DISPLAY REFRESHED, RE-ENTER CHANGES'          
LRM003             TO SYSTEM-MSG                                                
LRM003           PERFORM SEND-MAP-DATA-ONLY                             10250002
LRM003           PERFORM WRITE-TSQ-RTN                                  10790002
LRM003           PERFORM RETURN-TO-CICS                                 08350002
LRM003        END-IF                                                            
           ELSE                                                                 
           IF TWA-SECR-ACTION = 'C'                                             
              SET ACAT11IO-IT-UPD-ASSET TO TRUE                                 
              PERFORM LINK-TO-ACAT11IO-RTN                                      
           ELSE                                                                 
           IF TWA-SECR-ACTION = 'D'                                             
              SET ACAT11IO-IT-DEL-ASSET TO TRUE                                 
              PERFORM LINK-TO-ACAT11IO-RTN                                      
           END-IF.                                                              
           MOVE TWA-MSECR TO  TWA-ORIG-MSECR                                    
                              TWA-ORIG-SECR.                                    
           MOVE TWA-MSLOC TO  TWA-ORIG-SLOC.                                    
           MOVE TWA-MTYPE TO  TWA-ORIG-MTYPE.                                   
           MOVE ACAT11IO-CSH-MGN-SHRT-CD TO TWA-ORIG-TYPE.                      
                                                                                
           IF NOT ACAT11IO-GOOD-RESP                                            
              MOVE LOW-VALUE TO ACAT11MO                                03620002
              MOVE 'REPL A'          TO WS-DB2-PROBLEM-FUNCTION                 
              MOVE ACAT11IO-SQLCAID  TO WS-DB2-PROBLEM-TABLE                    
              MOVE ACAT11IO-SQLCODE  TO WS-DB2-PROBLEM-ID                       
              MOVE WS-DB2-PROBLEM-MSG TO SYSTEM-MSG                             
              PERFORM DB2-ERROR-RTN.                                            
                                                                                
           IF TWA-SECR-ACTION = 'D'                                             
              MOVE SPACES TO TWA-ASSET-AREA                                     
              MOVE ZEROS  TO TWA-MQTY-9                                         
                             TWA-MAMT-9                                         
              PERFORM REFORMAT-SCREEN-ASSET                                     
              MOVE 'ASSET DELETED' TO SYSTEM-MSG                                
              PERFORM READ-NEXT-ASSET-RTN.                                      
                                                                                
           EJECT                                                                
       READ-ACAT-RTN.                                                           
           MOVE SPACES TO ACAT11IO-CALL-AREA.                                   
           SET ACAT11IO-IT-READ TO TRUE.                                        
           MOVE TWA-CLIENT-NO-X   TO ACAT11IO-CLIENT-NBR.                       
           MOVE TWA-MCBRKR        TO ACAT11IO-RCV-NBR.                          
           MOVE TWA-MCACCT        TO ACAT11IO-RCV-ACCT.                         
           MOVE ACAT-ADP-BROKER   TO ACAT11IO-DLVR-NBR.                         
           MOVE TWA-MBR           TO ACAT11IO-DLVR-ACCT.                        
           MOVE TWA-MAC           TO ACAT11IO-DLVR-ACCT(4 : 5).                 
LRM028     IF TWA-INP-TFR-TYP = 'PTF'                                           
LRM028        MOVE 'PTF'          TO ACAT11IO-TRNFR-TYPE-CD                     
LRM028     ELSE                                                                 
              MOVE 'PTD'          TO ACAT11IO-TRNFR-TYPE-CD.                    
           PERFORM LINK-TO-ACAT11IO-RTN.                                        
           IF ACAT11IO-DB2-ERROR                                                
              MOVE 'READ'            TO WS-DB2-PROBLEM-FUNCTION                 
              MOVE ACAT11IO-SQLCAID  TO WS-DB2-PROBLEM-TABLE                    
              MOVE ACAT11IO-SQLCODE  TO WS-DB2-PROBLEM-ID                       
              MOVE WS-DB2-PROBLEM-MSG TO SYSTEM-MSG                             
              PERFORM DB2-ERROR-RTN.                                            
                                                                                
DEAD?  READ-ACTIVE-PTR-RTN.                                                     
           MOVE SPACES TO ACAT11IO-CALL-AREA.                                   
           MOVE TWA-CLIENT-NO-X   TO ACAT11IO-CLIENT-NBR.                       
           MOVE TWA-MACAT TO ACAT11IO-CONTROL-NBR                               
           SET ACAT11IO-IT-GET-ACTIVE  TO TRUE                                  
           PERFORM LINK-TO-ACAT11IO-RTN.                                        
           IF ACAT11IO-DB2-ERROR                                                
              MOVE 'READ A'          TO WS-DB2-PROBLEM-FUNCTION                 
              MOVE ACAT11IO-SQLCAID  TO WS-DB2-PROBLEM-TABLE                    
              MOVE ACAT11IO-SQLCODE  TO WS-DB2-PROBLEM-ID                       
              MOVE WS-DB2-PROBLEM-MSG TO SYSTEM-MSG                             
              PERFORM DB2-ERROR-RTN.                                            
                                                                                
       READ-NEXT-ASSET-RTN.                                                     
           IF TWA-ACTION = '6'                                                  
              SET ACAT11IO-IT-READNEXT-VASSET TO TRUE                           
           ELSE                                                                 
              SET ACAT11IO-IT-READNEXT-VINITAST TO TRUE.                        
           PERFORM LINK-TO-ACAT11IO-RTN.                                        
                                                                                
           IF ACAT11IO-ASSET-FOUND                                              
              PERFORM MOVE-ACAT11IO-ASSET-TO-TWA                                
              PERFORM REFORMAT-SCREEN-ASSET                                     
              MOVE 'C' TO TWA-SECR-ACTION                                       
           END-IF.                                                              
                                                                                
           IF ACAT11IO-DB2-ERROR                                                
              MOVE LOW-VALUE TO ACAT11MO                                03620002
              MOVE 'NXT-A'           TO WS-DB2-PROBLEM-FUNCTION                 
              MOVE ACAT11IO-SQLCAID  TO WS-DB2-PROBLEM-TABLE                    
              MOVE ACAT11IO-SQLCODE  TO WS-DB2-PROBLEM-ID                       
              MOVE WS-DB2-PROBLEM-MSG TO SYSTEM-MSG                             
              PERFORM DB2-ERROR-RTN.                                            
                                                                                
       READ-ASSET-RTN.                                                          
           MOVE TWA-CLIENT-NO-X   TO ACAT11IO-CLIENT-NBR.                       
           MOVE TWA-MCBRKR        TO ACAT11IO-RCV-NBR.                          
           MOVE TWA-MCACCT        TO ACAT11IO-RCV-ACCT.                         
           MOVE ACAT-ADP-BROKER   TO ACAT11IO-DLVR-NBR.                         
LRM003***  MOVE TWA-MBR           TO ACAT11IO-DLVR-ACCT.                        
LRM003***  MOVE TWA-MAC           TO ACAT11IO-DLVR-ACCT(4 : 5).                 
LRM003     MOVE TWA-DLVR-ACCT     TO ACAT11IO-DLVR-ACCT.                02030002
           MOVE TWA-MCTYPE        TO ACAT11IO-RCV-ACCT-TYPE-CD.         02030002
LRM028     IF TWA-INP-TFR-TYP = 'PTF'                                           
LRM028        MOVE 'PTF' TO ACAT11IO-TRNFR-TYPE-CD                              
LRM028     ELSE                                                                 
              MOVE 'PTD' TO ACAT11IO-TRNFR-TYPE-CD.                             
                                                                                
           MOVE TWA-ORIG-RCV-NBR   TO ACAT11IO-ORIG-RCV-NBR.                    
           MOVE TWA-ORIG-RCV-ACCT TO ACAT11IO-ORIG-RCV-ACCT.                    
                                                                                
LRM043     IF TWA-ISIN-CNTRY-CD NOT = 'US' AND '  '                             
LRM043        MOVE TWA-MSECR(1:2) TO ACAT11IO-ISIN-CNTRY-CD                     
LRM043        MOVE TWA-MSECR(3:9) TO ACAT11IO-ISIN-SEC-ISSUE-CD                 
LRM043        MOVE TWA-MSECR(12:1) TO ACAT11IO-ISIN-SEC-CDG-CD                  
LRM043     ELSE                                                                 
              MOVE 'US'  TO ACAT11IO-ISIN-CNTRY-CD                              
LRM028                      TWA-ISIN-CNTRY-CD                                   
              MOVE TWA-MSECR TO ACAT11IO-ISIN-SEC-ISSUE-CD                      
              MOVE SPACES TO ACAT11IO-ISIN-SEC-CDG-CD                           
LRM043     END-IF.                                                              
           MOVE TWA-MSLOC  TO ACAT11IO-STTLM-LCTN-CD.                           
           MOVE TWA-ADP-NBR TO ACAT11IO-ADP-NBR.                                
    **** SET ACAT11IO-PSTN-CD BASED ON POSITIVE OR NEGATIVE QTY BELOW.          
           IF TWA-MQTY-9 < ZERO                                                 
              SET ACAT11IO-SHORT-ASSET-QTY TO TRUE                              
           ELSE                                                                 
           IF TWA-MQTY-9 > ZERO                                                 
              SET ACAT11IO-LONG-ASSET-QTY TO TRUE                               
           ELSE                                                                 
              SET ACAT11IO-NA-ASSET-QTY TO TRUE                                 
           END-IF.                                                              
                                                                                
           IF TWA-MTYPE = '1'                                                   
              SET ACAT11IO-CASH-ASSET TO TRUE                                   
           ELSE                                                                 
           IF TWA-MTYPE = '2'                                                   
              SET ACAT11IO-MARGIN-ASSET TO TRUE                                 
           ELSE                                                                 
LRM041     IF TWA-MTYPE = '4'                                                   
LRM041        MOVE TWA-MTYPE TO ACAT11IO-CSH-MGN-SHRT-CD                        
LRM041     ELSE                                                                 
           IF TWA-MTYPE = '5'                                                   
              SET ACAT11IO-SHORT-ASSET TO TRUE                                  
           ELSE                                                                 
              MOVE SPACES TO ACAT11IO-CSH-MGN-SHRT-CD                           
           END-IF.                                                              
                                                                                
           SET ACAT11IO-IT-READ-ASSET TO TRUE                                   
LRM016     IF TWA-CONTROL-NBR > SPACES                                          
LRM016        MOVE TWA-CONTROL-NBR TO ACAT11IO-CONTROL-NBR                      
LRM016     ELSE                                                                 
LRM016        MOVE SPACES          TO ACAT11IO-CONTROL-NBR                      
LRM016     END-IF.                                                              
           PERFORM LINK-TO-ACAT11IO-RTN                                         
           IF ACAT11IO-DB2-ERROR                                                
              MOVE LOW-VALUE TO ACAT11MO                                03620002
              MOVE 'GET-A'           TO WS-DB2-PROBLEM-FUNCTION                 
              MOVE ACAT11IO-SQLCAID  TO WS-DB2-PROBLEM-TABLE                    
              MOVE ACAT11IO-SQLCODE  TO WS-DB2-PROBLEM-ID                       
              MOVE WS-DB2-PROBLEM-MSG TO SYSTEM-MSG                             
              PERFORM DB2-ERROR-RTN.                                            
                                                                                
           SKIP3                                                                
       FORMAT-FROM-ACTIVE-RTN.                                                  
           SET ACAT11IO-IT-GET-ACTIVE TO TRUE.                                  
           MOVE TWA-CLIENT-NO-X   TO ACAT11IO-CLIENT-NBR.                       
           MOVE ACAT-CONTROL-NBR  TO ACAT11IO-CONTROL-NBR.                      
           MOVE ACAT-INP-TFR-TYP  TO ACAT11IO-TRNFR-TYPE-CD.                    
                                                                                
           PERFORM LINK-TO-ACAT11IO-RTN.                                        
           IF ACAT11IO-ACTIVE-FOUND                                             
           OR ACAT11IO-PTD-INITIAL-FOUND                                        
              MOVE ACAT11IO-ACTIVE-DB TO TWA-ACTIVE-DB                          
              PERFORM MOVE-ACAT11IO-TO-TWA-RTN                                  
              PERFORM REFORMAT-SCREEN-DETAIL                                    
              PERFORM MOVE-ACAT11IO-ASSET-TO-TWA                                
              PERFORM REFORMAT-SCREEN-ASSET                                     
              IF ACAT-SIGN-ON-UPDATE                                            
              AND (ACAT11IO-TRNFR-TYPE-CD = 'PTD' OR 'PTF')                     
              AND ACAT11IO-ACTIVE-DB NOT = 'Y'                                  
              AND (ACAT11IO-NSCC-SUBMIT-ELIGIBLE                                
                OR ACAT11IO-NSCC-SUBMIT-HOLD)                                   
                 MOVE 'C' TO TWA-ACTION                                         
              ELSE                                                              
                 IF ACAT-SIGN-ON-UPDATE                                         
                 AND ACAT11IO-TRNFR-TYPE-CD = 'PTR'                             
                    MOVE 'R' TO TWA-ACTION                                      
                 ELSE                                                           
                    MOVE 'B' TO TWA-ACTION                                      
                 END-IF                                                         
                 PERFORM ASKIP-MAP-RTN                                          
                 MOVE ATT-UNPROT TO  MACATA                                     
                 MOVE -1         TO  MACATL                                     
           END-IF.                                                              
                                                                                
           PERFORM PROCESS-MAP-ITEMS THRU PROCESS-MAP-ITEMS-EXIT.               
           IF ACAT11IO-ACTIVE-FOUND                                             
LRM028        IF TWA-INP-TFR-TYP = 'PTF'                                        
LRM028           MOVE 'PTF TIF DISPLAYED' TO SYSTEM-MSG                         
LRM028        ELSE                                                              
              IF TWA-INP-TFR-TYP = 'PTD'                                        
                 MOVE 'PTD TIF DISPLAYED' TO SYSTEM-MSG                         
              ELSE                                                              
                 MOVE 'PTR TIF DISPLAYED' TO SYSTEM-MSG                         
           ELSE                                                                 
              MOVE 'NO ACTIVE TIFS FOUND' TO SYSTEM-MSG                         
           END-IF.                                                              
                                                                                
           MOVE SPACES TO ACAT-CALLING-PROG-NAME                                
           PERFORM SEND-MAP-ERASE.                                              
           PERFORM WRITE-TSQ-RTN.                                       10790002
           PERFORM RETURN-TO-CICS.                                      08350002
                                                                                
           EJECT                                                                
       DELETE-ACAT-IT-RECORD.                                                   
           SET ACAT11IO-IT-DEL TO TRUE.                                         
           MOVE TWA-CLIENT-NO-X   TO ACAT11IO-CLIENT-NBR.                       
           MOVE TWA-MCBRKR        TO ACAT11IO-RCV-NBR.                          
           MOVE TWA-MCACCT        TO ACAT11IO-RCV-ACCT.                         
           MOVE ACAT-ADP-BROKER   TO ACAT11IO-DLVR-NBR.                         
LRM003***  MOVE TWA-MBR           TO ACAT11IO-DLVR-ACCT.                        
LRM003***  MOVE TWA-MAC           TO ACAT11IO-DLVR-ACCT(4 : 5).                 
LRM003     MOVE TWA-DLVR-ACCT     TO ACAT11IO-DLVR-ACCT.                02030002
LRM009*****MOVE 'PTD'             TO ACAT11IO-TRNFR-TYPE-CD.                    
LRM009     MOVE TWA-INP-TFR-TYP   TO ACAT11IO-TRNFR-TYPE-CD.                    
           MOVE TWA-ORIG-RCV-NBR   TO ACAT11IO-ORIG-RCV-NBR.                    
           MOVE TWA-ORIG-RCV-ACCT TO ACAT11IO-ORIG-RCV-ACCT.                    
           MOVE TWA-CONTROL-NBR   TO ACAT11IO-CONTROL-NBR.                      
           PERFORM LINK-TO-ACAT11IO-RTN.                                        
                                                                                
           IF ACAT11IO-DB2-ERROR                                                
              MOVE 'DELETE'          TO WS-DB2-PROBLEM-FUNCTION                 
              MOVE ACAT11IO-SQLCAID  TO WS-DB2-PROBLEM-TABLE                    
              MOVE ACAT11IO-SQLCODE  TO WS-DB2-PROBLEM-ID                       
              MOVE WS-DB2-PROBLEM-MSG TO SYSTEM-MSG                             
              PERFORM DB2-ERROR-RTN.                                            
LRM003     IF TWA-PTR-BEEN-FLIPPED                                              
LRM003        SET WS-DELETE TO TRUE                                             
LRM003        MOVE ACAT11IO-CONTROL-NBR TO TWA-MACAT                            
LRM003        MOVE SPACES TO TWA-CONTROL-NBR                                    
LRM003        PERFORM PAGE-FORWARD-TIF                                          
LRM003     END-IF.                                                              
           MOVE SPACES TO TWA-MAP-TABLE.                                02000002
           MOVE ZEROS TO TWA-MBAL01-9                                           
                         TWA-MBAL02-9                                           
                         TWA-MBAL05-9                                           
LRM026                   TWA-MAMT-9                                             
LRM026                   TWA-MQTY-9.                                            
           MOVE 'A' TO TWA-ACTION                                               
           PERFORM REFORMAT-SCREEN-DETAIL.                                      
           PERFORM REFORMAT-SCREEN-ASSET                                        
           PERFORM PROCESS-MAP-ITEMS THRU PROCESS-MAP-ITEMS-EXIT.               
           MOVE 'TIF DELETED' TO SYSTEM-MSG.                                    
           PERFORM SEND-MAP-ERASE.                                              
           PERFORM WRITE-TSQ-RTN.                                       10790002
           PERFORM RETURN-TO-CICS.                                      08350002
120800                                                                  10041009
       EJECT                                                                    
120800                                                                  10130002
120900 NOT-OPEN.                                                        10140002
           IF FIRST-TIME                                                        
              MOVE 'ACAT11PT' TO ACAT-PROGRAM-NAME                      08340002
              MOVE LOW-VALUES TO ACAT11MO.                                      
                                                                                
           PERFORM INIT-MAP-RTN.                                        07650005
           MOVE 'ACATVR FILE IS NOT AVAILABLE.' TO TRLMSGO.             10150002
           MOVE  ATT-ASKIP-BRT                TO TRLMSGA.               10160002
           MOVE -1 TO MNEXTL.                                           04773110
127200     PERFORM WRITE-TSQ-RTN.                                       10790002
121200     PERFORM SEND-MAP-ERASE.                                      10170002
121300     PERFORM RETURN-TO-CICS.                                      10180002
120800                                                                  10181004
120700     EJECT                                                        10182004
                                                                                
       DB2-ERROR-RTN.                                                           
           PERFORM ERROR-RTN.                                                   
121400                                                                  10190002
121700 ERROR-RTN.                                                       10220002
           MOVE TWA-CLIENT-NO-X(2 : 3) TO MCLINBO.                              
029700     MOVE WSTIME         TO  MTIMEO.                              02740002
029800     MOVE WSMMDDYY       TO  MDATEO.                              02750002
   800     MOVE SYSTEM-MSG     TO  TRLMSGO.                             10230002
121900     MOVE ATT-ASKIP-BRT  TO  TRLMSGA.                             10240002
           IF FIRST-TIME                                                        
              PERFORM SEND-MAP-ERASE                                    08330002
           ELSE                                                                 
              PERFORM SEND-MAP-DATA-ONLY.                               10250002
127200     PERFORM WRITE-TSQ-RTN.                                       10790002
122100     PERFORM RETURN-TO-CICS.                                      10260002
122200                                                                  10270002
122300     EJECT                                                        10288002
122400                                                                  10290002
123600 READ-TSQ-RTN.                                                    10350002
123700     EXEC CICS READQ TS QUEUE(TSQ-NAME)                           10360002
123800                        INTO(TWA-AREA)                            10370002
123900                        LENGTH(LENGTH OF TWA-AREA)                10380002
                              ITEM(ITEM-NUM)                            10390002
124000     END-EXEC.                                                    10400002
125100     IF (EIBRESP NOT = +0)                                        10410002
           AND (NOT FIRST-TIME)                                         10420002
              MOVE LOW-VALUE TO ACAT11MO                                        
125200        MOVE 'ACAT11 READ TSQ ERROR.'                             10430002
125300          TO SYSTEM-MSG                                           10440002
125400        PERFORM ERROR-RTN                                         10450002
125500     END-IF.                                                      10460002
124100                                                                  10470002
124200 DELETE-TSQ-RTN.                                                  10480002
124300     EXEC CICS DELETEQ TS QUEUE(TSQ-NAME)                         10490002
124400     END-EXEC.                                                    10500002
124500                                                                  10510002
124600 WRITE-TSQ-RTN.                                                   10520002
124700     EXEC CICS WRITEQ TS QUEUE(TSQ-NAME)                          10530002
124800                         FROM(TWA-AREA)                           10540002
124900                         LENGTH(LENGTH OF TWA-AREA)               10550002
                               ITEM(ITEM-NUM)                           10560002
125000     END-EXEC.                                                    10570002
125100     IF EIBRESP NOT = +0                                          10580002
              MOVE LOW-VALUE TO ACAT11MO                                        
125200        MOVE 'ACAT11 WRITE TSQ ERROR.'                            10590002
125300          TO SYSTEM-MSG                                           10600002
125500     END-IF.                                                      10620002
125600                                                                  10630002
136400     EJECT                                                        00110040
125800                                                                  10650002
125900 RETURN-CONTROL-RTN.                                              10660002
126000     EXEC CICS SEND CONTROL                                       10670002
126100                      ERASE                                       10680002
126200                     FREEKB                                       10690002
126300     END-EXEC.                                                    10700002
126400     EXEC CICS XCTL PROGRAM ('RATT01')                            10710002
126500     END-EXEC.                                                    10720002
126600     EXEC CICS RETURN                                             10730002
126700     END-EXEC.                                                    10740002
126800                                                                  10750002
126900     EJECT                                                        10760002
127000                                                                  10770002
127100 RETURN-TO-CICS.                                                  10780002
           MOVE TWA-CALLING-PROG TO ACAT-CALLING-PROG-NAME.                     
127300     EXEC CICS RETURN                                             10800002
127400               TRANSID('ACAX')                                    10810002
127500               COMMAREA(ACATCOMM-COMMAREA)                        10820002
127600     END-EXEC.                                                    10830002
127700                                                                  10840002
127800 HANG-CICS.                                                       10850002
127900     GOBACK.                                                      10860002
