000001* PDX    - ACAT10DC C0360817 11/20/14 15:16:47 TBLAMUR            00001006
000001* LRM030 SSR 99150 CONTRA CUSIP SUBMIT WARNING                    00001103
000001* PDX    - ACAT10DC C0335821 06/24/13 14:38:42 TBLAMUR            00001200
000001* LRM028 SSR 90275 CORRECT POSITION UPDATE IN REQUEST STATUS.     00001300
000001* PDX    - ACAT10DC C0333830 11/15/12 16:25:27 TBLAMUR            00001400
000001* LRM027 CORRECT BALANCE UPDATE CAUSING "ADD" RECORD NOT UPDATE   00001500
000001*  IN REWIEW MODE, DUE TO CURRENCY CODE BUG CAUSING VASSET NOTFND.00001600
000001* PDX    - ACAT10DC C0330171 08/28/12 10:25:45 TBLAMUR            00001700
000001* LRM026 SUPPORT DLVY OF FOREIGN CURRENCY POSITION.               00001800
000001* PDX    - ACAT10DC C0327733 06/15/12 15:37:01 TBLAMUR            00001900
000001* LRM025 SSR 85090 CAPTURE USER ID, ETC ON BALANCE UPDATES.       00002000
000001* PDX    - ACAT10DC C0318727 11/08/11 08:57:34 TBLAMUR            00002100
000001* LRM024 SSR 80728 RECOMPILE ONLY DUE TO TWA/ACAT10IO CHANGE.     00002200
000001* PDX    - ACAT10DC C0308774 03/03/11 10:39:36 TBLAMUR            00002300
000001* LRM018 - SSR# 76705 CORRECT -811 WITH 2 FULL DLVY REQUESTS WITH 00002400
000001* LRM018 - SAME KEYS AND HAVING OPTIONS.                          00002500
000001* PDX    - ACAT10DC C0305327 12/23/10 09:21:12 TBLAMUR            00002600
000001* LRM017 - SSR# 73637 RECOMPILE ONLY DUE TO TWA/ACAT10IO CHANGE.  00002700
000001* PDX    - ACAT10DC C0302589 10/26/10 10:04:12 TBLAMUR            00002800
000001* LRM016 - SSR 70666 CAPTURE USER AUDIT INFO ON SUBMITTED ASSETS. 00002900
000001* PDX    - ACAT10DC C0281257 04/12/10 15:34:26 TBLAMUR            00003000
000001* LRM015 SSR 62882 DELETE ALL ASSETS FUNCTION.                    00003100
000001* PDX    - ACAT10DC C0274616 12/18/08 12:43:22 TBLAMUR            00003200
000001* LRM013 SSR 55766 CONTINUED, COPY PEND AND ACK-IND FROM OTHER    00003300
000001*  INITIAL ASSETS WHEN IN REQUEST MODE, IF ANY OTHERS FOUND.      00003400
000001* PDX    - ACAT10DC C0270267 09/15/08 09:01:21 TBLAMUR            00003500
000001* LRM012 TSK 60550 DB2 CORRECTION FOR -303 MESSAGE.               00003600
000001* PDX    - ACAT10DC C0263391 05/23/08 15:22:16 TBLAMUR            00003700
000001* LRM011 SSR 55766 ASCENDIS INTERFACE. WIPE ACK_IND ON UPDATE     00003800
000001*  IN REVIEW MODE OR WHEN SUBMITTING ASSETS/REJECT MANUALLY.      00003900
000001* PDX    - ACAT10DC C0254958 10/01/07 11:04:43 TBLAMUR            00004000
000001* LRM010 SSR 54091 RECOMPILE ONLY DUE TO COPYBOOK 10IO CHANGE     00004100
000001* PDX    - ACAT10DC C0242236 12/04/06 15:44:49 TBLAMUR            00004200
      * LRM008 SSR 48334 RECOMPILE ONLY DUE TO COPYBOOK 10IO CHANGE     00004300
000001* PDX    - ACAT10DC C0238544 08/28/06 11:22:11 TBLAMUR            00004400
      * LRM006 SSR 45145 RECOMPILE ONLY DUE TO COPYBOOK 10IO CHANGE     00004500
000001* PDX    - ACAT10DC C0231507 07/07/06 15:13:55 TBEDTAK            00004600
      * ET0003 - 45744 ACCT FREEZE. RECOMPILE ONLY FOR COPY MEMBER CHG. 00004700
      * LRM005 - 40661 - SAVE DELETE ASSET DATA FOR ONLINE USER REPORT  00004800
      *          BY INSERTING ROW INTO ACTIAST WITH CLIENT NBR D###,    00004900
      *          AND SAVE NETNAME, USRNAME, ETC ON ADDS AND DELETES.    00005000
000001* PDX    - ACAT10DC C0226668 10/19/05 08:51:43 TBLAMUR            00005100
      * LRM004 0034889 UPDATE SIGN-ON-ID ON ACTIAST                     00005200
000001* PDX    - ACAT10DC C0215192 01/03/05 11:39:11 TBEDTAK            00005300
      * ET0002 DB2 TABLE KEY CHANGE WITH NEW TABLE NAME                 00005400
000001* PDX    - ACAT10DC C0209766 08/12/04 13:20:50 TBEDTAK            00005500
      * ET0001 FIX BUG - DUPE KEY ERROR IS CAUSING A LOOP WHEN PROGRAM  00005600
      *  TRIES TO INSERT MULTI ASSETS WITH SAME SECURITIES IN INITAST.  00005700
000001* PDX    - ACAT10DC C0179784 10/02/02 09:34:15 TBLAMUR            00005800
      * LRM002 0026952 RESCIND BLOCK RECOMPILE ONLY FOR 10IO CPY CHANGE 00005900
000001* PDX    - ACAT10DC C0173301 04/30/02 14:05:00 TBLAMUR            00006000
000001* PDX    - ACAT10DC C0126743 06/07/99 10:06:54 TBTIKUO            00006100
000001* PDX    - ACAT10DC C0124783 04/21/99 10:08:12 TBLAMUR            00006200
000001* PDX    - ACAT10DC C0123344 04/06/99 10:49:47 TBLAMUR            00006300
000001* PDX    - ACAT10DC C0121429 02/09/99 21:30:54 TBDACRA            00006400
000001* PDX    - ACAT10DC C0121190 02/08/99 16:51:55 TBDACRA            00006500
000001* PDX    - ACAT10DC C0121429 02/07/99 21:13:06 TBDACRA            00006600
000001* PDX    - ACAT10DC C0120812 02/04/99 17:35:21 TBDACRA            00006700
000001* PDX    - ACAT10DC C0119861 01/22/99 10:51:37 TBTIKUO            00006800
000001* PDX    - ACAT10DC C0119290 01/05/99 11:04:46 TBTIKUO            00006900
000001* PDX    - ACAT10DC C0118748 12/11/98 14:33:27 TBTIKUO            00007000
000001* PDX    - ACAT10DC C0117770 12/07/98 12:34:37 TBTIKUO            00007100
000001* PDX    - ACAT10DC C0112193 11/11/98 14:34:20 TBTIKUO            00007200
000001* PDX    - ACAT10DC C0117817 11/09/98 09:34:55 TBTIKUO            00007300
000001* PDX    - ACAT10DC C0112193 10/28/98 09:24:11 TBTIKUO            00007400
       IDENTIFICATION DIVISION.                                         00007500
       PROGRAM-ID.    ACAT10DC.                                         00007600
       AUTHOR.        TINA KUO.                                         00007700
       DATE-WRITTEN.                                                    00007800
       DATE-COMPILED.                                                   00007900
      *---------------------------------------------------------------* 00008000
      *                                                               * 00008100
      *   THIS IS THE ACATS I/O MODULE CALLED BY ACAT10NT,            * 00008200
      *   IT HANDLES DB2 FUNCTIONS OF TABLE ACAT_ASSET.               * 00008300
      *   WHEN STCD IS LESS THAN 200, ASSET INFO IS FROM INITVAST     * 00008400
      *   WHEN STCD IS BETWEEN 200 AND 300 (200 INCLUDED), ASSET INFO * 00008500
      *             IS FROM BOTH VASSET AND INITVAST                  * 00008600
      *   WHEN STCD IS NOT LESS THAN 300, ASSET INFO IS FROM VASSET   * 00008700
      *                                                               * 00008800
      *---------------------------------------------------------------* 00008900
LRM001* 04/30/02 DELETE SMA ASSET WHEN ZERO IN REQUEST MODE           * 00009000
      *---------------------------------------------------------------* 00009100
      ***************************************************************** 00009200
       ENVIRONMENT DIVISION.                                            00009300
                                                                        00009400
       DATA DIVISION.                                                   00009500
                                                                        00009600
       WORKING-STORAGE SECTION.                                         00009700
       COPY PDXIDCOB.                                                   00009800
       01  FILLER                          PIC X(60)                    00009900
           VALUE 'ACAT10DC WORKING STORAGE BEGINS HERE'.                00010000
                                                                        00010100
092700 77  WS-VASSET-COUNT                  PIC S9(9) COMP.             00010200
092700 77  WS-VINITAST-COUNT                PIC S9(9) COMP.             00011000
092700 77  FETCH-SUBY-CNT                   PIC S9(9) COMP.             00020000
092700 77  FETCH-SUBN-CNT                   PIC S9(9) COMP.             00030000
092700 77  UPDATE-SUBY-CNT                  PIC S9(9) COMP.             00040000
092700 77  UPDATE-SUBN-CNT                  PIC S9(9) COMP.             00050000
12/11  77  WS-SEQ-NBR-9                     PIC 9(6).                   00060000
       01  WS-ACAT10DC-WORK-AREA.                                       00070000
           05  WS-FIRST-TIME-SW             PIC X(01) VALUE SPACE.      00080000
               88 FIRST-TIME                         VALUE 'Y'.         00090000
           05  WS-VTRNFR-AREA.                                          00100000
               10 SEARCH-VTRNFR-SW          PIC X(01) VALUE SPACE.      00110000
                  88 SEARCH-VTRNFR                   VALUE 'Y'.         00120000
               10 FOUND-VTRNFR-SW           PIC X(01) VALUE SPACE.      00130000
                  88  VTRNFR-FOUND                   VALUE 'Y'.         00140000
                  88  VTRNFR-NOT-FOUND               VALUE 'N'.         00150000
           05  WS-VASSET-AREA.                                          00160000
               10 SEARCH-VASSET-SW          PIC X(01) VALUE SPACE.      00170000
                  88 SEARCH-VASSET                   VALUE 'Y'.         00180000
               10 FOUND-VASSET-SW           PIC X(01) VALUE SPACE.      00190000
                  88  VASSET-FOUND                   VALUE 'Y'.         00200000
                  88  VASSET-NOT-FOUND               VALUE 'N'.         00210000
               10 SEARCH-VINITAST-SW        PIC X(01) VALUE SPACE.      00220000
                  88 SEARCH-VINITAST                 VALUE 'Y'.         00230000
               10 FOUND-VINITAST-SW         PIC X(01) VALUE SPACE.      00240000
                  88  VINITAST-FOUND                 VALUE 'Y'.         00250000
                  88  VINITAST-NOT-FOUND             VALUE 'N'.         00260000
               10 INSERT-VINITAST-SW        PIC X(01) VALUE SPACE.      00270000
                  88  VINITAST-INSERTED              VALUE 'Y'.         00280000
               10 FETCH-VINITAST-SW         PIC X(01) VALUE SPACE.      00290000
                  88  MORE-VINITAST                  VALUE 'Y'.         00300000
                  88  NO-MORE-VINITAST               VALUE 'N'.         00310000
     ****                                                               00320000
12/11      05  WS-INIT-SEC-NBR.                                         00330000
               10  FILLER                   PIC X(3)   VALUE 'XXX'.     00340000
12/11          10  WS-INIT-SEQ-NBR-9        PIC X(6)   VALUE ZERO.      00350000
     ****                                                               00360000
ET0001**   05  WS-RETURN-MSG                PIC X(70)  VALUE SPACE.     00370000
ET0001     05  WS-RETURN-MSG                PIC X(79)  VALUE SPACE.     00380000
           05  WS-TIMESTAMP                 PIC X(26).                  00390000
           05  SV-VASSET-KEY.                                           00400000
               10 SV-ACAT-CNTL-NBR          PIC X(14)  VALUE SPACE.     00410000
               10 SV-ASSET-SEQ-NBR          PIC S9(04) COMP.            00420000
               10 SV-INITAST-SEQ-NBR        PIC S9(04) COMP.            00430000
           05  WS-ACAT-CNTL-NBR             PIC X(14)  VALUE SPACE.     00440000
           05  WS-ASSET-SEQ-NBR             PIC S9(04) COMP.            00450000
12/03      05  WS-INIT-ASSET-SEQ-NBR        PIC S9(04) COMP.            00460000
01/23      05  SV-OPT-BS-CD                 PIC X(01).                  00470000
01/23      05  SV-OPTN-CMNT-TXT             PIC X(16).                  00480000
093100     05  SV-VINITAST-KEY.                                         00490000
093100         10 SV-CLIENT-NBR             PIC X(04)  VALUE SPACE.     00500000
               10 SV-DLVR-NBR               PIC X(04)  VALUE SPACE.     00510000
               10 SV-RCV-NBR                PIC X(04)  VALUE SPACE.     00520000
               10 SV-ACCT-DLVR-NBR          PIC X(20)  VALUE SPACE.     00530000
               10 SV-ACCT-RCV-NBR           PIC X(20)  VALUE SPACE.     00540000
               10 SV-STTLM-LCTN-CD          PIC X(02)  VALUE SPACE.     00550000
               10 SV-CNTRY-CD               PIC X(02)  VALUE SPACE.     00560000
               10 SV-SEC-ISSUE-CD           PIC X(09)  VALUE SPACE.     00570000
               10 SV-SEC-CDG-CD             PIC X(01)  VALUE SPACE.     00580000
               10 SV-CSH-MGN-SHRT-CD        PIC X(01)  VALUE SPACE.     00590000
LRM026         10 SV-CRNCY-CD               PIC X(03)  VALUE SPACE.     00600000
           05 WS-DLVR-NBR               PIC X(04)  VALUE SPACE.         00610000
           05 WS-RCV-NBR                PIC X(04)  VALUE SPACE.         00620000
           05 WS-ACCT-DLVR-NBR          PIC X(20)  VALUE SPACE.         00630000
           05 WS-ACCT-RCV-NBR           PIC X(20)  VALUE SPACE.         00640000
01/18      05 WS-BAL01-COMP2            USAGE COMP-2.                   00650000
01/18      05 WS-BAL02-COMP2            USAGE COMP-2.                   00660000
01/18      05 WS-BAL05-COMP2            USAGE COMP-2.                   00670000
01/18      05 WS-SMA-COMP2              USAGE COMP-2.                   00680000
01/18      05 WS-QTY-COMP2              USAGE COMP-2.                   00690000
01/18      05 WS-AMT-COMP2              USAGE COMP-2.                   00700000
12/09      05 WS-ORIG-BAL01-9           PIC S9(15)V99 COMP-3.           00710000
  |        05 WS-ORIG-BAL02-9           PIC S9(15)V99 COMP-3.           00720000
  |        05 WS-ORIG-BAL05-9           PIC S9(15)V99 COMP-3.           00730000
  |        05 WS-ORIG-SMA-9             PIC S9(15)V99 COMP-3.           00740000
  |        05 WS-ORIG-QTY-9             PIC S9(12)V9(4) COMP-3.         00750000
  |        05 WS-ORIG-AMT-9             PIC S9(15)V99 COMP-3.           00760000
  |        05 WS-ORIG-BAL01-N           PIC 9(15)V99.                   00770000
  |        05 WS-ORIG-BAL02-N           PIC 9(15)V99.                   00780000
  |        05 WS-ORIG-BAL05-N           PIC 9(15)V99.                   00790000
  |        05 WS-ORIG-SMA-N             PIC 9(15)V99.                   00800000
  |        05 WS-ORIG-QTY-N             PIC 9(13)V9(4).                 00810000
12/09      05 WS-ORIG-AMT-N             PIC 9(15)V99.                   00820000
       01  WS-ASSET-AREA.                                               00830000
           05 WS-SEC-NBR                            PIC X(12).          00840000
           05 WS-ADP-NBR                            PIC X(07).          00850000
           05 WS-TRANS-TYPE-CD                      PIC X(01).          00860000
           05 WS-CSH-MGN-SHRT-CD                    PIC X(01).          00870000
           05 WS-PSTN-CD                            PIC X(01).          00880000
01/21      05 WS-OPTN-CTGY-CD                       PIC X(02).          00890000
01/21      05 WS-OPT-BS-CD                          PIC X(01).          00900000
           05 WS-WHEN-ISSUED                        PIC X(01).          00910000
           05 WS-STTLM-LCTN-CD                      PIC X(02).          00920000
           05 WS-CNTRY-CD                           PIC X(02).          00930000
           05 WS-STTLM-RSN-CD                       PIC X(04).          00940000
           05 WS-INITAST-NSCC-PEND-CD               PIC X(01).          00950000
LRM011     05 WS-INITAST-NSCC-ACK-IND               PIC X(01).          00960000
           05 WS-NSCC-WTHLD-CD                      PIC X(01).          00970000
           05 WS-ASSET-QTY                       PIC S9(13)V9(4) COMP-3.00980000
           05 WS-ASSET-AMT                       PIC S9(15)V9(2) COMP-3.00990000
           05 WS-ASSET-DESC                         PIC X(140).         01000000
LRM015     05 WS-DELETE-ASSETS-IND                  PIC X(01).          01010000
           05 WS-ASSET-CMNT                         PIC X(120).         01020000
01/23      05 WS-OPTN-CMNT-TXT                      PIC X(16).          01030000
06/04      05 WS-RESTRICTED-IND                     PIC X(01).          01040000
LRM015     05 WS-SEC-CDG-CD                         PIC X(01).          01050000
LRM026     05 WS-CRNCY-CD                           PIC X(03).          01060000
LRM030     05 WS-WHI-STTS-CD                        PIC X(01).          01061004
                                                                        01070000
LRM005 01  WS-DLTE-WORKAREA.                                            01071000
LRM005     05  WS-DLTE-CLIENT-NBR         PIC X(04).                    01072000
LRM005     05  WS-DLTE-DLVR-NBR           PIC X(04).                    01073000
LRM005     05  WS-DLTE-RCV-NBR            PIC X(04).                    01074000
LRM005     05  WS-DLTE-ACCT-DLVR-NBR      PIC X(20).                    01075000
LRM005     05  WS-DLTE-ACCT-RCV-NBR       PIC X(20).                    01076000
LRM005     05  WS-DLTE-ISIN               PIC X(09).                    01077000
LRM005     05  WS-DLTE-ACAT-CNTL-NBR      PIC X(14).                    01078000
LRM005     05  WS-DLTE-SLOC               PIC X(02).                    01079000
LRM005     05  WS-DLTE-CSH-MGN-SHRT-CD    PIC X(01).                    01080000
LRM005     05  WS-DLTE-STTLM-RSN-CD       PIC X(04).                    01090000
LRM005     05  WS-DLTE-CNTRY-CD           PIC X(02).                    01100000
                                                                        01110000
       01  WS-VINITAST-SW                           PIC X.              01120000
           88  UPDATE-VINITAST                      VALUE 'Y'.          01130000
           88  NO-UPDATE-VINITAST                   VALUE 'N'.          01140000
                                                                        01150000
       01  WS-SAVE-TRANS-TYPE                       PIC X.              01151000
       01  WS-ABEND-MESSAGE.                                            01151100
           05  FILLER                      PIC X(24) VALUE              01151200
             'ACAT10DC ABENDED ====> '.                                 01151300
           05  WS-ABCODE                   PIC X(04) VALUE SPACES.      01151400
                                                                        01151500
       01  WS-ERRL-DATA.                                                01151600
           05  REQUEST-TYPE                PIC X(01).                   01151700
               88  WRITE-ERROR-TO-LOG          VALUE 'W'.               01151800
           05  CALLING-TRAN-ID             PIC X(04).                   01151900
           05  CALLING-PROGRAM-ID          PIC X(08).                   01152000
           05  SQLCA-AREA                  PIC X(136).                  01153000
      *                                                                 01154000
       01  WK-SQLCODE.                                                  01155000
           05 VASSET-SQLCODE               PIC -999  VALUE SPACES.      01156000
           05 VINITAST-SQLCODE             PIC -999  VALUE SPACES.      01157000
           EXEC SQL                                                     01158000
                INCLUDE SQLCA                                           01159000
           END-EXEC                                                     01160000
      /                                                                 01170000
      *----------------------------------------------------------------*01180000
      *                  ACAT INITIAL ASSET TABLE                      *01190000
      *----------------------------------------------------------------*01200000
014700     EXEC SQL                                                     01210000
ET0002**       INCLUDE VINITAST                                         01220000
ET0002         INCLUDE ACTIAST                                          01230000
014900     END-EXEC.                                                    01240000
015000/                                                                 01241000
      *----------------------------------------------------------------*01242000
      *                      ACAT ASSET TABLE                          *01243000
      *----------------------------------------------------------------*01244000
014700     EXEC SQL                                                     01245000
PC             INCLUDE VASSET                                           01246000
014900     END-EXEC.                                                    01247000
015000/                                                                 01248000
01/20 *----------------------------------------------------------------*01249000
      *                      ACAT OPTION TABLE                         *01250000
      *----------------------------------------------------------------*01260000
           EXEC SQL                                                     01270000
               INCLUDE VOPTN                                            01280000
           END-EXEC.                                                    01290000
      /                                                                 01300000
01/20 *----------------------------------------------------------------*01310000
      *                  ACAT INITIAL OPTION TABLE                     *01320000
      *----------------------------------------------------------------*01330000
           EXEC SQL                                                     01340000
ET0002**       INCLUDE VINITOPN                                         01350000
ET0002         INCLUDE ACTIOPN                                          01360000
           END-EXEC.                                                    01370000
      /                                                                 01380000
      *----------------------------------------------------------------*01390000
ET0002*          FORWARD SEARCH ACTIAST ==> FWD_VISAT                  *01400000
      *----------------------------------------------------------------*01410000
           EXEC SQL                                                     01420000
                DECLARE FWD_VISAT  CURSOR FOR                           01430000
                SELECT                                                  01440000
                     DLVR_NBR                                           01450000
                   , RCV_NBR                                            01460000
                   , ACCT_DLVR_NBR                                      01470000
                   , ACCT_RCV_NBR                                       01480000
                   , ISIN_CNTRY_CD                                      01490000
                   , ISIN_SEC_ISSUE_CD                                  01500000
                   , ACAT_CONTROL_NBR                                   01510000
                   , SECURITY_ADP_NBR                                   01520000
                   , ASSET_SEQ_NBR                                      01530000
                   , TRANS_TYPE_CD                                      01540000
                   , CSH_MGN_SHRT_CD                                    01550000
                   , PSTN_CD                                            01560000
01/21              , OPTN_CTGY_CD                                       01570000
                   , WHI_CD                                             01580000
                   , STTLM_LCTN_CD                                      01590000
                   , ISIN_CNTRY_CD                                      01600000
                   , STTLM_RSN_CD                                       01610000
                   , NSCC_PEND_CD                                       01620000
LRM011             , NSCC_ACK_IND                                       01630000
                   , NSCC_WTHLD_CD                                      01640000
                   , ASSET_QTY                                          01650000
                   , ASSET_AMT                                          01660000
                   , ASSET_DESC_TXT                                     01670000
                   , ASSET_CMNT_TXT                                     01680000
LRM026             , CRNCY_CD                                           01690000
LRM030             , WHI_STTS_CD                                        01691002
ET0002          FROM ACTIAST                                            01700000
                   WHERE  CLIENT_NBR = :SV-CLIENT-NBR                   01710000
                     AND  DLVR_NBR = :SV-DLVR-NBR                       01720000
                     AND  RCV_NBR = :SV-RCV-NBR                         01730000
                     AND  ACCT_DLVR_NBR = :SV-ACCT-DLVR-NBR             01740000
                     AND  ACCT_RCV_NBR = :SV-ACCT-RCV-NBR               01741000
                     AND  ACAT_CONTROL_NBR = :SV-ACAT-CNTL-NBR          01742000
                     AND  NOT STTLM_LCTN_CD = '40'                      01743000
                     AND  NOT (STTLM_LCTN_CD = '45'   AND               01744000
                               STTLM_RSN_CD = 'SMA ')                   01745000
12/12                AND (ISIN_SEC_ISSUE_CD > :SV-SEC-ISSUE-CD          01746000
LRM026                OR (ISIN_SEC_ISSUE_CD = :SV-SEC-ISSUE-CD          01747000
LRM026                   AND STTLM_LCTN_CD = :SV-STTLM-LCTN-CD          01748000
LRM026                   AND CSH_MGN_SHRT_CD = :SV-CSH-MGN-SHRT-CD      01749000
LRM026                   AND CRNCY_CD > :SV-CRNCY-CD )                  01750000
12/12                 OR (ISIN_SEC_ISSUE_CD = :SV-SEC-ISSUE-CD          01760000
                         AND STTLM_LCTN_CD = :SV-STTLM-LCTN-CD          01770000
                         AND CSH_MGN_SHRT_CD > :SV-CSH-MGN-SHRT-CD)     01780000
12/12                 OR (ISIN_SEC_ISSUE_CD = :SV-SEC-ISSUE-CD          01790000
                         AND STTLM_LCTN_CD > :SV-STTLM-LCTN-CD))        01791000
                     ORDER BY DLVR_NBR, RCV_NBR,                        01792000
                              ACCT_DLVR_NBR, ACCT_RCV_NBR,              01793000
                              ACAT_CONTROL_NBR,                         01794000
                              ISIN_SEC_ISSUE_CD,                        01795000
                              STTLM_LCTN_CD,                            01796000
                              CSH_MGN_SHRT_CD,                          01797000
LRM026                        CRNCY_CD                                  01798000
           END-EXEC.                                                    01799000
12/12 ***             OR  (ISIN_SEC_ISSUE_CD = :SV-SEC-ISSUE-CD  AND    01800000
      ***                  NOT ASSET_SEQ_NBR < :SV-INITAST-SEQ-NBR))    01810000
      ****           AND  NOT ISIN_SEC_ISSUE_CD = '         '           01820000
      ****                    ISIN_SEC_ISSUE_CD, ASSET_SEQ_NBR          01830000
      ***            AND   ISIN_SEC_ISSUE_CD > :SV-SEC-ISSUE-CD))       01840000
      *              AND  NOT (STTLM_LCTN_CD = '45'   AND               01850000
      *                        STTLM_RSN_CD = 'SMA ')                   01860000
      *              AND (ISIN_SEC_ISSUE_CD > :SV-SEC-ISSUE-CD          01870000
      *               OR  (ISIN_SEC_ISSUE_CD = :SV-SEC-ISSUE-CD  AND    01880000
      *                    ASSET_SEQ_NBR > :SV-INITAST-SEQ-NBR))        01890000
      /                                                                 01900000
      *----------------------------------------------------------------*01910000
ET0002*         BACKWARD SEARCH ACTIAST ==> BWD_VISAT                  *01920000
      *----------------------------------------------------------------*01930000
           EXEC SQL                                                     01940000
                DECLARE BWD_VISAT  CURSOR FOR                           01950000
                SELECT                                                  01960000
                     DLVR_NBR                                           01970000
                   , RCV_NBR                                            01980000
                   , ACCT_DLVR_NBR                                      01990000
                   , ACCT_RCV_NBR                                       02000000
                   , ISIN_CNTRY_CD                                      02010000
                   , ISIN_SEC_ISSUE_CD                                  02020000
                   , ACAT_CONTROL_NBR                                   02030000
                   , SECURITY_ADP_NBR                                   02040000
                   , ASSET_SEQ_NBR                                      02050000
                   , TRANS_TYPE_CD                                      02060000
                   , CSH_MGN_SHRT_CD                                    02070000
                   , PSTN_CD                                            02080000
01/21              , OPTN_CTGY_CD                                       02090000
                   , WHI_CD                                             02100000
                   , STTLM_LCTN_CD                                      02110000
                   , ISIN_CNTRY_CD                                      02120000
                   , STTLM_RSN_CD                                       02130000
                   , NSCC_PEND_CD                                       02140000
LRM011             , NSCC_ACK_IND                                       02150000
                   , NSCC_WTHLD_CD                                      02160000
                   , ASSET_QTY                                          02170000
                   , ASSET_AMT                                          02180000
                   , ASSET_DESC_TXT                                     02190000
                   , ASSET_CMNT_TXT                                     02200000
LRM026             , CRNCY_CD                                           02210000
LRM030             , WHI_STTS_CD                                        02211002
ET0002          FROM ACTIAST                                            02220000
                   WHERE  CLIENT_NBR = :SV-CLIENT-NBR                   02230000
                     AND  DLVR_NBR = :SV-DLVR-NBR                       02240000
                     AND  RCV_NBR = :SV-RCV-NBR                         02250000
                     AND  ACCT_DLVR_NBR = :SV-ACCT-DLVR-NBR             02260000
                     AND  ACCT_RCV_NBR = :SV-ACCT-RCV-NBR               02270000
                     AND  ACAT_CONTROL_NBR = :SV-ACAT-CNTL-NBR          02280000
                     AND  NOT STTLM_LCTN_CD = '40'                      02290000
                     AND  NOT (STTLM_LCTN_CD = '45'   AND               02300000
                               STTLM_RSN_CD = 'SMA ')                   02310000
12/12                AND (ISIN_SEC_ISSUE_CD < :SV-SEC-ISSUE-CD          02320000
LRM026                OR (ISIN_SEC_ISSUE_CD = :SV-SEC-ISSUE-CD          02330000
LRM026                   AND STTLM_LCTN_CD = :SV-STTLM-LCTN-CD          02340000
LRM026                   AND CSH_MGN_SHRT_CD = :SV-CSH-MGN-SHRT-CD      02350000
LRM026                   AND CRNCY_CD < :SV-CRNCY-CD )                  02360000
12/12                 OR (ISIN_SEC_ISSUE_CD = :SV-SEC-ISSUE-CD          02370000
                         AND STTLM_LCTN_CD = :SV-STTLM-LCTN-CD          02380000
                         AND CSH_MGN_SHRT_CD < :SV-CSH-MGN-SHRT-CD)     02390000
12/12                 OR (ISIN_SEC_ISSUE_CD = :SV-SEC-ISSUE-CD          02400000
                         AND STTLM_LCTN_CD < :SV-STTLM-LCTN-CD))        02410000
                     ORDER BY DLVR_NBR  DESC, RCV_NBR  DESC,            02420000
                              ACCT_DLVR_NBR  DESC,                      02430000
                              ACCT_RCV_NBR   DESC,                      02431000
                              ACAT_CONTROL_NBR  DESC,                   02432000
                              ISIN_SEC_ISSUE_CD DESC,                   02433000
                              STTLM_LCTN_CD DESC,                       02434000
                              CSH_MGN_SHRT_CD DESC,                     02435000
LRM026                        CRNCY_CD DESC                             02436000
           END-EXEC.                                                    02437000
12/12 *               OR  (ISIN_SEC_ISSUE_CD = :SV-SEC-ISSUE-CD  AND    02438000
      *                    ASSET_SEQ_NBR < :SV-INITAST-SEQ-NBR))        02439000
      *              AND  NOT ISIN_SEC_ISSUE_CD = '         '           02440000
      *              AND  ISIN_SEC_ISSUE_CD < :SV-SEC-ISSUE-CD)         02450000
      *                       ISIN_SEC_ISSUE_CD DESC,                   02460000
      /                                                                 02470000
      *----------------------------------------------------------------*02480000
      *          FORWARD SEARCH VASSET   ==> FWD_VASST                 *02490000
      *----------------------------------------------------------------*02500000
           EXEC SQL                                                     02510000
                DECLARE FWD_VASST  CURSOR FOR                           02520000
                SELECT                                                  02530000
                     ASSET_SEQ_NBR                                      02540000
                   , ISIN_CNTRY_CD                                      02550000
                   , ISIN_SEC_ISSUE_CD                                  02560000
                   , ISIN_SEC_CDG_CD                                    02570000
LRM026             , CRNCY_CD                                           02580000
                   , SECURITY_ADP_NBR                                   02590000
                   , TRANS_TYPE_CD                                      02600000
                   , CSH_MGN_SHRT_CD                                    02610000
                   , PSTN_CD                                            02620000
01/21              , OPTN_CTGY_CD                                       02630000
                   , WHI_CD                                             02640000
                   , STTLM_LCTN_CD                                      02650000
                   , STTLM_RSN_CD                                       02660000
                   , NSCC_PEND_CD                                       02670000
                   , ASSET_QTY                                          02680000
                   , ASSET_AMT                                          02690000
                   , ASSET_DESC_TXT                                     02700000
                   , ASSET_CMNT_TXT                                     02710000
06/04              , RESTRICTED_IND                                     02720000
                FROM VASSET                                             02730000
                   WHERE  CLIENT_NBR = :SV-CLIENT-NBR                   02740000
                     AND  ACAT_CONTROL_NBR = :SV-ACAT-CNTL-NBR          02750000
                     AND  ASSET_SEQ_NBR > :SV-ASSET-SEQ-NBR             02751000
                     AND  NOT STTLM_LCTN_CD = '40'                      02752000
                     AND  NOT (STTLM_LCTN_CD = '45'   AND               02753000
                               STTLM_RSN_CD = 'SMA ')                   02754000
                     ORDER BY ASSET_SEQ_NBR                             02755000
           END-EXEC.                                                    02756000
      /                                                                 02757000
      *----------------------------------------------------------------*02758000
      *         BACKWARD SEARCH VASSET   ==> BWD_VASST                 *02759000
      *----------------------------------------------------------------*02760000
           EXEC SQL                                                     02770000
                DECLARE BWD_VASST  CURSOR FOR                           02780000
                SELECT                                                  02790000
                     ASSET_SEQ_NBR                                      02800000
                   , ISIN_CNTRY_CD                                      02810000
                   , ISIN_SEC_ISSUE_CD                                  02820000
                   , ISIN_SEC_CDG_CD                                    02830000
LRM026             , CRNCY_CD                                           02840000
                   , SECURITY_ADP_NBR                                   02850000
                   , TRANS_TYPE_CD                                      02860000
                   , CSH_MGN_SHRT_CD                                    02870000
                   , PSTN_CD                                            02880000
01/21              , OPTN_CTGY_CD                                       02890000
                   , WHI_CD                                             02900000
                   , STTLM_LCTN_CD                                      02910000
                   , STTLM_RSN_CD                                       02920000
                   , NSCC_PEND_CD                                       02930000
                   , ASSET_QTY                                          02940000
                   , ASSET_AMT                                          02950000
                   , ASSET_DESC_TXT                                     02960000
                   , ASSET_CMNT_TXT                                     02970000
06/04              , RESTRICTED_IND                                     02980000
                FROM VASSET                                             02990000
                   WHERE  CLIENT_NBR = :SV-CLIENT-NBR                   03000000
                     AND  ACAT_CONTROL_NBR = :SV-ACAT-CNTL-NBR          03010000
                     AND  ASSET_SEQ_NBR < :SV-ASSET-SEQ-NBR             03020000
                     AND  NOT STTLM_LCTN_CD = '40'                      03030000
                     AND  NOT (STTLM_LCTN_CD = '45'   AND               03040000
                               STTLM_RSN_CD = 'SMA ')                   03050000
                     ORDER BY ASSET_SEQ_NBR  DESC                       03060000
           END-EXEC.                                                    03070000
      /                                                                 03080000
LRM015*----------------------------------------------------------------*03090000
LRM015*      VASSET CURSOR TO READ THRU ALL ASSET PER TRANSFER         *03100000
LRM015*----------------------------------------------------------------*03110000
LRM015     EXEC SQL                                                     03120000
LRM015          DECLARE CSR_VASST  CURSOR FOR                           03130000
LRM015          SELECT                                                  03140000
LRM015               ASSET_SEQ_NBR                                      03150000
LRM015             , ISIN_CNTRY_CD                                      03160000
LRM015             , ISIN_SEC_ISSUE_CD                                  03170000
LRM015             , ISIN_SEC_CDG_CD                                    03180000
LRM015             , SECURITY_ADP_NBR                                   03190000
LRM015             , TRANS_TYPE_CD                                      03200000
LRM015             , CSH_MGN_SHRT_CD                                    03210000
LRM015             , PSTN_CD                                            03220000
LRM015             , OPTN_CTGY_CD                                       03230000
LRM015             , WHI_CD                                             03240000
LRM015             , STTLM_LCTN_CD                                      03250000
LRM015             , STTLM_RSN_CD                                       03251000
LRM015             , ASSET_QTY                                          03252000
LRM015             , ASSET_AMT                                          03253000
LRM015             , ASSET_DESC_TXT                                     03254000
LRM015          FROM VASSET                                             03255000
LRM015             WHERE  CLIENT_NBR = :SV-CLIENT-NBR                   03256000
LRM015               AND  ACAT_CONTROL_NBR = :SV-ACAT-CNTL-NBR          03257000
LRM015     END-EXEC.                                                    03258000
                                                                        03259000
      /                                                                 03259100
      *----------------------------------------------------------------*03259200
ET0002*         SUBMIT/UPDATE ACTIAST   ==> SUBY_CSR                   *03259300
      *----------------------------------------------------------------*03259400
           EXEC SQL                                                     03259500
                DECLARE SUBY_CSR   CURSOR FOR                           03259600
                SELECT                                                  03259700
                     NSCC_PEND_CD                                       03259800
                    ,UPDT_TMSTP                                         03259900
                    ,PRGM_NM                                            03260000
ET0002          FROM ACTIAST                                            03261000
                   WHERE (CLIENT_NBR = :SV-CLIENT-NBR                   03262000
                     AND  DLVR_NBR = :SV-DLVR-NBR                       03263000
                     AND  RCV_NBR = :SV-RCV-NBR                         03264000
                     AND  ACCT_DLVR_NBR = :SV-ACCT-DLVR-NBR             03265000
                     AND  ACCT_RCV_NBR = :SV-ACCT-RCV-NBR               03266000
                     AND  ACAT_CONTROL_NBR  = :SV-ACAT-CNTL-NBR         03267000
                     AND  NOT NSCC_WTHLD_CD =  'W')                     03268000
                   FOR UPDATE OF NSCC_PEND_CD                           03269000
                                ,UPDT_TMSTP                             03270000
                                ,PRGM_NM                                03280000
LRM004                          ,CICS_SGNON_ID                          03290000
LRM011                          ,NSCC_ACK_IND                           03300000
LRM016                          ,CICS_NET_NM                            03310000
LRM016                          ,TPSCRT_USR_ID                          03320000
LRM016                          ,TPSCRT_USR_NM                          03330000
LRM016                          ,CICS_TERM_ID_CD                        03340000
           END-EXEC.                                                    03350000
      /                                                                 03360000
      *----------------------------------------------------------------*03370000
ET0002*       UNSUBMIT/UPDATE ACTIAST   ==> SUBN_CSR                   *03380000
      *----------------------------------------------------------------*03390000
           EXEC SQL                                                     03400000
                DECLARE SUBN_CSR   CURSOR FOR                           03410000
                SELECT                                                  03420000
                     NSCC_PEND_CD                                       03430000
                    ,UPDT_TMSTP                                         03440000
                    ,PRGM_NM                                            03450000
ET0002          FROM ACTIAST                                            03460000
                   WHERE (CLIENT_NBR = :SV-CLIENT-NBR                   03470000
                     AND  DLVR_NBR = :SV-DLVR-NBR                       03480000
                     AND  RCV_NBR = :SV-RCV-NBR                         03490000
                     AND  ACCT_DLVR_NBR = :SV-ACCT-DLVR-NBR             03500000
                     AND  ACCT_RCV_NBR = :SV-ACCT-RCV-NBR               03510000
                     AND  ACAT_CONTROL_NBR  = :SV-ACAT-CNTL-NBR         03520000
                     AND  NOT NSCC_WTHLD_CD =  'W')                     03530000
                   FOR UPDATE OF NSCC_PEND_CD                           03540000
                                ,UPDT_TMSTP                             03550000
                                ,PRGM_NM                                03560000
LRM004                          ,CICS_SGNON_ID                          03570000
LRM011                          ,NSCC_ACK_IND                           03580000
LRM025                          ,CICS_NET_NM                            03581000
LRM025                          ,TPSCRT_USR_ID                          03582000
LRM025                          ,TPSCRT_USR_NM                          03583000
LRM025                          ,CICS_TERM_ID_CD                        03584000
           END-EXEC.                                                    03585000
      /                                                                 03586000
      **********************************************************        03587000
      *****      L I N K A G E  S E C T I O N              *****        03588000
      **********************************************************        03589000
       LINKAGE SECTION.                                                 03590000
                                                                        03600000
       01  DFHCOMMAREA.                                                 03610000
      *01  ACAT10IO-COMM-AREA.                                          03620000
           COPY ACAT10IO.                                               03630000
      /                                                                 03640000
      **********************************************************        03650000
      *****   P R O C E D U R E   D I V I S I O N           *****       03660000
      **********************************************************        03670000
       PROCEDURE DIVISION.                                              03680000
                                                                        03690000
       0000-MAIN-RTN.                                                   03700000
                                                                        03710000
      *    MOVE EIBCALEN TO  WS-EIBCALEN.                               03720000
           IF EIBCALEN > +0                                             03730000
              CONTINUE                                                  03740000
           ELSE                                                         03750000
              EXEC CICS RETURN END-EXEC                                 03760000
           END-IF.                                                      03770000
      *                                                                 03780000
           MOVE ACAT10IO-SV-CLIENT-NBR      TO  SV-CLIENT-NBR.          03790000
           MOVE ACAT10IO-SV-ACAT-CNTL-NBR   TO  SV-ACAT-CNTL-NBR.       03800000
           MOVE ACAT10IO-SV-ASSET-SEQ-NBR   TO  SV-ASSET-SEQ-NBR.       03810000
           MOVE ACAT10IO-SV-INITAST-SEQ-NBR TO  SV-INITAST-SEQ-NBR.     03820000
01/25      IF ACAT10IO-TIF-ACCT-NEW                                     03830000
              MOVE ACAT10IO-O-DLVR-NBR      TO  SV-DLVR-NBR             03840000
              MOVE ACAT10IO-O-RCV-NBR       TO  SV-RCV-NBR              03850000
              MOVE ACAT10IO-O-ACCT-DLVR-NBR TO  SV-ACCT-DLVR-NBR        03860000
              MOVE ACAT10IO-O-ACCT-RCV-NBR  TO  SV-ACCT-RCV-NBR         03870000
           ELSE                                                         03880000
              MOVE ACAT10IO-SV-DLVR-NBR     TO  SV-DLVR-NBR             03890000
              MOVE ACAT10IO-SV-RCV-NBR      TO  SV-RCV-NBR              03900000
              MOVE ACAT10IO-SV-ACCT-DLVR-NBR TO SV-ACCT-DLVR-NBR        03910000
              MOVE ACAT10IO-SV-ACCT-RCV-NBR TO  SV-ACCT-RCV-NBR         03920000
01/25      END-IF.                                                      03930000
           MOVE ACAT10IO-SV-STTLM-LCTN-CD   TO  SV-STTLM-LCTN-CD.       03940000
           MOVE ACAT10IO-SV-CNTRY-CD        TO  SV-CNTRY-CD.            03950000
           MOVE ACAT10IO-SV-SEC-ISSUE-CD    TO  SV-SEC-ISSUE-CD.        03960000
           MOVE ACAT10IO-SV-SEC-CDG-CD      TO  SV-SEC-CDG-CD.          03970000
LRM026     MOVE ACAT10IO-SV-CRNCY-CD        TO  SV-CRNCY-CD.            03980000
           MOVE ACAT10IO-CSH-MGN-SHRT-CD    TO  SV-CSH-MGN-SHRT-CD.     03990000
           MOVE ACAT10IO-VASSET-COUNT       TO  WS-VASSET-COUNT.        04000000
           MOVE ACAT10IO-VINITAST-COUNT     TO  WS-VINITAST-COUNT.      04010000
01/18      MOVE +0   TO WS-BAL01-COMP2, WS-BAL02-COMP2, WS-BAL05-COMP2, 04020000
01/18                   WS-SMA-COMP2, WS-QTY-COMP2, WS-AMT-COMP2.       04030000
      *                                                                 04031000
           IF ACAT10IO-DLTE-VINITAST                                    04032000
              PERFORM 0800-DLTE-VINITAST THRU 0800-EXIT                 04033000
           ELSE                                                         04034000
              IF ACAT10IO-ISRT-VINITAST OR                              04035000
                 ACAT10IO-UPDT-VINITAST                                 04036000
                 PERFORM 0300-PROCESS-CHG-RQST THRU 0300-EXIT           04037000
              ELSE                                                      04038000
                 IF ACAT10IO-SRCH-VINITAST-FWD                          04039000
                    PERFORM 0100-SRCH-VINITAST-FWD                      04040000
                 ELSE                                                   04050000
                    IF ACAT10IO-SRCH-VINITAST-BWD                       04060000
                       PERFORM 0200-SRCH-VINITAST-BWD                   04070000
                    ELSE                                                04080000
                       IF ACAT10IO-SRCH-VASSET-FWD                      04090000
                          PERFORM 0900-SRCH-VASSET-FWD                  04100000
                       ELSE                                             04110000
                          IF ACAT10IO-SRCH-VASSET-BWD                   04120000
                             PERFORM 0910-SRCH-VASSET-BWD               04130000
LRM015                    ELSE                                          04140000
LRM015                       IF ACAT10IO-DELETE-ALL-ASSETS              04150000
LRM015                       OR ACAT10IO-DELETE-ALL-ASSETS-RVS          04160000
LRM015                          PERFORM 3000-DELETE-ALL-ASSETS-RTN      04170000
LRM015                             THRU 3000-EXIT                       04180000
LRM015                       END-IF                                     04190000
                          END-IF                                        04200000
                       END-IF                                           04210000
                    END-IF                                              04220000
                 END-IF                                                 04230000
              END-IF                                                    04240000
           END-IF.                                                      04250000
01/26 ****                                                              04260000
01/26      IF ACAT10IO-MBAL01 > SPACE   AND                             04270000
              ACAT10IO-BAL01-UPDATED                                    04280000
              MOVE WS-BAL01-COMP2 TO ACAT10IO-BAL01, ACAT10IO-BAL01-9   04290000
           ELSE                                                         04300000
              MOVE LOW-VALUES TO ACAT10IO-MBAL01                        04301000
           END-IF.                                                      04302000
                                                                        04303000
01/26      IF ACAT10IO-MBAL02 > SPACE  AND                              04304000
              ACAT10IO-BAL02-UPDATED                                    04305000
              MOVE WS-BAL02-COMP2 TO ACAT10IO-BAL02, ACAT10IO-BAL02-9   04306000
           ELSE                                                         04307000
              MOVE LOW-VALUES TO ACAT10IO-MBAL02                        04308000
           END-IF.                                                      04309000
                                                                        04310000
01/26      IF ACAT10IO-MBAL05 > SPACE  AND                              04320000
              ACAT10IO-BAL05-UPDATED                                    04330000
              MOVE WS-BAL05-COMP2 TO ACAT10IO-BAL05, ACAT10IO-BAL05-9   04340000
           ELSE                                                         04350000
              MOVE LOW-VALUES TO ACAT10IO-MBAL05                        04360000
           END-IF.                                                      04370000
                                                                        04380000
01/26      IF ACAT10IO-MSMA > SPACE   AND                               04390000
              ACAT10IO-SMA-UPDATED                                      04400000
              MOVE WS-SMA-COMP2   TO ACAT10IO-SMA, ACAT10IO-SMA-9       04410000
           ELSE                                                         04420000
              MOVE LOW-VALUES TO ACAT10IO-MSMA                          04430000
           END-IF.                                                      04440000
                                                                        04450000
01/24      IF ACAT10IO-MQTY > SPACE   AND                               04460000
              ACAT10IO-QTY-UPDATED                                      04470000
              MOVE WS-QTY-COMP2 TO ACAT10IO-ASSET-QTY, ACAT10IO-QTY-9   04480000
           ELSE                                                         04490000
              MOVE LOW-VALUES TO ACAT10IO-MQTY                          04500000
           END-IF.                                                      04510000
                                                                        04520000
           IF ACAT10IO-MAMT > SPACE   AND                               04530000
              ACAT10IO-AMT-UPDATED                                      04540000
              MOVE WS-AMT-COMP2 TO ACAT10IO-ASSET-AMT, ACAT10IO-AMT-9   04550000
           ELSE                                                         04560000
              MOVE LOW-VALUES TO ACAT10IO-MAMT                          04570000
01/24      END-IF.                                                      04580000
                                                                        04590000
01/26      IF ACAT10IO-BAL01-UPDATED   AND                              04600000
01/26         ACAT10IO-BAL02-UPDATED   AND                              04610000
01/26         ACAT10IO-BAL05-UPDATED   AND                              04620000
              ACAT10IO-SMA-UPDATED                                      04630000
              MOVE 'CASH/MARGIN/SHORT/SMA BALANCES WERE ALL MODIFIED'   04640000
              TO WS-RETURN-MSG                                          04650000
           ELSE                                                         04660000
01/26         IF ACAT10IO-BAL01-UPDATED                                 04670000
                 MOVE '                 CASH BALANCE WAS MODIFIED    '  04680000
                 TO WS-RETURN-MSG                                       04690000
              ELSE                                                      04691000
01/26            IF ACAT10IO-BAL02-UPDATED                              04692000
                   MOVE '               MARGIN BALANCE WAS MODIFIED  '  04693000
                    TO WS-RETURN-MSG                                    04694000
                 ELSE                                                   04695000
01/26               IF ACAT10IO-BAL05-UPDATED                           04696000
                       MOVE '              SHORT BALANCE WAS MODIFIED  '04697000
                       TO WS-RETURN-MSG                                 04698000
                    ELSE                                                04699000
01/26               IF ACAT10IO-SMA-UPDATED                             04700000
                       MOVE '                SMA BALANCE WAS MODIFIED  '04710000
                       TO WS-RETURN-MSG                                 04720000
                    END-IF                                              04730000
                 END-IF                                                 04740000
              END-IF                                                    04750000
           END-IF.                                                      04760000
01/26      IF ACAT10IO-QTY-UPDATED                                      04770000
              MOVE '                  ASSET QUANTITY WAS MODIFIED' TO   04780000
              WS-RETURN-MSG                                             04790000
           END-IF.                                                      04800000
           IF ACAT10IO-AMT-UPDATED                                      04810000
              MOVE '                    ASSET AMOUNT WAS MODIFIED' TO   04820000
              WS-RETURN-MSG                                             04830000
           END-IF.                                                      04840000
01/26      IF ACAT10IO-QTY-UPDATED  AND                                 04850000
              ACAT10IO-AMT-UPDATED                                      04860000
              MOVE ' ASSET QUANTITY AND AMOUNT WERE MODIFIED' TO        04870000
              WS-RETURN-MSG                                             04880000
           END-IF.                                                      04890000
01/26      IF (ACAT10IO-BAL01-UPDATED OR                                04900000
01/26         ACAT10IO-BAL02-UPDATED  OR                                04910000
01/26         ACAT10IO-BAL05-UPDATED  OR                                04920000
              ACAT10IO-SMA-UPDATED )    AND                             04930000
01/26         (ACAT10IO-QTY-UPDATED   OR                                04940000
              ACAT10IO-AMT-UPDATED)                                     04950000
              MOVE '            BALANCES/ASSET WERE MODIFIED ' TO       04960000
              WS-RETURN-MSG                                             04970000
           END-IF.                                                      04980000
01/26      IF ACAT10IO-BAL01-UPDATED   AND                              04990000
01/26         ACAT10IO-BAL02-UPDATED   AND                              05000000
01/26         ACAT10IO-BAL05-UPDATED   AND                              05010000
              ACAT10IO-SMA-UPDATED     AND                              05020000
01/26         ACAT10IO-QTY-UPDATED     AND                              05030000
              ACAT10IO-AMT-UPDATED                                      05040000
              MOVE 'ALL BALANCES AND QTY/AMT FIELDS WERE MODIFIED ' TO  05050000
              WS-RETURN-MSG                                             05060000
           END-IF.                                                      05070000
01/26 ****                                                              05080000
           IF ACAT10IO-FIRST-TIME                                       05090000
              MOVE  ' '    TO  ACAT10IO-FIRST-TIME-SW                   05100000
           END-IF.                                                      05110000
                                                                        05120000
      *    MOVE SV-ASSET-SEQ-NBR    TO  ACAT10IO-SV-ASSET-SEQ-NBR.      05130000
      *    MOVE SV-INITAST-SEQ-NBR  TO  ACAT10IO-SV-INITAST-SEQ-NBR.    05140000
           MOVE WS-VINITAST-COUNT   TO  ACAT10IO-VINITAST-COUNT.        05150000
           MOVE WS-VASSET-COUNT     TO  ACAT10IO-VASSET-COUNT.          05160000
           MOVE WS-RETURN-MSG       TO  ACAT10IO-RETURN-MSG.            05170000
           MOVE SV-STTLM-LCTN-CD    TO  ACAT10IO-SV-STTLM-LCTN-CD.      05180000
           MOVE SV-CNTRY-CD         TO  ACAT10IO-SV-CNTRY-CD.           05190000
           MOVE SV-SEC-ISSUE-CD     TO  ACAT10IO-SV-SEC-ISSUE-CD.       05200000
           MOVE SV-SEC-CDG-CD       TO  ACAT10IO-SV-SEC-CDG-CD.         05210000
LRM026     MOVE SV-CRNCY-CD         TO  ACAT10IO-SV-CRNCY-CD            05220000
LRM026                                  ACAT10IO-CRNCY-CD.              05230000
                                                                        05240000
           EXEC CICS RETURN END-EXEC.                                   05250000
      /                                                                 05260000
      *                                                                 05270000
01/04  0050-MOVE-ASSET-DATA.                                            05280000
           MOVE WS-SEC-NBR          TO ACAT10IO-SEC-NBR.                05290000
           MOVE WS-ADP-NBR          TO ACAT10IO-ADP-NBR.                05300000
           MOVE WS-TRANS-TYPE-CD    TO ACAT10IO-TRANS-TYPE-CD.          05310000
           MOVE WS-CSH-MGN-SHRT-CD  TO ACAT10IO-CSH-MGN-SHRT-CD.        05320000
           MOVE WS-PSTN-CD          TO ACAT10IO-PSTN-CD.                05330000
01/21      MOVE WS-OPTN-CTGY-CD     TO ACAT10IO-OPTN-CTGY-CD.           05340000
           MOVE WS-OPT-BS-CD        TO ACAT10IO-OPT-BS-CD               05350000
           MOVE WS-WHEN-ISSUED      TO ACAT10IO-WHEN-ISSUED.            05360000
           MOVE WS-STTLM-LCTN-CD    TO ACAT10IO-STTLM-LCTN-CD.          05370000
           MOVE WS-CNTRY-CD         TO ACAT10IO-CNTRY-CD                05380000
           MOVE WS-STTLM-RSN-CD     TO ACAT10IO-STTLM-RSN-CD.           05390000
           MOVE WS-INITAST-NSCC-PEND-CD                                 05400000
                                    TO ACAT10IO-VINITAST-NSCC-PEND-CD.  05410000
LRM011     MOVE WS-INITAST-NSCC-ACK-IND                                 05420000
LRM011                              TO ACAT10IO-VINITAST-NSCC-ACK-IND.  05430000
           MOVE WS-NSCC-WTHLD-CD    TO ACAT10IO-NSCC-WTHLD-CD.          05440000
06/04      MOVE WS-RESTRICTED-IND   TO ACAT10IO-RESTRICTED-IND.         05450000
LRM030     MOVE WS-WHI-STTS-CD      TO ACAT10IO-WHI-STTS-CD             05451002
01/05 ***  IF ACAT10IO-MCD = 'C'         AND                            05460000
     ****     ACAT10IO-BAL01-9 > +0                                     05470000
           IF ACAT10IO-MBAL01 > SPACES                                  05480000
              MOVE ACAT10IO-BAL01-9     TO ACAT10IO-BAL01               05490000
           END-IF.                                                      05500000
01/05 ***  IF ACAT10IO-MCD = 'C'         AND                            05510000
NEW   ***  IF ACAT10IO-BAL02-9 > +0                                     05520000
NEW        IF ACAT10IO-MBAL02  > SPACES                                 05530000
              MOVE ACAT10IO-BAL02-9     TO ACAT10IO-BAL02               05540000
           END-IF.                                                      05550000
01/05 ***  IF ACAT10IO-MCD = 'C'         AND                            05560000
NEW   **** IF ACAT10IO-BAL05-9  > +0                                    05570000
NEW        IF ACAT10IO-MBAL05   > SPACES                                05580000
              MOVE ACAT10IO-BAL05-9     TO ACAT10IO-BAL05               05590000
           END-IF.                                                      05600000
01/05 ***  IF ACAT10IO-MCD = 'C'         AND                            05610000
NEW   ***  IF ACAT10IO-SMA-9 > +0                                       05620000
NEW        IF ACAT10IO-MSMA  > SPACES                                   05630000
              MOVE ACAT10IO-SMA-9     TO ACAT10IO-SMA                   05640000
           END-IF.                                                      05650000
01/05 **** IF ACAT10IO-MCD = 'C'         AND                            05660000
NEW   ***  IF ACAT10IO-QTY-9 > +0                                       05670000
NEW        IF ACAT10IO-MQTY  > SPACES                                   05680000
              MOVE ACAT10IO-QTY-9     TO ACAT10IO-ASSET-QTY             05690000
           ELSE                                                         05700000
              MOVE WS-ASSET-QTY       TO ACAT10IO-ASSET-QTY             05710000
           END-IF.                                                      05720000
01/05 **** IF ACAT10IO-MCD = 'C'         AND                            05730000
NEW  ****  IF ACAT10IO-AMT-9 > +0                                       05740000
NEW        IF ACAT10IO-MAMT  > SPACES                                   05750000
              MOVE ACAT10IO-AMT-9     TO ACAT10IO-ASSET-AMT             05760000
           ELSE                                                         05770000
              MOVE WS-ASSET-AMT       TO ACAT10IO-ASSET-AMT             05780000
           END-IF.                                                      05790000
           MOVE WS-ASSET-DESC       TO ACAT10IO-ASSET-DESC.             05800000
           MOVE WS-ASSET-CMNT       TO ACAT10IO-ASSET-CMNT.             05800100
                                                                        05800200
01/04  0050-EXIT.                                                       05800300
           EXIT.                                                        05800400
      /                                                                 05800500
      *                                                                 05800600
01/04  0055-MOVE-ASSET-FROM-TSQ.                                        05800700
           MOVE ACAT10IO-SEC-NBR       TO WS-SEC-NBR.                   05800800
           MOVE ACAT10IO-ADP-NBR       TO WS-ADP-NBR.                   05800900
           MOVE ACAT10IO-TRANS-TYPE-CD TO WS-TRANS-TYPE-CD.             05801000
           MOVE ACAT10IO-CSH-MGN-SHRT-CD  TO WS-CSH-MGN-SHRT-CD.        05802000
           MOVE ACAT10IO-PSTN-CD       TO WS-PSTN-CD.                   05803000
01/21****  MOVE ACAT10IO-OPTN-CTGY-CD  TO WS-OPTN-CTGY-CD.              05804000
06/04      MOVE ACAT10IO-RESTRICTED-IND TO WS-RESTRICTED-IND.           05805000
           MOVE ACAT10IO-WHEN-ISSUED   TO WS-WHEN-ISSUED.               05806000
           MOVE ACAT10IO-STTLM-LCTN-CD TO WS-STTLM-LCTN-CD.             05807000
           MOVE ACAT10IO-CNTRY-CD      TO WS-CNTRY-CD                   05808000
           MOVE ACAT10IO-STTLM-RSN-CD  TO WS-STTLM-RSN-CD.              05809000
           MOVE ACAT10IO-VINITAST-NSCC-PEND-CD                          05810000
                                       TO WS-INITAST-NSCC-PEND-CD.      05820000
LRM011     MOVE ACAT10IO-VINITAST-NSCC-ACK-IND                          05830000
LRM011                                 TO WS-INITAST-NSCC-ACK-IND.      05840000
           MOVE ACAT10IO-NSCC-WTHLD-CD TO WS-NSCC-WTHLD-CD.             05850000
           MOVE ACAT10IO-ASSET-QTY     TO WS-ASSET-QTY.                 05860000
           MOVE ACAT10IO-ASSET-AMT     TO WS-ASSET-AMT.                 05870000
           MOVE ACAT10IO-ASSET-DESC    TO WS-ASSET-DESC.                05880000
           MOVE ACAT10IO-ASSET-CMNT    TO WS-ASSET-CMNT.                05890000
                                                                        05900000
01/04  0055-EXIT.                                                       05910000
           EXIT.                                                        05920000
      /                                                                 05930000
       0100-SRCH-VINITAST-FWD.                                          05940000
      *                                                                 05950000
           PERFORM 0110-OPEN-FWD-CURSOR.                                05960000
093400     EVALUATE SQLCODE                                             05970000
093500          WHEN +0                                                 05980000
                     PERFORM 0120-FETCH-FWD-CURSOR                      05990000
                WHEN +100                                               06000000
                     SET ACAT10IO-VINITAST-NOT-FOUND TO TRUE            06010000
                     SET ACAT10IO-VINITAST-NOT-FETCHED TO TRUE          06020000
                     MOVE '  OPEN FWD_VISAT CURSOR ERROR'               06030000
                      TO WS-RETURN-MSG                                  06040000
                     PERFORM 0130-CLOSE-FWD-CURSOR                      06050000
094000          WHEN OTHER                                              06060000
                     SET ACAT10IO-VINITAST-NOT-FOUND TO TRUE            06070000
                     SET ACAT10IO-VINITAST-NOT-FETCHED TO TRUE          06080000
                     MOVE SPACES TO ACAT10IO-VINITAST-SW                06090000
                     PERFORM 9000-WRITE-TO-CICS-LOG                     06100000
                     PERFORM 9500-RETURN-DB2-ERROR                      06110000
094200      END-EVALUATE.                                               06120000
      *                                                                 06130000
                                                                        06140000
       0110-OPEN-FWD-CURSOR.                                            06150000
                                                                        06160000
           IF EIBAID                    = '7' OR                        06170000
                                          '8'                           06180000
              MOVE SPACES              TO SV-SEC-ISSUE-CD               06190000
                                          SV-STTLM-LCTN-CD              06200000
                                          SV-CSH-MGN-SHRT-CD            06210000
           END-IF                                                       06220000
                                                                        06230000
           EXEC SQL                                                     06240000
                OPEN FWD_VISAT                                          06250000
           END-EXEC.                                                    06260000
      *                                                                 06270000
       0120-FETCH-FWD-CURSOR.                                           06280000
                                                                        06290000
           EXEC SQL                                                     06300000
                FETCH  FWD_VISAT                                        06310000
                INTO                                                    06320000
                   :WS-DLVR-NBR                                         06330000
                  ,:WS-RCV-NBR                                          06340000
                  ,:WS-ACCT-DLVR-NBR                                    06350000
                  ,:WS-ACCT-RCV-NBR                                     06360000
                  ,:SV-CNTRY-CD                                         06370000
                  ,:WS-SEC-NBR                                          06380000
                  ,:WS-ACAT-CNTL-NBR                                    06390000
                  ,:WS-ADP-NBR                                          06400000
                  ,:WS-INIT-ASSET-SEQ-NBR                               06410000
                  ,:WS-TRANS-TYPE-CD                                    06420000
                  ,:WS-CSH-MGN-SHRT-CD                                  06430000
                  ,:WS-PSTN-CD                                          06440000
01/21             ,:WS-OPTN-CTGY-CD                                     06450000
                  ,:WS-WHEN-ISSUED                                      06460000
                  ,:WS-STTLM-LCTN-CD                                    06470000
                  ,:WS-CNTRY-CD                                         06480000
                  ,:WS-STTLM-RSN-CD                                     06490000
                  ,:WS-INITAST-NSCC-PEND-CD                             06500000
LRM011            ,:WS-INITAST-NSCC-ACK-IND                             06510000
                  ,:WS-NSCC-WTHLD-CD                                    06520000
                  ,:WS-ASSET-QTY                                        06530000
                  ,:WS-ASSET-AMT                                        06540000
                  ,:WS-ASSET-DESC                                       06550000
                  ,:WS-ASSET-CMNT                                       06560000
LRM026            ,:WS-CRNCY-CD                                         06570000
LRM030            ,:WS-WHI-STTS-CD                                      06571004
           END-EXEC.                                                    06580000
      *                                                                 06590000
093400     EVALUATE SQLCODE                                             06600000
093500          WHEN +0                                                 06610000
                     MOVE LOW-VALUE  TO ACAT10IO-DC                     06620000
                     PERFORM 0050-MOVE-ASSET-DATA THRU 0050-EXIT        06630000
                     MOVE WS-SEC-NBR    TO SV-SEC-ISSUE-CD,             06640000
                                           ACAT10IO-SV-SEC-ISSUE-CD     06650000
                     MOVE WS-INIT-ASSET-SEQ-NBR TO SV-INITAST-SEQ-NBR,  06660000
                                          ACAT10IO-SV-INITAST-SEQ-NBR   06670000
                     MOVE WS-STTLM-LCTN-CD TO SV-STTLM-LCTN-CD          06680000
                     MOVE WS-CNTRY-CD      TO SV-CNTRY-CD               06690000
                     MOVE WS-CSH-MGN-SHRT-CD TO SV-CSH-MGN-SHRT-CD      06700000
LRM026               MOVE WS-CRNCY-CD      TO SV-CRNCY-CD               06710000
                     SET ACAT10IO-VINITAST-FOUND TO TRUE                06720000
                     SET ACAT10IO-VINITAST-FETCHED TO TRUE              06730000
                     PERFORM 0130-CLOSE-FWD-CURSOR                      06740000
01/21                IF WS-OPTN-CTGY-CD NOT = '00'                      06750000
01/21                   MOVE WS-OPTN-CTGY-CD TO ACAT10IO-OPTN-CTGY-CD   06760000
01/21                   PERFORM 0820-GET-VINITOPN THRU 0820-EXIT        06770000
                        MOVE WS-OPT-BS-CD    TO ACAT10IO-OPT-BS-CD      06780000
01/21                END-IF                                             06790000
                WHEN +100                                               06800000
                     SET ACAT10IO-VINITAST-NOT-FOUND TO TRUE            06810000
12/18                IF ACAT10IO-SV-SEC-ISSUE-CD  > LOW-VALUES          06820000
                        SET ACAT10IO-VINITAST-LAST TO TRUE              06830000
                        MOVE 'THE LAST ASSET POSITION UNDER THIS TIF'   06840000
                         TO WS-RETURN-MSG                               06850000
                     ELSE                                               06860000
                         MOVE 'NO ASSET POSITION UNDER THIS TIF' TO     06870000
                         WS-RETURN-MSG                                  06880000
                     END-IF                                             06890000
                     PERFORM 0130-CLOSE-FWD-CURSOR                      06900000
094000          WHEN OTHER                                              06910000
                     SET ACAT10IO-VINITAST-NOT-FOUND TO TRUE            06920000
                     SET ACAT10IO-VINITAST-NOT-FETCHED TO TRUE          06921000
                     MOVE SPACES TO ACAT10IO-VINITAST-SW                06922000
                     PERFORM 9000-WRITE-TO-CICS-LOG                     06923000
                     PERFORM 9500-RETURN-DB2-ERROR                      06924000
094200      END-EVALUATE.                                               06925000
      *                                                                 06926000
       0130-CLOSE-FWD-CURSOR.                                           06927000
                                                                        06928000
           EXEC SQL                                                     06929000
                CLOSE FWD_VISAT                                         06930000
           END-EXEC.                                                    06940000
                                                                        06950000
      /                                                                 06960000
       0200-SRCH-VINITAST-BWD.                                          06970000
      ***                                                               06980000
           PERFORM 0210-OPEN-BWD-CURSOR.                                06990000
093400     EVALUATE SQLCODE                                             07000000
093500          WHEN +0                                                 07010000
                     PERFORM 0220-FETCH-BWD-CURSOR                      07020000
                WHEN +100                                               07030000
                     SET ACAT10IO-VINITAST-NOT-FOUND TO TRUE            07040000
                     SET ACAT10IO-VINITAST-NOT-FETCHED TO TRUE          07050000
                     MOVE '  OPEN BWD_VISAT CURSOR ERROR'               07060000
                      TO WS-RETURN-MSG                                  07070000
                     PERFORM 0230-CLOSE-BWD-CURSOR                      07080000
094000          WHEN OTHER                                              07090000
                     SET ACAT10IO-VINITAST-NOT-FOUND TO TRUE            07100000
                     SET ACAT10IO-VINITAST-NOT-FETCHED TO TRUE          07110000
                     MOVE SPACES TO ACAT10IO-VINITAST-SW                07120000
                     PERFORM 9000-WRITE-TO-CICS-LOG                     07130000
                     PERFORM 9500-RETURN-DB2-ERROR                      07140000
094200      END-EVALUATE.                                               07150000
      *                                                                 07160000
      ***                                                               07170000
       0210-OPEN-BWD-CURSOR.                                            07180000
                                                                        07190000
           IF EIBAID                    = '7' OR                        07200000
                                          '8'                           07210000
              MOVE SPACES              TO SV-SEC-ISSUE-CD               07220000
                                          SV-STTLM-LCTN-CD              07230000
                                          SV-CSH-MGN-SHRT-CD            07240000
           END-IF                                                       07250000
                                                                        07260000
           EXEC SQL                                                     07270000
                OPEN BWD_VISAT                                          07280000
           END-EXEC.                                                    07290000
      *                                                                 07300000
       0220-FETCH-BWD-CURSOR.                                           07310000
                                                                        07320000
           EXEC SQL                                                     07330000
                FETCH  BWD_VISAT                                        07340000
                INTO                                                    07350000
                   :WS-DLVR-NBR                                         07360000
                  ,:WS-RCV-NBR                                          07370000
                  ,:WS-ACCT-DLVR-NBR                                    07380000
                  ,:WS-ACCT-RCV-NBR                                     07390000
                  ,:SV-CNTRY-CD                                         07400000
                  ,:WS-SEC-NBR                                          07410000
                  ,:WS-ACAT-CNTL-NBR                                    07420000
                  ,:WS-ADP-NBR                                          07430000
                  ,:WS-INIT-ASSET-SEQ-NBR                               07440000
                  ,:WS-TRANS-TYPE-CD                                    07450000
                  ,:WS-CSH-MGN-SHRT-CD                                  07460000
                  ,:WS-PSTN-CD                                          07470000
01/21             ,:WS-OPTN-CTGY-CD                                     07480000
                  ,:WS-WHEN-ISSUED                                      07490000
                  ,:WS-STTLM-LCTN-CD                                    07500000
                  ,:WS-CNTRY-CD                                         07510000
                  ,:WS-STTLM-RSN-CD                                     07520000
                  ,:WS-INITAST-NSCC-PEND-CD                             07530000
LRM011            ,:WS-INITAST-NSCC-ACK-IND                             07540000
                  ,:WS-NSCC-WTHLD-CD                                    07550000
                  ,:WS-ASSET-QTY                                        07560000
                  ,:WS-ASSET-AMT                                        07570000
                  ,:WS-ASSET-DESC                                       07571000
                  ,:WS-ASSET-CMNT                                       07572000
LRM026            ,:WS-CRNCY-CD                                         07573000
LRM030            ,:WS-WHI-STTS-CD                                      07573104
           END-EXEC.                                                    07574000
      *                                                                 07575000
093400     EVALUATE SQLCODE                                             07576000
093500          WHEN +0                                                 07577000
                     MOVE LOW-VALUE        TO ACAT10IO-DC               07578000
01/04                PERFORM 0050-MOVE-ASSET-DATA THRU 0050-EXIT        07579000
                     MOVE WS-SEC-NBR       TO SV-SEC-ISSUE-CD           07580000
                                           ACAT10IO-SV-SEC-ISSUE-CD     07590000
                     MOVE WS-INIT-ASSET-SEQ-NBR TO SV-INITAST-SEQ-NBR,  07600000
                                          ACAT10IO-SV-INITAST-SEQ-NBR   07610000
                     MOVE WS-STTLM-LCTN-CD TO SV-STTLM-LCTN-CD          07620000
                     MOVE WS-CNTRY-CD      TO SV-CNTRY-CD               07630000
                     MOVE WS-CSH-MGN-SHRT-CD TO SV-CSH-MGN-SHRT-CD      07640000
LRM026               MOVE WS-CRNCY-CD      TO SV-CRNCY-CD               07641000
                     SET ACAT10IO-VINITAST-FETCHED TO TRUE              07642000
                     SET ACAT10IO-VINITAST-FOUND   TO TRUE              07643000
                     PERFORM 0230-CLOSE-BWD-CURSOR                      07644000
01/21                IF WS-OPTN-CTGY-CD NOT = '00'                      07645000
01/21                   MOVE WS-OPTN-CTGY-CD TO ACAT10IO-OPTN-CTGY-CD   07646000
01/21                   PERFORM 0820-GET-VINITOPN THRU 0820-EXIT        07647000
                        MOVE WS-OPT-BS-CD    TO ACAT10IO-OPT-BS-CD      07648000
01/21                END-IF                                             07649000
                WHEN +100                                               07650000
                     SET ACAT10IO-VINITAST-NOT-FOUND TO TRUE            07660000
12/02                IF ACAT10IO-SV-SEC-ISSUE-CD  > LOW-VALUES          07670000
12/18C                  SET ACAT10IO-VINITAST-FIRST TO TRUE             07680000
                        MOVE 'THE FIRST ASSET POSITION UNDER THIS TIF'  07690000
                         TO WS-RETURN-MSG                               07700000
                     ELSE                                               07710000
                         MOVE 'NO ASSET POSITION UNDER THIS TIF' TO     07720000
                         WS-RETURN-MSG                                  07730000
                     END-IF                                             07740000
                     PERFORM 0230-CLOSE-BWD-CURSOR                      07750000
094000          WHEN OTHER                                              07760000
                     MOVE SPACES TO ACAT10IO-VINITAST-SW                07770000
                     SET ACAT10IO-VINITAST-NOT-FETCHED TO TRUE          07780000
                     SET ACAT10IO-VINITAST-NOT-FOUND   TO TRUE          07790000
                     PERFORM 9000-WRITE-TO-CICS-LOG                     07800000
                     PERFORM 9500-RETURN-DB2-ERROR                      07810000
094200      END-EVALUATE.                                               07820000
      *                                                                 07830000
       0230-CLOSE-BWD-CURSOR.                                           07840000
                                                                        07850000
           EXEC SQL                                                     07860000
                CLOSE BWD_VISAT                                         07870000
           END-EXEC.                                                    07880000
                                                                        07890000
      /                                                                 07900000
       0250-MOVE-VINITAST.                                              07910000
                                                                        07920000
           INITIALIZE ACAT10IO-DC.                                      07930000
ET0002****   MOVE FIELDS FROM DCLACTIAST.                               07940000
ET0002     MOVE STTLM-RSN-CD OF DCLACTIAST TO ACAT10IO-STTLM-RSN-CD.    07950000
ET0002     MOVE ISIN-SEC-ISSUE-CD OF DCLACTIAST TO ACAT10IO-SEC-NBR.    07960000
ET0002     MOVE SECURITY-ADP-NBR OF DCLACTIAST TO ACAT10IO-ADP-NBR.     07970000
ET0002     MOVE TRANS-TYPE-CD OF DCLACTIAST   TO ACAT10IO-TRANS-TYPE-CD.07980000
ET0002     MOVE CSH-MGN-SHRT-CD OF DCLACTIAST                           07990000
                                           TO ACAT10IO-CSH-MGN-SHRT-CD. 08000000
ET0002     MOVE WHI-CD OF DCLACTIAST         TO ACAT10IO-WHEN-ISSUED.   08010000
ET0002     MOVE STTLM-LCTN-CD OF DCLACTIAST TO ACAT10IO-STTLM-LCTN-CD.  08020000
ET0002     MOVE ISIN-CNTRY-CD OF DCLACTIAST TO ACAT10IO-CNTRY-CD        08030000
ET0002     MOVE STTLM-RSN-CD OF DCLACTIAST   TO ACAT10IO-STTLM-RSN-CD.  08040000
      **** MOVE TRNFR-TYPE-RSN-CD OF DCLVINITAST                        08050000
      ***                             TO    ACAT10IO-TRNFR-TYPE-RSN-CD. 08060000
ET0002     IF ASSET-QTY OF DCLACTIAST > +0                              08070000
ET0002        MOVE ASSET-QTY OF DCLACTIAST    TO ACAT10IO-ASSET-QTY     08080000
           END-IF.                                                      08090000
ET0002     IF ASSET-AMT OF DCLACTIAST > +0                              08100000
ET0002        MOVE ASSET-AMT OF DCLACTIAST TO ACAT10IO-ASSET-AMT        08110000
           END-IF.                                                      08120000
ET0002     IF ASSET-DESC-TXT OF DCLACTIAST > SPACES                     08130000
ET0002        MOVE ASSET-DESC-TXT OF DCLACTIAST TO ACAT10IO-ASSET-DESC  08140000
           END-IF.                                                      08150000
ET0002     IF ASSET-CMNT-TXT OF DCLACTIAST > SPACES                     08160000
ET0002        MOVE ASSET-CMNT-TXT OF DCLACTIAST TO ACAT10IO-ASSET-CMNT  08170000
           END-IF.                                                      08180000
      ***                                                               08190000
           IF ACAT10IO-NSCC-WTHLD-CD = 'W'                              08200000
              MOVE '** WITHHELD ASSET, WILL NOT BE SENT TO NSCC **'     08210000
                   TO ACAT10IO-RETURN-MSG                               08220000
           ELSE                                                         08230000
           IF ACAT10IO-NSCC-WTHLD-CD = 'M'                              08240000
              MOVE '** SEND MEMO ONLY  ****'                            08250000
                   TO ACAT10IO-RETURN-MSG                               08260000
           ELSE                                                         08270000
           IF ACAT10IO-NSCC-WTHLD-CD = 'L'                              08280000
              MOVE '** LIQUIDATE ASSET ****'                            08290000
                   TO ACAT10IO-RETURN-MSG                               08300000
           ELSE                                                         08310000
           IF ACAT10IO-TRANS-TYPE-CD = 'A'                              08320000
              MOVE '******   ASSET WAS ADDED  ******'                   08330000
                   TO ACAT10IO-RETURN-MSG                               08340000
           ELSE                                                         08350000
           IF ACAT10IO-TRANS-TYPE-CD = 'C'                              08360000
              MOVE '******   ASSET WAS CHANGED  *****'                  08370000
                   TO ACAT10IO-RETURN-MSG                               08380000
           ELSE                                                         08390000
           IF ACAT10IO-TRANS-TYPE-CD = 'D'                              08400000
              MOVE '**** ASSET WAS FLAGGED FOR DELETION ***'            08410000
                   TO ACAT10IO-RETURN-MSG                               08420000
           END-IF END-IF END-IF END-IF END-IF END-IF.                   08430000
                                                                        08440000
       0250-EXIT.                                                       08450000
           EXIT.                                                        08460000
      /                                                                 08470000
       0300-PROCESS-CHG-RQST.                                           08480000
      *                                                                 08490000
10/15 **** UPDATE USING CURSOR                                          08500000
      *                                                                 08510000
01/26      IF  ACAT10IO-VINITAST-NOT-FOUND                              08520000
              AND ACAT10IO-MSUBM = 'S'                                  08530000
               MOVE                                                     08540000
               ' NO ASSET POSITIONS UNDER THIS TIF, CAN"T SUBMITTE'     08550000
               TO WS-RETURN-MSG                                         08560000
               GO TO 0300-EXIT                                          08570000
           ELSE                                                         08580000
              IF ACAT10IO-UPDT-VINITAST                                 08590000
              AND ACAT10IO-MSUBM = 'S'                                  08600000
                   PERFORM 0960-UPDATE-FOR-SUBY THRU 0960-EXIT          08610000
                   GO TO 0300-EXIT                                      08620000
              END-IF                                                    08630000
           END-IF.                                                      08640000
      *                                                                 08650000
01/26      IF  ACAT10IO-VINITAST-NOT-FOUND                              08660000
              AND ACAT10IO-MSUBM = ' '                                  08670000
               MOVE                                                     08680000
               ' NO ASSET POSITIONS UNDER THIS TIF, CAN"T REVERSE'      08690000
               TO WS-RETURN-MSG                                         08700000
               GO TO 0300-EXIT                                          08710000
           ELSE                                                         08720000
              IF ACAT10IO-UPDT-VINITAST                                 08730000
              AND ACAT10IO-MSUBM = ' '                                  08740000
                  PERFORM 0970-UPDATE-FOR-SUBN THRU 0970-EXIT           08750000
                  GO TO 0300-EXIT                                       08760000
              END-IF                                                    08770000
           END-IF.                                                      08780000
      **                                                                08790000
      ******************************************************************08800000
      **************     PROCESS CASH BALANCES         *****************08810000
      ******************************************************************08820000
           IF ACAT10IO-MBAL01 > LOW-VALUES    AND                       08830000
              ACAT10IO-BAL01-CHANGED                                    08840000
              MOVE ACAT10IO-BAL01-9 TO WS-BAL01-COMP2                   08850000
              IF ACAT10IO-BAL01-9 < +0                                  08860000
                 SET ACAT10IO-MBAL01-CREDIT TO TRUE                     08870000
                 COMPUTE WS-BAL01-COMP2 = WS-BAL01-COMP2 * -1           08880000
                 MOVE WS-BAL01-COMP2 TO ACAT10IO-BAL01 ACAT10IO-BAL01-9 08890000
              ELSE                                                      08900000
                 SET ACAT10IO-MBAL01-DEBIT  TO TRUE                     08910000
              END-IF                                                    08920000
              MOVE 'C'  TO  SV-CSH-MGN-SHRT-CD                          08930000
              MOVE '40' TO  SV-STTLM-LCTN-CD                            08940000
              MOVE '         ' TO SV-SEC-ISSUE-CD                       08950000
              MOVE ACAT10IO-BAL01-SEQ-NBR TO SV-ASSET-SEQ-NBR           08960000
              MOVE ACAT10IO-BAL01-STTLM-RSN-CD TO WS-STTLM-RSN-CD       08970000
LRM027        MOVE SPACES  TO  SV-CRNCY-CD                              08980000
              PERFORM 0500-GET-VINITAST-INFO THRU 0500-EXIT             08990000
              IF ACAT10IO-VINITAST-FOUND                                09000000
                 IF  WS-TRANS-TYPE-CD   = 'D'                           09010000
                     MOVE ACAT10IO-BAL01-SEQ-NBR TO SV-ASSET-SEQ-NBR    09020000
                     PERFORM 0950-GET-VASSET-INFO THRU 0950-EXIT        09030000
                     IF  ACAT10IO-VASSET-FOUND                          09040000
                         MOVE 'C'      TO WS-TRANS-TYPE-CD              09050000
                                          WS-SAVE-TRANS-TYPE            09060000
                                          ACAT10IO-BAL01-TRAN-TYPE      09070000
                     ELSE                                               09080000
                         MOVE 'A'      TO WS-TRANS-TYPE-CD              09090000
                                          WS-SAVE-TRANS-TYPE            09100000
                                          ACAT10IO-BAL01-TRAN-TYPE      09110000
                     END-IF                                             09120000
                 END-IF                                                 09130000
                 IF ACAT10IO-BAL01-CMNT = SPACES                        09140000
                    MOVE WS-ASSET-CMNT TO ACAT10IO-BAL01-CMNT           09150000
                 END-IF                                                 09160000
                 PERFORM 0401-UPDATE-BAL01                              09170000
              ELSE                                                      09180000
                 MOVE ACAT10IO-BAL01-SEQ-NBR TO SV-ASSET-SEQ-NBR        09190000
                 PERFORM 0950-GET-VASSET-INFO THRU 0950-EXIT            09200000
                 PERFORM 0600-ISRT-VINITAST                             09210000
              END-IF                                                    09220000
LRM027        MOVE ACAT10IO-SV-CRNCY-CD        TO  SV-CRNCY-CD          09230000
           END-IF.                                                      09240000
                                                                        09250000
           IF ACAT10IO-MBAL02 > LOW-VALUES  AND                         09260000
              ACAT10IO-BAL02-CHANGED                                    09270000
              MOVE ACAT10IO-BAL02-9 TO WS-BAL02-COMP2                   09280000
              IF ACAT10IO-BAL02-9 < +0                                  09290000
                 SET ACAT10IO-MBAL02-CREDIT TO TRUE                     09300000
                 COMPUTE WS-BAL02-COMP2 = WS-BAL02-COMP2 * -1           09310000
                 MOVE WS-BAL02-COMP2 TO ACAT10IO-BAL02 ACAT10IO-BAL02-9 09320000
              ELSE                                                      09330000
                 SET ACAT10IO-MBAL02-DEBIT TO TRUE                      09340000
              END-IF                                                    09341000
              MOVE 'M'  TO  SV-CSH-MGN-SHRT-CD                          09342000
              MOVE '40' TO  SV-STTLM-LCTN-CD                            09343000
              MOVE '         ' TO SV-SEC-ISSUE-CD                       09343100
              MOVE ACAT10IO-BAL02-STTLM-RSN-CD TO WS-STTLM-RSN-CD       09343200
              MOVE ACAT10IO-BAL02-SEQ-NBR TO SV-ASSET-SEQ-NBR           09343300
LRM027        MOVE SPACES  TO  SV-CRNCY-CD                              09343400
              PERFORM 0500-GET-VINITAST-INFO THRU 0500-EXIT             09343500
              IF ACAT10IO-VINITAST-FOUND                                09343600
                 IF  WS-TRANS-TYPE-CD   = 'D'                           09343700
                     MOVE ACAT10IO-BAL02-SEQ-NBR TO SV-ASSET-SEQ-NBR    09343800
                     PERFORM 0950-GET-VASSET-INFO THRU 0950-EXIT        09343900
                     IF  ACAT10IO-VASSET-FOUND                          09344000
                         MOVE 'C'      TO WS-TRANS-TYPE-CD              09344100
                                          WS-SAVE-TRANS-TYPE            09344200
                                          ACAT10IO-BAL02-TRAN-TYPE      09344300
                     ELSE                                               09344400
                         MOVE 'A'      TO WS-TRANS-TYPE-CD              09344500
                                          WS-SAVE-TRANS-TYPE            09344600
                                          ACAT10IO-BAL02-TRAN-TYPE      09344700
                     END-IF                                             09344800
                 END-IF                                                 09344900
                 IF ACAT10IO-BAL02-CMNT = SPACES                        09345000
                    MOVE WS-ASSET-CMNT TO ACAT10IO-BAL02-CMNT           09346000
                 END-IF                                                 09347000
                 PERFORM 0402-UPDATE-BAL02                              09348000
              ELSE                                                      09349000
                 MOVE ACAT10IO-BAL02-SEQ-NBR TO SV-ASSET-SEQ-NBR        09350000
                 PERFORM 0950-GET-VASSET-INFO THRU 0950-EXIT            09360000
                 PERFORM 0600-ISRT-VINITAST                             09370000
              END-IF                                                    09380000
LRM027        MOVE ACAT10IO-SV-CRNCY-CD        TO  SV-CRNCY-CD          09390000
           END-IF.                                                      09400000
                                                                        09410000
      ***  IF ACAT10IO-MCD = 'C'   AND                                  09420000
           IF ACAT10IO-MBAL05 > LOW-VALUES  AND                         09430000
              ACAT10IO-BAL05-CHANGED                                    09440000
              MOVE ACAT10IO-BAL05-9 TO WS-BAL05-COMP2                   09450000
              IF ACAT10IO-BAL05-9 < +0                                  09460000
                 SET ACAT10IO-MBAL05-CREDIT TO TRUE                     09470000
                 COMPUTE WS-BAL05-COMP2 = WS-BAL05-COMP2 * -1           09480000
                 MOVE WS-BAL05-COMP2 TO ACAT10IO-BAL05 ACAT10IO-BAL05-9 09490000
              ELSE                                                      09500000
                 SET ACAT10IO-MBAL05-DEBIT TO TRUE                      09510000
              END-IF                                                    09520000
              MOVE 'S'  TO  SV-CSH-MGN-SHRT-CD                          09530000
              MOVE '40' TO  SV-STTLM-LCTN-CD                            09540000
              MOVE '         ' TO SV-SEC-ISSUE-CD                       09550000
              MOVE ACAT10IO-BAL05-STTLM-RSN-CD TO WS-STTLM-RSN-CD       09560000
              MOVE ACAT10IO-BAL05-SEQ-NBR TO SV-ASSET-SEQ-NBR           09570000
LRM027        MOVE SPACES  TO  SV-CRNCY-CD                              09580000
              PERFORM 0500-GET-VINITAST-INFO THRU 0500-EXIT             09590000
              IF ACAT10IO-VINITAST-FOUND                                09600000
                 IF  WS-TRANS-TYPE-CD   = 'D'                           09610000
                     MOVE ACAT10IO-BAL05-SEQ-NBR TO SV-ASSET-SEQ-NBR    09620000
                     PERFORM 0950-GET-VASSET-INFO THRU 0950-EXIT        09621000
                     IF  ACAT10IO-VASSET-FOUND                          09622000
                         MOVE 'C'      TO WS-TRANS-TYPE-CD              09623000
                                          WS-SAVE-TRANS-TYPE            09624000
                                          ACAT10IO-BAL05-TRAN-TYPE      09625000
                     ELSE                                               09626000
                         MOVE 'A'      TO WS-TRANS-TYPE-CD              09627000
                                          WS-SAVE-TRANS-TYPE            09628000
                                          ACAT10IO-BAL05-TRAN-TYPE      09629000
                     END-IF                                             09630000
                 END-IF                                                 09640000
                 IF ACAT10IO-BAL05-CMNT = SPACES                        09650000
                    MOVE WS-ASSET-CMNT TO ACAT10IO-BAL05-CMNT           09660000
                 END-IF                                                 09670000
                 PERFORM 0403-UPDATE-BAL05                              09680000
              ELSE                                                      09690000
                 MOVE ACAT10IO-BAL05-SEQ-NBR TO SV-ASSET-SEQ-NBR        09700000
                 PERFORM 0950-GET-VASSET-INFO THRU 0950-EXIT            09710000
                 PERFORM 0600-ISRT-VINITAST                             09720000
              END-IF                                                    09730000
LRM027        MOVE ACAT10IO-SV-CRNCY-CD        TO  SV-CRNCY-CD          09740000
           END-IF.                                                      09750000
                                                                        09760000
           IF ACAT10IO-MSMA   > LOW-VALUES  AND                         09770000
              ACAT10IO-SMA-CHANGED                                      09780000
              MOVE ACAT10IO-SMA-9 TO WS-SMA-COMP2                       09790000
              MOVE '45'  TO SV-STTLM-LCTN-CD                            09800000
              MOVE 'SMA' TO WS-STTLM-RSN-CD                             09810000
              MOVE '         ' TO SV-SEC-ISSUE-CD                       09820000
              MOVE ACAT10IO-SMA-CMS-CD  TO SV-CSH-MGN-SHRT-CD           09830000
              MOVE ACAT10IO-SMA-SEQ-NBR TO SV-ASSET-SEQ-NBR             09840000
LRM027        MOVE SPACES  TO  SV-CRNCY-CD                              09850000
              PERFORM 0500-GET-VINITAST-INFO THRU 0500-EXIT             09860000
              IF ACAT10IO-VINITAST-FOUND                                09870000
                 IF  WS-TRANS-TYPE-CD   = 'D'                           09880000
                     MOVE ACAT10IO-SMA-SEQ-NBR TO SV-ASSET-SEQ-NBR      09890000
                     PERFORM 0950-GET-VASSET-INFO THRU 0950-EXIT        09900000
                     IF  ACAT10IO-VASSET-FOUND                          09910000
                         MOVE 'C'      TO WS-TRANS-TYPE-CD              09911000
                                          WS-SAVE-TRANS-TYPE            09912000
                                          ACAT10IO-SMA-TRAN-TYPE        09913000
                     ELSE                                               09913100
                         MOVE 'A'      TO WS-TRANS-TYPE-CD              09913200
                                          WS-SAVE-TRANS-TYPE            09913300
                                          ACAT10IO-SMA-TRAN-TYPE        09913400
                     END-IF                                             09913500
                 END-IF                                                 09913600
01/27            IF ACAT10IO-SMA-CMNT = SPACES                          09913700
                    MOVE WS-ASSET-CMNT TO ACAT10IO-SMA-CMNT             09913800
01/27            END-IF                                                 09913900
                 PERFORM 0404-UPDATE-SMA                                09914000
              ELSE                                                      09915000
01/20            MOVE ACAT10IO-SMA-SEQ-NBR TO SV-ASSET-SEQ-NBR          09916000
20               PERFORM 0950-GET-VASSET-INFO THRU 0950-EXIT            09917000
                 PERFORM 0600-ISRT-VINITAST                             09918000
              END-IF                                                    09919000
LRM027        MOVE ACAT10IO-SV-CRNCY-CD        TO  SV-CRNCY-CD          09920000
           END-IF.                                                      09930000
      ******************************************************************09940000
           IF (ACAT10IO-MCD = SPACE         AND                         09950000
               ACAT10IO-NSCC-WTHLD-CD = 'W')                            09960000
           OR (ACAT10IO-MCD = 'W' OR 'D')                               09970000
           OR (ACAT10IO-MSECC = 'S'   AND                               09980000
               ACAT10IO-ASSET-CMNT > SPACES)                            09990000
           OR (ACAT10IO-MQTY > SPACES  AND                              10000000
               ACAT10IO-QTY-CHANGED)                                    10010000
           OR (ACAT10IO-MAMT > SPACES  AND                              10020000
               ACAT10IO-AMT-CHANGED)                                    10030000
              PERFORM 0055-MOVE-ASSET-FROM-TSQ THRU 0055-EXIT           10040000
              MOVE WS-SEC-NBR                TO SV-SEC-ISSUE-CD         10050000
              MOVE WS-STTLM-LCTN-CD          TO SV-STTLM-LCTN-CD        10060000
              MOVE WS-CNTRY-CD               TO SV-CNTRY-CD             10070000
              MOVE WS-CSH-MGN-SHRT-CD        TO SV-CSH-MGN-SHRT-CD      10080000
              MOVE ACAT10IO-SV-ASSET-SEQ-NBR TO SV-ASSET-SEQ-NBR        10090000
              PERFORM 0500-GET-VINITAST-INFO  THRU 0500-EXIT            10100000
              IF ACAT10IO-VINITAST-FOUND    OR                          10110000
                 ACAT10IO-VINITAST-FETCHED                              10120000
                 SET ACAT10IO-UPDT-VINITAST TO TRUE                     10121000
                 PERFORM 0400-UPDT-VINITAST THRU 0400-EXIT              10122000
              ELSE                                                      10123000
                 IF SQLCODE = -811                                      10124000
                    PERFORM 0350-GET-NEXT-VINITAST-UPDATE THRU 0350-EXIT10125000
                 ELSE                                                   10126000
                    SET ACAT10IO-ISRT-VINITAST TO TRUE                  10127000
                    PERFORM 0950-GET-VASSET-INFO THRU 0950-EXIT         10128000
                    PERFORM 0600-ISRT-VINITAST THRU 0600-EXIT           10129000
                 END-IF                                                 10130000
              END-IF                                                    10140000
           END-IF.                                                      10150000
                                                                        10160000
       0300-EXIT.                                                       10170000
           EXIT.                                                        10180000
      /                                                                 10190000
       0350-GET-NEXT-VINITAST-UPDATE.                                   10200000
           ADD +1  TO  SV-INITAST-SEQ-NBR.                              10210000
           PERFORM 0510-GET-VINITAST-BY-SEQNBR THRU 0510-EXIT           10220000
           IF ACAT10IO-VINITAST-FOUND                                   10230000
              PERFORM 0400-UPDT-VINITAST THRU 0400-EXIT                 10240000
           ELSE                                                         10250000
              IF SV-INITAST-SEQ-NBR > ACAT10IO-MAX-ASSET-SEQ-NBR        10260000
                 GO TO 0350-EXIT                                        10270000
              ELSE                                                      10280000
                 GO TO 0350-GET-NEXT-VINITAST-UPDATE                    10290000
              END-IF                                                    10300000
           END-IF.                                                      10310000
                                                                        10320000
       0350-EXIT.                                                       10330000
           EXIT.                                                        10340000
      /                                                                 10350000
       0400-UPDT-VINITAST.                                              10360000
      *                                                                 10370000
           IF (ACAT10IO-MCD = SPACE      AND                            10380000
               ACAT10IO-NSCC-WTHLD-CD = 'W')                            10390000
              MOVE 'A'          TO  ACAT10IO-TRANS-TYPE-CD              10400000
              MOVE SPACE        TO  ACAT10IO-NSCC-WTHLD-CD              10410000
                                    ACAT10IO-VINITAST-NSCC-PEND-CD      10420000
              IF ACAT10IO-SV-SEC-ISSUE-CD = '         '                 10430000
                 MOVE WS-INIT-SEC-NBR TO SV-SEC-ISSUE-CD                10440000
              END-IF                                                    10450000
LRM025         MOVE  EIBTRMID  TO  CICS-TERM-ID-CD OF DCLACTIAST        10460000
               EXEC SQL                                                 10470000
ET0002            UPDATE ACTIAST                                        10480000
                     SET NSCC_WTHLD_CD = :ACAT10IO-NSCC-WTHLD-CD        10490000
                        ,NSCC_PEND_CD  = :ACAT10IO-VINITAST-NSCC-PEND-CD10500000
                        ,TRANS_TYPE_CD = :ACAT10IO-TRANS-TYPE-CD        10510000
                        ,UPDT_TMSTP = CURRENT TIMESTAMP                 10520000
                        ,PRGM_NM = 'ACAT10DC'                           10530000
LRM011                  ,NSCC_ACK_IND      =  ' '                       10540000
LRM025                  ,CICS_SGNON_ID = :ACAT10IO-SIGN-ON-ID           10550000
LRM025                  ,CICS_NET_NM   = :ACAT10IO-NET-NAME             10560000
LRM025                  ,TPSCRT_USR_ID = :ACAT10IO-USER-ID              10570000
LRM025                  ,TPSCRT_USR_NM = :ACAT10IO-USER-NAME            10580000
LRM025                  ,CICS_TERM_ID_CD = :DCLACTIAST.CICS-TERM-ID-CD  10590000
                  WHERE (CLIENT_NBR = :SV-CLIENT-NBR                    10600000
ET0002              AND ACAT_CONTROL_NBR = :SV-ACAT-CNTL-NBR            10610000
                    AND DLVR_NBR = :SV-DLVR-NBR                         10620000
                    AND RCV_NBR = :SV-RCV-NBR                           10621000
                    AND ACCT_DLVR_NBR = :SV-ACCT-DLVR-NBR               10622000
                    AND ACCT_RCV_NBR = :SV-ACCT-RCV-NBR                 10623000
                    AND STTLM_LCTN_CD = :SV-STTLM-LCTN-CD               10624000
                    AND ISIN_SEC_ISSUE_CD = :SV-SEC-ISSUE-CD            10625000
                    AND CSH_MGN_SHRT_CD = :SV-CSH-MGN-SHRT-CD)          10626000
               END-EXEC                                                 10627000
               EVALUATE SQLCODE                                         10628000
                    WHEN +0                                             10629000
                         SET ACAT10IO-VINITAST-UPDATED TO TRUE          10630000
                         IF ACAT10IO-SV-SEC-ISSUE-CD = '         '      10640000
                            MOVE '         '     TO SV-SEC-ISSUE-CD     10650000
                         END-IF                                         10660000
                         MOVE ' THIS POSITION WILL NOT BE WITHHELD'     10670000
                            TO WS-RETURN-MSG                            10680000
                         GO TO 0400-EXIT                                10690000
                    WHEN OTHER                                          10700000
                         MOVE SPACES TO ACAT10IO-VINITAST-SW            10710000
                         PERFORM 9000-WRITE-TO-CICS-LOG                 10720000
                         PERFORM 9500-RETURN-DB2-ERROR                  10730000
               END-EVALUATE                                             10740000
           END-IF.                                                      10750000
      *                                                                 10760000
      *  IF 'W' ==> ST-CD IS LESS THAN '200', TRANS-TYPE-CD = 'A' **    10770000
      *  IF 'D' ==> ST-CD IS > OR = '200', TRANS-TYPE-CD = 'D'    **    10780000
           IF ACAT10IO-MCD = 'W'                                        10790000
              MOVE 'W'          TO  ACAT10IO-NSCC-WTHLD-CD              10800000
              MOVE 'H'          TO  ACAT10IO-VINITAST-NSCC-PEND-CD      10810000
              MOVE 'A'          TO  ACAT10IO-TRANS-TYPE-CD              10820000
           ELSE                                                         10830000
              MOVE SPACE        TO  ACAT10IO-NSCC-WTHLD-CD              10840000
                                    ACAT10IO-VINITAST-NSCC-PEND-CD      10850000
              IF ACAT10IO-MCD > SPACE                                   10860000
                 MOVE ACAT10IO-MCD TO ACAT10IO-TRANS-TYPE-CD            10870000
              ELSE                                                      10880000
                 MOVE 'C'       TO ACAT10IO-TRANS-TYPE-CD               10890000
              END-IF                                                    10900000
           END-IF.                                                      10910000
      *                                                                 10920000
           IF ACAT10IO-MCD =  'D' OR 'W'                                10930000
              IF ACAT10IO-SV-SEC-ISSUE-CD = '         '                 10940000
                 MOVE WS-INIT-SEC-NBR TO SV-SEC-ISSUE-CD                10950000
              END-IF                                                    10960000
LRM025         MOVE  EIBTRMID  TO  CICS-TERM-ID-CD OF DCLACTIAST        10970000
               EXEC SQL                                                 10980000
ET0002            UPDATE ACTIAST                                        10990000
                     SET NSCC_WTHLD_CD = :ACAT10IO-NSCC-WTHLD-CD        11000000
                        ,NSCC_PEND_CD  = :ACAT10IO-VINITAST-NSCC-PEND-CD11010000
                        ,TRANS_TYPE_CD = :ACAT10IO-TRANS-TYPE-CD        11020000
                        ,UPDT_TMSTP = CURRENT TIMESTAMP                 11030000
                        ,PRGM_NM = 'ACAT10DC'                           11040000
LRM011                  ,NSCC_ACK_IND      =  ' '                       11050000
LRM025                  ,CICS_SGNON_ID = :ACAT10IO-SIGN-ON-ID           11060000
LRM025                  ,CICS_NET_NM   = :ACAT10IO-NET-NAME             11070000
LRM025                  ,TPSCRT_USR_ID = :ACAT10IO-USER-ID              11080000
LRM025                  ,TPSCRT_USR_NM = :ACAT10IO-USER-NAME            11090000
LRM025                  ,CICS_TERM_ID_CD = :DCLACTIAST.CICS-TERM-ID-CD  11100000
                  WHERE (CLIENT_NBR = :SV-CLIENT-NBR                    11110000
ET0002              AND ACAT_CONTROL_NBR = :SV-ACAT-CNTL-NBR            11120000
                    AND DLVR_NBR = :SV-DLVR-NBR                         11130000
                    AND RCV_NBR = :SV-RCV-NBR                           11140000
                    AND ACCT_DLVR_NBR = :SV-ACCT-DLVR-NBR               11150000
                    AND ACCT_RCV_NBR = :SV-ACCT-RCV-NBR                 11160000
                    AND STTLM_LCTN_CD = :SV-STTLM-LCTN-CD               11170000
                    AND CSH_MGN_SHRT_CD = :SV-CSH-MGN-SHRT-CD           11180000
                    AND ISIN_SEC_ISSUE_CD = :SV-SEC-ISSUE-CD)           11190000
               END-EXEC                                                 11200000
               EVALUATE SQLCODE                                         11210000
                    WHEN +0                                             11220000
                         SET ACAT10IO-VINITAST-UPDATED TO TRUE          11230000
                         IF ACAT10IO-SV-SEC-ISSUE-CD = '         '      11240000
                            MOVE '         '     TO SV-SEC-ISSUE-CD     11250000
                         END-IF                                         11260000
01/26**????              MOVE ACAT10IO-MCD TO ACAT10IO-TRANS-TYPE-CD    11270000
                         IF ACAT10IO-MCD =  'D'                         11280000
                            MOVE '  THIS POSITION WILL BE DELETED'      11290000
                            TO WS-RETURN-MSG                            11300000
                         END-IF                                         11310000
                         GO TO 0400-EXIT                                11320000
                    WHEN +100                                           11330000
                         PERFORM 0950-GET-VASSET-INFO THRU 0950-EXIT    11331000
                         PERFORM 0600-ISRT-VINITAST                     11332000
                         GO TO 0400-EXIT                                11333000
                    WHEN OTHER                                          11334000
                         MOVE SPACES TO ACAT10IO-VINITAST-SW            11335000
                         PERFORM 9000-WRITE-TO-CICS-LOG                 11336000
                         PERFORM 9500-RETURN-DB2-ERROR                  11337000
               END-EVALUATE                                             11338000
           END-IF.                                                      11339000
      ****                                                              11340000
      **** IF ACAT10IO-MCD = 'C'            AND                         11350000
           IF ACAT10IO-MQTY > SPACES        AND                         11360000
              ACAT10IO-QTY-CHANGED                                      11370000
              MOVE ACAT10IO-QTY-9 TO WS-QTY-COMP2                       11380000
              IF ACAT10IO-QTY-9 > +0                                    11390000
                 SET ACAT10IO-LONG-ASSET-QTY TO TRUE                    11400000
              ELSE                                                      11410000
                 IF ACAT10IO-QTY-9 < +0                                 11420000
                    SET ACAT10IO-SHORT-ASSET-QTY TO TRUE                11430000
                    COMPUTE WS-QTY-COMP2 = WS-QTY-COMP2 * -1            11440000
                 ELSE                                                   11450000
                    SET ACAT10IO-NA-ASSET-QTY TO TRUE                   11460000
                 END-IF                                                 11470000
01/21         END-IF                                                    11480000
12/12         IF ACAT10IO-SV-SEC-ISSUE-CD = '         '                 11490000
                 MOVE WS-INIT-SEC-NBR TO SV-SEC-ISSUE-CD                11500000
              END-IF                                                    11510000
LRM025        MOVE  EIBTRMID  TO  CICS-TERM-ID-CD OF DCLACTIAST         11520000
LRM026        IF ACAT10IO-SV-CRNCY-CD > '000'                           11530000
LRM026           MOVE ACAT10IO-SV-CRNCY-CD TO CRNCY-CD OF DCLACTIAST    11540000
LRM028        ELSE                                                      11550000
LRM028           MOVE SPACES               TO CRNCY-CD OF DCLACTIAST    11560000
LRM026        END-IF                                                    11570000
               EXEC SQL                                                 11580000
ET0002              UPDATE ACTIAST                                      11581000
                      SET NSCC_WTHLD_CD = :ACAT10IO-NSCC-WTHLD-CD       11582000
                          ,TRANS_TYPE_CD = :ACAT10IO-TRANS-TYPE-CD      11583000
                          ,ASSET_DESC_TXT = :ACAT10IO-ASSET-DESC        11584000
                          ,ASSET_QTY = :WS-QTY-COMP2                    11585000
01/21                     ,PSTN_CD = :ACAT10IO-PSTN-CD                  11586000
                          ,UPDT_TMSTP = CURRENT TIMESTAMP               11587000
                          ,PRGM_NM = 'ACAT10DC'                         11588000
LRM025                    ,CICS_SGNON_ID = :ACAT10IO-SIGN-ON-ID         11590000
LRM025                    ,CICS_NET_NM   = :ACAT10IO-NET-NAME           11600000
LRM025                    ,TPSCRT_USR_ID = :ACAT10IO-USER-ID            11610000
LRM025                    ,TPSCRT_USR_NM = :ACAT10IO-USER-NAME          11620000
LRM025                    ,CICS_TERM_ID_CD = :DCLACTIAST.CICS-TERM-ID-CD11630000
                    WHERE (CLIENT_NBR = :SV-CLIENT-NBR                  11640000
ET0002                AND ACAT_CONTROL_NBR = :SV-ACAT-CNTL-NBR          11650000
                      AND DLVR_NBR = :SV-DLVR-NBR                       11660000
                      AND RCV_NBR = :SV-RCV-NBR                         11670000
                      AND ACCT_DLVR_NBR = :SV-ACCT-DLVR-NBR             11680000
                      AND ACCT_RCV_NBR = :SV-ACCT-RCV-NBR               11690000
12/03                 AND ASSET_SEQ_NBR = :SV-INITAST-SEQ-NBR           11700000
                      AND STTLM_LCTN_CD = :SV-STTLM-LCTN-CD             11710000
01/19                 AND CSH_MGN_SHRT_CD = :SV-CSH-MGN-SHRT-CD         11720000
                      AND ISIN_SEC_ISSUE_CD = :SV-SEC-ISSUE-CD          11730000
LRM026                AND  CRNCY_CD         = :DCLACTIAST.CRNCY-CD)     11740000
               END-EXEC                                                 11750000
LRM011***********         ,NSCC_ACK_IND      =  ' '                     11751000
093400         EVALUATE SQLCODE                                         11760000
093500              WHEN +0                                             11770000
                         SET ACAT10IO-VINITAST-UPDATED TO TRUE          11771000
01/26                    SET ACAT10IO-QTY-UPDATED TO TRUE               11772000
01/24                    MOVE WS-QTY-COMP2 TO ACAT10IO-ASSET-QTY        11773000
01/24                                         ACAT10IO-QTY-9            11774000
01/20 **** OPTION ----->                                                11775000
                         IF ACAT10IO-OPTN-CTGY-CD > '00'                11776000
                            PERFORM 0840-UPDT-VINITOPN THRU 0840-EXIT   11777000
                         END-IF                                         11778000
12/12                    IF ACAT10IO-SV-SEC-ISSUE-CD = '         '      11779000
                            MOVE '         '     TO SV-SEC-ISSUE-CD     11780000
                         END-IF                                         11790000
01/25                    MOVE '          QUANTITY FIELD WAS MODIFIED' TO11800000
01/25                    WS-RETURN-MSG                                  11810000
093500              WHEN +100                                           11820000
01/25                    MOVE ACAT10IO-SV-ASSET-SEQ-NBR TO              11830000
01/25                         SV-ASSET-SEQ-NBR                          11840000
01/20                    PERFORM 0950-GET-VASSET-INFO THRU 0950-EXIT    11850000
                         PERFORM 0600-ISRT-VINITAST  THRU 0600-EXIT     11860000
01/20                    IF ACAT10IO-VINITAST-INSERTED                  11870000
                            IF ACAT10IO-OPTN-CTGY-CD > '00'             11880000
                            PERFORM 0830-ISRT-VINITOPN THRU 0830-EXIT   11890000
                            END-IF                                      11900000
                         END-IF                                         11910000
094000              WHEN OTHER                                          11920000
                         MOVE SPACES TO ACAT10IO-VINITAST-SW            11930000
                         PERFORM 9000-WRITE-TO-CICS-LOG                 11940000
                         PERFORM 9500-RETURN-DB2-ERROR                  11950000
094200         END-EVALUATE                                             11960000
           END-IF.                                                      11970000
                                                                        11980000
      **** IF ACAT10IO-MCD = 'C'        AND                             11990000
           IF ACAT10IO-MAMT > SPACES   AND                              12000000
              ACAT10IO-AMT-CHANGED                                      12010000
01/18         MOVE ACAT10IO-AMT-9  TO WS-AMT-COMP2                      12020000
              IF ACAT10IO-AMT-9 < +0                                    12030000
   *  *****      SET ACAT10IO-SHORT-ASSET-QTY TO TRUE                   12040000
01/24            COMPUTE WS-AMT-COMP2 = WS-AMT-COMP2 * -1               12050000
01/21         END-IF                                                    12060000
12/12         IF ACAT10IO-SV-SEC-ISSUE-CD = '         '                 12070000
                 MOVE WS-INIT-SEC-NBR TO SV-SEC-ISSUE-CD                12080000
              END-IF                                                    12090000
LRM025         MOVE  EIBTRMID  TO  CICS-TERM-ID-CD OF DCLACTIAST        12100000
               EXEC SQL                                                 12110000
ET0002              UPDATE ACTIAST                                      12120000
                      SET NSCC_WTHLD_CD = :ACAT10IO-NSCC-WTHLD-CD       12130000
                          ,TRANS_TYPE_CD = :ACAT10IO-TRANS-TYPE-CD      12140000
                          ,ASSET_DESC_TXT = :ACAT10IO-ASSET-DESC        12150000
                          ,ASSET_AMT = :WS-AMT-COMP2                    12160000
01/21                     ,PSTN_CD = :ACAT10IO-PSTN-CD                  12170000
                          ,UPDT_TMSTP = CURRENT TIMESTAMP               12180000
                          ,PRGM_NM = 'ACAT10DC'                         12190000
LRM025                    ,CICS_SGNON_ID = :ACAT10IO-SIGN-ON-ID         12210000
LRM025                    ,CICS_NET_NM   = :ACAT10IO-NET-NAME           12220000
LRM025                    ,TPSCRT_USR_ID = :ACAT10IO-USER-ID            12230000
LRM025                    ,TPSCRT_USR_NM = :ACAT10IO-USER-NAME          12240000
LRM025                    ,CICS_TERM_ID_CD = :DCLACTIAST.CICS-TERM-ID-CD12250000
                    WHERE (CLIENT_NBR = :SV-CLIENT-NBR                  12260000
ET0002                AND ACAT_CONTROL_NBR = :SV-ACAT-CNTL-NBR          12270000
                      AND DLVR_NBR = :SV-DLVR-NBR                       12280000
                      AND RCV_NBR = :SV-RCV-NBR                         12290000
                      AND ACCT_DLVR_NBR = :SV-ACCT-DLVR-NBR             12300000
                      AND ACCT_RCV_NBR = :SV-ACCT-RCV-NBR               12310000
                      AND ASSET_SEQ_NBR = :SV-INITAST-SEQ-NBR           12320000
                      AND STTLM_LCTN_CD = :SV-STTLM-LCTN-CD             12330000
                      AND CSH_MGN_SHRT_CD = :SV-CSH-MGN-SHRT-CD         12340000
                      AND ISIN_SEC_ISSUE_CD = :SV-SEC-ISSUE-CD)         12350000
               END-EXEC                                                 12360000
LRM011*************       ,NSCC_ACK_IND      =  ' '                     12361000
               EVALUATE SQLCODE                                         12370000
                    WHEN +0                                             12380000
                         SET ACAT10IO-VINITAST-UPDATED TO TRUE          12390000
                         SET ACAT10IO-AMT-UPDATED TO TRUE               12400000
                         MOVE WS-AMT-COMP2 TO ACAT10IO-ASSET-AMT        12410000
                                              ACAT10IO-AMT-9            12420000
                         IF ACAT10IO-SV-SEC-ISSUE-CD = '         '      12430000
                            MOVE '         '     TO SV-SEC-ISSUE-CD     12440000
                         END-IF                                         12450000
                         MOVE '        AMOUNT FIELD WAS MODIFIED' TO    12460000
                         WS-RETURN-MSG                                  12470000
                    WHEN +100                                           12480000
                         MOVE ACAT10IO-SV-ASSET-SEQ-NBR TO              12490000
                              SV-ASSET-SEQ-NBR                          12500000
                         PERFORM 0950-GET-VASSET-INFO THRU 0950-EXIT    12510000
                         PERFORM 0600-ISRT-VINITAST                     12520000
                    WHEN OTHER                                          12530000
                         MOVE SPACES TO ACAT10IO-VINITAST-SW            12540000
                         PERFORM 9000-WRITE-TO-CICS-LOG                 12550000
                         PERFORM 9500-RETURN-DB2-ERROR                  12560000
               END-EVALUATE                                             12570000
           END-IF.                                                      12580000
                                                                        12590000
           IF ACAT10IO-MSECC = 'S'          AND                         12600000
              ACAT10IO-ASSET-CMNT > SPACES                              12610000
              EXEC SQL                                                  12620000
ET0002             UPDATE ACTIAST                                       12630000
                   SET ASSET_CMNT_TXT = :ACAT10IO-ASSET-CMNT            12640000
                      ,UPDT_TMSTP = CURRENT TIMESTAMP                   12650000
                      ,PRGM_NM = 'ACAT10DC'                             12660000
LRM011                ,NSCC_ACK_IND      =  ' '                         12670000
                WHERE  CLIENT_NBR = :SV-CLIENT-NBR                      12680000
                  AND  DLVR_NBR = :SV-DLVR-NBR                          12690000
                  AND  RCV_NBR = :SV-RCV-NBR                            12700000
                  AND  ACCT_DLVR_NBR = :SV-ACCT-DLVR-NBR                12710000
                  AND  ACCT_RCV_NBR = :SV-ACCT-RCV-NBR                  12720000
                  AND  ISIN_SEC_ISSUE_CD = :SV-SEC-ISSUE-CD             12730000
                  AND  CSH_MGN_SHRT_CD = :SV-CSH-MGN-SHRT-CD            12740000
                  AND  ACAT_CONTROL_NBR = :SV-ACAT-CNTL-NBR             12750000
              END-EXEC                                                  12760000
              EVALUATE SQLCODE                                          12770000
                    WHEN +0                                             12780000
                         SET ACAT10IO-VINITAST-UPDATED TO TRUE          12790000
                         MOVE 'SECURITY COMMENTS HAS BEE UPDATED' TO    12800000
                         WS-RETURN-MSG                                  12810000
                    WHEN +100                                           12820000
                         PERFORM 0950-GET-VASSET-INFO THRU 0950-EXIT    12830000
                         PERFORM 0600-ISRT-VINITAST                     12840000
                    WHEN OTHER                                          12850000
                         MOVE SPACES TO ACAT10IO-VINITAST-SW            12860000
                         PERFORM 9000-WRITE-TO-CICS-LOG                 12870000
                         PERFORM 9500-RETURN-DB2-ERROR                  12880000
               END-EVALUATE                                             12890000
           END-IF.                                                      12900000
      *                                                                 12910000
       0400-EXIT.                                                       12920000
           EXIT.                                                        12930000
      /                                                                 12940000
       0401-UPDATE-BAL01.                                               12950000
                                                                        12960000
           SET UPDATE-VINITAST         TO TRUE                          12970000
           IF  WS-BAL01-COMP2           = ZERO                          12980000
               MOVE ACAT10IO-BAL01-SEQ-NBR TO SV-ASSET-SEQ-NBR          12990000
               PERFORM 0950-GET-VASSET-INFO THRU 0950-EXIT              13000000
               IF  ACAT10IO-VASSET-FOUND                                13010000
                   MOVE 'D'      TO WS-TRANS-TYPE-CD                    13020000
                                    WS-SAVE-TRANS-TYPE                  13030000
                                    ACAT10IO-BAL01-TRAN-TYPE            13040000
                   MOVE ASSET-AMT OF DCLVASSET                          13050000
                                 TO WS-BAL01-COMP2                      13060000
               ELSE                                                     13070000
                   SET NO-UPDATE-VINITAST TO TRUE                       13080000
LRM005             MOVE SV-CLIENT-NBR     TO WS-DLTE-CLIENT-NBR         13090000
LRM005             MOVE SV-DLVR-NBR       TO WS-DLTE-DLVR-NBR           13100000
LRM005             MOVE SV-RCV-NBR        TO WS-DLTE-RCV-NBR            13110000
LRM005             MOVE SV-ACCT-DLVR-NBR  TO WS-DLTE-ACCT-DLVR-NBR      13120000
LRM005             MOVE SV-ACCT-RCV-NBR   TO WS-DLTE-ACCT-RCV-NBR       13130000
LRM005             MOVE SPACES            TO WS-DLTE-ISIN               13140000
LRM005             MOVE SV-ACAT-CNTL-NBR  TO WS-DLTE-ACAT-CNTL-NBR      13150000
LRM005             MOVE '40'              TO WS-DLTE-SLOC               13160000
LRM005             MOVE 'C'               TO WS-DLTE-CSH-MGN-SHRT-CD    13170000
LRM005             PERFORM 2500-CRE-DLTED-CASH-AUDIT-ROW                13180000
                   EXEC SQL                                             13190000
                        DELETE                                          13200000
ET0002                  FROM ACTIAST                                    13210000
                        WHERE  CLIENT_NBR = :SV-CLIENT-NBR              13220000
                          AND  DLVR_NBR = :SV-DLVR-NBR                  13230000
                          AND  RCV_NBR = :SV-RCV-NBR                    13240000
                          AND  ACCT_DLVR_NBR = :SV-ACCT-DLVR-NBR        13250000
                          AND  ACCT_RCV_NBR = :SV-ACCT-RCV-NBR          13260000
                          AND  ISIN_SEC_ISSUE_CD = '         '          13270000
                          AND  ACAT_CONTROL_NBR = :SV-ACAT-CNTL-NBR     13280000
                          AND  STTLM_LCTN_CD = '40'                     13290000
                          AND  CSH_MGN_SHRT_CD  = 'C'                   13300000
                   END-EXEC                                             13310000
               END-IF                                                   13311000
           END-IF                                                       13312000
           IF  UPDATE-VINITAST                                          13312100
LRM025         MOVE  EIBTRMID  TO  CICS-TERM-ID-CD OF DCLACTIAST        13312200
               EXEC SQL                                                 13312300
ET0002              UPDATE ACTIAST                                      13312400
                      SET  NSCC_WTHLD_CD = ' '                          13312500
                          ,TRANS_TYPE_CD = :WS-SAVE-TRANS-TYPE          13312600
                          ,ASSET_AMT = :WS-BAL01-COMP2                  13312700
                          ,STTLM_RSN_CD = :ACAT10IO-MBAL01-STTLM-RSN-CD 13312800
                          ,ASSET_CMNT_TXT = :ACAT10IO-BAL01-CMNT        13312900
                          ,UPDT_TMSTP = CURRENT TIMESTAMP               13313000
                          ,PRGM_NM = 'ACAT10DC'                         13314000
LRM011                    ,NSCC_ACK_IND      =  ' '                     13315000
LRM025                    ,CICS_SGNON_ID = :ACAT10IO-SIGN-ON-ID         13315100
LRM025                    ,CICS_NET_NM   = :ACAT10IO-NET-NAME           13315200
LRM025                    ,TPSCRT_USR_ID = :ACAT10IO-USER-ID            13315300
LRM025                    ,TPSCRT_USR_NM = :ACAT10IO-USER-NAME          13315400
LRM025                    ,CICS_TERM_ID_CD = :DCLACTIAST.CICS-TERM-ID-CD13315500
                    WHERE  CLIENT_NBR = :SV-CLIENT-NBR                  13315600
                      AND  DLVR_NBR = :SV-DLVR-NBR                      13315700
                      AND  RCV_NBR = :SV-RCV-NBR                        13315800
                      AND  ACCT_DLVR_NBR = :SV-ACCT-DLVR-NBR            13315900
                      AND  ACCT_RCV_NBR = :SV-ACCT-RCV-NBR              13316000
                      AND  ISIN_SEC_ISSUE_CD = '         '              13316100
                      AND  ACAT_CONTROL_NBR = :SV-ACAT-CNTL-NBR         13316200
                      AND  STTLM_LCTN_CD = '40'                         13316300
                      AND  CSH_MGN_SHRT_CD  = 'C'                       13316400
               END-EXEC                                                 13316500
           END-IF                                                       13316600
                                                                        13316700
      **                                                                13316800
           EVALUATE SQLCODE                                             13316900
                WHEN +0                                                 13317000
                     SET ACAT10IO-VINITAST-UPDATED TO TRUE              13317100
                     SET ACAT10IO-BAL01-UPDATED TO TRUE                 13317200
                     MOVE WS-BAL01-COMP2 TO ACAT10IO-BAL01              13317300
                     MOVE ACAT10IO-MBAL01-STTLM-RSN-CD TO               13317400
                          ACAT10IO-BAL01-STTLM-RSN-CD                   13317500
                     MOVE 'CASH BALANCE WAS MODIFIED' TO WS-RETURN-MSG  13317600
                WHEN OTHER                                              13317700
                     MOVE SPACES TO ACAT10IO-VINITAST-SW                13317800
                     PERFORM 9000-WRITE-TO-CICS-LOG                     13317900
                     PERFORM 9500-RETURN-DB2-ERROR                      13318000
            END-EVALUATE.                                               13319000
      *                                                                 13320000
      /                                                                 13330000
       0402-UPDATE-BAL02.                                               13340000
                                                                        13350000
           SET UPDATE-VINITAST         TO TRUE                          13360000
           IF  WS-BAL02-COMP2           = ZERO                          13370000
               MOVE ACAT10IO-BAL02-SEQ-NBR TO SV-ASSET-SEQ-NBR          13380000
               PERFORM 0950-GET-VASSET-INFO THRU 0950-EXIT              13390000
               IF  ACAT10IO-VASSET-FOUND                                13400000
                   MOVE 'D'      TO WS-TRANS-TYPE-CD                    13410000
                                    WS-SAVE-TRANS-TYPE                  13420000
                                    ACAT10IO-BAL02-TRAN-TYPE            13430000
                   MOVE ASSET-AMT OF DCLVASSET                          13440000
                                 TO WS-BAL02-COMP2                      13450000
               ELSE                                                     13460000
                   SET NO-UPDATE-VINITAST TO TRUE                       13470000
LRM005             MOVE SV-CLIENT-NBR     TO WS-DLTE-CLIENT-NBR         13480000
LRM005             MOVE SV-DLVR-NBR       TO WS-DLTE-DLVR-NBR           13490000
LRM005             MOVE SV-RCV-NBR        TO WS-DLTE-RCV-NBR            13500000
LRM005             MOVE SV-ACCT-DLVR-NBR  TO WS-DLTE-ACCT-DLVR-NBR      13510000
LRM005             MOVE SV-ACCT-RCV-NBR   TO WS-DLTE-ACCT-RCV-NBR       13520000
LRM005             MOVE SPACES            TO WS-DLTE-ISIN               13530000
LRM005             MOVE SV-ACAT-CNTL-NBR  TO WS-DLTE-ACAT-CNTL-NBR      13540000
LRM005             MOVE '40'              TO WS-DLTE-SLOC               13550000
LRM005             MOVE 'M'               TO WS-DLTE-CSH-MGN-SHRT-CD    13560000
LRM005             PERFORM 2500-CRE-DLTED-CASH-AUDIT-ROW                13570000
                   EXEC SQL                                             13580000
                        DELETE                                          13590000
ET0002                  FROM ACTIAST                                    13600000
                        WHERE  CLIENT_NBR = :SV-CLIENT-NBR              13610000
                          AND  DLVR_NBR = :SV-DLVR-NBR                  13620000
                          AND  RCV_NBR = :SV-RCV-NBR                    13630000
                          AND  ACCT_DLVR_NBR = :SV-ACCT-DLVR-NBR        13640000
                          AND  ACCT_RCV_NBR = :SV-ACCT-RCV-NBR          13650000
                          AND  ISIN_SEC_ISSUE_CD = '         '          13660000
                          AND  ACAT_CONTROL_NBR = :SV-ACAT-CNTL-NBR     13670000
                          AND  STTLM_LCTN_CD = '40'                     13680000
                          AND  CSH_MGN_SHRT_CD  = 'M'                   13690000
                   END-EXEC                                             13700000
               END-IF                                                   13710000
           END-IF                                                       13720000
           IF  UPDATE-VINITAST                                          13721000
LRM025         MOVE  EIBTRMID  TO  CICS-TERM-ID-CD OF DCLACTIAST        13721100
               EXEC SQL                                                 13721200
ET0002              UPDATE ACTIAST                                      13721300
                      SET  NSCC_WTHLD_CD = ' '                          13721400
                          ,TRANS_TYPE_CD = :WS-SAVE-TRANS-TYPE          13721500
                          ,ASSET_AMT = :WS-BAL02-COMP2                  13721600
                          ,STTLM_RSN_CD = :ACAT10IO-MBAL02-STTLM-RSN-CD 13721700
                          ,ASSET_CMNT_TXT = :ACAT10IO-BAL02-CMNT        13721800
                          ,UPDT_TMSTP = CURRENT TIMESTAMP               13721900
                          ,PRGM_NM = 'ACAT10DC'                         13722000
LRM011                    ,NSCC_ACK_IND      =  ' '                     13723000
LRM025                    ,CICS_SGNON_ID = :ACAT10IO-SIGN-ON-ID         13724000
LRM025                    ,CICS_NET_NM   = :ACAT10IO-NET-NAME           13725000
LRM025                    ,TPSCRT_USR_ID = :ACAT10IO-USER-ID            13726000
LRM025                    ,TPSCRT_USR_NM = :ACAT10IO-USER-NAME          13727000
LRM025                    ,CICS_TERM_ID_CD = :DCLACTIAST.CICS-TERM-ID-CD13728000
                    WHERE  CLIENT_NBR = :SV-CLIENT-NBR                  13729000
                      AND  DLVR_NBR = :SV-DLVR-NBR                      13729100
                      AND  RCV_NBR = :SV-RCV-NBR                        13729200
                      AND  ACCT_DLVR_NBR = :SV-ACCT-DLVR-NBR            13729300
                      AND  ACCT_RCV_NBR = :SV-ACCT-RCV-NBR              13729400
                      AND  ISIN_SEC_ISSUE_CD = '         '              13729500
                      AND  ACAT_CONTROL_NBR = :SV-ACAT-CNTL-NBR         13729600
                      AND  STTLM_LCTN_CD = '40'                         13729700
                      AND  CSH_MGN_SHRT_CD  = 'M'                       13729800
               END-EXEC                                                 13729900
           END-IF                                                       13730000
                                                                        13730100
      **                                                                13730200
           EVALUATE SQLCODE                                             13730300
                WHEN +0                                                 13730400
                     SET ACAT10IO-VINITAST-UPDATED TO TRUE              13730500
                     SET ACAT10IO-BAL02-UPDATED TO TRUE                 13730600
                     MOVE WS-BAL02-COMP2 TO ACAT10IO-BAL02              13730700
                     MOVE ACAT10IO-MBAL02-STTLM-RSN-CD TO               13730800
                          ACAT10IO-BAL02-STTLM-RSN-CD                   13730900
                     MOVE 'MARGIN BALANCE WAS MODIFIED' TO WS-RETURN-MSG13731000
                WHEN OTHER                                              13731100
                     MOVE SPACES TO ACAT10IO-VINITAST-SW                13731200
                     PERFORM 9000-WRITE-TO-CICS-LOG                     13731300
                     PERFORM 9500-RETURN-DB2-ERROR                      13731400
            END-EVALUATE.                                               13731500
      *                                                                 13731600
      /                                                                 13731700
       0403-UPDATE-BAL05.                                               13731800
                                                                        13731900
           SET UPDATE-VINITAST         TO TRUE                          13732000
           IF  WS-BAL05-COMP2           = ZERO                          13732100
               MOVE ACAT10IO-BAL05-SEQ-NBR TO SV-ASSET-SEQ-NBR          13732200
               PERFORM 0950-GET-VASSET-INFO THRU 0950-EXIT              13732300
               IF  ACAT10IO-VASSET-FOUND                                13732400
                   MOVE 'D'      TO WS-TRANS-TYPE-CD                    13732500
                                    WS-SAVE-TRANS-TYPE                  13732600
                                    ACAT10IO-BAL05-TRAN-TYPE            13732700
                   MOVE ASSET-AMT OF DCLVASSET                          13732800
                                 TO WS-BAL05-COMP2                      13732900
               ELSE                                                     13733000
                   SET NO-UPDATE-VINITAST TO TRUE                       13733100
LRM005             MOVE SV-CLIENT-NBR     TO WS-DLTE-CLIENT-NBR         13733200
LRM005             MOVE SV-DLVR-NBR       TO WS-DLTE-DLVR-NBR           13733300
LRM005             MOVE SV-RCV-NBR        TO WS-DLTE-RCV-NBR            13733400
LRM005             MOVE SV-ACCT-DLVR-NBR  TO WS-DLTE-ACCT-DLVR-NBR      13733500
LRM005             MOVE SV-ACCT-RCV-NBR   TO WS-DLTE-ACCT-RCV-NBR       13733600
LRM005             MOVE SPACES            TO WS-DLTE-ISIN               13733700
LRM005             MOVE SV-ACAT-CNTL-NBR  TO WS-DLTE-ACAT-CNTL-NBR      13733800
LRM005             MOVE '40'              TO WS-DLTE-SLOC               13733900
LRM005             MOVE 'S'               TO WS-DLTE-CSH-MGN-SHRT-CD    13734000
LRM005             PERFORM 2500-CRE-DLTED-CASH-AUDIT-ROW                13735000
                   EXEC SQL                                             13736000
                        DELETE                                          13737000
ET0002                  FROM ACTIAST                                    13738000
                        WHERE  CLIENT_NBR = :SV-CLIENT-NBR              13739000
                          AND  DLVR_NBR = :SV-DLVR-NBR                  13740000
                          AND  RCV_NBR = :SV-RCV-NBR                    13750000
                          AND  ACCT_DLVR_NBR = :SV-ACCT-DLVR-NBR        13760000
                          AND  ACCT_RCV_NBR = :SV-ACCT-RCV-NBR          13770000
                          AND  ISIN_SEC_ISSUE_CD = '         '          13780000
                          AND  ACAT_CONTROL_NBR = :SV-ACAT-CNTL-NBR     13790000
                          AND  STTLM_LCTN_CD = '40'                     13800000
                          AND  CSH_MGN_SHRT_CD  = 'S'                   13810000
                   END-EXEC                                             13820000
               END-IF                                                   13830000
           END-IF                                                       13840000
           IF  UPDATE-VINITAST                                          13850000
LRM025         MOVE  EIBTRMID  TO  CICS-TERM-ID-CD OF DCLACTIAST        13860000
               EXEC SQL                                                 13861000
ET0002              UPDATE ACTIAST                                      13862000
                      SET  NSCC_WTHLD_CD = ' '                          13863000
                          ,TRANS_TYPE_CD = :WS-SAVE-TRANS-TYPE          13864000
                          ,ASSET_AMT = :WS-BAL05-COMP2                  13865000
                          ,STTLM_RSN_CD = :ACAT10IO-MBAL05-STTLM-RSN-CD 13866000
                          ,ASSET_CMNT_TXT = :ACAT10IO-BAL05-CMNT        13867000
                          ,UPDT_TMSTP = CURRENT TIMESTAMP               13868000
                          ,PRGM_NM = 'ACAT10DC'                         13869000
LRM011                    ,NSCC_ACK_IND      =  ' '                     13870000
LRM025                    ,CICS_SGNON_ID = :ACAT10IO-SIGN-ON-ID         13880000
LRM025                    ,CICS_NET_NM   = :ACAT10IO-NET-NAME           13890000
LRM025                    ,TPSCRT_USR_ID = :ACAT10IO-USER-ID            13900000
LRM025                    ,TPSCRT_USR_NM = :ACAT10IO-USER-NAME          13910000
LRM025                    ,CICS_TERM_ID_CD = :DCLACTIAST.CICS-TERM-ID-CD13920000
                    WHERE  CLIENT_NBR = :SV-CLIENT-NBR                  13930000
                      AND  DLVR_NBR = :SV-DLVR-NBR                      13940000
                      AND  RCV_NBR = :SV-RCV-NBR                        13950000
                      AND  ACCT_DLVR_NBR = :SV-ACCT-DLVR-NBR            13960000
                      AND  ACCT_RCV_NBR = :SV-ACCT-RCV-NBR              13970000
                      AND  ISIN_SEC_ISSUE_CD = '         '              13980000
                      AND  ACAT_CONTROL_NBR = :SV-ACAT-CNTL-NBR         13990000
                      AND  STTLM_LCTN_CD = '40'                         14000000
                      AND  CSH_MGN_SHRT_CD  = 'S'                       14010000
               END-EXEC                                                 14020000
           END-IF                                                       14030000
                                                                        14040000
      **                                                                14050000
           EVALUATE SQLCODE                                             14060000
                WHEN +0                                                 14070000
                     SET ACAT10IO-VINITAST-UPDATED TO TRUE              14080000
                     SET ACAT10IO-BAL05-UPDATED TO TRUE                 14090000
                     MOVE WS-BAL05-COMP2 TO ACAT10IO-BAL05              14100000
                     MOVE ACAT10IO-MBAL05-STTLM-RSN-CD TO               14110000
                          ACAT10IO-BAL05-STTLM-RSN-CD                   14120000
                     MOVE 'SHORT BALANCE WAS MODIFIED' TO WS-RETURN-MSG 14130000
                WHEN OTHER                                              14131000
                     MOVE SPACES TO ACAT10IO-VINITAST-SW                14131100
                     PERFORM 9000-WRITE-TO-CICS-LOG                     14131200
                     PERFORM 9500-RETURN-DB2-ERROR                      14131300
            END-EVALUATE.                                               14131400
      *                                                                 14131500
      /                                                                 14131600
       0404-UPDATE-SMA.                                                 14131700
                                                                        14131800
           SET UPDATE-VINITAST         TO TRUE                          14131900
           IF  WS-SMA-COMP2           = ZERO                            14132000
               MOVE ACAT10IO-SMA-SEQ-NBR TO SV-ASSET-SEQ-NBR            14132100
               PERFORM 0950-GET-VASSET-INFO THRU 0950-EXIT              14132200
               IF  ACAT10IO-VASSET-FOUND                                14132300
                   MOVE 'D'      TO WS-TRANS-TYPE-CD                    14132400
                                    WS-SAVE-TRANS-TYPE                  14132500
                                    ACAT10IO-SMA-TRAN-TYPE              14132600
                   MOVE ASSET-AMT OF DCLVASSET                          14132700
                                 TO WS-SMA-COMP2                        14132800
               ELSE                                                     14132900
                   SET NO-UPDATE-VINITAST TO TRUE                       14133000
LRM005             MOVE SV-CLIENT-NBR     TO WS-DLTE-CLIENT-NBR         14134000
LRM005             MOVE SV-DLVR-NBR       TO WS-DLTE-DLVR-NBR           14135000
LRM005             MOVE SV-RCV-NBR        TO WS-DLTE-RCV-NBR            14136000
LRM005             MOVE SV-ACCT-DLVR-NBR  TO WS-DLTE-ACCT-DLVR-NBR      14137000
LRM005             MOVE SV-ACCT-RCV-NBR   TO WS-DLTE-ACCT-RCV-NBR       14138000
LRM005             MOVE SPACES            TO WS-DLTE-ISIN               14139000
LRM005             MOVE SV-ACAT-CNTL-NBR  TO WS-DLTE-ACAT-CNTL-NBR      14140000
LRM005             MOVE '45'              TO WS-DLTE-SLOC               14150000
LRM005             MOVE 'SMA'             TO WS-DLTE-STTLM-RSN-CD       14160000
LRM005             PERFORM 2600-CRE-DLTED-SMA-AUDIT-ROW                 14170000
                   EXEC SQL                                             14180000
                        DELETE                                          14190000
ET0002                  FROM ACTIAST                                    14200000
                        WHERE  CLIENT_NBR = :SV-CLIENT-NBR              14210000
                          AND  DLVR_NBR = :SV-DLVR-NBR                  14220000
                          AND  RCV_NBR = :SV-RCV-NBR                    14230000
                          AND  ACCT_DLVR_NBR = :SV-ACCT-DLVR-NBR        14240000
                          AND  ACCT_RCV_NBR = :SV-ACCT-RCV-NBR          14250000
                          AND  ISIN_SEC_ISSUE_CD = '         '          14260000
                          AND  ACAT_CONTROL_NBR = :SV-ACAT-CNTL-NBR     14261000
                          AND  STTLM_LCTN_CD = '45'                     14262000
                          AND  STTLM_RSN_CD  = 'SMA'                    14263000
                   END-EXEC                                             14264000
               END-IF                                                   14265000
           END-IF                                                       14266000
           IF  UPDATE-VINITAST                                          14267000
LRM025         MOVE  EIBTRMID  TO  CICS-TERM-ID-CD OF DCLACTIAST        14268000
               EXEC SQL                                                 14269000
ET0002              UPDATE ACTIAST                                      14270000
                      SET  NSCC_WTHLD_CD = ' '                          14280000
                          ,TRANS_TYPE_CD = :WS-SAVE-TRANS-TYPE          14290000
                          ,ASSET_AMT = :WS-SMA-COMP2                    14300000
                          ,ASSET_CMNT_TXT = :ACAT10IO-SMA-CMNT          14310000
                          ,UPDT_TMSTP = CURRENT TIMESTAMP               14320000
                          ,PRGM_NM = 'ACAT10DC'                         14330000
LRM011                    ,NSCC_ACK_IND      =  ' '                     14340000
LRM025                    ,CICS_SGNON_ID = :ACAT10IO-SIGN-ON-ID         14350000
LRM025                    ,CICS_NET_NM   = :ACAT10IO-NET-NAME           14360000
LRM025                    ,TPSCRT_USR_ID = :ACAT10IO-USER-ID            14370000
LRM025                    ,TPSCRT_USR_NM = :ACAT10IO-USER-NAME          14380000
LRM025                    ,CICS_TERM_ID_CD = :DCLACTIAST.CICS-TERM-ID-CD14390000
                    WHERE  CLIENT_NBR = :SV-CLIENT-NBR                  14391000
                      AND  DLVR_NBR = :SV-DLVR-NBR                      14392000
                      AND  RCV_NBR = :SV-RCV-NBR                        14393000
                      AND  ACCT_DLVR_NBR = :SV-ACCT-DLVR-NBR            14394000
                      AND  ACCT_RCV_NBR = :SV-ACCT-RCV-NBR              14395000
                      AND  ISIN_SEC_ISSUE_CD = '         '              14396000
                      AND  ACAT_CONTROL_NBR = :SV-ACAT-CNTL-NBR         14397000
                      AND  STTLM_LCTN_CD = '45'                         14398000
                      AND  STTLM_RSN_CD  = 'SMA'                        14399000
               END-EXEC                                                 14400000
           END-IF                                                       14410000
                                                                        14420000
           IF  WS-SMA-COMP2             = ZERO                          14430000
               MOVE 'D'                TO WS-SAVE-TRANS-TYPE            14440000
           END-IF                                                       14441000
LRM001     IF NOT NO-UPDATE-VINITAST                                    14441100
LRM025      MOVE  EIBTRMID  TO  CICS-TERM-ID-CD OF DCLACTIAST           14441200
           EXEC SQL                                                     14441300
ET0002         UPDATE ACTIAST                                           14441400
                  SET  NSCC_WTHLD_CD = ' '                              14441500
                      ,TRANS_TYPE_CD = :WS-SAVE-TRANS-TYPE              14441600
                      ,ASSET_AMT = :WS-SMA-COMP2                        14441700
01/27                 ,ASSET_CMNT_TXT = :ACAT10IO-SMA-CMNT              14441800
                      ,CRT_TMSTP  = CURRENT TIMESTAMP                   14441900
                      ,UPDT_TMSTP = CURRENT TIMESTAMP                   14442000
                      ,PRGM_NM = 'ACAT10DC'                             14442100
LRM011                ,NSCC_ACK_IND      =  ' '                         14442200
LRM025                ,CICS_SGNON_ID = :ACAT10IO-SIGN-ON-ID             14442300
LRM025                ,CICS_NET_NM   = :ACAT10IO-NET-NAME               14442400
LRM025                ,TPSCRT_USR_ID = :ACAT10IO-USER-ID                14442500
LRM025                ,TPSCRT_USR_NM = :ACAT10IO-USER-NAME              14442600
LRM025                ,CICS_TERM_ID_CD = :DCLACTIAST.CICS-TERM-ID-CD    14442700
                WHERE  CLIENT_NBR = :SV-CLIENT-NBR                      14442800
                  AND  DLVR_NBR = :SV-DLVR-NBR                          14442900
                  AND  RCV_NBR = :SV-RCV-NBR                            14443000
                  AND  ACCT_DLVR_NBR = :SV-ACCT-DLVR-NBR                14443100
                  AND  ACCT_RCV_NBR = :SV-ACCT-RCV-NBR                  14443200
                  AND  ISIN_SEC_ISSUE_CD = '         '                  14443300
                  AND  ACAT_CONTROL_NBR = :SV-ACAT-CNTL-NBR             14443400
                  AND  STTLM_LCTN_CD = '45'                             14443500
                  AND  STTLM_RSN_CD  = 'SMA'                            14443600
           END-EXEC.                                                    14443700
      **                                                                14443800
093400     EVALUATE SQLCODE                                             14443900
093500          WHEN +0                                                 14444000
                     SET ACAT10IO-VINITAST-UPDATED TO TRUE              14444100
01/26                SET ACAT10IO-SMA-UPDATED TO TRUE                   14444200
01/21                MOVE WS-SMA-COMP2 TO ACAT10IO-SMA                  14444300
                     MOVE 'SMA AMOUNT  WAS MODIFIED' TO WS-RETURN-MSG   14444400
094000          WHEN OTHER                                              14444500
                     MOVE SPACES TO ACAT10IO-VINITAST-SW                14444600
                     PERFORM 9000-WRITE-TO-CICS-LOG                     14444700
                     PERFORM 9500-RETURN-DB2-ERROR                      14444800
094200      END-EVALUATE.                                               14444900
      *                                                                 14445000
      /                                                                 14446000
       0500-GET-VINITAST-INFO.                                          14447000
      *----------------------------------------------------------------*14448000
      *                GET INITIAL ASSET INFORMATION                   *14449000
      *----------------------------------------------------------------*14450000
           EXEC SQL                                                     14460000
                SELECT                                                  14470000
                       DLVR_NBR                                         14480000
                     , RCV_NBR                                          14490000
                     , ACCT_DLVR_NBR                                    14500000
                     , ACCT_RCV_NBR                                     14510000
                     , ISIN_CNTRY_CD                                    14520000
                     , ISIN_SEC_ISSUE_CD                                14530000
                     , ISIN_SEC_CDG_CD                                  14540000
LRM026               , CRNCY_CD                                         14550000
                     , SECURITY_ADP_NBR                                 14560000
                     , TRANS_TYPE_CD                                    14570000
                     , ASSET_SEQ_NBR                                    14580000
                     , CSH_MGN_SHRT_CD                                  14590000
                     , PSTN_CD                                          14600000
01/21                , OPTN_CTGY_CD                                     14610000
                     , WHI_CD                                           14620000
                     , STTLM_LCTN_CD                                    14630000
                     , STTLM_RSN_CD                                     14640000
                     , NSCC_PEND_CD                                     14650000
LRM012               , NSCC_ACK_IND                                     14660000
                     , NSCC_WTHLD_CD                                    14670000
                     , ASSET_QTY                                        14680000
                     , ASSET_AMT                                        14690000
                     , ASSET_DESC_TXT                                   14700000
                     , ASSET_CMNT_TXT                                   14710000
                 INTO                                                   14720000
                      :WS-DLVR-NBR                                      14730000
                     ,:WS-RCV-NBR                                       14740000
                     ,:WS-ACCT-DLVR-NBR                                 14750000
                     ,:WS-ACCT-RCV-NBR                                  14760000
                     ,:SV-CNTRY-CD                                      14770000
                     ,:WS-SEC-NBR                                       14780000
                     ,:SV-SEC-CDG-CD                                    14790000
LRM026               ,:SV-CRNCY-CD                                      14800000
                     ,:WS-ADP-NBR                                       14810000
                     ,:WS-TRANS-TYPE-CD                                 14820000
                     ,:SV-INITAST-SEQ-NBR                               14830000
                     ,:WS-CSH-MGN-SHRT-CD                               14840000
                     ,:WS-PSTN-CD                                       14850000
01/21                ,:WS-OPTN-CTGY-CD                                  14860000
                     ,:WS-WHEN-ISSUED                                   14870000
                     ,:WS-STTLM-LCTN-CD                                 14880000
                     ,:WS-STTLM-RSN-CD                                  14890000
                     ,:WS-INITAST-NSCC-PEND-CD                          14900000
LRM011               ,:WS-INITAST-NSCC-ACK-IND                          14910000
                     ,:WS-NSCC-WTHLD-CD                                 14920000
                     ,:WS-ASSET-QTY                                     14930000
                     ,:WS-ASSET-AMT                                     14940000
                     ,:WS-ASSET-DESC                                    14950000
                     ,:WS-ASSET-CMNT                                    14960000
ET0002               FROM ACTIAST                                       14970000
                   WHERE (CLIENT_NBR = :SV-CLIENT-NBR                   14980000
                     AND  DLVR_NBR = :SV-DLVR-NBR                       14990000
                     AND  RCV_NBR = :SV-RCV-NBR                         15000000
                     AND  ACCT_DLVR_NBR = :SV-ACCT-DLVR-NBR             15010000
                     AND  ACCT_RCV_NBR = :SV-ACCT-RCV-NBR               15020000
                     AND  ISIN_SEC_ISSUE_CD = :SV-SEC-ISSUE-CD          15030000
                     AND  STTLM_LCTN_CD = :SV-STTLM-LCTN-CD             15040000
                     AND  CSH_MGN_SHRT_CD = :SV-CSH-MGN-SHRT-CD         15050000
                     AND  ACAT_CONTROL_NBR = :SV-ACAT-CNTL-NBR          15060000
                     AND  ASSET_SEQ_NBR = :SV-ASSET-SEQ-NBR)            15070000
            END-EXEC.                                                   15080000
      *********      AND  STTLM_RSN_CD = :WS-STTLM-RSN-CD               15090000
                                                                        15100000
            EVALUATE SQLCODE                                            15110000
                WHEN +0                                                 15120000
                     SET ACAT10IO-VINITAST-FOUND TO TRUE                15130000
                     MOVE SV-INITAST-SEQ-NBR TO                         15140000
                                        ACAT10IO-SV-INITAST-SEQ-NBR     15150000
                     MOVE WS-TRANS-TYPE-CD                              15160000
                                       TO WS-SAVE-TRANS-TYPE            15170000
      *              IF SV-SEC-ISSUE-CD = WS-INIT-SEC-NBR               15180000
      *                 MOVE '         ' TO SV-SEC-ISSUE-CD             15190000
      *              END-IF                                             15200000
                     IF ACAT10IO-OPTN-CTGY-CD NOT = '00'                15210000
                        MOVE WS-OPTN-CTGY-CD TO ACAT10IO-OPTN-CTGY-CD   15220000
                        PERFORM 0820-GET-VINITOPN THRU 0820-EXIT        15230000
                        MOVE WS-OPT-BS-CD    TO ACAT10IO-OPT-BS-CD      15240000
                     END-IF                                             15250000
                WHEN +100                                               15260000
                     SET ACAT10IO-VINITAST-NOT-FOUND TO TRUE            15270000
                     IF ACAT10IO-SEC-NBR = '         '        AND       15280000
                        WS-INIT-SEC-NBR NOT = SV-SEC-ISSUE-CD AND       15290000
                        NOT ACAT10IO-SV-STTLM-LCTN-CD = '40'  AND       15300000
                        NOT ACAT10IO-STTLM-RSN-CD  = 'SMA '             15310000
                        MOVE SV-ASSET-SEQ-NBR TO WS-SEQ-NBR-9           15320000
                        MOVE WS-SEQ-NBR-9     TO WS-INIT-SEQ-NBR-9      15330000
                        MOVE WS-INIT-SEC-NBR  TO SV-SEC-ISSUE-CD        15340000
                        GO TO 0500-GET-VINITAST-INFO                    15350000
                     END-IF                                             15360000
                WHEN -811                                               15370000
                     CONTINUE                                           15380000
                WHEN OTHER                                              15390000
                     SET ACAT10IO-VINITAST-NOT-FOUND TO TRUE            15400000
                     PERFORM 9000-WRITE-TO-CICS-LOG                     15410000
                     PERFORM 9500-RETURN-DB2-ERROR                      15420000
            END-EVALUATE.                                               15430000
      *                                                                 15440000
       0500-EXIT.                                                       15450000
           EXIT.                                                        15460000
      /                                                                 15470000
       0510-GET-VINITAST-BY-SEQNBR.                                     15480000
      *----------------------------------------------------------------*15490000
      *          GET INITIAL ASSET INFORMATION BY SEQ NBR              *15500000
      *----------------------------------------------------------------*15510000
           EXEC SQL                                                     15520000
                SELECT                                                  15530000
                       DLVR_NBR                                         15540000
                     , RCV_NBR                                          15550000
                     , ACCT_DLVR_NBR                                    15560000
                     , ACCT_RCV_NBR                                     15570000
                     , ISIN_CNTRY_CD                                    15580000
                     , ISIN_SEC_ISSUE_CD                                15590000
                     , ISIN_SEC_CDG_CD                                  15600000
LRM026               , CRNCY_CD                                         15610000
                     , SECURITY_ADP_NBR                                 15620000
                     , ASSET_SEQ_NBR                                    15630000
                     , TRANS_TYPE_CD                                    15640000
                     , CSH_MGN_SHRT_CD                                  15650000
                     , PSTN_CD                                          15660000
                     , OPTN_CTGY_CD                                     15670000
                     , WHI_CD                                           15680000
                     , STTLM_LCTN_CD                                    15690000
                     , STTLM_RSN_CD                                     15700000
                     , NSCC_PEND_CD                                     15710000
LRM012               , NSCC_ACK_IND                                     15720000
                     , NSCC_WTHLD_CD                                    15730000
                     , ASSET_QTY                                        15740000
                     , ASSET_AMT                                        15750000
                     , ASSET_DESC_TXT                                   15760000
                     , ASSET_CMNT_TXT                                   15770000
                 INTO                                                   15780000
                      :WS-DLVR-NBR                                      15790000
                     ,:WS-RCV-NBR                                       15800000
                     ,:WS-ACCT-DLVR-NBR                                 15810000
                     ,:WS-ACCT-RCV-NBR                                  15820000
                     ,:SV-CNTRY-CD                                      15830000
                     ,:WS-SEC-NBR                                       15840000
                     ,:SV-SEC-CDG-CD                                    15850000
LRM026               ,:SV-CRNCY-CD                                      15860000
                     ,:WS-ADP-NBR                                       15870000
                     ,:SV-INITAST-SEQ-NBR                               15880000
                     ,:WS-TRANS-TYPE-CD                                 15890000
                     ,:WS-CSH-MGN-SHRT-CD                               15900000
                     ,:WS-PSTN-CD                                       15910000
                     ,:WS-OPTN-CTGY-CD                                  15920000
                     ,:WS-WHEN-ISSUED                                   15930000
                     ,:WS-STTLM-LCTN-CD                                 15940000
                     ,:WS-STTLM-RSN-CD                                  15950000
                     ,:WS-INITAST-NSCC-PEND-CD                          15960000
LRM012               ,:WS-INITAST-NSCC-ACK-IND                          15970000
                     ,:WS-NSCC-WTHLD-CD                                 15980000
                     ,:WS-ASSET-QTY                                     15990000
                     ,:WS-ASSET-AMT                                     16000000
                     ,:WS-ASSET-DESC                                    16010000
                     ,:WS-ASSET-CMNT                                    16020000
ET0002               FROM ACTIAST                                       16030000
                   WHERE (CLIENT_NBR = :SV-CLIENT-NBR                   16040000
                     AND  DLVR_NBR = :SV-DLVR-NBR                       16050000
                     AND  RCV_NBR = :SV-RCV-NBR                         16060000
                     AND  ACCT_DLVR_NBR = :SV-ACCT-DLVR-NBR             16070000
                     AND  ACCT_RCV_NBR = :SV-ACCT-RCV-NBR               16080000
                     AND  ISIN_CNTRY_CD = :SV-CNTRY-CD                  16090000
                     AND  ISIN_SEC_ISSUE_CD = :SV-SEC-ISSUE-CD          16100000
                     AND  STTLM_LCTN_CD = :SV-STTLM-LCTN-CD             16110000
                     AND  CSH_MGN_SHRT_CD = :SV-CSH-MGN-SHRT-CD         16120000
                     AND  ACAT_CONTROL_NBR = :SV-ACAT-CNTL-NBR          16130000
                     AND  ASSET_SEQ_NBR = :SV-INITAST-SEQ-NBR)          16140000
            END-EXEC.                                                   16150000
      ********       AND  ISIN_SEC_CDG_CD = :SV-SEC-CDG-CD              16160000
                                                                        16170000
            EVALUATE SQLCODE                                            16180000
                WHEN +0                                                 16190000
                     SET ACAT10IO-VINITAST-FOUND TO TRUE                16200000
                     IF ACAT10IO-OPTN-CTGY-CD NOT = '00'                16210000
                        MOVE WS-OPTN-CTGY-CD TO ACAT10IO-OPTN-CTGY-CD   16220000
                        PERFORM 0820-GET-VINITOPN THRU 0820-EXIT        16230000
                        MOVE WS-OPT-BS-CD    TO ACAT10IO-OPT-BS-CD      16240000
                     END-IF                                             16250000
                     MOVE LOW-VALUE  TO ACAT10IO-DC                     16260000
                     PERFORM 0050-MOVE-ASSET-DATA THRU 0050-EXIT        16270000
                     MOVE SV-INITAST-SEQ-NBR TO                         16280000
                                        ACAT10IO-SV-INITAST-SEQ-NBR     16290000
                WHEN +100                                               16300000
                     SET ACAT10IO-VINITAST-NOT-FOUND TO TRUE            16310000
                WHEN OTHER                                              16320000
                     SET ACAT10IO-VINITAST-NOT-FOUND TO TRUE            16330000
                     PERFORM 9000-WRITE-TO-CICS-LOG                     16340000
                     PERFORM 9500-RETURN-DB2-ERROR                      16350000
            END-EVALUATE.                                               16360000
      *                                                                 16370000
       0510-EXIT.                                                       16380000
           EXIT.                                                        16390000
      /                                                                 16400000
       0600-ISRT-VINITAST.                                              16410000
ET0002**   INITIALIZE DCLVINITAST.                                      16420000
ET0002     INITIALIZE DCLACTIAST.                                       16430000
           IF (ACAT10IO-MBAL01 > SPACE  AND                             16440000
               ACAT10IO-BAL01-CHANGED)                                  16450000
           OR (ACAT10IO-MBAL02 > SPACE  AND                             16460000
               ACAT10IO-BAL02-CHANGED)                                  16470000
           OR (ACAT10IO-MBAL05 > SPACE  AND                             16480000
               ACAT10IO-BAL05-CHANGED)                                  16490000
           OR (ACAT10IO-MSMA   > SPACE  AND                             16500000
               ACAT10IO-SMA-CHANGED)                                    16510000
              IF ACAT10IO-VASSET-FOUND                                  16520000
                 PERFORM 0620-MOVE-FROM-VASSET THRU 0620-EXIT           16530000
              END-IF                                                    16540000
              PERFORM 0630-MOVE-CASH-BALANCE THRU 0630-EXIT             16550000
           ELSE                                                         16560000
              IF ACAT10IO-VASSET-FOUND                                  16570000
                 PERFORM 0610-MOVE-ASSET-DATA THRU 0610-EXIT            16580000
              END-IF                                                    16590000
           END-IF.                                                      16600000
           IF  ACAT10IO-STCD            > '199' AND < '300' AND         16610000
               ACAT10IO-MCD             < 'D'                           16620000
               IF  ACAT10IO-VASSET-FOUND                                16630000
ET0002             MOVE 'C'            TO TRANS-TYPE-CD OF DCLACTIAST   16640000
               ELSE                                                     16650000
ET0002             MOVE 'A'            TO TRANS-TYPE-CD OF DCLACTIAST   16660000
               END-IF                                                   16670000
ET0002         MOVE ' '                TO NSCC-PEND-CD OF DCLACTIAST    16680000
           END-IF                                                       16690000
LRM013     IF  ACAT10IO-STCD            > '199' AND < '300'             16700000
LRM013         MOVE ' ' TO NSCC-ACK-IND OF DCLACTIAST                   16710000
LRM013     END-IF.                                                      16720000
LRM004     MOVE ACAT10IO-SIGN-ON-ID TO CICS-SGNON-ID OF DCLACTIAST.     16730000
LRM005     MOVE ACAT10IO-NET-NAME   TO CICS-NET-NM   OF DCLACTIAST      16740000
LRM005     MOVE ACAT10IO-USER-ID    TO TPSCRT-USR-ID OF DCLACTIAST      16750000
LRM005     MOVE ACAT10IO-USER-NAME  TO TPSCRT-USR-NM OF DCLACTIAST      16760000
LRM005     MOVE  EIBTRMID  TO  CICS-TERM-ID-CD OF DCLACTIAST.           16770000
      ***                                                               16780000
           EXEC SQL                                                     16790000
ET0002          INSERT INTO ACTIAST                                     16800000
                ( CLIENT_NBR                                            16810000
                , DLVR_NBR                                              16811000
                , ACCT_DLVR_NBR                                         16812000
                , RCV_NBR                                               16813000
                , ACCT_RCV_NBR                                          16814000
                , ISIN_CNTRY_CD                                         16814100
                , ISIN_SEC_ISSUE_CD                                     16814200
                , ISIN_SEC_CDG_CD                                       16814300
                , STTLM_LCTN_CD                                         16814400
                , CSH_MGN_SHRT_CD                                       16814500
                , CSH_MRG_SHT_STS_CD                                    16814600
                , STTLM_LCTN_STTS_CD                                    16814700
                , ISIN_CNTRY_STTS_CD                                    16814800
                , SBMTG_PRTCP_NBR                                       16814900
                , SBMT_PRT_NR_STS_CD                                    16815000
                , ACAT_CONTROL_NBR                                      16815100
                , CONTROL_NBR_STS_CD                                    16815200
                , ASSET_SEQ_NBR                                         16815300
                , AST_SEQ_NBR_STS_CD                                    16815400
                , TRANS_TYPE_CD                                         16815500
                , TRANS_TYPE_STTS_CD                                    16815600
                , PHSCL_SEQ_NBR                                         16815700
                , PHSCL_SEQ_STTS_CD                                     16815800
                , LGCL_SEQ_NBR                                          16815900
                , LGCL_SEQ_NR_STS_CD                                    16816000
                , ASSET_PRC_CTGY_CD                                     16817000
                , AST_PRC_CTG_STS_CD                                    16818000
                , STTLM_RSN_CD                                          16819000
                , STTLM_RSN_STTS_CD                                     16820000
                , ASSET_DESC_TXT                                        16830000
                , ASSET_DESC_STTS_CD                                    16831000
                , ASSET_RQST_QTY_CD                                     16832000
                , ASSET_RQST_STS_CD                                     16833000
                , AST_RQST_TRANS_CD                                     16834000
                , AST_RQ_TRAN_STS_CD                                    16835000
                , ASSET_QTY                                             16836000
                , ASSET_QTY_STTS_CD                                     16837000
                , ASSET_PCT                                             16838000
                , ASSET_PCT_STTS_CD                                     16839000
                , PSTN_CD                                               16840000
                , PSTN_CD_STTS_CD                                       16850000
                , ISO_CRNCY_CD                                          16860000
                , ISO_CRNCY_STTS_CD                                     16870000
                , ASSET_AMT                                             16880000
                , ASSET_AMT_STTS_CD                                     16890000
                , BEARER_BOND_CD                                        16900000
                , BEARER_BND_STTS_CD                                    16910000
                , WHI_CD                                                16920000
                , WHI_STTS_CD                                           16930000
                , TRNFR_TYPE_RSN_CD                                     16940000
                , TRN_TYP_RSN_STS_CD                                    16950000
                , MBS_SERIAL_NBR                                        16960000
                , MBS_SERIAL_STTS_CD                                    16970000
                , ASSET_CMNT_TXT                                        16980000
                , ASSET_CMNT_STTS_CD                                    16990000
                , NSCC_WTHLD_CD                                         17000000
                , TRANS_RFRN_ID_CD                                      17010000
                , TRANS_RFRN_STTS_CD                                    17020000
                , ISIN_SEC_IS_STS_CD                                    17030000
                , ISIN_SEC_CD_STS_CD                                    17040000
                , OPTN_CTGY_CD                                          17050000
                , OPTN_CTGY_STTS_CD                                     17060000
                , RCRD_LNGTH_STTS_CD                                    17070000
                , RCRD_STTS_CD                                          17080000
                , NSCC_PEND_CD                                          17090000
                , NSCC_ACK_IND                                          17100000
                , PRGM_NM                                               17110000
                , CICS_TERM_ID_CD                                       17120000
                , UPDT_TMSTP                                            17130000
                , CRT_TMSTP                                             17140000
                , SECURITY_ADP_NBR                                      17150000
                , TRNFR_TYPE_CD                                         17160000
                , TRNFR_TYPE_STTS_CD                                    17170000
                , RCV_NBR_STTS_CD                                       17180000
                , DLVR_NBR_STTS_CD                                      17190000
LRM004          , CICS_SGNON_ID                                         17200000
LRM005          , CICS_NET_NM                                           17210000
LRM005          , TPSCRT_USR_ID                                         17220000
LRM005          , TPSCRT_USR_NM )                                       17230000
                  VALUES                                                17240000
ET0002          (: DCLACTIAST.CLIENT-NBR                                17250000
ET0002          ,: DCLACTIAST.DLVR-NBR                                  17260000
ET0002          ,: DCLACTIAST.ACCT-DLVR-NBR                             17270000
ET0002          ,: DCLACTIAST.RCV-NBR                                   17280000
ET0002          ,: DCLACTIAST.ACCT-RCV-NBR                              17290000
ET0002          ,: DCLACTIAST.ISIN-CNTRY-CD                             17300000
ET0002          ,: DCLACTIAST.ISIN-SEC-ISSUE-CD                         17310000
ET0002          ,: DCLACTIAST.ISIN-SEC-CDG-CD                           17320000
ET0002          ,: DCLACTIAST.STTLM-LCTN-CD                             17330000
ET0002          ,: DCLACTIAST.CSH-MGN-SHRT-CD                           17340000
ET0002          ,: DCLACTIAST.CSH-MRG-SHT-STS-CD                        17350000
ET0002          ,: DCLACTIAST.STTLM-LCTN-STTS-CD                        17360000
ET0002          ,: DCLACTIAST.ISIN-CNTRY-STTS-CD                        17370000
ET0002          ,: DCLACTIAST.SBMTG-PRTCP-NBR                           17380000
ET0002          ,: DCLACTIAST.SBMT-PRT-NR-STS-CD                        17390000
ET0002          ,: DCLACTIAST.ACAT-CONTROL-NBR                          17400000
ET0002          ,: DCLACTIAST.CONTROL-NBR-STS-CD                        17410000
ET0002          ,: DCLACTIAST.ASSET-SEQ-NBR                             17420000
ET0002          ,: DCLACTIAST.AST-SEQ-NBR-STS-CD                        17430000
ET0002          ,: DCLACTIAST.TRANS-TYPE-CD                             17440000
ET0002          ,: DCLACTIAST.TRANS-TYPE-STTS-CD                        17450000
ET0002          ,: DCLACTIAST.PHSCL-SEQ-NBR                             17460000
ET0002          ,: DCLACTIAST.PHSCL-SEQ-STTS-CD                         17470000
ET0002          ,: DCLACTIAST.LGCL-SEQ-NBR                              17480000
ET0002          ,: DCLACTIAST.LGCL-SEQ-NR-STS-CD                        17490000
ET0002          ,: DCLACTIAST.ASSET-PRC-CTGY-CD                         17500000
ET0002          ,: DCLACTIAST.AST-PRC-CTG-STS-CD                        17510000
ET0002          ,: DCLACTIAST.STTLM-RSN-CD                              17520000
ET0002          ,: DCLACTIAST.STTLM-RSN-STTS-CD                         17530000
ET0002          ,: DCLACTIAST.ASSET-DESC-TXT                            17540000
ET0002          ,: DCLACTIAST.ASSET-DESC-STTS-CD                        17550000
ET0002          ,: DCLACTIAST.ASSET-RQST-QTY-CD                         17560000
ET0002          ,: DCLACTIAST.ASSET-RQST-STS-CD                         17570000
ET0002          ,: DCLACTIAST.AST-RQST-TRANS-CD                         17580000
ET0002          ,: DCLACTIAST.AST-RQ-TRAN-STS-CD                        17590000
ET0002          ,: DCLACTIAST.ASSET-QTY                                 17600000
ET0002          ,: DCLACTIAST.ASSET-QTY-STTS-CD                         17610000
ET0002          ,: DCLACTIAST.ASSET-PCT                                 17620000
ET0002          ,: DCLACTIAST.ASSET-PCT-STTS-CD                         17630000
ET0002          ,: DCLACTIAST.PSTN-CD                                   17640000
ET0002          ,: DCLACTIAST.PSTN-CD-STTS-CD                           17650000
ET0002          ,: DCLACTIAST.ISO-CRNCY-CD                              17660000
ET0002          ,: DCLACTIAST.ISO-CRNCY-STTS-CD                         17670000
ET0002          ,: DCLACTIAST.ASSET-AMT                                 17680000
ET0002          ,: DCLACTIAST.ASSET-AMT-STTS-CD                         17690000
ET0002          ,: DCLACTIAST.BEARER-BOND-CD                            17700000
ET0002          ,: DCLACTIAST.BEARER-BND-STTS-CD                        17710000
ET0002          ,: DCLACTIAST.WHI-CD                                    17720000
ET0002          ,: DCLACTIAST.WHI-STTS-CD                               17730000
ET0002          ,: DCLACTIAST.TRNFR-TYPE-RSN-CD                         17740000
ET0002          ,: DCLACTIAST.TRN-TYP-RSN-STS-CD                        17750000
ET0002          ,: DCLACTIAST.MBS-SERIAL-NBR                            17760000
ET0002          ,: DCLACTIAST.MBS-SERIAL-STTS-CD                        17770000
ET0002          ,: DCLACTIAST.ASSET-CMNT-TXT                            17780000
ET0002          ,: DCLACTIAST.ASSET-CMNT-STTS-CD                        17790000
ET0002          ,: DCLACTIAST.NSCC-WTHLD-CD                             17800000
ET0002          ,: DCLACTIAST.TRANS-RFRN-ID-CD                          17810000
ET0002          ,: DCLACTIAST.TRANS-RFRN-STTS-CD                        17820000
ET0002          ,: DCLACTIAST.ISIN-SEC-IS-STS-CD                        17830000
ET0002          ,: DCLACTIAST.ISIN-SEC-CD-STS-CD                        17840000
ET0002          ,: DCLACTIAST.OPTN-CTGY-CD                              17850000
ET0002          ,: DCLACTIAST.OPTN-CTGY-STTS-CD                         17860000
ET0002          ,: DCLACTIAST.RCRD-LNGTH-STTS-CD                        17870000
ET0002          ,: DCLACTIAST.RCRD-STTS-CD                              17880000
ET0002          ,: DCLACTIAST.NSCC-PEND-CD                              17890000
ET0002          ,: DCLACTIAST.NSCC-ACK-IND                              17900000
ET0002          ,: DCLACTIAST.PRGM-NM                                   17910000
ET0002          ,: DCLACTIAST.CICS-TERM-ID-CD                           17920000
ET0002          ,: DCLACTIAST.UPDT-TMSTP                                17930000
ET0002          ,: DCLACTIAST.CRT-TMSTP                                 17940000
ET0002          ,: DCLACTIAST.SECURITY-ADP-NBR                          17950000
ET0002          ,: DCLACTIAST.TRNFR-TYPE-CD                             17960000
ET0002          ,: DCLACTIAST.TRNFR-TYPE-STTS-CD                        17970000
ET0002          ,: DCLACTIAST.RCV-NBR-STTS-CD                           17980000
ET0002          ,: DCLACTIAST.DLVR-NBR-STTS-CD                          17990000
LRM004          ,: DCLACTIAST.CICS-SGNON-ID                             18000000
LRM005          ,: DCLACTIAST.CICS-NET-NM                               18010000
LRM005          ,: DCLACTIAST.TPSCRT-USR-ID                             18020000
LRM005          ,: DCLACTIAST.TPSCRT-USR-NM  )                          18030000
           END-EXEC.                                                    18040000
      *                                                                 18050000
093400     EVALUATE SQLCODE                                             18060000
093500          WHEN +0                                                 18070000
                     SET ACAT10IO-VINITAST-INSERTED TO TRUE             18080000
                     SET VINITAST-INSERTED TO TRUE                      18090000
LRM005               IF STTLM-LCTN-CD OF DCLACTIAST = '40' OR '45'      18100000
LRM005                  PERFORM 2500-DLT-DLTED-CASH-AUDIT-ROW           18110000
LRM005               END-IF                                             18120000
12/02           WHEN -803                                               18130000
ET0001               MOVE 'UPDATE FAILED! DUPE ASSETS FOUND, WAIT 2 MORE18140000
ET0001-                   ' CYCLES TO UPDATE.  PF10 TO EXIT'            18150000
ET0001                 TO ACAT10IO-RETURN-MSG                           18160000
ET0001               EXEC CICS RETURN END-EXEC                          18170000
                     SET ACAT10IO-UPDT-VINITAST     TO TRUE             18180000
12/30                PERFORM 0400-UPDT-VINITAST THRU 0400-EXIT          18181000
094000          WHEN OTHER                                              18182000
                     MOVE SPACES TO ACAT10IO-VINITAST-SW                18183000
                                    INSERT-VINITAST-SW                  18184000
                     PERFORM 9000-WRITE-TO-CICS-LOG                     18185000
                     PERFORM 9500-RETURN-DB2-ERROR                      18186000
094200     END-EVALUATE.                                                18187000
                                                                        18188000
01/26      IF ACAT10IO-MBAL01 > SPACE                                   18189000
           AND ACAT10IO-BAL01-CHANGED                                   18190000
              MOVE WS-BAL01-COMP2 TO ACAT10IO-BAL01, ACAT10IO-BAL01-9   18200000
              SET ACAT10IO-BAL01-UPDATED TO TRUE                        18210000
           ELSE                                                         18220000
01/26      IF ACAT10IO-MBAL02 > SPACE                                   18230000
           AND ACAT10IO-BAL02-CHANGED                                   18240000
              MOVE WS-BAL02-COMP2 TO ACAT10IO-BAL02, ACAT10IO-BAL02-9   18250000
              SET ACAT10IO-BAL02-UPDATED TO TRUE                        18251000
           ELSE                                                         18252000
01/26      IF ACAT10IO-MBAL05 > SPACE                                   18253000
           AND ACAT10IO-BAL05-CHANGED                                   18254000
              MOVE WS-BAL05-COMP2 TO ACAT10IO-BAL05, ACAT10IO-BAL05-9   18255000
              SET ACAT10IO-BAL05-UPDATED TO TRUE                        18256000
           ELSE                                                         18257000
01/26      IF ACAT10IO-MSMA > SPACE                                     18258000
           AND ACAT10IO-SMA-CHANGED                                     18259000
              MOVE WS-SMA-COMP2   TO ACAT10IO-SMA, ACAT10IO-SMA-9       18260000
              SET ACAT10IO-SMA-UPDATED TO TRUE                          18270000
           ELSE                                                         18280000
01/24      IF ACAT10IO-MQTY > SPACE                                     18290000
           AND ACAT10IO-QTY-CHANGED                                     18300000
              MOVE WS-QTY-COMP2 TO ACAT10IO-ASSET-QTY, ACAT10IO-QTY-9   18310000
              SET ACAT10IO-QTY-UPDATED TO TRUE                          18320000
              IF ACAT10IO-MAMT > SPACE                                  18330000
              AND ACAT10IO-AMT-CHANGED                                  18340000
                 MOVE WS-AMT-COMP2 TO ACAT10IO-ASSET-AMT, ACAT10IO-AMT-918350000
                 SET ACAT10IO-AMT-UPDATED TO TRUE                       18360000
              END-IF                                                    18370000
           ELSE                                                         18380000
              IF ACAT10IO-MAMT > SPACE                                  18390000
              AND ACAT10IO-AMT-CHANGED                                  18400000
                 MOVE WS-AMT-COMP2 TO ACAT10IO-ASSET-AMT, ACAT10IO-AMT-918410000
                 SET ACAT10IO-AMT-UPDATED TO TRUE                       18420000
01/24         END-IF                                                    18430000
01/24      END-IF END-IF END-IF END-IF END-IF.                          18440000
                                                                        18450000
01/26      IF ACAT10IO-BAL01-UPDATED   AND                              18460000
01/26         ACAT10IO-BAL02-UPDATED   AND                              18470000
01/26         ACAT10IO-BAL05-UPDATED   AND                              18480000
              ACAT10IO-SMA-UPDATED                                      18490000
              MOVE 'CASH/MARGIN/SHORT/SMA BALANCES WERE ALL MODIFIED'   18500000
              TO WS-RETURN-MSG                                          18510000
           ELSE                                                         18520000
01/26         IF ACAT10IO-BAL01-UPDATED                                 18530000
                 MOVE '                 CASH BALANCE WAS MODIFIED    '  18540000
                 TO WS-RETURN-MSG                                       18550000
              ELSE                                                      18560000
01/26            IF ACAT10IO-BAL02-UPDATED                              18570000
                   MOVE '               MARGIN BALANCE WAS MODIFIED  '  18580000
                    TO WS-RETURN-MSG                                    18590000
                 ELSE                                                   18600000
01/26               IF ACAT10IO-BAL05-UPDATED                           18610000
                       MOVE '              SHORT BALANCE WAS MODIFIED  '18620000
                       TO WS-RETURN-MSG                                 18630000
                    ELSE                                                18640000
01/26               IF ACAT10IO-SMA-UPDATED                             18650000
                       MOVE '                SMA BALANCE WAS MODIFIED  '18660000
                       TO WS-RETURN-MSG                                 18670000
                    END-IF                                              18680000
                 END-IF                                                 18690000
              END-IF                                                    18700000
           END-IF.                                                      18710000
01/26      IF ACAT10IO-QTY-UPDATED                                      18720000
              MOVE '                  ASSET QUANTITY WAS MODIFIED' TO   18730000
              WS-RETURN-MSG                                             18740000
           END-IF.                                                      18750000
           IF ACAT10IO-AMT-UPDATED                                      18760000
              MOVE '                    ASSET AMOUNT WAS MODIFIED' TO   18770000
              WS-RETURN-MSG                                             18780000
           END-IF.                                                      18790000
01/26      IF ACAT10IO-QTY-UPDATED  AND                                 18800000
              ACAT10IO-AMT-UPDATED                                      18810000
              MOVE ' ASSET QUANTITY AND AMOUNT WERE MODIFIED' TO        18820000
              WS-RETURN-MSG                                             18830000
           END-IF.                                                      18840000
                                                                        18850000
       0600-EXIT.                                                       18860000
           EXIT.                                                        18870000
      /                                                                 18880000
       0610-MOVE-ASSET-DATA.                                            18890000
                                                                        18900000
12/15      PERFORM 0620-MOVE-FROM-VASSET THRU 0620-EXIT.                18910000
      *                                                                 18920000
      *==> MOVE FROM ACAT10IO -------------------------------------     18930000
12/08      IF ACAT10IO-MCD > LOW-VALUE                                  18940000
              IF ACAT10IO-MCD = 'W'                                     18950000
ET0002           MOVE 'W'             TO NSCC-WTHLD-CD OF DCLACTIAST    18960000
                                         ACAT10IO-NSCC-WTHLD-CD         18970000
ET0002           MOVE 'H'             TO NSCC-PEND-CD  OF DCLACTIAST    18980000
                                         ACAT10IO-VINITAST-NSCC-PEND-CD 18990000
              ELSE                                                      19000000
ET0002           MOVE SPACE           TO NSCC-WTHLD-CD OF DCLACTIAST    19010000
                                         ACAT10IO-NSCC-WTHLD-CD         19020000
ET0002                                   NSCC-PEND-CD  OF DCLACTIAST    19030000
                                         ACAT10IO-VINITAST-NSCC-PEND-CD 19040000
              END-IF                                                    19050000
           END-IF.                                                      19060000
      ***                                                               19070000
01/26      IF ACAT10IO-STCD < '200'                                     19080000
              IF ACAT10IO-MCD = 'C' OR 'C'                              19090000
ET0002           MOVE 'A'             TO TRANS-TYPE-CD OF DCLACTIAST    19100000
              ELSE                                                      19110000
ET0002           MOVE 'C'             TO TRANS-TYPE-CD OF DCLACTIAST    19120000
              END-IF                                                    19130000
           ELSE                                                         19140000
ET0002        MOVE ACAT10IO-MCD       TO TRANS-TYPE-CD OF DCLACTIAST    19150000
01/26      END-IF.                                                      19160000
      *                                                                 19170000
ET0002     MOVE ACAT10IO-SV-CLIENT-NBR    TO CLIENT-NBR OF DCLACTIAST.  19180000
ET0002     MOVE ACAT10IO-DLVR-NBR         TO DLVR-NBR OF DCLACTIAST.    19190000
           MOVE ACAT10IO-SV-ACCT-DLVR-NBR TO                            19200000
ET0002                                     ACCT-DLVR-NBR OF DCLACTIAST. 19210000
ET0002     MOVE ACAT10IO-SV-RCV-NBR       TO RCV-NBR OF DCLACTIAST.     19220000
           MOVE ACAT10IO-SV-ACCT-RCV-NBR  TO                            19230000
ET0002                                      ACCT-RCV-NBR OF DCLACTIAST. 19240000
 12/03     MOVE ACAT10IO-SV-ASSET-SEQ-NBR TO                            19250000
ET0002                                     ASSET-SEQ-NBR OF DCLACTIAST. 19260000
           MOVE ACAT10IO-SV-CNTRY-CD TO                                 19270000
ET0002                                 ISIN-CNTRY-CD OF DCLACTIAST.     19280000
 12/11**** CONSTRUCT A UNIQUE SEC NBR FOR ASSET WHICH DOES NOT HAVE     19290000
 12/11**** SEC NBR                                                      19300000
           IF ACAT10IO-SV-SEC-ISSUE-CD = SPACES  AND                    19310000
              ACAT10IO-STTLM-LCTN-CD NOT = '40'  AND                    19320000
              ACAT10IO-STTLM-RSN-CD NOT = 'SMA '                        19330000
              MOVE ACAT10IO-SV-ASSET-SEQ-NBR    TO  WS-SEQ-NBR-9        19340000
              MOVE WS-SEQ-NBR-9                 TO  WS-INIT-SEQ-NBR-9   19350000
ET0002        MOVE WS-INIT-SEC-NBR  TO ISIN-SEC-ISSUE-CD OF DCLACTIAST  19360000
           ELSE                                                         19370000
              MOVE ACAT10IO-SV-SEC-ISSUE-CD TO                          19380000
ET0002                                 ISIN-SEC-ISSUE-CD OF DCLACTIAST. 19390000
           MOVE ACAT10IO-SV-SEC-CDG-CD TO                               19400000
ET0002                                 ISIN-SEC-CDG-CD OF DCLACTIAST.   19410000
LRM026     MOVE ACAT10IO-SV-CRNCY-CD   TO  CRNCY-CD     OF DCLACTIAST.  19420000
ET0002     MOVE ACAT10IO-ADP-NBR TO    SECURITY-ADP-NBR OF DCLACTIAST.  19430000
           MOVE ACAT10IO-STTLM-LCTN-CD TO                               19440000
ET0002                                    STTLM-LCTN-CD OF DCLACTIAST.  19450000
           MOVE ACAT10IO-ACAT-CONTROL-NBR                               19460000
ET0002                               TO ACAT-CONTROL-NBR OF DCLACTIAST. 19470000
      *                                                                 19480000
           MOVE ACAT10IO-CSH-MGN-SHRT-CD                                19490000
ET0002                                TO CSH-MGN-SHRT-CD OF DCLACTIAST. 19500000
      *                                                                 19510000
           IF ACAT10IO-MQTY > SPACE   AND                               19520000
              ACAT10IO-QTY-CHANGED                                      19530000
              MOVE ACAT10IO-QTY-9 TO WS-QTY-COMP2                       19540000
ET0002        MOVE WS-QTY-COMP2 TO ASSET-QTY OF DCLACTIAST              19550000
              IF ACAT10IO-QTY-9 > +0                                    19560000
                 SET ACAT10IO-LONG-ASSET-QTY TO TRUE                    19570000
              ELSE                                                      19580000
                 IF ACAT10IO-QTY-9 < +0                                 19590000
                    SET ACAT10IO-SHORT-ASSET-QTY TO TRUE                19600000
                    COMPUTE WS-QTY-COMP2 = WS-QTY-COMP2 * -1            19610000
                 ELSE                                                   19620000
                    SET ACAT10IO-NA-ASSET-QTY TO TRUE                   19630000
                 END-IF                                                 19640000
              END-IF                                                    19650000
           END-IF.                                                      19660000
           IF ACAT10IO-MAMT > SPACE   AND                               19670000
              ACAT10IO-AMT-CHANGED                                      19680000
              MOVE ACAT10IO-AMT-9 TO WS-AMT-COMP2                       19690000
ET0002        MOVE WS-AMT-COMP2 TO ASSET-AMT OF DCLACTIAST              19700000
              IF ACAT10IO-AMT-9 > +0                                    19710000
                 SET ACAT10IO-LONG-ASSET-QTY TO TRUE                    19720000
              ELSE                                                      19730000
                 IF ACAT10IO-AMT-9 < +0                                 19740000
                    SET ACAT10IO-SHORT-ASSET-QTY TO TRUE                19750000
                    COMPUTE WS-AMT-COMP2 = WS-AMT-COMP2 * -1            19760000
                 ELSE                                                   19770000
                    SET ACAT10IO-NA-ASSET-QTY TO TRUE                   19780000
                 END-IF                                                 19790000
              END-IF                                                    19800000
           END-IF.                                                      19810000
ET0002     MOVE ACAT10IO-PSTN-CD      TO PSTN-CD OF DCLACTIAST.         19820000
ET0002     MOVE ACAT10IO-WHEN-ISSUED TO WHI-CD OF DCLACTIAST.           19830000
ET0002     MOVE ACAT10IO-ASSET-DESC  TO  ASSET-DESC-TXT OF DCLACTIAST.  19840000
           IF ACAT10IO-ASSET-CMNT > SPACES                              19850000
ET0002        MOVE ACAT10IO-ASSET-CMNT TO ASSET-CMNT-TXT OF DCLACTIAST  19860000
           END-IF.                                                      19870000
ET0002     MOVE ACAT10IO-TFR-TYPE  TO TRNFR-TYPE-CD OF DCLACTIAST.      19880000
ET0002     MOVE ACAT10IO-DLVR-NBR  TO SBMTG-PRTCP-NBR OF DCLACTIAST.    19890000
ET0002     MOVE +1                 TO PHSCL-SEQ-NBR OF DCLACTIAST,      19900000
ET0002                                LGCL-SEQ-NBR OF DCLACTIAST.       19910000
ET0002     MOVE 'ACAT10DC' TO  PRGM-NM OF DCLACTIAST.                   19920000
ET0002     MOVE  EIBTRMID  TO  CICS-TERM-ID-CD OF DCLACTIAST.           19930000
           EXEC SQL                                                     19940000
                SET  :WS-TIMESTAMP = CURRENT TIMESTAMP                  19950000
           END-EXEC.                                                    19960000
ET0002     MOVE WS-TIMESTAMP TO UPDT-TMSTP OF DCLACTIAST                19970000
ET0002                          CRT-TMSTP OF DCLACTIAST.                19980000
       0610-EXIT.                                                       19990000
           EXIT.                                                        20000000
      /                                                                 20010000
       0620-MOVE-FROM-VASSET.                                           20020000
                                                                        20030000
ET0002     MOVE CLIENT-NBR OF DCLVASSET TO CLIENT-NBR  OF DCLACTIAST.   20040000
           MOVE ACAT-CONTROL-NBR OF DCLVASSET TO                        20050000
ET0002                              ACAT-CONTROL-NBR OF DCLACTIAST.     20060000
           MOVE ASSET-SEQ-NBR  OF DCLVASSET TO                          20070000
ET0002                              ASSET-SEQ-NBR OF DCLACTIAST.        20080000
           MOVE SBMTG-PRTCP-NBR OF DCLVASSET TO                         20090000
ET0002                              SBMTG-PRTCP-NBR OF DCLACTIAST.      20100000
**** ***   MOVE TRANS-TYPE-CD OF DCLVASSET TO                           20110000
**** ***                            TRANS-TYPE-CD OF DCLVINITAST.       20120000
           MOVE ASSET-PRC-CTGY-CD OF DCLVASSET TO                       20130000
ET0002                              ASSET-PRC-CTGY-CD OF DCLACTIAST.    20140000
           MOVE STTLM-LCTN-CD OF DCLVASSET TO                           20150000
ET0002                              STTLM-LCTN-CD OF DCLACTIAST.        20160000
           MOVE STTLM-RSN-CD OF DCLVASSET TO                            20170000
ET0002                              STTLM-RSN-CD OF DCLACTIAST.         20180000
           MOVE ISIN-CNTRY-CD OF DCLVASSET TO                           20190000
ET0002                              ISIN-CNTRY-CD OF DCLACTIAST.        20200000
           MOVE ISIN-SEC-ISSUE-CD OF DCLVASSET TO                       20210000
ET0002                              ISIN-SEC-ISSUE-CD OF DCLACTIAST.    20220000
           MOVE ISIN-SEC-CDG-CD OF DCLVASSET TO                         20230000
ET0002                              ISIN-SEC-CDG-CD OF DCLACTIAST.      20240000
           MOVE ASSET-DESC-TXT OF DCLVASSET TO                          20250000
ET0002                              ASSET-DESC-TXT OF DCLACTIAST.       20260000
           MOVE ASSET-RQST-QTY-CD OF DCLVASSET TO                       20270000
ET0002                              ASSET-RQST-QTY-CD OF DCLACTIAST.    20280000
           MOVE AST-RQST-TRANS-CD OF DCLVASSET TO                       20290000
ET0002                              AST-RQST-TRANS-CD OF DCLACTIAST.    20300000
ET0002     MOVE ASSET-QTY OF DCLVASSET TO ASSET-QTY OF DCLACTIAST.      20310000
ET0002     MOVE ASSET-PCT OF DCLVASSET TO ASSET-PCT OF DCLACTIAST.      20320000
ET0002     MOVE PSTN-CD OF DCLVASSET TO PSTN-CD OF DCLACTIAST.          20330000
           MOVE ISO-CRNCY-CD OF DCLVASSET TO                            20340000
ET0002                              ISO-CRNCY-CD OF DCLACTIAST.         20350000
ET0002     MOVE ASSET-AMT OF DCLVASSET TO ASSET-AMT OF DCLACTIAST.      20360000
           MOVE BEARER-BOND-CD OF DCLVASSET TO                          20370000
ET0002                              BEARER-BOND-CD OF DCLACTIAST.       20380000
           MOVE CSH-MGN-SHRT-CD OF DCLVASSET TO                         20390000
ET0002                              CSH-MGN-SHRT-CD OF DCLACTIAST.      20400000
ET0002     MOVE WHI-CD OF DCLVASSET TO  WHI-CD OF DCLACTIAST.           20410000
           MOVE TRNFR-TYPE-RSN-CD OF DCLVASSET TO                       20420000
ET0002                              TRNFR-TYPE-RSN-CD OF DCLACTIAST.    20430000
           MOVE MBS-SERIAL-NBR  OF DCLVASSET TO                         20440000
ET0002                              MBS-SERIAL-NBR OF DCLACTIAST.       20450000
           MOVE ASSET-CMNT-TXT  OF DCLVASSET TO                         20460000
ET0002                              ASSET-CMNT-TXT OF DCLACTIAST.       20470000
           MOVE NSCC-ACK-IND  OF DCLVASSET TO                           20480000
ET0002                              NSCC-ACK-IND OF DCLACTIAST.         20490000
           MOVE NSCC-PEND-CD  OF DCLVASSET TO                           20500000
ET0002                              NSCC-PEND-CD OF DCLACTIAST.         20510000
           MOVE TRANS-RFRN-ID-CD OF DCLVASSET TO                        20520000
ET0002                              TRANS-RFRN-ID-CD OF DCLACTIAST.     20530000
           MOVE OPTN-CTGY-CD OF DCLVASSET TO                            20540000
ET0002                              OPTN-CTGY-CD OF DCLACTIAST.         20550000
           MOVE SECURITY-ADP-NBR OF DCLVASSET TO                        20560000
ET0002                              SECURITY-ADP-NBR OF DCLACTIAST.     20570000
           MOVE TRNFR-TYPE-CD  OF DCLVASSET TO                          20580000
ET0002                              TRNFR-TYPE-CD OF DCLACTIAST.        20590000
                                                                        20600000
       0620-EXIT.                                                       20610000
           EXIT.                                                        20620000
      /                                                                 20630000
01/21  0630-MOVE-CASH-BALANCE.                                          20640000
      *==> MOVE FROM ACAT10IO (CASH BALANCE) ----------------------     20650000
ET0002     MOVE ACAT10IO-SV-CLIENT-NBR    TO CLIENT-NBR OF DCLACTIAST.  20660000
ET0002     MOVE ACAT10IO-DLVR-NBR         TO DLVR-NBR OF DCLACTIAST.    20670000
           MOVE ACAT10IO-SV-ACCT-DLVR-NBR TO                            20680000
ET0002                                     ACCT-DLVR-NBR OF DCLACTIAST. 20690000
ET0002     MOVE ACAT10IO-SV-RCV-NBR       TO RCV-NBR OF DCLACTIAST.     20700000
           MOVE ACAT10IO-SV-ACCT-RCV-NBR  TO                            20710000
ET0002                                      ACCT-RCV-NBR OF DCLACTIAST. 20720000
           MOVE ACAT10IO-ACAT-CONTROL-NBR TO                            20730000
ET0002                   ACAT-CONTROL-NBR OF DCLACTIAST.                20740000
ET0002     MOVE SPACES           TO    SECURITY-ADP-NBR OF DCLACTIAST.  20750000
      *                                                                 20760000
ET0002     MOVE SPACE           TO NSCC-WTHLD-CD OF DCLACTIAST          20770000
ET0002                             NSCC-PEND-CD  OF DCLACTIAST.         20780000
LRM013*** READ ANY ASSET TO OBTAIN ACK-IND AND PEND-CD FOR ASCENDIS     20790000
LRM013*** PROCESSING LIVE MODE.                                         20800000
LRM013     PERFORM 2800-SELECT-ACTIAST-PEND-ACK.                        20810000
LRM013     IF (SQLCODE = +0 OR -811)                                    20820000
LRM013     AND (WS-INITAST-NSCC-ACK-IND = 'A' OR 'U' OR 'R')            20830000
LRM013        MOVE WS-INITAST-NSCC-ACK-IND TO                           20840000
LRM013                         NSCC-ACK-IND  OF DCLACTIAST              20850000
LRM013        MOVE WS-INITAST-NSCC-PEND-CD TO                           20860000
LRM013                         NSCC-PEND-CD  OF DCLACTIAST              20870000
LRM013     END-IF.                                                      20880000
      ***                                                               20890000
           IF ACAT10IO-STCD < '200'                                     20900000
ET0002        MOVE 'A'             TO TRANS-TYPE-CD OF DCLACTIAST       20910000
           ELSE                                                         20920000
ET0002        MOVE ACAT10IO-MCD    TO TRANS-TYPE-CD OF DCLACTIAST       20921000
           END-IF.                                                      20922000
      *                                                                 20923000
                                                                        20924000
           IF (ACAT10IO-MBAL01 > SPACES  AND                            20925000
               ACAT10IO-BAL01-CHANGED ) OR                              20926000
              (ACAT10IO-BAL01-CMNT > SPACES)                            20927000
ET0002        MOVE 'C'  TO  CSH-MGN-SHRT-CD OF DCLACTIAST               20928000
ET0002        MOVE '40' TO  STTLM-LCTN-CD OF DCLACTIAST                 20929000
ET0002        MOVE '         ' TO ISIN-SEC-ISSUE-CD OF DCLACTIAST       20930000
              MOVE ACAT10IO-BAL01-SEQ-NBR TO ASSET-SEQ-NBR OF           20940000
ET0002                                                 DCLACTIAST       20950000
              MOVE ACAT10IO-MBAL01-STTLM-RSN-CD TO                      20960000
ET0002                               STTLM-RSN-CD OF DCLACTIAST         20970000
ET0002        MOVE WS-BAL01-COMP2 TO ASSET-AMT OF DCLACTIAST            20980000
ET0002        MOVE 'CASH BALANCE' TO  ASSET-DESC-TXT OF DCLACTIAST      20990000
              IF ACAT10IO-BAL01-CMNT > SPACES                           21000000
                 MOVE ACAT10IO-BAL01-CMNT TO ASSET-CMNT-TXT OF          21010000
ET0002                                        DCLACTIAST                21020000
              END-IF                                                    21030000
           ELSE                                                         21040000
              IF (ACAT10IO-MBAL02 > SPACES AND                          21050000
                  ACAT10IO-BAL02-CHANGED )    OR                        21060000
                 (ACAT10IO-BAL02-CMNT > SPACES)                         21070000
ET0002           MOVE 'M' TO CSH-MGN-SHRT-CD OF DCLACTIAST              21080000
ET0002           MOVE '40' TO STTLM-LCTN-CD OF DCLACTIAST               21090000
ET0002           MOVE '         ' TO ISIN-SEC-ISSUE-CD OF DCLACTIAST    21100000
                 MOVE ACAT10IO-BAL02-SEQ-NBR TO ASSET-SEQ-NBR OF        21110000
ET0002                                                 DCLACTIAST       21120000
                 MOVE ACAT10IO-MBAL02-STTLM-RSN-CD TO                   21130000
ET0002                                  STTLM-RSN-CD OF DCLACTIAST      21140000
                 MOVE WS-BAL02-COMP2 TO ASSET-AMT OF DCLACTIAST         21150000
ET0002           MOVE 'CASH BALANCE' TO ASSET-DESC-TXT OF DCLACTIAST    21160000
                 IF ACAT10IO-BAL02-CMNT > SPACES                        21170000
                    MOVE ACAT10IO-BAL02-CMNT TO ASSET-CMNT-TXT OF       21180000
ET0002                                          DCLACTIAST              21190000
                 END-IF                                                 21200000
              ELSE                                                      21210000
                 IF (ACAT10IO-MBAL05 > SPACES  AND                      21220000
                     ACAT10IO-BAL05-CHANGED )    OR                     21230000
                    (ACAT10IO-BAL05-CMNT > SPACES)                      21240000
ET0002              MOVE 'S' TO CSH-MGN-SHRT-CD OF DCLACTIAST           21250000
ET0002              MOVE '40' TO STTLM-LCTN-CD OF DCLACTIAST            21260000
ET0002              MOVE '         ' TO ISIN-SEC-ISSUE-CD OF DCLACTIAST 21270000
                    MOVE ACAT10IO-BAL05-SEQ-NBR TO ASSET-SEQ-NBR OF     21280000
ET0002                                                 DCLACTIAST       21290000
                    MOVE ACAT10IO-MBAL05-STTLM-RSN-CD TO                21300000
ET0002                                     STTLM-RSN-CD OF DCLACTIAST   21310000
ET0002              MOVE WS-BAL05-COMP2 TO ASSET-AMT OF DCLACTIAST      21320000
                    IF ACAT10IO-BAL05-CMNT > SPACES                     21330000
                       MOVE ACAT10IO-BAL05-CMNT TO ASSET-CMNT-TXT OF    21340000
ET0002                                             DCLACTIAST           21350000
                    END-IF                                              21360000
                 ELSE                                                   21370000
                    IF (ACAT10IO-MSMA   > SPACES  AND                   21380000
                        ACAT10IO-SMA-CHANGED )    OR                    21390000
                       (ACAT10IO-BAL02-CMNT > SPACES)                   21400000
ET0002                 MOVE '45' TO STTLM-LCTN-CD OF DCLACTIAST         21410000
                       MOVE '         ' TO ISIN-SEC-ISSUE-CD            21420000
ET0002                                                    OF DCLACTIAST 21430000
                       MOVE ACAT10IO-SMA-SEQ-NBR TO ASSET-SEQ-NBR OF    21440000
ET0002                                                 DCLACTIAST       21450000
ET0002                 MOVE 'SMA ' TO   STTLM-RSN-CD OF DCLACTIAST      21460000
                        MOVE ACAT10IO-SMA-9 TO WS-SMA-COMP2             21470000
ET0002                  MOVE WS-SMA-COMP2 TO ASSET-AMT OF DCLACTIAST    21480000
                       IF ACAT10IO-SMA-CMNT > SPACES                    21490000
                          MOVE ACAT10IO-SMA-CMNT TO ASSET-CMNT-TXT OF   21500000
ET0002                                                DCLACTIAST        21510000
                       END-IF                                           21520000
                    END-IF                                              21530000
                 END-IF                                                 21540000
              END-IF                                                    21550000
           END-IF.                                                      21560000
                                                                        21570000
ET0002     MOVE ACAT10IO-DLVR-NBR TO SBMTG-PRTCP-NBR OF DCLACTIAST.     21580000
ET0002     MOVE 'H'       TO        NSCC-PEND-CD OF DCLACTIAST.         21590000
ET0002     MOVE SPACE TO            ASSET-PRC-CTGY-CD OF DCLACTIAST     21600000
ET0002                              WHI-CD OF DCLACTIAST                21610000
ET0002                              ASSET-CMNT-TXT OF DCLACTIAST.       21620000
ET0002     MOVE 'FUL'          TO   TRNFR-TYPE-CD OF DCLACTIAST.        21630000
ET0002     MOVE '00'           TO   OPTN-CTGY-CD OF DCLACTIAST.         21640000
      *?*              IF ACAT10IO-SMA-9 < +0                           21650000
      *?*                 MOVE 'DEB ' TO   STTLM-RSN-CD OF DCLVINITAST  21660000
      *?*              ELSE                                             21670000
      *?*                 MOVE 'CRED'  TO  STTLM-RSN-CD OF DCLVINITAST  21680000
      ***              END-IF                                           21690000
ET0002     MOVE +1         TO PHSCL-SEQ-NBR OF DCLACTIAST,              21700000
ET0002                        LGCL-SEQ-NBR OF DCLACTIAST.               21710000
ET0002     MOVE 'ACAT10DC' TO  PRGM-NM OF DCLACTIAST.                   21720000
ET0002     MOVE  EIBTRMID  TO  CICS-TERM-ID-CD OF DCLACTIAST.           21730000
           EXEC SQL                                                     21740000
                SET  :WS-TIMESTAMP = CURRENT TIMESTAMP                  21750000
           END-EXEC.                                                    21760000
ET0002     MOVE WS-TIMESTAMP TO UPDT-TMSTP OF DCLACTIAST                21770000
ET0002                          CRT-TMSTP OF DCLACTIAST.                21780000
       0630-EXIT.                                                       21790000
01/21      EXIT.                                                        21800000
      /                                                                 21810000
       0800-DLTE-VINITAST.                                              21820000
LRM005     MOVE SV-CLIENT-NBR       TO WS-DLTE-CLIENT-NBR               21830000
LRM005     MOVE SV-DLVR-NBR         TO WS-DLTE-DLVR-NBR                 21840000
LRM005     MOVE SV-RCV-NBR          TO WS-DLTE-RCV-NBR                  21850000
LRM005     MOVE SV-ACCT-DLVR-NBR    TO WS-DLTE-ACCT-DLVR-NBR            21860000
LRM005     MOVE SV-ACCT-RCV-NBR     TO WS-DLTE-ACCT-RCV-NBR             21870000
LRM005     MOVE SV-SEC-ISSUE-CD     TO WS-DLTE-ISIN                     21880000
LRM005     MOVE SV-ACAT-CNTL-NBR    TO WS-DLTE-ACAT-CNTL-NBR            21890000
LRM005     MOVE SV-STTLM-LCTN-CD    TO WS-DLTE-SLOC                     21900000
LRM005     MOVE SV-CSH-MGN-SHRT-CD  TO WS-DLTE-CSH-MGN-SHRT-CD          21910000
LRM005     MOVE SV-CNTRY-CD         TO WS-DLTE-CNTRY-CD                 21920000
LRM005     PERFORM 2700-CRE-DLTED-SEC-AUDIT-ROW                         21930000
           EXEC SQL                                                     21940000
                DELETE                                                  21950000
ET0002          FROM ACTIAST                                            21960000
                WHERE (CLIENT_NBR = :SV-CLIENT-NBR                      21970000
LRM004            AND  ACAT_CONTROL_NBR = :SV-ACAT-CNTL-NBR             21980000
                  AND  DLVR_NBR = :SV-DLVR-NBR                          21981000
                  AND  RCV_NBR = :SV-RCV-NBR                            21982000
                  AND  ACCT_DLVR_NBR = :SV-ACCT-DLVR-NBR                21983000
                  AND  ACCT_RCV_NBR = :SV-ACCT-RCV-NBR                  21984000
                  AND  STTLM_LCTN_CD = :SV-STTLM-LCTN-CD                21985000
                  AND  CSH_MGN_SHRT_CD = :SV-CSH-MGN-SHRT-CD            21986000
                  AND  ISIN_CNTRY_CD = :SV-CNTRY-CD                     21987000
                  AND  ISIN_SEC_ISSUE_CD = :SV-SEC-ISSUE-CD)            21988000
           END-EXEC.                                                    21989000
    ************* AND  ISIN_SEC_CDG_CD = :SV-SEC-CDG-CD)                21989100
                                                                        21989200
           EVALUATE SQLCODE                                             21989300
                WHEN +0                                                 21989400
                     SET ACAT10IO-VINITAST-DELETED TO TRUE              21989500
                     IF ACAT10IO-STCD < '200'                           21989600
ET0002                  MOVE 'THIS POSITION WILL BE DELETED (ACTIAST)'  21989700
                        TO WS-RETURN-MSG                                21989800
                     ELSE                                               21989900
                        MOVE '<<< CHANGES ARE REVERSED >>> '            21990000
                        TO WS-RETURN-MSG                                22000000
12/23                   PERFORM 0980-REBUILT-ASSET-INFO THRU 0980-EXIT  22010000
01/23                   IF ACAT10IO-OPTN-CTGY-CD > '00 '                22020000
01/21                      PERFORM 0810-GET-VOPTN THRU 0810-EXIT        22030000
01/21                   END-IF                                          22040000
                     END-IF                                             22050000
                WHEN +100                                               22060000
                     SET ACAT10IO-VINITAST-NOT-FOUND TO TRUE            22070000
      **             PERFORM 0950-GET-VASSET-INFO THRU 0950-EXIT        22080000
12/23 **             PERFORM 0600-ISRT-VINITAST                         22090000
                     MOVE ' DID NOT FIND CHANGED RECORD '               22100000
                     TO WS-RETURN-MSG                                   22110000
                WHEN OTHER                                              22120000
                     MOVE SPACE TO ACAT10IO-VINITAST-SW                 22130000
                     PERFORM 9000-WRITE-TO-CICS-LOG                     22140000
                     PERFORM 9500-RETURN-DB2-ERROR                      22150000
           END-EVALUATE.                                                22160000
       0800-EXIT.                                                       22170000
           EXIT.                                                        22180000
      /                                                                 22190000
01/21  0810-GET-VOPTN.                                                  22200000
                                                                        22210000
           EXEC SQL                                                     22220000
             SELECT                                                     22230000
                  CLIENT_NBR                                            22240000
                 ,ACAT_CONTROL_NBR                                      22250000
                 ,ASSET_SEQ_NBR                                         22260000
                 ,BS_CD                                                 22270000
                 ,BS_STTS_CD                                            22280000
                 ,PTCL_CD                                               22290000
                 ,PTCL_STTS_CD                                          22300000
                 ,OPTN_OPN_CLSD_CD                                      22310000
                 ,OPT_OPN_CLS_STS_CD                                    22320000
                 ,SYM_CD                                                22330000
                 ,SYM_STTS_CD                                           22340000
                 ,EXPTN_DT                                              22350000
                 ,STPRC_INTEGER_AMT                                     22360000
                 ,STPRC_INTR_STTS_CD                                    22370000
                 ,STPRC_FRCTN_AMT                                       22380000
                 ,STPRC_FRCT_STTS_CD                                    22390000
                 ,DLVR_OCC_NBR                                          22400000
                 ,OPTN_ACCT_TYPE_CD                                     22410000
                 ,OPT_ACT_TYP_STS_CD                                    22420000
                 ,ACCT_SUB_CD                                           22430000
                 ,ACCT_SUB_STTS_CD                                      22440000
                 ,OPTN_CMNT_TXT                                         22450000
                 ,OPTN_CMNT_STTS_CD                                     22460000
                 ,OPTN_EXPTN_DT_CD                                      22470000
                 ,OPT_OCC_DLV_STS_CD                                    22480000
                 ,ACCT_TYPE_MSMT_IND                                    22490000
                 ,CRT_TMSTP                                             22500000
                 ,UPDT_TMSTP                                            22510000
                 ,PRGM_NM                                               22520000
                 ,CICS_TERM_ID_CD                                       22530000
             INTO                                                       22540000
                 :DCLVOPTN.CLIENT-NBR                                   22550000
                ,:DCLVOPTN.ACAT-CONTROL-NBR                             22560000
                ,:DCLVOPTN.ASSET-SEQ-NBR                                22570000
                ,:DCLVOPTN.BS-CD                                        22580000
                ,:DCLVOPTN.BS-STTS-CD                                   22590000
                ,:DCLVOPTN.PTCL-CD                                      22600000
                ,:DCLVOPTN.PTCL-STTS-CD                                 22610000
                ,:DCLVOPTN.OPTN-OPN-CLSD-CD                             22620000
                ,:DCLVOPTN.OPT-OPN-CLS-STS-CD                           22630000
                ,:DCLVOPTN.SYM-CD                                       22640000
                ,:DCLVOPTN.SYM-STTS-CD                                  22650000
                ,:DCLVOPTN.EXPTN-DT                                     22660000
                ,:DCLVOPTN.STPRC-INTEGER-AMT                            22670000
                ,:DCLVOPTN.STPRC-INTR-STTS-CD                           22680000
                ,:DCLVOPTN.STPRC-FRCTN-AMT                              22690000
                ,:DCLVOPTN.STPRC-FRCT-STTS-CD                           22700000
                ,:DCLVOPTN.DLVR-OCC-NBR                                 22710000
                ,:DCLVOPTN.OPTN-ACCT-TYPE-CD                            22720000
                ,:DCLVOPTN.OPT-ACT-TYP-STS-CD                           22730000
                ,:DCLVOPTN.ACCT-SUB-CD                                  22740000
                ,:DCLVOPTN.ACCT-SUB-STTS-CD                             22750000
                ,:DCLVOPTN.OPTN-CMNT-TXT                                22760000
                ,:DCLVOPTN.OPTN-CMNT-STTS-CD                            22770000
                ,:DCLVOPTN.OPTN-EXPTN-DT-CD                             22780000
                ,:DCLVOPTN.OPT-OCC-DLV-STS-CD                           22790000
                ,:DCLVOPTN.ACCT-TYPE-MSMT-IND                           22800000
                ,:DCLVOPTN.CRT-TMSTP                                    22810000
                ,:DCLVOPTN.UPDT-TMSTP                                   22820000
                ,:DCLVOPTN.PRGM-NM                                      22830000
                ,:DCLVOPTN.CICS-TERM-ID-CD                              22840000
                FROM VOPTN                                              22850000
                WHERE (CLIENT_NBR = :SV-CLIENT-NBR                      22860000
                 AND  ACAT_CONTROL_NBR = :SV-ACAT-CNTL-NBR              22870000
                 AND  ASSET_SEQ_NBR = : SV-ASSET-SEQ-NBR)               22880000
           END-EXEC.                                                    22890000
                                                                        22900000
           EVALUATE SQLCODE                                             22910000
                WHEN +0                                                 22920000
                     SET ACAT10IO-VOPTN-FOUND   TO TRUE                 22930000
     ****            MOVE WS-OPT-BS-CD TO ACAT10IO-OPT-BS-CD            22940000
01/23                MOVE BS-CD OF DCLVOPTN TO SV-OPT-BS-CD             22950000
                                               WS-OPT-BS-CD             22960000
                                               ACAT10IO-OPT-BS-CD       22970000
01/23                MOVE OPTN-CMNT-TXT OF DCLVOPTN TO                  22980000
01/23                                      ACAT10IO-OPTN-CMNT-TXT       22990000
                WHEN +100                                               23000000
                     SET ACAT10IO-VOPTN-NOT-FOUND TO TRUE               23010000
                     MOVE ' OPTION INFO NOT FOUND (VOPTN)'              23020000
                        TO WS-RETURN-MSG                                23030000
                WHEN OTHER                                              23040000
                     MOVE SPACE TO ACAT10IO-VOPTN-SW                    23050000
                     PERFORM 9000-WRITE-TO-CICS-LOG                     23060000
                     PERFORM 9500-RETURN-DB2-ERROR                      23070000
           END-EVALUATE.                                                23080000
       0810-EXIT.                                                       23090000
01/23      EXIT.                                                        23100000
      /                                                                 23110000
       0820-GET-VINITOPN.                                               23120000
                                                                        23130000
           EXEC SQL                                                     23140000
             SELECT                                                     23150000
                  CLIENT_NBR                                            23160000
                 ,DLVR_NBR                                              23170000
                 ,ACCT_DLVR_NBR                                         23180000
                 ,RCV_NBR                                               23190000
                 ,ACCT_RCV_NBR                                          23200000
                 ,ISIN_CNTRY_CD                                         23210000
                 ,ISIN_SEC_ISSUE_CD                                     23220000
                 ,ISIN_SEC_CDG_CD                                       23230000
                 ,STTLM_LCTN_CD                                         23240000
                 ,CSH_MGN_SHRT_CD                                       23250000
ET0002           ,ACAT_CONTROL_NBR                                      23260000
ET0002           ,TRNFR_TYPE_CD                                         23270000
ET0002           ,ASSET_SEQ_NBR                                         23280000
                 ,BS_CD                                                 23281000
                 ,BS_STTS_CD                                            23282000
                 ,PTCL_CD                                               23283000
                 ,PTCL_STTS_CD                                          23284000
                 ,OPTN_OPN_CLSD_CD                                      23285000
                 ,OPT_OPN_CLS_TST_CD                                    23286000
                 ,SYM_CD                                                23287000
                 ,SYM_STTS_CD                                           23288000
                 ,EXPTN_DT                                              23289000
                 ,STPRC_INTEGER_AMT                                     23290000
                 ,STPRC_INTR_STTS_CD                                    23300000
                 ,STPRC_FRCTN_AMT                                       23310000
                 ,STPRC_FRCT_STTS_CD                                    23320000
                 ,DLVR_OCC_NBR                                          23330000
                 ,OPTN_ACCT_TYPE_CD                                     23340000
                 ,OPT_ACT_TYP_STS_CD                                    23350000
                 ,ACCT_SUB_CD                                           23360000
                 ,ACCT_SUB_STTS_CD                                      23370000
                 ,OPTN_CMNT_TXT                                         23380000
                 ,OPTN_CMNT_CD                                          23390000
                 ,OPTN_EXPTN_DT_CD                                      23400000
                 ,OPT_OCC_DLV_STS_CD                                    23410000
                 ,NSCC_ACK_IND                                          23420000
                 ,NSCC_PEND_CD                                          23430000
                 ,CRT_TMSTP                                             23440000
                 ,UPDT_TMSTP                                            23450000
                 ,CICS_TERM_ID_CD                                       23460000
                 ,PRGM_NM                                               23470000
                 ,SECURITY_ADP_NBR                                      23480000
            INTO                                                        23490000
ET0002           :DCLACTIOPN.CLIENT-NBR                                 23500000
ET0002          ,:DCLACTIOPN.DLVR-NBR                                   23510000
ET0002          ,:DCLACTIOPN.ACCT-DLVR-NBR                              23520000
ET0002          ,:DCLACTIOPN.RCV-NBR                                    23530000
ET0002          ,:DCLACTIOPN.ACCT-RCV-NBR                               23540000
ET0002          ,:DCLACTIOPN.ISIN-CNTRY-CD                              23550000
ET0002          ,:DCLACTIOPN.ISIN-SEC-ISSUE-CD                          23560000
ET0002          ,:DCLACTIOPN.ISIN-SEC-CDG-CD                            23570000
ET0002          ,:DCLACTIOPN.STTLM-LCTN-CD                              23580000
ET0002          ,:DCLACTIOPN.CSH-MGN-SHRT-CD                            23590000
ET0002          ,:DCLACTIOPN.ACAT-CONTROL-NBR                           23600000
ET0002          ,:DCLACTIOPN.TRNFR-TYPE-CD                              23610000
ET0002          ,:DCLACTIOPN.ASSET-SEQ-NBR                              23620000
ET0002          ,:DCLACTIOPN.BS-CD                                      23630000
ET0002          ,:DCLACTIOPN.BS-STTS-CD                                 23640000
ET0002          ,:DCLACTIOPN.PTCL-CD                                    23650000
ET0002          ,:DCLACTIOPN.PTCL-STTS-CD                               23660000
ET0002          ,:DCLACTIOPN.OPTN-OPN-CLSD-CD                           23670000
ET0002          ,:DCLACTIOPN.OPT-OPN-CLS-TST-CD                         23680000
ET0002          ,:DCLACTIOPN.SYM-CD                                     23690000
ET0002          ,:DCLACTIOPN.SYM-STTS-CD                                23700000
ET0002          ,:DCLACTIOPN.EXPTN-DT                                   23710000
ET0002          ,:DCLACTIOPN.STPRC-INTEGER-AMT                          23720000
ET0002          ,:DCLACTIOPN.STPRC-INTR-STTS-CD                         23730000
ET0002          ,:DCLACTIOPN.STPRC-FRCTN-AMT                            23740000
ET0002          ,:DCLACTIOPN.STPRC-FRCT-STTS-CD                         23750000
ET0002          ,:DCLACTIOPN.DLVR-OCC-NBR                               23760000
ET0002          ,:DCLACTIOPN.OPTN-ACCT-TYPE-CD                          23770000
ET0002          ,:DCLACTIOPN.OPT-ACT-TYP-STS-CD                         23780000
ET0002          ,:DCLACTIOPN.ACCT-SUB-CD                                23790000
ET0002          ,:DCLACTIOPN.ACCT-SUB-STTS-CD                           23800000
ET0002          ,:DCLACTIOPN.OPTN-CMNT-TXT                              23810000
ET0002          ,:DCLACTIOPN.OPTN-CMNT-CD                               23820000
ET0002          ,:DCLACTIOPN.OPTN-EXPTN-DT-CD                           23830000
ET0002          ,:DCLACTIOPN.OPT-OCC-DLV-STS-CD                         23840000
ET0002          ,:DCLACTIOPN.NSCC-ACK-IND                               23850000
ET0002          ,:DCLACTIOPN.NSCC-PEND-CD                               23860000
ET0002          ,:DCLACTIOPN.CRT-TMSTP                                  23870000
ET0002          ,:DCLACTIOPN.UPDT-TMSTP                                 23880000
ET0002          ,:DCLACTIOPN.CICS-TERM-ID-CD                            23890000
ET0002          ,:DCLACTIOPN.PRGM-NM                                    23900000
ET0002          ,:DCLACTIOPN.SECURITY-ADP-NBR                           23910000
ET0002          FROM ACTIOPN                                            23920000
                WHERE (CLIENT_NBR = :SV-CLIENT-NBR                      23930000
LRM018           AND  ACAT_CONTROL_NBR = :SV-ACAT-CNTL-NBR              23940000
                 AND  DLVR_NBR = :SV-DLVR-NBR                           23950000
                 AND  RCV_NBR = :SV-RCV-NBR                             23960000
                 AND  ACCT_DLVR_NBR = :SV-ACCT-DLVR-NBR                 23970000
                 AND  ACCT_RCV_NBR = :SV-ACCT-RCV-NBR                   23980000
                 AND  ISIN_SEC_ISSUE_CD = :SV-SEC-ISSUE-CD              23990000
                 AND  STTLM_LCTN_CD = :SV-STTLM-LCTN-CD                 24000000
                 AND  CSH_MGN_SHRT_CD = :SV-CSH-MGN-SHRT-CD)            24010000
           END-EXEC.                                                    24020000
                                                                        24030000
           EVALUATE SQLCODE                                             24040000
                WHEN +0                                                 24050000
                     SET ACAT10IO-VINITOPN-FOUND   TO TRUE              24060000
ET0002               MOVE BS-CD OF DCLACTIOPN TO WS-OPT-BS-CD           24070000
ET0002               MOVE OPTN-CMNT-TXT OF DCLACTIOPN TO                24080000
                                              WS-OPTN-CMNT-TXT          24090000
                WHEN +100                                               24100000
                     SET ACAT10IO-VINITOPN-NOT-FOUND TO TRUE            24110000
01/22***             MOVE ' OPTION INFO NOT FOUND (VINITOPN)'           24120000
TEMP ***                TO WS-RETURN-MSG                                24130000
                WHEN OTHER                                              24140000
                     MOVE SPACE TO ACAT10IO-VINITOPN-SW                 24150000
                     PERFORM 9000-WRITE-TO-CICS-LOG                     24160000
                     PERFORM 9500-RETURN-DB2-ERROR                      24170000
           END-EVALUATE.                                                24180000
       0820-EXIT.                                                       24190000
01/23      EXIT.                                                        24200000
      /                                                                 24210000
01/23  0825-MOVE-VOPTN-TO-VINITOPN.                                     24220000
ET0002**   INITIALIZE DCLVINITOPN.                                      24230000
ET0002     INITIALIZE DCLACTIOPN.                                       24240000
ET0002     MOVE SV-CLIENT-NBR TO CLIENT-NBR OF DCLACTIOPN.              24250000
ET0002     MOVE SV-DLVR-NBR TO DLVR-NBR OF DCLACTIOPN.                  24260000
ET0002     MOVE SV-ACCT-DLVR-NBR TO ACCT-DLVR-NBR OF DCLACTIOPN.        24270000
ET0002     MOVE SV-RCV-NBR TO RCV-NBR OF DCLACTIOPN.                    24280000
ET0002     MOVE SV-ACCT-RCV-NBR TO ACCT-RCV-NBR OF DCLACTIOPN.          24290000
ET0002     MOVE SV-CNTRY-CD TO ISIN-CNTRY-CD OF DCLACTIOPN.             24300000
ET0002     MOVE SV-SEC-ISSUE-CD TO ISIN-SEC-ISSUE-CD OF DCLACTIOPN      24310000
ET0002     MOVE SV-SEC-CDG-CD TO ISIN-SEC-CDG-CD OF DCLACTIOPN.         24320000
ET0002     MOVE SV-STTLM-LCTN-CD TO STTLM-LCTN-CD OF DCLACTIOPN.        24330000
ET0002     MOVE SV-CSH-MGN-SHRT-CD TO CSH-MGN-SHRT-CD OF DCLACTIOPN.    24340000
ET0002     MOVE BS-CD OF DCLVOPTN TO BS-CD OF DCLACTIOPN.               24350000
ET0002     MOVE BS-STTS-CD OF DCLVOPTN TO BS-STTS-CD OF DCLACTIOPN.     24360000
ET0002     MOVE PTCL-CD OF DCLVOPTN TO PTCL-CD OF DCLACTIOPN.           24370000
ET0002     MOVE PTCL-STTS-CD OF DCLVOPTN TO PTCL-STTS-CD OF DCLACTIOPN. 24380000
           MOVE OPTN-OPN-CLSD-CD OF DCLVOPTN TO OPTN-OPN-CLSD-CD OF     24381000
ET0002                                             DCLACTIOPN.          24382000
           MOVE OPT-OPN-CLS-STS-CD OF DCLVOPTN TO OPT-OPN-CLS-TST-CD OF 24383000
ET0002                                             DCLACTIOPN.          24384000
ET0002     MOVE SYM-CD OF DCLVOPTN TO SYM-CD OF DCLACTIOPN.             24385000
ET0002     MOVE SYM-STTS-CD OF DCLVOPTN TO SYM-STTS-CD OF DCLACTIOPN.   24386000
ET0002     MOVE EXPTN-DT OF DCLVOPTN TO EXPTN-DT OF DCLACTIOPN.         24387000
           MOVE STPRC-INTEGER-AMT OF DCLVOPTN TO STPRC-INTEGER-AMT OF   24388000
ET0002                                             DCLACTIOPN.          24389000
           MOVE STPRC-INTR-STTS-CD OF DCLVOPTN TO STPRC-INTR-STTS-CD    24390000
ET0002                                         OF  DCLACTIOPN.          24400000
           MOVE STPRC-FRCTN-AMT OF DCLVOPTN TO STPRC-FRCTN-AMT          24410000
ET0002                                         OF  DCLACTIOPN.          24420000
           MOVE STPRC-FRCT-STTS-CD OF DCLVOPTN TO STPRC-FRCT-STTS-CD    24430000
ET0002                                         OF  DCLACTIOPN.          24440000
           MOVE DLVR-OCC-NBR OF DCLVOPTN TO DLVR-OCC-NBR                24450000
ET0002                                         OF  DCLACTIOPN.          24460000
           MOVE OPTN-ACCT-TYPE-CD OF DCLVOPTN TO OPTN-ACCT-TYPE-CD      24470000
ET0002                                         OF  DCLACTIOPN.          24480000
           MOVE OPT-ACT-TYP-STS-CD OF DCLVOPTN TO OPT-ACT-TYP-STS-CD    24490000
ET0002                                         OF  DCLACTIOPN.          24500000
ET0002     MOVE ACCT-SUB-CD OF DCLVOPTN TO ACCT-SUB-CD OF DCLACTIOPN.   24510000
           MOVE ACCT-SUB-STTS-CD OF DCLVOPTN TO ACCT-SUB-STTS-CD        24520000
ET0002                                         OF  DCLACTIOPN.          24530000
           MOVE OPTN-CMNT-TXT OF DCLVOPTN TO OPTN-CMNT-TXT              24540000
ET0002                                         OF  DCLACTIOPN.          24550000
           MOVE OPTN-EXPTN-DT-CD OF DCLVOPTN TO                         24560000
ET0002                      OPTN-EXPTN-DT-CD   OF  DCLACTIOPN.          24570000
           MOVE OPT-OCC-DLV-STS-CD OF DCLVOPTN TO                       24580000
ET0002                      OPT-OCC-DLV-STS-CD OF  DCLACTIOPN.          24590000
ET0002     MOVE '00' TO ACCT-SUB-STTS-CD OF DCLACTIOPN.                 24600000
ET0002     MOVE 'N' TO NSCC-ACK-IND OF DCLACTIOPN.                      24610000
ET0002     MOVE ' ' TO NSCC-PEND-CD OF DCLACTIOPN.                      24620000
ET0002     MOVE ACAT10IO-ADP-NBR TO  SECURITY-ADP-NBR OF DCLACTIOPN.    24630000
ET0002     MOVE 'ACAT10DC' TO  PRGM-NM OF DCLACTIOPN.                   24640000
ET0002     MOVE EIBTRMID  TO  CICS-TERM-ID-CD OF DCLACTIOPN.            24650000
           EXEC SQL                                                     24660000
                SET :WS-TIMESTAMP = CURRENT TIMESTAMP                   24670000
           END-EXEC.                                                    24680000
ET0002**   MOVE WS-TIMESTAMP TO CRT-TMSTP OF DCLVINITAST                24690000
ET0002**                        UPDT-TMSTP OF DCLVINITAST.              24700000
ET0002     MOVE WS-TIMESTAMP TO CRT-TMSTP OF DCLACTIOPN                 24710000
ET0002                          UPDT-TMSTP OF DCLACTIOPN.               24720000
                                                                        24730000
ET0002**<< ADD NEW KEY FIELD COLUMS>>                                   24740000
ET0002     MOVE ACAT-CONTROL-NBR   OF DCLVOPTN                          24750000
ET0002       TO ACAT-CONTROL-NBR   OF DCLACTIOPN.                       24760000
ET0002     MOVE 'FUL'                                                   24770000
ET0002       TO TRNFR-TYPE-CD      OF DCLACTIOPN.                       24780000
ET0002     MOVE ASSET-SEQ-NBR      OF DCLVOPTN                          24790000
ET0002       TO ASSET-SEQ-NBR      OF DCLACTIOPN.                       24800000
                                                                        24810000
       0825-EXIT.                                                       24820000
           EXIT.                                                        24830000
      /                                                                 24840000
       0830-ISRT-VINITOPN.                                              24850000
           PERFORM 0810-GET-VOPTN THRU 0810-EXIT.                       24860000
           PERFORM 0825-MOVE-VOPTN-TO-VINITOPN THRU 0825-EXIT.          24870000
                                                                        24880000
           EXEC SQL                                                     24890000
ET0002       INSERT INTO ACTIOPN                                        24900000
                ( CLIENT_NBR                                            24910000
                 ,DLVR_NBR                                              24920000
                 ,ACCT_DLVR_NBR                                         24930000
                 ,RCV_NBR                                               24931000
                 ,ACCT_RCV_NBR                                          24932000
                 ,ISIN_CNTRY_CD                                         24933000
                 ,ISIN_SEC_ISSUE_CD                                     24934000
                 ,ISIN_SEC_CDG_CD                                       24935000
                 ,STTLM_LCTN_CD                                         24936000
                 ,CSH_MGN_SHRT_CD                                       24937000
ET0002           ,ACAT_CONTROL_NBR                                      24938000
ET0002           ,TRNFR_TYPE_CD                                         24939000
ET0002           ,ASSET_SEQ_NBR                                         24940000
                 ,BS_CD                                                 24950000
                 ,BS_STTS_CD                                            24960000
                 ,PTCL_CD                                               24970000
                 ,PTCL_STTS_CD                                          24980000
                 ,OPTN_OPN_CLSD_CD                                      24990000
                 ,OPT_OPN_CLS_TST_CD                                    25000000
                 ,SYM_CD                                                25010000
                 ,SYM_STTS_CD                                           25020000
                 ,EXPTN_DT                                              25030000
                 ,STPRC_INTEGER_AMT                                     25040000
                 ,STPRC_INTR_STTS_CD                                    25050000
                 ,STPRC_FRCTN_AMT                                       25060000
                 ,STPRC_FRCT_STTS_CD                                    25070000
                 ,DLVR_OCC_NBR                                          25080000
                 ,OPTN_ACCT_TYPE_CD                                     25090000
                 ,OPT_ACT_TYP_STS_CD                                    25100000
                 ,ACCT_SUB_CD                                           25110000
                 ,ACCT_SUB_STTS_CD                                      25120000
                 ,OPTN_CMNT_TXT                                         25130000
                 ,OPTN_CMNT_CD                                          25140000
                 ,OPTN_EXPTN_DT_CD                                      25150000
                 ,OPT_OCC_DLV_STS_CD                                    25160000
                 ,NSCC_ACK_IND                                          25170000
                 ,NSCC_PEND_CD                                          25180000
                 ,CRT_TMSTP                                             25190000
                 ,UPDT_TMSTP                                            25200000
                 ,CICS_TERM_ID_CD                                       25210000
                 ,PRGM_NM                                               25220000
                 ,SECURITY_ADP_NBR)                                     25230000
            VALUES                                                      25240000
ET0002         ( :DCLACTIOPN.CLIENT-NBR                                 25250000
ET0002          ,:DCLACTIOPN.DLVR-NBR                                   25260000
ET0002          ,:DCLACTIOPN.ACCT-DLVR-NBR                              25270000
ET0002          ,:DCLACTIOPN.RCV-NBR                                    25280000
ET0002          ,:DCLACTIOPN.ACCT-RCV-NBR                               25290000
ET0002          ,:DCLACTIOPN.ISIN-CNTRY-CD                              25300000
ET0002          ,:DCLACTIOPN.ISIN-SEC-ISSUE-CD                          25310000
ET0002          ,:DCLACTIOPN.ISIN-SEC-CDG-CD                            25320000
ET0002          ,:DCLACTIOPN.STTLM-LCTN-CD                              25330000
ET0002          ,:DCLACTIOPN.CSH-MGN-SHRT-CD                            25340000
ET0002          ,:DCLACTIOPN.ACAT-CONTROL-NBR                           25350000
ET0002          ,:DCLACTIOPN.TRNFR-TYPE-CD                              25360000
ET0002          ,:DCLACTIOPN.ASSET-SEQ-NBR                              25370000
ET0002          ,:DCLACTIOPN.BS-CD                                      25380000
ET0002          ,:DCLACTIOPN.BS-STTS-CD                                 25390000
ET0002          ,:DCLACTIOPN.PTCL-CD                                    25400000
ET0002          ,:DCLACTIOPN.PTCL-STTS-CD                               25410000
ET0002          ,:DCLACTIOPN.OPTN-OPN-CLSD-CD                           25420000
ET0002          ,:DCLACTIOPN.OPT-OPN-CLS-TST-CD                         25430000
ET0002          ,:DCLACTIOPN.SYM-CD                                     25440000
ET0002          ,:DCLACTIOPN.SYM-STTS-CD                                25450000
ET0002          ,:DCLACTIOPN.EXPTN-DT                                   25460000
ET0002          ,:DCLACTIOPN.STPRC-INTEGER-AMT                          25470000
ET0002          ,:DCLACTIOPN.STPRC-INTR-STTS-CD                         25480000
ET0002          ,:DCLACTIOPN.STPRC-FRCTN-AMT                            25490000
ET0002          ,:DCLACTIOPN.STPRC-FRCT-STTS-CD                         25500000
ET0002          ,:DCLACTIOPN.DLVR-OCC-NBR                               25510000
ET0002          ,:DCLACTIOPN.OPTN-ACCT-TYPE-CD                          25520000
ET0002          ,:DCLACTIOPN.OPT-ACT-TYP-STS-CD                         25530000
ET0002          ,:DCLACTIOPN.ACCT-SUB-CD                                25540000
ET0002          ,:DCLACTIOPN.ACCT-SUB-STTS-CD                           25550000
ET0002          ,:DCLACTIOPN.OPTN-CMNT-TXT                              25560000
ET0002          ,:DCLACTIOPN.OPTN-CMNT-CD                               25570000
ET0002          ,:DCLACTIOPN.OPTN-EXPTN-DT-CD                           25580000
ET0002          ,:DCLACTIOPN.OPT-OCC-DLV-STS-CD                         25590000
ET0002          ,:DCLACTIOPN.NSCC-ACK-IND                               25600000
ET0002          ,:DCLACTIOPN.NSCC-PEND-CD                               25610000
ET0002          ,:DCLACTIOPN.CRT-TMSTP                                  25620000
ET0002          ,:DCLACTIOPN.UPDT-TMSTP                                 25630000
ET0002          ,:DCLACTIOPN.CICS-TERM-ID-CD                            25640000
ET0002          ,:DCLACTIOPN.PRGM-NM                                    25650000
ET0002          ,:DCLACTIOPN.SECURITY-ADP-NBR)                          25660000
           END-EXEC.                                                    25670000
                                                                        25680000
           EVALUATE SQLCODE                                             25690000
                WHEN +0                                                 25700000
                     SET ACAT10IO-VINITOPN-INSERTED TO TRUE             25710000
ET0002               MOVE BS-CD OF DCLACTIOPN TO WS-OPT-BS-CD           25720000
ET0002               MOVE OPTN-CMNT-TXT OF DCLACTIOPN TO                25730000
                                              WS-OPTN-CMNT-TXT          25740000
                WHEN -803                                               25750000
                     SET ACAT10IO-UPDT-VINITOPN  TO TRUE                25760000
                     PERFORM 0840-UPDT-VINITOPN THRU 0840-EXIT          25770000
                WHEN OTHER                                              25780000
                     MOVE SPACE TO ACAT10IO-VINITAST-SW                 25790000
                     PERFORM 9000-WRITE-TO-CICS-LOG                     25800000
                     PERFORM 9500-RETURN-DB2-ERROR                      25810000
           END-EVALUATE.                                                25820000
                                                                        25830000
       0830-EXIT.                                                       25840000
           EXIT.                                                        25850000
      /                                                                 25860000
01/23  0835-MERGE-OPTN-DATA.                                            25870000
            IF WS-OPT-BS-CD > SPACE                                     25880000
               MOVE WS-OPT-BS-CD TO ACAT10IO-OPT-BS-CD                  25890000
            ELSE                                                        25900000
               MOVE SV-OPT-BS-CD TO ACAT10IO-OPT-BS-CD                  25910000
            END-IF.                                                     25920000
                                                                        25930000
            IF WS-OPTN-CMNT-TXT > SPACE                                 25940000
               MOVE WS-OPTN-CMNT-TXT TO ACAT10IO-OPTN-CMNT-TXT          25950000
            ELSE                                                        25960000
               MOVE SV-OPTN-CMNT-TXT TO ACAT10IO-OPTN-CMNT-TXT          25970000
            END-IF.                                                     25980000
                                                                        25990000
       0835-EXIT.                                                       26000000
01/23      EXIT.                                                        26010000
      /                                                                 26020000
01/23  0840-UPDT-VINITOPN.                                              26030000
           IF ACAT10IO-LONG-ASSET-QTY                                   26040000
              MOVE 'S' TO WS-OPT-BS-CD                                  26050000
           ELSE                                                         26060000
              MOVE 'B' TO WS-OPT-BS-CD                                  26070000
           END-IF.                                                      26080000
                                                                        26090000
           EXEC SQL                                                     26100000
ET0002        UPDATE ACTIOPN                                            26110000
                 SET BS_CD = :WS-OPT-BS-CD                              26120000
                    ,UPDT_TMSTP = CURRENT TIMESTAMP                     26130000
                    ,PRGM_NM = 'ACAT10DC'                               26140000
              WHERE (CLIENT_NBR = :SV-CLIENT-NBR                        26150000
ET0002          AND ACAT_CONTROL_NBR = :SV-ACAT-CNTL-NBR                26160000
                AND DLVR_NBR = :SV-DLVR-NBR                             26170000
                AND RCV_NBR = :SV-RCV-NBR                               26180000
                AND ACCT_DLVR_NBR = :SV-ACCT-DLVR-NBR                   26190000
                AND ACCT_RCV_NBR = :SV-ACCT-RCV-NBR                     26200000
                AND STTLM_LCTN_CD = :SV-STTLM-LCTN-CD                   26210000
                AND ISIN_SEC_ISSUE_CD = :SV-SEC-ISSUE-CD                26220000
                AND CSH_MGN_SHRT_CD = :SV-CSH-MGN-SHRT-CD)              26230000
           END-EXEC.                                                    26240000
               EVALUATE SQLCODE                                         26250000
                    WHEN +0                                             26260000
                         SET ACAT10IO-VINITOPN-UPDATED TO TRUE          26270000
                         MOVE WS-OPT-BS-CD TO ACAT10IO-OPT-BS-CD        26280000
                         MOVE ' THIS OPTION IS UPDATED' TO WS-RETURN-MSG26290000
      *                  IF ACAT10IO-SV-SEC-ISSUE-CD = '         '      26300000
      *                     MOVE '         '     TO SV-SEC-ISSUE-CD     26310000
      *                  END-IF                                         26320000
                    WHEN OTHER                                          26330000
                         MOVE SPACES TO ACAT10IO-VINITOPN-SW            26340000
                         PERFORM 9000-WRITE-TO-CICS-LOG                 26350000
                         PERFORM 9500-RETURN-DB2-ERROR                  26360000
               END-EVALUATE.                                            26370000
      *                                                                 26380000
       0840-EXIT.                                                       26390000
01/23      EXIT.                                                        26400000
      /                                                                 26410000
01/2   0850-DLTE-VINITOPN.                                              26420000
           EXEC SQL                                                     26430000
                DELETE                                                  26440000
ET0002          FROM ACTIOPN                                            26450000
                WHERE (CLIENT_NBR = :SV-CLIENT-NBR                      26460000
ET0002            AND ACAT_CONTROL_NBR = :SV-ACAT-CNTL-NBR              26470000
                  AND  DLVR_NBR = :SV-DLVR-NBR                          26480000
                  AND  RCV_NBR = :SV-RCV-NBR                            26490000
                  AND  ACCT_DLVR_NBR = :SV-ACCT-DLVR-NBR                26500000
                  AND  ACCT_RCV_NBR = :SV-ACCT-RCV-NBR                  26510000
                  AND  STTLM_LCTN_CD = :SV-STTLM-LCTN-CD                26520000
                  AND  ISIN_CNTRY_CD = :SV-CNTRY-CD                     26530000
                  AND  ISIN_SEC_ISSUE_CD = :SV-SEC-ISSUE-CD)            26540000
           END-EXEC.                                                    26550000
    ************* AND  ISIN_SEC_CDG_CD = :SV-SEC-CDG-CD)                26560000
                                                                        26570000
           EVALUATE SQLCODE                                             26580000
                WHEN +0                                                 26590000
                     SET ACAT10IO-VINITOPN-DELETED TO TRUE              26600000
                     IF ACAT10IO-STCD < '200'                           26610000
ET0002                  MOVE 'THIS OPTION WILL BE DELETED (ACTIOPN)'    26611000
                        TO WS-RETURN-MSG                                26612000
                     ELSE                                               26613000
                        MOVE '<<< CHANGES ARE REVERSED >>> '            26614000
                        TO WS-RETURN-MSG                                26615000
01/23 **** RETRIEVIE VOPTN                                              26616000
01/23                   PERFORM 0810-GET-VOPTN THRU 0810-EXIT           26617000
                        IF ACAT10IO-VOPTN-NOT-FOUND                     26618000
                           MOVE 'CAN"T FIND OPION RECORD, CRITIAL ERROR'26619000
                           TO WS-RETURN-MSG                             26620000
                        END-IF                                          26630000
                     END-IF                                             26640000
                WHEN +100                                               26650000
                     SET ACAT10IO-VINITOPN-NOT-FOUND TO TRUE            26660000
                     MOVE ' DID NOT FIND CHANGED OPTION '               26670000
                     TO WS-RETURN-MSG                                   26680000
                WHEN OTHER                                              26690000
                     MOVE SPACE TO ACAT10IO-VINITOPN-SW                 26700000
                     PERFORM 9000-WRITE-TO-CICS-LOG                     26710000
                     PERFORM 9500-RETURN-DB2-ERROR                      26720000
           END-EVALUATE.                                                26730000
       0850-EXIT.                                                       26740000
01/23      EXIT.                                                        26750000
      /                                                                 26760000
      ******************************************************************26770000
       0900-SRCH-VASSET-FWD.                                            26780000
      *----------------------------------------------------------------*26790000
      *                      GET VASSET  INFORMATION                   *26800000
      *----------------------------------------------------------------*26810000
      *                                                                 26820000
           PERFORM 0900A-OPEN-FWD-CURSOR.                               26830000
           EVALUATE SQLCODE                                             26840000
                WHEN +0                                                 26850000
                     PERFORM 0900B-FETCH-FWD-CURSOR                     26860000
                WHEN +100                                               26870000
                     PERFORM 0900C-CLOSE-FWD-CURSOR                     26880000
094000          WHEN OTHER                                              26890000
                     SET ACAT10IO-VASSET-NOT-FOUND TO TRUE              26900000
                     SET ACAT10IO-VASSET-NOT-FETCHED TO TRUE            26910000
                     MOVE SPACES TO ACAT10IO-VASSET-SW                  26920000
                     PERFORM 9000-WRITE-TO-CICS-LOG                     26930000
                     PERFORM 9500-RETURN-DB2-ERROR                      26940000
094200      END-EVALUATE.                                               26950000
                                                                        26960000
       0900A-OPEN-FWD-CURSOR.                                           26970000
                                                                        26980000
           IF EIBAID                    = '7' OR                        26990000
                                          '8'                           27000000
              MOVE ZERO                TO SV-ASSET-SEQ-NBR              27010000
           END-IF                                                       27020000
                                                                        27030000
           EXEC SQL                                                     27040000
                OPEN FWD_VASST                                          27050000
           END-EXEC.                                                    27060000
      *                                                                 27070000
       0900B-FETCH-FWD-CURSOR.                                          27080000
                                                                        27090000
           EXEC SQL                                                     27100000
                FETCH  FWD_VASST                                        27110000
                INTO                                                    27120000
                   :WS-ASSET-SEQ-NBR                                    27130000
                  ,:WS-CNTRY-CD                                         27140000
                  ,:WS-SEC-NBR                                          27150000
                  ,:SV-SEC-CDG-CD                                       27160000
LRM026            ,:SV-CRNCY-CD                                         27170000
                  ,:WS-ADP-NBR                                          27180000
                  ,:WS-TRANS-TYPE-CD                                    27190000
                  ,:WS-CSH-MGN-SHRT-CD                                  27200000
                  ,:WS-PSTN-CD                                          27210000
01/21             ,:WS-OPTN-CTGY-CD                                     27220000
                  ,:WS-WHEN-ISSUED                                      27230000
                  ,:WS-STTLM-LCTN-CD                                    27240000
                  ,:WS-STTLM-RSN-CD                                     27250000
                  ,:WS-INITAST-NSCC-PEND-CD                             27260000
                  ,:WS-ASSET-QTY                                        27270000
                  ,:WS-ASSET-AMT                                        27280000
                  ,:WS-ASSET-DESC                                       27290000
                  ,:WS-ASSET-CMNT                                       27300000
           END-EXEC.                                                    27310000
      *                                                                 27320000
093400     EVALUATE SQLCODE                                             27330000
093500          WHEN +0                                                 27340000
                     MOVE SQLCODE  TO  VASSET-SQLCODE                   27350000
                     SET ACAT10IO-VASSET-FOUND   TO TRUE                27360000
                     SET ACAT10IO-VASSET-FETCHED TO TRUE                27370000
                     MOVE WS-ASSET-SEQ-NBR TO SV-ASSET-SEQ-NBR          27380000
                                              ACAT10IO-SV-ASSET-SEQ-NBR 27390000
                     MOVE WS-SEC-NBR       TO SV-SEC-ISSUE-CD           27400000
                     MOVE SV-CNTRY-CD      TO ACAT10IO-SV-CNTRY-CD      27410000
                     MOVE SV-SEC-CDG-CD    TO ACAT10IO-SV-SEC-CDG-CD    27420000
LRM026               MOVE SV-CRNCY-CD      TO ACAT10IO-SV-CRNCY-CD      27430000
LRM026                                        ACAT10IO-CRNCY-CD         27431000
                     MOVE WS-STTLM-LCTN-CD TO SV-STTLM-LCTN-CD          27432000
                     MOVE WS-CNTRY-CD      TO SV-CNTRY-CD               27433000
                     MOVE WS-CSH-MGN-SHRT-CD TO SV-CSH-MGN-SHRT-CD      27434000
01/04                PERFORM 0050-MOVE-ASSET-DATA THRU 0050-EXIT        27435000
                     PERFORM 0900C-CLOSE-FWD-CURSOR                     27436000
01/21 ******         IF ACAT10IO-STTLM-RSN-CD = 'OPT '                  27437000
01/23                IF ACAT10IO-OPTN-CTGY-CD > '00 '                   27438000
01/21                   PERFORM 0810-GET-VOPTN THRU 0810-EXIT           27439000
01/21                END-IF                                             27440000
                     PERFORM 0920-CHECK-INIT-ASSET THRU 0920-EXIT       27450000
                WHEN +100                                               27460000
                     MOVE SQLCODE  TO  VASSET-SQLCODE                   27470000
                     SET ACAT10IO-VASSET-NOT-FOUND TO TRUE              27480000
                     SET ACAT10IO-VASSET-NOT-FETCHED TO TRUE            27490000
                     PERFORM 0920-CHECK-INIT-ASSET THRU 0920-EXIT       27500000
12/03                IF ACAT10IO-SV-ASSET-SEQ-NBR > +0                  27510000
                        SET ACAT10IO-VASSET-LAST TO TRUE                27520000
                        MOVE 'THE LAST ASSET POSITION UNDER THIS TIF'   27530000
                        TO WS-RETURN-MSG                                27540000
                     ELSE                                               27550000
                        IF ACAT10IO-VINITAST-NOT-FOUND                  27560000
                            MOVE 'NO ASSET POSITION UNDER THIS TIF' TO  27570000
                            WS-RETURN-MSG                               27580000
                        END-IF                                          27590000
                     END-IF                                             27600000
094000          WHEN OTHER                                              27610000
                     SET ACAT10IO-VASSET-NOT-FOUND TO TRUE              27620000
                     SET ACAT10IO-VASSET-NOT-FETCHED TO TRUE            27630000
                     MOVE SPACES TO ACAT10IO-VASSET-SW                  27640000
                     PERFORM 9000-WRITE-TO-CICS-LOG                     27650000
                     PERFORM 9500-RETURN-DB2-ERROR                      27660000
094200      END-EVALUATE.                                               27670000
      *                                                                 27680000
                                                                        27690000
       0900C-CLOSE-FWD-CURSOR.                                          27700000
                                                                        27710000
           EXEC SQL                                                     27720000
                CLOSE FWD_VASST                                         27730000
           END-EXEC.                                                    27740000
      *                                                                 27750000
      /                                                                 27760000
       0910-SRCH-VASSET-BWD.                                            27770000
      *----------------------------------------------------------------*27780000
      *          FETCH ASSET BACKWARD                                  *27790000
      *----------------------------------------------------------------*27800000
      *                                                                 27810000
           PERFORM 0910A-OPEN-BWD-CURSOR.                               27820000
           EVALUATE SQLCODE                                             27830000
                WHEN +0                                                 27840000
                     PERFORM 0910B-FETCH-BWD-CURSOR                     27850000
                WHEN +100                                               27860000
                     PERFORM 0910C-CLOSE-BWD-CURSOR                     27870000
094000          WHEN OTHER                                              27880000
                     SET ACAT10IO-VASSET-NOT-FOUND TO TRUE              27890000
                     SET ACAT10IO-VASSET-NOT-FETCHED TO TRUE            27900000
                     MOVE SPACES TO ACAT10IO-VASSET-SW                  27910000
                     PERFORM 9000-WRITE-TO-CICS-LOG                     27920000
                     PERFORM 9500-RETURN-DB2-ERROR                      27930000
094200      END-EVALUATE.                                               27940000
      *                                                                 27950000
       0910A-OPEN-BWD-CURSOR.                                           27960000
                                                                        27970000
           IF EIBAID                    = '7' OR                        27980000
                                          '8'                           27990000
              MOVE ZERO                TO SV-ASSET-SEQ-NBR              28000000
           END-IF                                                       28010000
                                                                        28020000
           EXEC SQL                                                     28030000
                OPEN BWD_VASST                                          28040000
           END-EXEC.                                                    28050000
      *                                                                 28060000
       0910B-FETCH-BWD-CURSOR.                                          28070000
                                                                        28080000
           EXEC SQL                                                     28090000
                FETCH  BWD_VASST                                        28100000
                INTO                                                    28110000
                   :WS-ASSET-SEQ-NBR                                    28120000
                  ,:WS-CNTRY-CD                                         28130000
                  ,:WS-SEC-NBR                                          28140000
                  ,:SV-SEC-CDG-CD                                       28150000
LRM026            ,:SV-CRNCY-CD                                         28160000
                  ,:WS-ADP-NBR                                          28170000
                  ,:WS-TRANS-TYPE-CD                                    28180000
                  ,:WS-CSH-MGN-SHRT-CD                                  28190000
                  ,:WS-PSTN-CD                                          28191000
01/21             ,:WS-OPTN-CTGY-CD                                     28192000
                  ,:WS-WHEN-ISSUED                                      28193000
                  ,:WS-STTLM-LCTN-CD                                    28194000
                  ,:WS-STTLM-RSN-CD                                     28195000
                  ,:WS-INITAST-NSCC-PEND-CD                             28196000
                  ,:WS-ASSET-QTY                                        28197000
                  ,:WS-ASSET-AMT                                        28198000
                  ,:WS-ASSET-DESC                                       28199000
                  ,:WS-ASSET-CMNT                                       28200000
           END-EXEC.                                                    28210000
      *                                                                 28220000
093400     EVALUATE SQLCODE                                             28230000
093500          WHEN +0                                                 28240000
                     MOVE SQLCODE  TO  VASSET-SQLCODE                   28250000
                     SET ACAT10IO-VASSET-FOUND TO TRUE                  28260000
                     SET ACAT10IO-VASSET-FETCHED TO TRUE                28270000
                     MOVE WS-ASSET-SEQ-NBR TO SV-ASSET-SEQ-NBR          28280000
                                            ACAT10IO-SV-ASSET-SEQ-NBR   28290000
                     MOVE WS-SEC-NBR TO SV-SEC-ISSUE-CD                 28300000
                     MOVE SV-CNTRY-CD TO ACAT10IO-SV-CNTRY-CD           28310000
                     MOVE SV-SEC-CDG-CD TO ACAT10IO-SV-SEC-CDG-CD       28320000
LRM026               MOVE SV-CRNCY-CD   TO ACAT10IO-SV-CRNCY-CD         28330000
LRM026                                     ACAT10IO-CRNCY-CD            28340000
                     MOVE WS-STTLM-LCTN-CD TO SV-STTLM-LCTN-CD          28350000
                     MOVE WS-CNTRY-CD      TO SV-CNTRY-CD               28360000
                     MOVE WS-CSH-MGN-SHRT-CD TO SV-CSH-MGN-SHRT-CD      28370000
01/04 ******         MOVE WS-ASSET-AREA   TO ACAT10IO-DC                28380000
01/04                PERFORM 0050-MOVE-ASSET-DATA THRU 0050-EXIT        28390000
                     PERFORM 0910C-CLOSE-BWD-CURSOR                     28400000
01/21 ******         IF ACAT10IO-STTLM-RSN-CD = 'OPT '                  28410000
01/23                IF ACAT10IO-OPTN-CTGY-CD > '00 '                   28420000
01/21                   PERFORM 0810-GET-VOPTN THRU 0810-EXIT           28430000
01/21                END-IF                                             28440000
                     PERFORM 0920-CHECK-INIT-ASSET THRU 0920-EXIT       28450000
                WHEN +100                                               28460000
                     MOVE SQLCODE  TO  VASSET-SQLCODE                   28470000
                     SET ACAT10IO-VASSET-NOT-FOUND TO TRUE              28480000
                     SET ACAT10IO-VASSET-NOT-FETCHED TO TRUE            28490000
                     IF ACAT10IO-SV-ASSET-SEQ-NBR > +0                  28500000
                        SET ACAT10IO-VASSET-FIRST TO TRUE               28510000
                        MOVE 'THE FIRST ASSET POSITION UNDER THIS TIF'  28520000
                         TO WS-RETURN-MSG                               28530000
                     ELSE                                               28540000
                        IF ACAT10IO-VINITAST-NOT-FOUND                  28550000
                           MOVE 'NO ASSET POSITION UNDER THIS TIF' TO   28560000
                           WS-RETURN-MSG                                28570000
                        END-IF                                          28580000
                     END-IF                                             28590000
094000          WHEN OTHER                                              28600000
                     SET ACAT10IO-VASSET-NOT-FOUND TO TRUE              28610000
                     SET ACAT10IO-VASSET-NOT-FETCHED TO TRUE            28620000
                     MOVE SPACES TO ACAT10IO-VASSET-SW                  28621000
                     PERFORM 9000-WRITE-TO-CICS-LOG                     28622000
                     PERFORM 9500-RETURN-DB2-ERROR                      28623000
094200      END-EVALUATE.                                               28624000
      *                                                                 28625000
       0910C-CLOSE-BWD-CURSOR.                                          28626000
                                                                        28627000
           EXEC SQL                                                     28628000
                CLOSE BWD_VASST                                         28629000
           END-EXEC.                                                    28630000
                                                                        28640000
      /                                                                 28650000
       0920-CHECK-INIT-ASSET.                                           28660000
     ** CHECK STATUS CODE & SUBMITTING IND ==============>              28670000
      *                                                                 28680000
           IF ACAT10IO-STCD LESS THAN 300      AND                      28690000
              ACAT10IO-STCD NOT LESS THAN 200                           28700000
              PERFORM 0500-GET-VINITAST-INFO                            28710000
              IF ACAT10IO-VINITAST-FOUND                                28720000
01/21 *****      IF ACAT10IO-STTLM-RSN-CD = 'OPT '                      28730000
01/23            IF ACAT10IO-OPTN-CTGY-CD > '00 '                       28740000
01/21               MOVE WS-OPTN-CTGY-CD TO ACAT10IO-OPTN-CTGY-CD       28750000
01/21               PERFORM 0820-GET-VINITOPN THRU 0820-EXIT            28760000
                    MOVE WS-OPT-BS-CD    TO ACAT10IO-OPT-BS-CD          28770000
01/21            END-IF                                                 28780000
                 PERFORM 0930-MERGE-ASSET-DATA THRU 0930-EXIT           28790000
                 PERFORM 0835-MERGE-OPTN-DATA THRU 0835-EXIT            28800000
              ELSE                                                      28810000
                 IF ACAT10IO-VINITAST-NOT-FOUND                         28820000
                    IF WS-ASSET-SEQ-NBR  > +0                           28830000
                       MOVE LOW-VALUE TO ACAT10IO-DC                    28840000
01/04                  PERFORM 0050-MOVE-ASSET-DATA THRU 0050-EXIT      28850000
                       MOVE WS-ASSET-SEQ-NBR TO SV-ASSET-SEQ-NBR        28860000
                                              ACAT10IO-SV-ASSET-SEQ-NBR 28870000
                       MOVE WS-SEC-NBR TO SV-SEC-ISSUE-CD               28880000
                       MOVE SV-CNTRY-CD TO ACAT10IO-SV-CNTRY-CD         28890000
                       MOVE SV-SEC-CDG-CD TO ACAT10IO-SV-SEC-CDG-CD     28900000
LRM026                 MOVE SV-CRNCY-CD   TO ACAT10IO-SV-CRNCY-CD       28910000
                       MOVE WS-STTLM-LCTN-CD TO SV-STTLM-LCTN-CD        28920000
                       MOVE WS-CNTRY-CD      TO SV-CNTRY-CD             28930000
                       MOVE SV-OPT-BS-CD TO ACAT10IO-OPT-BS-CD          28940000
                    END-IF                                              28950000
                 END-IF                                                 28960000
              END-IF                                                    28970000
           END-IF.                                                      28980000
                                                                        28990000
       0920-EXIT.                                                       29000000
           EXIT.                                                        29010000
      /                                                                 29020000
       0930-MERGE-ASSET-DATA.                                           29030000
                                                                        29040000
      ****   MOVE FIELDS FROM DCLVINITAST.                              29050000
      *                                                                 29060000
      *    IF WS-ADP-NBR > SPACES                                       29070000
      *       MOVE WS-ADP-NBR TO ACAT10IO-ADP-NBR                       29080000
      *    END-IF.                                                      29090000
      *    IF WS-TRANS-TYPE-CD > SPACE                                  29100000
      *       MOVE WS-TRANS-TYPE-CD  TO  ACAT10IO-TRANS-TYPE-CD         29110000
      *    END-IF                                                       29120000
      *    IF WS-CSH-MGN-SHRT-CD > SPACE                                29130000
      *       MOVE WS-CSH-MGN-SHRT-CD  TO ACAT10IO-CSH-MGN-SHRT-CD      29140000
      *    END-IF.                                                      29150000
      *    IF WS-PSTN-CD > SPACE                                        29160000
              MOVE WS-PSTN-CD  TO ACAT10IO-PSTN-CD                      29170000
      *    END-IF.                                                      29180000
01/21 *    IF WS-OPTN-CTGY-CD > SPACE                                   29190000
01/21         MOVE WS-OPTN-CTGY-CD TO ACAT10IO-OPTN-CTGY-CD             29200000
01/21 *    END-IF.                                                      29210000
01/21 *    IF WS-OPT-BS-CD > SPACE                                      29220000
01/21         MOVE WS-OPT-BS-CD  TO ACAT10IO-OPT-BS-CD                  29230000
01/21 *    END-IF.                                                      29240000
      *    IF WS-WHEN-ISSUED  > SPACE                                   29250000
              MOVE WS-WHEN-ISSUED TO ACAT10IO-WHEN-ISSUED               29260000
      *    END-IF.                                                      29270000
      *    IF WS-STTLM-LCTN-CD  > SPACE                                 29280000
              MOVE WS-STTLM-LCTN-CD TO ACAT10IO-STTLM-LCTN-CD           29290000
              MOVE WS-CNTRY-CD      TO ACAT10IO-CNTRY-CD                29300000
      *    END-IF.                                                      29310000
      *    IF WS-STTLM-RSN-CD  > SPACE                                  29320000
              MOVE WS-STTLM-RSN-CD TO ACAT10IO-STTLM-RSN-CD             29330000
      *    END-IF.                                                      29340000
      *    IF WS-INITAST-NSCC-PEND-CD > SPACE                           29350000
              MOVE WS-INITAST-NSCC-PEND-CD TO                           29360000
                                    ACAT10IO-VINITAST-NSCC-PEND-CD      29370000
LRM011        MOVE WS-INITAST-NSCC-ACK-IND TO                           29380000
LRM011                              ACAT10IO-VINITAST-NSCC-ACK-IND      29390000
      *    END-IF.                                                      29400000
      *    IF WS-ASSET-QTY > +0                                         29410000
              MOVE WS-ASSET-QTY  TO ACAT10IO-ASSET-QTY                  29420000
      *    END-IF.                                                      29430000
      *    IF WS-ASSET-AMT > +0                                         29440000
              MOVE WS-ASSET-AMT  TO ACAT10IO-ASSET-AMT                  29450000
      *    END-IF.                                                      29460000
      *    IF WS-ASSET-DESC  > SPACES                                   29470000
              MOVE WS-ASSET-DESC TO ACAT10IO-ASSET-DESC                 29480000
      *    END-IF.                                                      29490000
      *    IF WS-ASSET-CMNT > SPACES                                    29500000
              MOVE WS-ASSET-CMNT TO ACAT10IO-ASSET-CMNT                 29510000
      *    END-IF.                                                      29520000
                                                                        29530000
      *    IF WS-NSCC-WTHLD-CD > SPACE                                  29540000
              MOVE WS-NSCC-WTHLD-CD TO ACAT10IO-NSCC-WTHLD-CD           29550000
      *    END-IF.                                                      29560000
                                                                        29570000
           MOVE WS-TRANS-TYPE-CD    TO ACAT10IO-TRANS-TYPE-CD           29580000
                                                                        29590000
           IF ACAT10IO-NSCC-WTHLD-CD = 'W'                              29600000
              MOVE '** WITHHELD ASSET, WILL NOT BE SENT TO NSCC **'     29610000
                   TO ACAT10IO-RETURN-MSG                               29620000
           ELSE                                                         29630000
           IF ACAT10IO-NSCC-WTHLD-CD = 'M'                              29640000
              MOVE '** SEND MEMO ONLY  ****'                            29650000
                   TO ACAT10IO-RETURN-MSG                               29660000
           ELSE                                                         29670000
           IF ACAT10IO-NSCC-WTHLD-CD = 'L'                              29680000
              MOVE '** LIQUIDATE ASSET ****'                            29690000
                   TO ACAT10IO-RETURN-MSG                               29700000
           ELSE                                                         29710000
           IF ACAT10IO-TRANS-TYPE-CD = 'A'                              29720000
              MOVE '******   ASSET WAS ADDED  ******'                   29730000
                   TO ACAT10IO-RETURN-MSG                               29740000
           ELSE                                                         29750000
           IF ACAT10IO-TRANS-TYPE-CD = 'C'                              29760000
              MOVE '******   ASSET WAS CHANGED  *****'                  29770000
                   TO ACAT10IO-RETURN-MSG                               29780000
           ELSE                                                         29790000
           IF ACAT10IO-TRANS-TYPE-CD = 'D'                              29800000
              MOVE '**** ASSET WAS FLAGGED FOR DELETION ***'            29810000
                   TO ACAT10IO-RETURN-MSG                               29820000
           END-IF END-IF END-IF END-IF END-IF END-IF.                   29830000
                                                                        29840000
       0930-EXIT.                                                       29850000
           EXIT.                                                        29860000
      /                                                                 29870000
XXXX   0940-MOVE-VASSET.                                                29880000
      *    NOT BEEN USED                                                29890000
      *                                                                 29900000
      *    INITIALIZE ACAT10IO-DC.                                      29910000
      ****   MOVE FIELDS FROM DCLVASSET.                                29920000
           MOVE STTLM-RSN-CD OF DCLVASSET  TO ACAT10IO-STTLM-RSN-CD.    29930000
           MOVE ISIN-SEC-ISSUE-CD OF DCLVASSET TO ACAT10IO-SEC-NBR.     29940000
           MOVE SECURITY-ADP-NBR OF DCLVASSET TO ACAT10IO-ADP-NBR.      29950000
           MOVE TRANS-TYPE-CD OF DCLVASSET  TO ACAT10IO-TRANS-TYPE-CD.  29960000
           MOVE CSH-MGN-SHRT-CD OF DCLVASSET                            29970000
                                            TO ACAT10IO-CSH-MGN-SHRT-CD.29980000
           MOVE WHI-CD OF DCLVASSET         TO ACAT10IO-WHEN-ISSUED.    29990000
           MOVE STTLM-LCTN-CD OF DCLVASSET  TO ACAT10IO-STTLM-LCTN-CD.  30000000
           MOVE ISIN-CNTRY-CD OF DCLVASSET  TO ACAT10IO-CNTRY-CD        30010000
      **** MOVE TRNFR-TYPE-RSN-CD OF DCLVASSET TO                       30020000
      ****                                 ACAT10IO-TRNFR-TYPE-RSN-CD.  30030000
           MOVE ASSET-QTY OF DCLVASSET      TO ACAT10IO-ASSET-QTY.      30040000
           MOVE ASSET-AMT OF DCLVASSET      TO ACAT10IO-ASSET-AMT.      30050000
     **    MOVE ASSET-DESC-TXT OF DCLVASSET TO ACAT10IO-ASSET-DESC.     30060000
           MOVE ASSET-CMNT-TXT OF DCLVASSET TO ACAT10IO-ASSET-CMNT.     30070000
           IF ACAT10IO-TRANS-TYPE-CD = 'A'                              30080000
              MOVE '******   ASSET WAS ADDED  ******'                   30090000
                   TO  ACAT10IO-RETURN-MSG                              30100000
           ELSE                                                         30110000
              IF ACAT10IO-TRANS-TYPE-CD = 'C'                           30120000
                 MOVE '******   ASSET WAS CHANGED  ******'              30130000
                      TO ACAT10IO-RETURN-MSG                            30140000
              ELSE                                                      30150000
                 IF ACAT10IO-TRANS-TYPE-CD = 'D'                        30160000
                    MOVE '******   ASSET WAS DELETED  ******'           30170000
                         TO ACAT10IO-RETURN-MSG                         30180000
                 END-IF                                                 30190000
              END-IF                                                    30200000
           END-IF.                                                      30210000
      *                                                                 30220000
       0940-EXIT.                                                       30230000
           EXIT.                                                        30240000
      /                                                                 30250000
      ******************************************************************30260000
       0950-GET-VASSET-INFO.                                            30270000
      *----------------------------------------------------------------*30280000
      *          GET VASSET  INFORMATION                               *30290000
      *----------------------------------------------------------------*30300000
           EXEC SQL                                                     30310000
                SELECT                                                  30320000
                       CLIENT_NBR                                       30330000
                     , ACAT_CONTROL_NBR                                 30340000
                     , ASSET_SEQ_NBR                                    30350000
                     , CONTROL_NBR_STS_CD                               30360000
                     , DLVR_NBR_STTS_CD                                 30370000
                     , RCV_NBR_STTS_CD                                  30380000
                     , SBMTG_PRTCP_NBR                                  30390000
                     , SBMT_PRT_NR_STS_CD                               30400000
                     , AST_SEQ_NBR_STS_CD                               30410000
                     , SYS_ACT_CD                                       30420000
                     , SYS_RJCT_RSN_CD                                  30430000
                     , TRANS_TYPE_CD                                    30440000
                     , TRANS_TYPE_STTS_CD                               30450000
                     , PHSCL_SEQ_NBR                                    30460000
                     , PHSCL_SEQ_STTS_CD                                30470000
                     , LGCL_SEQ_NBR                                     30480000
                     , LGCL_SEQ_NR_STS_CD                               30490000
                     , ASSET_PRC_CTGY_CD                                30500000
                     , AST_PRC_CTG_STS_CD                               30510000
                     , STTLM_LCTN_CD                                    30520000
                     , STTLM_LCTN_STTS_CD                               30530000
                     , STTLM_RSN_CD                                     30540000
                     , STTLM_RSN_STTS_CD                                30550000
                     , ISIN_CNTRY_CD                                    30560000
                     , ISIN_CNTRY_STTS_CD                               30570000
                     , ISIN_SEC_ISSUE_CD                                30580000
                     , ISIN_SEC_IS_STS_CD                               30590000
                     , ISIN_SEC_CDG_CD                                  30600000
                     , ISIN_SEC_CD_STS_CD                               30610000
                     , ASSET_DESC_TXT                                   30620000
                     , ASSET_DESC_STTS_CD                               30630000
                     , ASSET_RQST_QTY_CD                                30640000
                     , ASSET_RQST_STS_CD                                30650000
                     , AST_RQST_TRANS_CD                                30660000
                     , AST_RQ_TRAN_STS_CD                               30670000
                     , ASSET_QTY                                        30680000
                     , ASSET_QTY_STTS_CD                                30690000
                     , ASSET_PCT                                        30700000
                     , ASSET_PCT_STTS_CD                                30710000
                     , PSTN_CD                                          30720000
                     , PSTN_CD_STTS_CD                                  30730000
                     , ISO_CRNCY_CD                                     30740000
                     , ISO_CRNCY_STTS_CD                                30750000
                     , ASSET_AMT                                        30760000
                     , ASSET_AMT_STTS_CD                                30770000
                     , BEARER_BOND_CD                                   30780000
                     , BEARER_BND_STTS_CD                               30790000
                     , CSH_MGN_SHRT_CD                                  30800000
                     , CSH_MRG_SHT_STS_CD                               30810000
                     , WHI_CD                                           30820000
                     , WHI_STTS_CD                                      30830000
                     , TRNFR_TYPE_RSN_CD                                30840000
                     , TRN_TYP_RSN_STS_CD                               30850000
                     , MBS_SERIAL_NBR                                   30860000
                     , MBS_SERIAL_STTS_CD                               30870000
                     , ASSET_CMNT_TXT                                   30880000
                     , ASSET_CMNT_STTS_CD                               30890000
                     , NSCC_ACK_IND                                     30900000
                     , NSCC_PEND_CD                                     30910000
                     , FAIL_SENT_CAGE_IND                               30920000
                     , FAIL_OPEN_CAGE_IND                               30930000
                     , NSCC_NON_ADP_IND                                 30940000
                     , TRANS_RFRN_ID_CD                                 30950000
                     , TRANS_RFRN_STTS_CD                               30960000
                     , OPTN_CTGY_CD                                     30970000
                     , OPTN_CTGY_STTS_CD                                30980000
                     , RCRD_LNGTH_STTS_CD                               30990000
                     , RCRD_STTS_CD                                     31000000
                     , ISIN_SEC_EXCPT_IND                               31010000
                     , CRT_TMSTP                                        31020000
                     , UPDT_TMSTP                                       31030000
                     , CICS_TERM_ID_CD                                  31040000
                     , PRGM_NM                                          31050000
                     , SECURITY_ADP_NBR                                 31060000
                     , RCL_SENT_NSCC_IND                                31070000
                     , FRV_SENT_NSCC_IND                                31080000
                     , TRNFR_TYPE_CD                                    31090000
                 INTO                                                   31100000
                      :DCLVASSET.CLIENT-NBR                             31110000
                     ,:DCLVASSET.ACAT-CONTROL-NBR                       31120000
                     ,:DCLVASSET.ASSET-SEQ-NBR                          31130000
                     ,:DCLVASSET.CONTROL-NBR-STS-CD                     31140000
                     ,:DCLVASSET.DLVR-NBR-STTS-CD                       31150000
                     ,:DCLVASSET.RCV-NBR-STTS-CD                        31160000
                     ,:DCLVASSET.SBMTG-PRTCP-NBR                        31170000
                     ,:DCLVASSET.SBMT-PRT-NR-STS-CD                     31180000
                     ,:DCLVASSET.AST-SEQ-NBR-STS-CD                     31190000
                     ,:DCLVASSET.SYS-ACT-CD                             31200000
                     ,:DCLVASSET.SYS-RJCT-RSN-CD                        31210000
                     ,:DCLVASSET.TRANS-TYPE-CD                          31220000
                     ,:DCLVASSET.TRANS-TYPE-STTS-CD                     31230000
                     ,:DCLVASSET.PHSCL-SEQ-NBR                          31240000
                     ,:DCLVASSET.PHSCL-SEQ-STTS-CD                      31250000
                     ,:DCLVASSET.LGCL-SEQ-NBR                           31260000
                     ,:DCLVASSET.LGCL-SEQ-NR-STS-CD                     31270000
                     ,:DCLVASSET.ASSET-PRC-CTGY-CD                      31280000
                     ,:DCLVASSET.AST-PRC-CTG-STS-CD                     31290000
                     ,:DCLVASSET.STTLM-LCTN-CD                          31300000
                     ,:DCLVASSET.STTLM-LCTN-STTS-CD                     31310000
                     ,:DCLVASSET.STTLM-RSN-CD                           31320000
                     ,:DCLVASSET.STTLM-RSN-STTS-CD                      31330000
                     ,:DCLVASSET.ISIN-CNTRY-CD                          31340000
                     ,:DCLVASSET.ISIN-CNTRY-STTS-CD                     31350000
                     ,:DCLVASSET.ISIN-SEC-ISSUE-CD                      31360000
                     ,:DCLVASSET.ISIN-SEC-IS-STS-CD                     31370000
                     ,:DCLVASSET.ISIN-SEC-CDG-CD                        31380000
                     ,:DCLVASSET.ISIN-SEC-CD-STS-CD                     31390000
                     ,:DCLVASSET.ASSET-DESC-TXT                         31400000
                     ,:DCLVASSET.ASSET-DESC-STTS-CD                     31410000
                     ,:DCLVASSET.ASSET-RQST-QTY-CD                      31420000
                     ,:DCLVASSET.ASSET-RQST-STS-CD                      31430000
                     ,:DCLVASSET.AST-RQST-TRANS-CD                      31440000
                     ,:DCLVASSET.AST-RQ-TRAN-STS-CD                     31450000
                     ,:DCLVASSET.ASSET-QTY                              31460000
                     ,:DCLVASSET.ASSET-QTY-STTS-CD                      31470000
                     ,:DCLVASSET.ASSET-PCT                              31480000
                     ,:DCLVASSET.ASSET-PCT-STTS-CD                      31490000
                     ,:DCLVASSET.PSTN-CD                                31500000
                     ,:DCLVASSET.PSTN-CD-STTS-CD                        31510000
                     ,:DCLVASSET.ISO-CRNCY-CD                           31520000
                     ,:DCLVASSET.ISO-CRNCY-STTS-CD                      31530000
                     ,:DCLVASSET.ASSET-AMT                              31540000
                     ,:DCLVASSET.ASSET-AMT-STTS-CD                      31550000
                     ,:DCLVASSET.BEARER-BOND-CD                         31560000
                     ,:DCLVASSET.BEARER-BND-STTS-CD                     31570000
                     ,:DCLVASSET.CSH-MGN-SHRT-CD                        31580000
                     ,:DCLVASSET.CSH-MRG-SHT-STS-CD                     31590000
                     ,:DCLVASSET.WHI-CD                                 31600000
                     ,:DCLVASSET.WHI-STTS-CD                            31610000
                     ,:DCLVASSET.TRNFR-TYPE-RSN-CD                      31620000
                     ,:DCLVASSET.TRN-TYP-RSN-STS-CD                     31630000
                     ,:DCLVASSET.MBS-SERIAL-NBR                         31640000
                     ,:DCLVASSET.MBS-SERIAL-STTS-CD                     31650000
                     ,:DCLVASSET.ASSET-CMNT-TXT                         31660000
                     ,:DCLVASSET.ASSET-CMNT-STTS-CD                     31670000
                     ,:DCLVASSET.NSCC-ACK-IND                           31680000
                     ,:DCLVASSET.NSCC-PEND-CD                           31690000
                     ,:DCLVASSET.FAIL-SENT-CAGE-IND                     31700000
                     ,:DCLVASSET.FAIL-OPEN-CAGE-IND                     31710000
                     ,:DCLVASSET.NSCC-NON-ADP-IND                       31720000
                     ,:DCLVASSET.TRANS-RFRN-ID-CD                       31730000
                     ,:DCLVASSET.TRANS-RFRN-STTS-CD                     31740000
                     ,:DCLVASSET.OPTN-CTGY-CD                           31750000
                     ,:DCLVASSET.OPTN-CTGY-STTS-CD                      31760000
                     ,:DCLVASSET.RCRD-LNGTH-STTS-CD                     31770000
                     ,:DCLVASSET.RCRD-STTS-CD                           31780000
                     ,:DCLVASSET.ISIN-SEC-EXCPT-IND                     31790000
                     ,:DCLVASSET.CRT-TMSTP                              31800000
                     ,:DCLVASSET.UPDT-TMSTP                             31810000
                     ,:DCLVASSET.CICS-TERM-ID-CD                        31820000
                     ,:DCLVASSET.PRGM-NM                                31830000
                     ,:DCLVASSET.SECURITY-ADP-NBR                       31840000
                     ,:DCLVASSET.RCL-SENT-NSCC-IND                      31850000
                     ,:DCLVASSET.FRV-SENT-NSCC-IND                      31860000
                     ,:DCLVASSET.TRNFR-TYPE-CD                          31870000
092900               FROM VASSET                                        31880000
093000             WHERE (CLIENT_NBR       = :SV-CLIENT-NBR)            31890000
                    AND  (ACAT_CONTROL_NBR = :SV-ACAT-CNTL-NBR)         31900000
                    AND  (ASSET_SEQ_NBR    = :SV-ASSET-SEQ-NBR)         31910000
LRM026              AND  (CRNCY_CD         = :SV-CRNCY-CD)              31920000
093200      END-EXEC.                                                   31930000
                                                                        31940000
093400      EVALUATE SQLCODE                                            31950000
093500          WHEN +0                                                 31960000
                     SUBTRACT  +1   FROM  WS-VASSET-COUNT               31970000
                     SET ACAT10IO-VASSET-FOUND TO TRUE                  31980000
      **             MOVE  SV-ASSET-SEQ-NBR  TO                         31990000
      **                     ACAT10IO-SV-ASSET-SEQ-NBR                  32000000
01/21 *****          IF ACAT10IO-STTLM-RSN-CD = 'OPT '                  32010000
01/23                IF ACAT10IO-OPTN-CTGY-CD > '00 '                   32020000
01/21                   PERFORM 0810-GET-VOPTN THRU 0810-EXIT           32030000
01/21                END-IF                                             32040000
093800          WHEN +100                                               32050000
                     SET ACAT10IO-VASSET-NOT-FOUND TO TRUE              32060000
      ***            PERFORM 0500-GET-VINITAST-INFO                     32070000
094000          WHEN OTHER                                              32080000
                     PERFORM 9000-WRITE-TO-CICS-LOG                     32090000
                     PERFORM 9500-RETURN-DB2-ERROR                      32100000
094200      END-EVALUATE.                                               32110000
                                                                        32120000
      *                                                                 32130000
094400 0950-EXIT.                                                       32140000
094500     EXIT.                                                        32150000
      /                                                                 32160000
094400 0960-UPDATE-FOR-SUBY.                                            32170000
094500                                                                  32180000
           MOVE SPACE TO FETCH-VINITAST-SW.                             32190000
LRM004     MOVE ACAT10IO-SIGN-ON-ID TO CICS-SGNON-ID OF DCLACTIAST.     32200000
                                                                        32210000
           EXEC SQL                                                     32220000
                OPEN SUBY_CSR                                           32230000
           END-EXEC.                                                    32240000
                                                                        32250000
           PERFORM 0965-FETCH-UPDATE THRU 0965-EXIT  UNTIL              32260000
                   NO-MORE-VINITAST.                                    32270000
                                                                        32280000
           IF FETCH-SUBY-CNT = UPDATE-SUBY-CNT                          32290000
              SET ACAT10IO-VINITAST-UPDATED TO TRUE                     32300000
              MOVE 'ALL POSITIONS WILL BE SUBMITTED' TO WS-RETURN-MSG   32310000
           ELSE                                                         32320000
              MOVE SPACE TO ACAT10IO-VINITAST-SW                        32330000
           END-IF.                                                      32340000
                                                                        32350000
094400 0960-EXIT.                                                       32360000
094500     EXIT.                                                        32370000
      /                                                                 32380000
       0965-FETCH-UPDATE.                                               32390000
                                                                        32400000
           EXEC SQL                                                     32410000
                FETCH SUBY_CSR                                          32420000
                INTO :WS-INITAST-NSCC-PEND-CD                           32430000
ET0002              ,:DCLACTIAST.UPDT-TMSTP                             32440000
ET0002              ,:DCLACTIAST.PRGM-NM                                32450000
           END-EXEC.                                                    32460000
                                                                        32470000
           EVALUATE SQLCODE                                             32480000
              WHEN  +0                                                  32490000
                    ADD +1  TO FETCH-SUBY-CNT                           32500000
                    PERFORM 0965A-UPDATE                                32510000
              WHEN  +100                                                32520000
                    EXEC SQL                                            32530000
                         CLOSE SUBY_CSR                                 32540000
                    END-EXEC                                            32550000
                    MOVE 'N' TO FETCH-VINITAST-SW                       32560000
094000          WHEN OTHER                                              32570000
                     PERFORM 9000-WRITE-TO-CICS-LOG                     32580000
                     PERFORM 9500-RETURN-DB2-ERROR                      32590000
           END-EVALUATE.                                                32600000
                                                                        32610000
094400 0965-EXIT.                                                       32620000
094500     EXIT.                                                        32630000
                                                                        32640000
       0965A-UPDATE.                                                    32650000
LRM016     MOVE  EIBTRMID  TO  CICS-TERM-ID-CD OF DCLACTIAST            32651000
           EXEC SQL                                                     32652000
ET0002          UPDATE ACTIAST                                          32653000
                SET NSCC_PEND_CD = ' '                                  32654000
                   ,UPDT_TMSTP = CURRENT TIMESTAMP                      32655000
                   ,PRGM_NM = 'ACAT10DC'                                32656000
LRM004             ,CICS_SGNON_ID = :ACAT10IO-SIGN-ON-ID                32657000
LRM011             ,NSCC_ACK_IND      =  ' '                            32658000
LRM016             ,CICS_NET_NM   = :ACAT10IO-NET-NAME                  32659000
LRM016             ,TPSCRT_USR_ID = :ACAT10IO-USER-ID                   32660000
LRM016             ,TPSCRT_USR_NM = :ACAT10IO-USER-NAME                 32670000
LRM016             ,CICS_TERM_ID_CD = :DCLACTIAST.CICS-TERM-ID-CD       32680000
                WHERE CURRENT OF SUBY_CSR                               32690000
           END-EXEC.                                                    32700000
                                                                        32710000
           EVALUATE SQLCODE                                             32720000
              WHEN  +0                                                  32730000
                    ADD +1  TO UPDATE-SUBY-CNT                          32740000
                    MOVE ' ' TO ACAT10IO-VINITAST-NSCC-PEND-CD          32750000
              WHEN  +100                                                32760000
                    MOVE SPACE TO ACAT10IO-VINITAST-SW                  32770000
094000          WHEN OTHER                                              32780000
                     PERFORM 9000-WRITE-TO-CICS-LOG                     32790000
                     PERFORM 9500-RETURN-DB2-ERROR                      32800000
           END-EVALUATE.                                                32810000
                                                                        32820000
      /                                                                 32830000
094400 0970-UPDATE-FOR-SUBN.                                            32840000
094500                                                                  32850000
           MOVE SPACE TO FETCH-VINITAST-SW.                             32860000
LRM004     MOVE ACAT10IO-SIGN-ON-ID TO CICS-SGNON-ID OF DCLACTIAST.     32870000
094500                                                                  32880000
           EXEC SQL                                                     32890000
                OPEN SUBN_CSR                                           32900000
           END-EXEC.                                                    32910000
                                                                        32920000
           PERFORM 0975-FETCH-UPDATE THRU 0975-EXIT  UNTIL              32930000
                   NO-MORE-VINITAST.                                    32940000
                                                                        32950000
           IF FETCH-SUBN-CNT = UPDATE-SUBN-CNT                          32960000
              SET ACAT10IO-VINITAST-UPDATED TO TRUE                     32970000
              MOVE 'ALL POSITIONS WILL NOT BE SUBMITTED'                32980000
                                            TO WS-RETURN-MSG            32990000
           ELSE                                                         33000000
              MOVE SPACE TO ACAT10IO-VINITAST-SW                        33010000
           END-IF.                                                      33020000
                                                                        33030000
                                                                        33040000
094400 0970-EXIT.                                                       33050000
094500     EXIT.                                                        33060000
      /                                                                 33070000
       0975-FETCH-UPDATE.                                               33080000
                                                                        33090000
           EXEC SQL                                                     33100000
                FETCH SUBN_CSR                                          33110000
                INTO :WS-INITAST-NSCC-PEND-CD                           33120000
ET0002              ,:DCLACTIAST.UPDT-TMSTP                             33130000
ET0002              ,:DCLACTIAST.PRGM-NM                                33140000
           END-EXEC.                                                    33150000
                                                                        33160000
           EVALUATE SQLCODE                                             33170000
              WHEN  +0                                                  33180000
                    ADD +1  TO FETCH-SUBN-CNT                           33190000
                    PERFORM 0975A-UPDATE                                33200000
              WHEN  +100                                                33210000
                    EXEC SQL                                            33220000
                         CLOSE SUBN_CSR                                 33230000
                    END-EXEC                                            33240000
                    MOVE 'N' TO FETCH-VINITAST-SW                       33250000
094000          WHEN OTHER                                              33260000
                     PERFORM 9000-WRITE-TO-CICS-LOG                     33270000
                     PERFORM 9500-RETURN-DB2-ERROR                      33280000
           END-EVALUATE.                                                33290000
                                                                        33300000
094400 0975-EXIT.                                                       33310000
094500     EXIT.                                                        33320000
                                                                        33330000
       0975A-UPDATE.                                                    33340000
                                                                        33350000
           EXEC SQL                                                     33360000
ET0002          UPDATE ACTIAST                                          33370000
                SET NSCC_PEND_CD = 'H'                                  33380000
                   ,UPDT_TMSTP = CURRENT TIMESTAMP                      33390000
                   ,PRGM_NM = 'ACAT10DC'                                33400000
LRM004             ,CICS_SGNON_ID = :ACAT10IO-SIGN-ON-ID                33410000
LRM011             ,NSCC_ACK_IND      =  ' '                            33420000
LRM025             ,CICS_NET_NM   = :ACAT10IO-NET-NAME                  33430000
LRM025             ,TPSCRT_USR_ID = :ACAT10IO-USER-ID                   33440000
LRM025             ,TPSCRT_USR_NM = :ACAT10IO-USER-NAME                 33450000
LRM025             ,CICS_TERM_ID_CD = :DCLACTIAST.CICS-TERM-ID-CD       33460000
                WHERE CURRENT OF SUBN_CSR                               33470000
           END-EXEC.                                                    33480000
           EVALUATE SQLCODE                                             33490000
              WHEN  +0                                                  33491000
                    ADD +1  TO UPDATE-SUBN-CNT                          33492000
                    MOVE 'H' TO ACAT10IO-VINITAST-NSCC-PEND-CD          33493000
              WHEN  +100                                                33494000
                    MOVE SPACE TO ACAT10IO-VINITAST-SW                  33495000
094000          WHEN OTHER                                              33496000
                     PERFORM 9000-WRITE-TO-CICS-LOG                     33497000
                     PERFORM 9500-RETURN-DB2-ERROR                      33498000
                                                                        33499000
           END-EVALUATE.                                                33500000
                                                                        33510000
      /                                                                 33520000
      **** THIS PARA WAS ADDED ON 12/23 TO REBUILT ASSET SCREEN AFTER   33530000
      **** VINITAST ROW WAS DELETED                                     33540000
12/23  0980-REBUILT-ASSET-INFO.                                         33550000
12/23 ***                                                               33560000
           EXEC SQL                                                     33570000
                SELECT                                                  33580000
                     ASSET_SEQ_NBR                                      33590000
                   , ISIN_CNTRY_CD                                      33600000
                   , ISIN_SEC_ISSUE_CD                                  33610000
                   , ISIN_SEC_CDG_CD                                    33620000
LRM026             , CRNCY_CD                                           33630000
                   , SECURITY_ADP_NBR                                   33640000
                   , TRANS_TYPE_CD                                      33650000
                   , CSH_MGN_SHRT_CD                                    33660000
                   , PSTN_CD                                            33661000
                   , WHI_CD                                             33662000
                   , STTLM_LCTN_CD                                      33663000
                   , STTLM_RSN_CD                                       33664000
                   , NSCC_PEND_CD                                       33665000
                   , ASSET_QTY                                          33666000
                   , ASSET_AMT                                          33667000
                   , ASSET_DESC_TXT                                     33668000
                   , ASSET_CMNT_TXT                                     33669000
                INTO                                                    33670000
                   :WS-ASSET-SEQ-NBR                                    33680000
                  ,:WS-CNTRY-CD                                         33690000
                  ,:WS-SEC-NBR                                          33700000
                  ,:SV-SEC-CDG-CD                                       33710000
LRM026            ,:SV-CRNCY-CD                                         33720000
                  ,:WS-ADP-NBR                                          33730000
                  ,:WS-TRANS-TYPE-CD                                    33740000
                  ,:WS-CSH-MGN-SHRT-CD                                  33750000
                  ,:WS-PSTN-CD                                          33760000
                  ,:WS-WHEN-ISSUED                                      33770000
                  ,:WS-STTLM-LCTN-CD                                    33780000
                  ,:WS-STTLM-RSN-CD                                     33790000
                  ,:WS-INITAST-NSCC-PEND-CD                             33800000
                  ,:WS-ASSET-QTY                                        33810000
                  ,:WS-ASSET-AMT                                        33820000
                  ,:WS-ASSET-DESC                                       33830000
                  ,:WS-ASSET-CMNT                                       33840000
                FROM VASSET                                             33850000
                   WHERE  CLIENT_NBR = :SV-CLIENT-NBR                   33860000
                     AND  ACAT_CONTROL_NBR = :SV-ACAT-CNTL-NBR          33870000
                     AND  ASSET_SEQ_NBR = :SV-ASSET-SEQ-NBR             33880000
           END-EXEC.                                                    33890000
      *                                                                 33900000
093400     EVALUATE SQLCODE                                             33910000
093500          WHEN +0                                                 33920000
                     MOVE SQLCODE  TO  VASSET-SQLCODE                   33930000
                     SET ACAT10IO-VASSET-FOUND   TO TRUE                33940000
                     MOVE WS-ASSET-SEQ-NBR TO SV-ASSET-SEQ-NBR          33950000
                                              ACAT10IO-SV-ASSET-SEQ-NBR 33960000
                     MOVE WS-SEC-NBR       TO SV-SEC-ISSUE-CD           33970000
                     MOVE SV-CNTRY-CD      TO ACAT10IO-SV-CNTRY-CD      33980000
                     MOVE SV-SEC-CDG-CD    TO ACAT10IO-SV-SEC-CDG-CD    33990000
LRM026               MOVE SV-CRNCY-CD      TO ACAT10IO-SV-CRNCY-CD      34000000
                     MOVE WS-STTLM-LCTN-CD TO SV-STTLM-LCTN-CD          34010000
                     MOVE WS-CNTRY-CD      TO SV-CNTRY-CD               34020000
12/23                MOVE SPACES TO ACAT10IO-MBAL01, ACAT10IO-MBAL02,   34030000
                                    ACAT10IO-MBAL05, ACAT10IO-MSMA,     34040000
                                    ACAT10IO-MQTY, ACAT10IO-MAMT        34050000
01/04                PERFORM 0050-MOVE-ASSET-DATA THRU 0050-EXIT        34060000
                WHEN +100                                               34070000
                     MOVE SQLCODE  TO  VASSET-SQLCODE                   34080000
                     SET ACAT10IO-VASSET-NOT-FOUND TO TRUE              34090000
                     MOVE 'CANNOT FIND ASSET -- CRITICAL ERROR'         34100000
                        TO WS-RETURN-MSG                                34110000
094000          WHEN OTHER                                              34120000
                     SET ACAT10IO-VASSET-NOT-FOUND TO TRUE              34130000
                     MOVE SPACES TO ACAT10IO-VASSET-SW                  34140000
                     PERFORM 9000-WRITE-TO-CICS-LOG                     34150000
                     PERFORM 9500-RETURN-DB2-ERROR                      34160000
094200      END-EVALUATE.                                               34170000
      *                                                                 34180000
       0980-EXIT.                                                       34190000
           EXIT.                                                        34200000
      /                                                                 34210000
      ******************************************************************34220000
       ABENDED.                                                         34230000
     ***   EXEC CICS ASSIGN ABCODE(WS-ABCODE) END-EXEC.                 34240000
     ***   MOVE WS-ABEND-MESSAGE TO BHST-MESSAGE.                       34250000
     ***   MOVE '9999' TO BHST-RETURN-CODE.                             34260000
     **    EXEC CICS RETURN END-EXEC.                                   34270000
      *==============================                                   34280000
                                                                        34290000
       9000-WRITE-TO-CICS-LOG.                                          34300000
      *==============================                                   34310000
           IF SQLCODE = -803                                            34320000
               CONTINUE                                                 34330000
           ELSE                                                         34340000
               MOVE SPACES             TO WS-ERRL-DATA                  34350000
               SET WRITE-ERROR-TO-LOG  TO TRUE                          34360000
               MOVE EIBTRNID           TO CALLING-TRAN-ID               34370000
               MOVE 'ACAT10DC'         TO CALLING-PROGRAM-ID            34380000
               MOVE SQLCA              TO SQLCA-AREA                    34390000
               EXEC CICS LINK PROGRAM ('FPDB2LOG')                      34400000
                     COMMAREA (WS-ERRL-DATA)                            34410000
                     LENGTH (LENGTH OF WS-ERRL-DATA)                    34420000
                     NOHANDLE                                           34430000
               END-EXEC                                                 34440000
           END-IF.                                                      34450000
      *    EXEC CICS RETURN END-EXEC.                                   34460000
                                                                        34470000
       9500-RETURN-DB2-ERROR.                                           34480000
           EXEC CICS SYNCPOINT ROLLBACK END-EXEC.                       34490000
           SET ACAT10IO-DB2-ERROR TO TRUE.                              34500000
           MOVE SQLCAID TO ACAT10IO-SQLCAID.                            34510000
           MOVE SQLCODE TO ACAT10IO-SQLCODE.                            34520000
           MOVE SQLERRM TO ACAT10IO-SQLERRM.                            34530000
           EXEC CICS RETURN END-EXEC.                                   34540000
      ******************************************************************34550000
01/20  0410-GET-ASSET-BALANCE.                                          34560000
      *----------------------------------------------------------------*34570000
      *          GET VASSET BALANCES INFORMATION                       *34580000
      *----------------------------------------------------------------*34590000
           EXEC SQL                                                     34600000
                SELECT                                                  34610000
                       CLIENT_NBR                                       34620000
                     , ACAT_CONTROL_NBR                                 34630000
                     , ASSET_SEQ_NBR                                    34640000
                     , CONTROL_NBR_STS_CD                               34650000
                     , DLVR_NBR_STTS_CD                                 34660000
                     , RCV_NBR_STTS_CD                                  34670000
                     , SBMTG_PRTCP_NBR                                  34680000
                     , SBMT_PRT_NR_STS_CD                               34690000
                     , AST_SEQ_NBR_STS_CD                               34700000
                     , SYS_ACT_CD                                       34710000
                     , SYS_RJCT_RSN_CD                                  34720000
                     , TRANS_TYPE_CD                                    34730000
                     , TRANS_TYPE_STTS_CD                               34740000
                     , PHSCL_SEQ_NBR                                    34750000
                     , PHSCL_SEQ_STTS_CD                                34760000
                     , LGCL_SEQ_NBR                                     34770000
                     , LGCL_SEQ_NR_STS_CD                               34780000
                     , ASSET_PRC_CTGY_CD                                34790000
                     , AST_PRC_CTG_STS_CD                               34800000
                     , STTLM_LCTN_CD                                    34810000
                     , STTLM_LCTN_STTS_CD                               34820000
                     , STTLM_RSN_CD                                     34830000
                     , STTLM_RSN_STTS_CD                                34840000
                     , ISIN_CNTRY_CD                                    34850000
                     , ISIN_CNTRY_STTS_CD                               34860000
                     , ISIN_SEC_ISSUE_CD                                34870000
                     , ISIN_SEC_IS_STS_CD                               34880000
                     , ISIN_SEC_CDG_CD                                  34890000
                     , ISIN_SEC_CD_STS_CD                               34900000
                     , ASSET_DESC_TXT                                   34910000
                     , ASSET_DESC_STTS_CD                               34920000
                     , ASSET_RQST_QTY_CD                                34930000
                     , ASSET_RQST_STS_CD                                34940000
                     , AST_RQST_TRANS_CD                                34950000
                     , AST_RQ_TRAN_STS_CD                               34960000
                     , ASSET_QTY                                        34970000
                     , ASSET_QTY_STTS_CD                                34980000
                     , ASSET_PCT                                        34990000
                     , ASSET_PCT_STTS_CD                                35000000
                     , PSTN_CD                                          35010000
                     , PSTN_CD_STTS_CD                                  35020000
                     , ISO_CRNCY_CD                                     35030000
                     , ISO_CRNCY_STTS_CD                                35040000
                     , ASSET_AMT                                        35050000
                     , ASSET_AMT_STTS_CD                                35060000
                     , BEARER_BOND_CD                                   35070000
                     , BEARER_BND_STTS_CD                               35080000
                     , CSH_MGN_SHRT_CD                                  35090000
                     , CSH_MRG_SHT_STS_CD                               35100000
                     , WHI_CD                                           35110000
                     , WHI_STTS_CD                                      35120000
                     , TRNFR_TYPE_RSN_CD                                35130000
                     , TRN_TYP_RSN_STS_CD                               35140000
                     , MBS_SERIAL_NBR                                   35150000
                     , MBS_SERIAL_STTS_CD                               35160000
                     , ASSET_CMNT_TXT                                   35170000
                     , ASSET_CMNT_STTS_CD                               35180000
                     , NSCC_ACK_IND                                     35190000
                     , NSCC_PEND_CD                                     35200000
                     , FAIL_SENT_CAGE_IND                               35210000
                     , FAIL_OPEN_CAGE_IND                               35220000
                     , NSCC_NON_ADP_IND                                 35230000
                     , TRANS_RFRN_ID_CD                                 35240000
                     , TRANS_RFRN_STTS_CD                               35250000
                     , OPTN_CTGY_CD                                     35260000
                     , OPTN_CTGY_STTS_CD                                35270000
                     , RCRD_LNGTH_STTS_CD                               35280000
                     , RCRD_STTS_CD                                     35290000
                     , ISIN_SEC_EXCPT_IND                               35300000
                     , CRT_TMSTP                                        35310000
                     , UPDT_TMSTP                                       35320000
                     , CICS_TERM_ID_CD                                  35330000
                     , PRGM_NM                                          35340000
                     , SECURITY_ADP_NBR                                 35350000
                     , RCL_SENT_NSCC_IND                                35360000
                     , FRV_SENT_NSCC_IND                                35370000
                     , TRNFR_TYPE_CD                                    35380000
                 INTO                                                   35390000
                      :DCLVASSET.CLIENT-NBR                             35400000
                     ,:DCLVASSET.ACAT-CONTROL-NBR                       35410000
                     ,:DCLVASSET.ASSET-SEQ-NBR                          35420000
                     ,:DCLVASSET.CONTROL-NBR-STS-CD                     35430000
                     ,:DCLVASSET.DLVR-NBR-STTS-CD                       35440000
                     ,:DCLVASSET.RCV-NBR-STTS-CD                        35450000
                     ,:DCLVASSET.SBMTG-PRTCP-NBR                        35460000
                     ,:DCLVASSET.SBMT-PRT-NR-STS-CD                     35470000
                     ,:DCLVASSET.AST-SEQ-NBR-STS-CD                     35480000
                     ,:DCLVASSET.SYS-ACT-CD                             35490000
                     ,:DCLVASSET.SYS-RJCT-RSN-CD                        35500000
                     ,:DCLVASSET.TRANS-TYPE-CD                          35510000
                     ,:DCLVASSET.TRANS-TYPE-STTS-CD                     35520000
                     ,:DCLVASSET.PHSCL-SEQ-NBR                          35530000
                     ,:DCLVASSET.PHSCL-SEQ-STTS-CD                      35540000
                     ,:DCLVASSET.LGCL-SEQ-NBR                           35550000
                     ,:DCLVASSET.LGCL-SEQ-NR-STS-CD                     35560000
                     ,:DCLVASSET.ASSET-PRC-CTGY-CD                      35570000
                     ,:DCLVASSET.AST-PRC-CTG-STS-CD                     35580000
                     ,:DCLVASSET.STTLM-LCTN-CD                          35590000
                     ,:DCLVASSET.STTLM-LCTN-STTS-CD                     35600000
                     ,:DCLVASSET.STTLM-RSN-CD                           35610000
                     ,:DCLVASSET.STTLM-RSN-STTS-CD                      35620000
                     ,:DCLVASSET.ISIN-CNTRY-CD                          35630000
                     ,:DCLVASSET.ISIN-CNTRY-STTS-CD                     35640000
                     ,:DCLVASSET.ISIN-SEC-ISSUE-CD                      35650000
                     ,:DCLVASSET.ISIN-SEC-IS-STS-CD                     35660000
                     ,:DCLVASSET.ISIN-SEC-CDG-CD                        35670000
                     ,:DCLVASSET.ISIN-SEC-CD-STS-CD                     35680000
                     ,:DCLVASSET.ASSET-DESC-TXT                         35690000
                     ,:DCLVASSET.ASSET-DESC-STTS-CD                     35700000
                     ,:DCLVASSET.ASSET-RQST-QTY-CD                      35710000
                     ,:DCLVASSET.ASSET-RQST-STS-CD                      35720000
                     ,:DCLVASSET.AST-RQST-TRANS-CD                      35730000
                     ,:DCLVASSET.AST-RQ-TRAN-STS-CD                     35740000
                     ,:DCLVASSET.ASSET-QTY                              35750000
                     ,:DCLVASSET.ASSET-QTY-STTS-CD                      35760000
                     ,:DCLVASSET.ASSET-PCT                              35770000
                     ,:DCLVASSET.ASSET-PCT-STTS-CD                      35780000
                     ,:DCLVASSET.PSTN-CD                                35790000
                     ,:DCLVASSET.PSTN-CD-STTS-CD                        35800000
                     ,:DCLVASSET.ISO-CRNCY-CD                           35810000
                     ,:DCLVASSET.ISO-CRNCY-STTS-CD                      35820000
                     ,:DCLVASSET.ASSET-AMT                              35830000
                     ,:DCLVASSET.ASSET-AMT-STTS-CD                      35840000
                     ,:DCLVASSET.BEARER-BOND-CD                         35850000
                     ,:DCLVASSET.BEARER-BND-STTS-CD                     35860000
                     ,:DCLVASSET.CSH-MGN-SHRT-CD                        35870000
                     ,:DCLVASSET.CSH-MRG-SHT-STS-CD                     35880000
                     ,:DCLVASSET.WHI-CD                                 35890000
                     ,:DCLVASSET.WHI-STTS-CD                            35900000
                     ,:DCLVASSET.TRNFR-TYPE-RSN-CD                      35910000
                     ,:DCLVASSET.TRN-TYP-RSN-STS-CD                     35920000
                     ,:DCLVASSET.MBS-SERIAL-NBR                         35930000
                     ,:DCLVASSET.MBS-SERIAL-STTS-CD                     35940000
                     ,:DCLVASSET.ASSET-CMNT-TXT                         35950000
                     ,:DCLVASSET.ASSET-CMNT-STTS-CD                     35960000
                     ,:DCLVASSET.NSCC-ACK-IND                           35970000
                     ,:DCLVASSET.NSCC-PEND-CD                           35980000
                     ,:DCLVASSET.FAIL-SENT-CAGE-IND                     35990000
                     ,:DCLVASSET.FAIL-OPEN-CAGE-IND                     36000000
                     ,:DCLVASSET.NSCC-NON-ADP-IND                       36010000
                     ,:DCLVASSET.TRANS-RFRN-ID-CD                       36020000
                     ,:DCLVASSET.TRANS-RFRN-STTS-CD                     36030000
                     ,:DCLVASSET.OPTN-CTGY-CD                           36040000
                     ,:DCLVASSET.OPTN-CTGY-STTS-CD                      36050000
                     ,:DCLVASSET.RCRD-LNGTH-STTS-CD                     36060000
                     ,:DCLVASSET.RCRD-STTS-CD                           36070000
                     ,:DCLVASSET.ISIN-SEC-EXCPT-IND                     36080000
                     ,:DCLVASSET.CRT-TMSTP                              36090000
                     ,:DCLVASSET.UPDT-TMSTP                             36100000
                     ,:DCLVASSET.CICS-TERM-ID-CD                        36110000
                     ,:DCLVASSET.PRGM-NM                                36120000
                     ,:DCLVASSET.SECURITY-ADP-NBR                       36130000
                     ,:DCLVASSET.RCL-SENT-NSCC-IND                      36140000
                     ,:DCLVASSET.FRV-SENT-NSCC-IND                      36150000
                     ,:DCLVASSET.TRNFR-TYPE-CD                          36160000
092900               FROM VASSET                                        36170000
                    WHERE (CLIENT_NBR  = :SV-CLIENT-NBR)                36180000
                      AND (ACAT_CONTROL_NBR = :SV-ACAT-CNTL-NBR)        36190000
                      AND (STTLM_LCTN_CD = :WS-STTLM-LCTN-CD)           36200000
                      AND (STTLM_RSN_CD = :WS-STTLM-RSN-CD)             36210000
                      AND (CSH_MGN_SHRT_CD = :WS-CSH-MGN-SHRT-CD)       36220000
093200      END-EXEC.                                                   36230000
                                                                        36240000
093400      EVALUATE SQLCODE                                            36250000
093500          WHEN +0                                                 36260000
                     SET VASSET-FOUND TO TRUE                           36270000
094000          WHEN +100                                               36280000
                     SET VASSET-NOT-FOUND TO TRUE                       36290000
                     MOVE 'ASSET BALANCE NOT FOUND ' TO WS-RETURN-MSG   36300000
094000          WHEN OTHER                                              36310000
                     PERFORM 9000-WRITE-TO-CICS-LOG                     36320000
                     PERFORM 9500-RETURN-DB2-ERROR                      36330000
094200      END-EVALUATE.                                               36340000
                                                                        36350000
      *                                                                 36360000
       0410-EXIT.                                                       36370000
           EXIT.                                                        36380000
      /                                                                 36390000
01/20  0420-GET-ASSET-SMA.                                              36400000
      *----------------------------------------------------------------*36410000
      *          GET VASSET   SMA    INFORMATION                       *36420000
      *----------------------------------------------------------------*36430000
           EXEC SQL                                                     36440000
                SELECT                                                  36450000
                       CLIENT_NBR                                       36460000
                     , ACAT_CONTROL_NBR                                 36470000
                     , ASSET_SEQ_NBR                                    36480000
                     , CONTROL_NBR_STS_CD                               36490000
                     , DLVR_NBR_STTS_CD                                 36500000
                     , RCV_NBR_STTS_CD                                  36510000
                     , SBMTG_PRTCP_NBR                                  36520000
                     , SBMT_PRT_NR_STS_CD                               36530000
                     , AST_SEQ_NBR_STS_CD                               36540000
                     , SYS_ACT_CD                                       36550000
                     , SYS_RJCT_RSN_CD                                  36560000
                     , TRANS_TYPE_CD                                    36570000
                     , TRANS_TYPE_STTS_CD                               36580000
                     , PHSCL_SEQ_NBR                                    36590000
                     , PHSCL_SEQ_STTS_CD                                36600000
                     , LGCL_SEQ_NBR                                     36610000
                     , LGCL_SEQ_NR_STS_CD                               36620000
                     , ASSET_PRC_CTGY_CD                                36630000
                     , AST_PRC_CTG_STS_CD                               36640000
                     , STTLM_LCTN_CD                                    36650000
                     , STTLM_LCTN_STTS_CD                               36660000
                     , STTLM_RSN_CD                                     36670000
                     , STTLM_RSN_STTS_CD                                36680000
                     , ISIN_CNTRY_CD                                    36690000
                     , ISIN_CNTRY_STTS_CD                               36700000
                     , ISIN_SEC_ISSUE_CD                                36710000
                     , ISIN_SEC_IS_STS_CD                               36720000
                     , ISIN_SEC_CDG_CD                                  36730000
                     , ISIN_SEC_CD_STS_CD                               36740000
                     , ASSET_DESC_TXT                                   36750000
                     , ASSET_DESC_STTS_CD                               36760000
                     , ASSET_RQST_QTY_CD                                36770000
                     , ASSET_RQST_STS_CD                                36780000
                     , AST_RQST_TRANS_CD                                36790000
                     , AST_RQ_TRAN_STS_CD                               36800000
                     , ASSET_QTY                                        36810000
                     , ASSET_QTY_STTS_CD                                36820000
                     , ASSET_PCT                                        36830000
                     , ASSET_PCT_STTS_CD                                36840000
                     , PSTN_CD                                          36850000
                     , PSTN_CD_STTS_CD                                  36860000
                     , ISO_CRNCY_CD                                     36870000
                     , ISO_CRNCY_STTS_CD                                36880000
                     , ASSET_AMT                                        36890000
                     , ASSET_AMT_STTS_CD                                36900000
                     , BEARER_BOND_CD                                   36910000
                     , BEARER_BND_STTS_CD                               36920000
                     , CSH_MGN_SHRT_CD                                  36930000
                     , CSH_MRG_SHT_STS_CD                               36940000
                     , WHI_CD                                           36950000
                     , WHI_STTS_CD                                      36960000
                     , TRNFR_TYPE_RSN_CD                                36970000
                     , TRN_TYP_RSN_STS_CD                               36980000
                     , MBS_SERIAL_NBR                                   36990000
                     , MBS_SERIAL_STTS_CD                               37000000
                     , ASSET_CMNT_TXT                                   37010000
                     , ASSET_CMNT_STTS_CD                               37020000
                     , NSCC_ACK_IND                                     37030000
                     , NSCC_PEND_CD                                     37040000
                     , FAIL_SENT_CAGE_IND                               37050000
                     , FAIL_OPEN_CAGE_IND                               37060000
                     , NSCC_NON_ADP_IND                                 37070000
                     , TRANS_RFRN_ID_CD                                 37080000
                     , TRANS_RFRN_STTS_CD                               37090000
                     , OPTN_CTGY_CD                                     37100000
                     , OPTN_CTGY_STTS_CD                                37110000
                     , RCRD_LNGTH_STTS_CD                               37120000
                     , RCRD_STTS_CD                                     37130000
                     , ISIN_SEC_EXCPT_IND                               37140000
                     , CRT_TMSTP                                        37150000
                     , UPDT_TMSTP                                       37160000
                     , CICS_TERM_ID_CD                                  37170000
                     , PRGM_NM                                          37180000
                     , SECURITY_ADP_NBR                                 37190000
                     , RCL_SENT_NSCC_IND                                37200000
                     , FRV_SENT_NSCC_IND                                37210000
                     , TRNFR_TYPE_CD                                    37220000
                 INTO                                                   37230000
                      :DCLVASSET.CLIENT-NBR                             37240000
                     ,:DCLVASSET.ACAT-CONTROL-NBR                       37250000
                     ,:DCLVASSET.ASSET-SEQ-NBR                          37260000
                     ,:DCLVASSET.CONTROL-NBR-STS-CD                     37270000
                     ,:DCLVASSET.DLVR-NBR-STTS-CD                       37280000
                     ,:DCLVASSET.RCV-NBR-STTS-CD                        37290000
                     ,:DCLVASSET.SBMTG-PRTCP-NBR                        37300000
                     ,:DCLVASSET.SBMT-PRT-NR-STS-CD                     37310000
                     ,:DCLVASSET.AST-SEQ-NBR-STS-CD                     37320000
                     ,:DCLVASSET.SYS-ACT-CD                             37330000
                     ,:DCLVASSET.SYS-RJCT-RSN-CD                        37340000
                     ,:DCLVASSET.TRANS-TYPE-CD                          37350000
                     ,:DCLVASSET.TRANS-TYPE-STTS-CD                     37360000
                     ,:DCLVASSET.PHSCL-SEQ-NBR                          37370000
                     ,:DCLVASSET.PHSCL-SEQ-STTS-CD                      37380000
                     ,:DCLVASSET.LGCL-SEQ-NBR                           37390000
                     ,:DCLVASSET.LGCL-SEQ-NR-STS-CD                     37400000
                     ,:DCLVASSET.ASSET-PRC-CTGY-CD                      37410000
                     ,:DCLVASSET.AST-PRC-CTG-STS-CD                     37420000
                     ,:DCLVASSET.STTLM-LCTN-CD                          37430000
                     ,:DCLVASSET.STTLM-LCTN-STTS-CD                     37440000
                     ,:DCLVASSET.STTLM-RSN-CD                           37450000
                     ,:DCLVASSET.STTLM-RSN-STTS-CD                      37460000
                     ,:DCLVASSET.ISIN-CNTRY-CD                          37470000
                     ,:DCLVASSET.ISIN-CNTRY-STTS-CD                     37480000
                     ,:DCLVASSET.ISIN-SEC-ISSUE-CD                      37490000
                     ,:DCLVASSET.ISIN-SEC-IS-STS-CD                     37500000
                     ,:DCLVASSET.ISIN-SEC-CDG-CD                        37510000
                     ,:DCLVASSET.ISIN-SEC-CD-STS-CD                     37520000
                     ,:DCLVASSET.ASSET-DESC-TXT                         37530000
                     ,:DCLVASSET.ASSET-DESC-STTS-CD                     37540000
                     ,:DCLVASSET.ASSET-RQST-QTY-CD                      37550000
                     ,:DCLVASSET.ASSET-RQST-STS-CD                      37560000
                     ,:DCLVASSET.AST-RQST-TRANS-CD                      37570000
                     ,:DCLVASSET.AST-RQ-TRAN-STS-CD                     37580000
                     ,:DCLVASSET.ASSET-QTY                              37590000
                     ,:DCLVASSET.ASSET-QTY-STTS-CD                      37600000
                     ,:DCLVASSET.ASSET-PCT                              37610000
                     ,:DCLVASSET.ASSET-PCT-STTS-CD                      37620000
                     ,:DCLVASSET.PSTN-CD                                37630000
                     ,:DCLVASSET.PSTN-CD-STTS-CD                        37640000
                     ,:DCLVASSET.ISO-CRNCY-CD                           37650000
                     ,:DCLVASSET.ISO-CRNCY-STTS-CD                      37660000
                     ,:DCLVASSET.ASSET-AMT                              37670000
                     ,:DCLVASSET.ASSET-AMT-STTS-CD                      37680000
                     ,:DCLVASSET.BEARER-BOND-CD                         37690000
                     ,:DCLVASSET.BEARER-BND-STTS-CD                     37700000
                     ,:DCLVASSET.CSH-MGN-SHRT-CD                        37710000
                     ,:DCLVASSET.CSH-MRG-SHT-STS-CD                     37720000
                     ,:DCLVASSET.WHI-CD                                 37730000
                     ,:DCLVASSET.WHI-STTS-CD                            37740000
                     ,:DCLVASSET.TRNFR-TYPE-RSN-CD                      37750000
                     ,:DCLVASSET.TRN-TYP-RSN-STS-CD                     37760000
                     ,:DCLVASSET.MBS-SERIAL-NBR                         37770000
                     ,:DCLVASSET.MBS-SERIAL-STTS-CD                     37780000
                     ,:DCLVASSET.ASSET-CMNT-TXT                         37790000
                     ,:DCLVASSET.ASSET-CMNT-STTS-CD                     37800000
                     ,:DCLVASSET.NSCC-ACK-IND                           37810000
                     ,:DCLVASSET.NSCC-PEND-CD                           37820000
                     ,:DCLVASSET.FAIL-SENT-CAGE-IND                     37830000
                     ,:DCLVASSET.FAIL-OPEN-CAGE-IND                     37840000
                     ,:DCLVASSET.NSCC-NON-ADP-IND                       37850000
                     ,:DCLVASSET.TRANS-RFRN-ID-CD                       37860000
                     ,:DCLVASSET.TRANS-RFRN-STTS-CD                     37870000
                     ,:DCLVASSET.OPTN-CTGY-CD                           37880000
                     ,:DCLVASSET.OPTN-CTGY-STTS-CD                      37890000
                     ,:DCLVASSET.RCRD-LNGTH-STTS-CD                     37900000
                     ,:DCLVASSET.RCRD-STTS-CD                           37910000
                     ,:DCLVASSET.ISIN-SEC-EXCPT-IND                     37920000
                     ,:DCLVASSET.CRT-TMSTP                              37930000
                     ,:DCLVASSET.UPDT-TMSTP                             37940000
                     ,:DCLVASSET.CICS-TERM-ID-CD                        37950000
                     ,:DCLVASSET.PRGM-NM                                37960000
                     ,:DCLVASSET.SECURITY-ADP-NBR                       37970000
                     ,:DCLVASSET.RCL-SENT-NSCC-IND                      37980000
                     ,:DCLVASSET.FRV-SENT-NSCC-IND                      37990000
                     ,:DCLVASSET.TRNFR-TYPE-CD                          38000000
092900               FROM VASSET                                        38010000
                    WHERE (CLIENT_NBR  = :SV-CLIENT-NBR)                38020000
                      AND (ACAT_CONTROL_NBR = :SV-ACAT-CNTL-NBR)        38030000
                      AND (STTLM_LCTN_CD = :WS-STTLM-LCTN-CD)           38040000
                      AND (STTLM_RSN_CD = :WS-STTLM-RSN-CD)             38050000
                                                                        38060000
093200      END-EXEC.                                                   38070000
                                                                        38080000
093400      EVALUATE SQLCODE                                            38090000
093500          WHEN +0                                                 38100000
                     SET VASSET-FOUND TO TRUE                           38110000
      *              MOVE  SV-ASSET-SEQ-NBR  TO                         38120000
      *                      ACAT10IO-SV-ASSET-SEQ-NBR                  38130000
094000          WHEN +100                                               38140000
                     MOVE 'ASSET SMA NOT FOUND ' TO WS-RETURN-MSG       38150000
094000          WHEN OTHER                                              38160000
                     PERFORM 9000-WRITE-TO-CICS-LOG                     38170000
                     PERFORM 9500-RETURN-DB2-ERROR                      38180000
094200      END-EVALUATE.                                               38190000
                                                                        38200000
      *                                                                 38210000
       0420-EXIT.                                                       38220000
           EXIT.                                                        38230000
      /                                                                 38240000
                                                                        38250000
LRM005 2500-CRE-DLTED-CASH-AUDIT-ROW.                                   38260000
           EXEC SQL                                                     38270000
                SET :WS-TIMESTAMP = CURRENT TIMESTAMP                   38280000
           END-EXEC.                                                    38290000
           EXEC SQL                                                     38300000
              SELECT                                                    38310000
                 CLIENT_NBR                                             38320000
                ,DLVR_NBR                                               38330000
                ,ACCT_DLVR_NBR                                          38340000
                ,RCV_NBR                                                38350000
                ,ACCT_RCV_NBR                                           38360000
                ,TRNFR_TYPE_CD                                          38370000
                ,ISIN_CNTRY_CD                                          38380000
                ,ISIN_SEC_ISSUE_CD                                      38390000
                ,ISIN_SEC_CDG_CD                                        38400000
                ,STTLM_LCTN_CD                                          38410000
                ,CSH_MGN_SHRT_CD                                        38420000
                ,CSH_MRG_SHT_STS_CD                                     38430000
                ,STTLM_LCTN_STTS_CD                                     38440000
                ,ISIN_CNTRY_STTS_CD                                     38440100
                ,SBMTG_PRTCP_NBR                                        38440200
                ,SBMT_PRT_NR_STS_CD                                     38440300
                ,ACAT_CONTROL_NBR                                       38440400
                ,CONTROL_NBR_STS_CD                                     38440500
                ,ASSET_SEQ_NBR                                          38440600
                ,AST_SEQ_NBR_STS_CD                                     38440700
                ,TRANS_TYPE_CD                                          38440800
                ,TRANS_TYPE_STTS_CD                                     38440900
                ,PHSCL_SEQ_NBR                                          38441000
                ,PHSCL_SEQ_STTS_CD                                      38442000
                ,LGCL_SEQ_NBR                                           38443000
                ,LGCL_SEQ_NR_STS_CD                                     38444000
                ,ASSET_PRC_CTGY_CD                                      38445000
                ,AST_PRC_CTG_STS_CD                                     38446000
                ,STTLM_RSN_CD                                           38447000
                ,STTLM_RSN_STTS_CD                                      38448000
                ,ASSET_DESC_TXT                                         38449000
                ,ASSET_DESC_STTS_CD                                     38450000
                ,ASSET_RQST_QTY_CD                                      38460000
                ,ASSET_RQST_STS_CD                                      38470000
                ,AST_RQST_TRANS_CD                                      38480000
                ,AST_RQ_TRAN_STS_CD                                     38490000
                ,ASSET_QTY                                              38500000
                ,ASSET_QTY_STTS_CD                                      38510000
                ,ASSET_PCT                                              38520000
                ,ASSET_PCT_STTS_CD                                      38530000
                ,PSTN_CD                                                38540000
                ,PSTN_CD_STTS_CD                                        38550000
                ,ISO_CRNCY_CD                                           38560000
                ,ISO_CRNCY_STTS_CD                                      38570000
                ,ASSET_AMT                                              38580000
                ,ASSET_AMT_STTS_CD                                      38590000
                ,BEARER_BOND_CD                                         38600000
                ,BEARER_BND_STTS_CD                                     38610000
                ,WHI_CD                                                 38620000
                ,WHI_STTS_CD                                            38630000
                ,TRNFR_TYPE_RSN_CD                                      38640000
                ,TRN_TYP_RSN_STS_CD                                     38650000
                ,MBS_SERIAL_NBR                                         38660000
                ,MBS_SERIAL_STTS_CD                                     38670000
                ,ASSET_CMNT_TXT                                         38680000
                ,ASSET_CMNT_STTS_CD                                     38690000
                ,NSCC_WTHLD_CD                                          38700000
                ,TRANS_RFRN_ID_CD                                       38710000
                ,TRANS_RFRN_STTS_CD                                     38720000
                ,ISIN_SEC_IS_STS_CD                                     38730000
                ,ISIN_SEC_CD_STS_CD                                     38740000
                ,OPTN_CTGY_CD                                           38750000
                ,OPTN_CTGY_STTS_CD                                      38760000
                ,RCRD_LNGTH_STTS_CD                                     38770000
                ,RCRD_STTS_CD                                           38780000
                ,NSCC_PEND_CD                                           38790000
                ,NSCC_ACK_IND                                           38800000
                ,PRGM_NM                                                38810000
                ,CICS_TERM_ID_CD                                        38820000
                ,UPDT_TMSTP                                             38830000
                ,CRT_TMSTP                                              38840000
                ,SECURITY_ADP_NBR                                       38850000
                ,TRNFR_TYPE_STTS_CD                                     38860000
                ,RCV_NBR_STTS_CD                                        38870000
                ,DLVR_NBR_STTS_CD                                       38880000
                ,CAGE_TAG_NBR                                           38890000
                ,SCRTY_866_NBR                                          38900000
                ,ASSET_866_QTY                                          38910000
                ,CICS_SGNON_ID                                          38920000
                ,CICS_NET_NM                                            38930000
                ,TPSCRT_USR_ID                                          38940000
                ,TPSCRT_USR_NM                                          38950000
              INTO                                                      38960000
                :DCLACTIAST.CLIENT-NBR                                  38970000
               ,:DCLACTIAST.DLVR-NBR                                    38980000
               ,:DCLACTIAST.ACCT-DLVR-NBR                               38990000
               ,:DCLACTIAST.RCV-NBR                                     39000000
               ,:DCLACTIAST.ACCT-RCV-NBR                                39010000
               ,:DCLACTIAST.TRNFR-TYPE-CD                               39020000
               ,:DCLACTIAST.ISIN-CNTRY-CD                               39030000
               ,:DCLACTIAST.ISIN-SEC-ISSUE-CD                           39040000
               ,:DCLACTIAST.ISIN-SEC-CDG-CD                             39050000
               ,:DCLACTIAST.STTLM-LCTN-CD                               39060000
               ,:DCLACTIAST.CSH-MGN-SHRT-CD                             39070000
               ,:DCLACTIAST.CSH-MRG-SHT-STS-CD                          39080000
               ,:DCLACTIAST.STTLM-LCTN-STTS-CD                          39090000
               ,:DCLACTIAST.ISIN-CNTRY-STTS-CD                          39100000
               ,:DCLACTIAST.SBMTG-PRTCP-NBR                             39110000
               ,:DCLACTIAST.SBMT-PRT-NR-STS-CD                          39120000
               ,:DCLACTIAST.ACAT-CONTROL-NBR                            39130000
               ,:DCLACTIAST.CONTROL-NBR-STS-CD                          39140000
               ,:DCLACTIAST.ASSET-SEQ-NBR                               39150000
               ,:DCLACTIAST.AST-SEQ-NBR-STS-CD                          39160000
               ,:DCLACTIAST.TRANS-TYPE-CD                               39170000
               ,:DCLACTIAST.TRANS-TYPE-STTS-CD                          39180000
               ,:DCLACTIAST.PHSCL-SEQ-NBR                               39190000
               ,:DCLACTIAST.PHSCL-SEQ-STTS-CD                           39200000
               ,:DCLACTIAST.LGCL-SEQ-NBR                                39210000
               ,:DCLACTIAST.LGCL-SEQ-NR-STS-CD                          39220000
               ,:DCLACTIAST.ASSET-PRC-CTGY-CD                           39230000
               ,:DCLACTIAST.AST-PRC-CTG-STS-CD                          39240000
               ,:DCLACTIAST.STTLM-RSN-CD                                39250000
               ,:DCLACTIAST.STTLM-RSN-STTS-CD                           39260000
               ,:DCLACTIAST.ASSET-DESC-TXT                              39270000
               ,:DCLACTIAST.ASSET-DESC-STTS-CD                          39280000
               ,:DCLACTIAST.ASSET-RQST-QTY-CD                           39290000
               ,:DCLACTIAST.ASSET-RQST-STS-CD                           39300000
               ,:DCLACTIAST.AST-RQST-TRANS-CD                           39310000
               ,:DCLACTIAST.AST-RQ-TRAN-STS-CD                          39320000
               ,:DCLACTIAST.ASSET-QTY                                   39330000
               ,:DCLACTIAST.ASSET-QTY-STTS-CD                           39340000
               ,:DCLACTIAST.ASSET-PCT                                   39350000
               ,:DCLACTIAST.ASSET-PCT-STTS-CD                           39360000
               ,:DCLACTIAST.PSTN-CD                                     39370000
               ,:DCLACTIAST.PSTN-CD-STTS-CD                             39380000
               ,:DCLACTIAST.ISO-CRNCY-CD                                39390000
               ,:DCLACTIAST.ISO-CRNCY-STTS-CD                           39400000
               ,:DCLACTIAST.ASSET-AMT                                   39410000
               ,:DCLACTIAST.ASSET-AMT-STTS-CD                           39420000
               ,:DCLACTIAST.BEARER-BOND-CD                              39430000
               ,:DCLACTIAST.BEARER-BND-STTS-CD                          39440000
               ,:DCLACTIAST.WHI-CD                                      39450000
               ,:DCLACTIAST.WHI-STTS-CD                                 39460000
               ,:DCLACTIAST.TRNFR-TYPE-RSN-CD                           39470000
               ,:DCLACTIAST.TRN-TYP-RSN-STS-CD                          39480000
               ,:DCLACTIAST.MBS-SERIAL-NBR                              39490000
               ,:DCLACTIAST.MBS-SERIAL-STTS-CD                          39500000
               ,:DCLACTIAST.ASSET-CMNT-TXT                              39510000
               ,:DCLACTIAST.ASSET-CMNT-STTS-CD                          39520000
               ,:DCLACTIAST.NSCC-WTHLD-CD                               39530000
               ,:DCLACTIAST.TRANS-RFRN-ID-CD                            39540000
               ,:DCLACTIAST.TRANS-RFRN-STTS-CD                          39550000
               ,:DCLACTIAST.ISIN-SEC-IS-STS-CD                          39560000
               ,:DCLACTIAST.ISIN-SEC-CD-STS-CD                          39570000
               ,:DCLACTIAST.OPTN-CTGY-CD                                39580000
               ,:DCLACTIAST.OPTN-CTGY-STTS-CD                           39590000
               ,:DCLACTIAST.RCRD-LNGTH-STTS-CD                          39600000
               ,:DCLACTIAST.RCRD-STTS-CD                                39610000
               ,:DCLACTIAST.NSCC-PEND-CD                                39620000
               ,:DCLACTIAST.NSCC-ACK-IND                                39630000
               ,:DCLACTIAST.PRGM-NM                                     39640000
               ,:DCLACTIAST.CICS-TERM-ID-CD                             39650000
               ,:DCLACTIAST.UPDT-TMSTP                                  39660000
               ,:DCLACTIAST.CRT-TMSTP                                   39670000
               ,:DCLACTIAST.SECURITY-ADP-NBR                            39680000
               ,:DCLACTIAST.TRNFR-TYPE-STTS-CD                          39690000
               ,:DCLACTIAST.RCV-NBR-STTS-CD                             39700000
               ,:DCLACTIAST.DLVR-NBR-STTS-CD                            39710000
               ,:DCLACTIAST.CAGE-TAG-NBR                                39720000
               ,:DCLACTIAST.SCRTY-866-NBR                               39730000
               ,:DCLACTIAST.ASSET-866-QTY                               39740000
               ,:DCLACTIAST.CICS-SGNON-ID                               39750000
               ,:DCLACTIAST.CICS-NET-NM                                 39760000
               ,:DCLACTIAST.TPSCRT-USR-ID                               39770000
               ,:DCLACTIAST.TPSCRT-USR-NM                               39780000
             FROM ACTIAST                                               39790000
             WHERE (CLIENT_NBR          = :WS-DLTE-CLIENT-NBR           39800000
                AND DLVR_NBR            = :WS-DLTE-DLVR-NBR             39810000
                AND RCV_NBR             = :WS-DLTE-RCV-NBR              39820000
                AND ACCT_DLVR_NBR       = :WS-DLTE-ACCT-DLVR-NBR        39830000
                AND ACCT_RCV_NBR        = :WS-DLTE-ACCT-RCV-NBR         39840000
                AND ISIN_SEC_ISSUE_CD   = :WS-DLTE-ISIN                 39850000
                AND ACAT_CONTROL_NBR    = :WS-DLTE-ACAT-CNTL-NBR        39860000
                AND STTLM_LCTN_CD       = :WS-DLTE-SLOC                 39870000
                AND CSH_MGN_SHRT_CD     = :WS-DLTE-CSH-MGN-SHRT-CD)     39880000
           END-EXEC.                                                    39890000
                                                                        39900000
           IF SQLCODE = +0                                              39910000
              MOVE 'D' TO WS-DLTE-CLIENT-NBR (1 : 1)                    39920000
                          TRANS-TYPE-CD OF DCLACTIAST                   39930000
              MOVE WS-DLTE-CLIENT-NBR TO CLIENT-NBR    OF DCLACTIAST    39940000
              MOVE ACAT10IO-NET-NAME  TO CICS-NET-NM   OF DCLACTIAST    39950000
              MOVE ACAT10IO-USER-ID   TO TPSCRT-USR-ID OF DCLACTIAST    39960000
              MOVE ACAT10IO-USER-NAME TO TPSCRT-USR-NM OF DCLACTIAST    39970000
              MOVE 'ACAT10DC'         TO  PRGM-NM      OF DCLACTIAST    39980000
              MOVE ACAT10IO-SIGN-ON-ID TO CICS-SGNON-ID OF DCLACTIAST   39990000
              MOVE  EIBTRMID          TO  CICS-TERM-ID-CD OF DCLACTIAST 40000000
              MOVE WS-TIMESTAMP TO UPDT-TMSTP OF DCLACTIAST             40010000
              EXEC SQL                                                  40020000
              INSERT INTO ACTIAST                                       40030000
               ( CLIENT_NBR                                             40040000
                ,DLVR_NBR                                               40050000
                ,ACCT_DLVR_NBR                                          40060000
                ,RCV_NBR                                                40070000
                ,ACCT_RCV_NBR                                           40080000
                ,TRNFR_TYPE_CD                                          40090000
                ,ISIN_CNTRY_CD                                          40100000
                ,ISIN_SEC_ISSUE_CD                                      40110000
                ,ISIN_SEC_CDG_CD                                        40120000
                ,STTLM_LCTN_CD                                          40130000
                ,CSH_MGN_SHRT_CD                                        40140000
                ,CSH_MRG_SHT_STS_CD                                     40150000
                ,STTLM_LCTN_STTS_CD                                     40160000
                ,ISIN_CNTRY_STTS_CD                                     40170000
                ,SBMTG_PRTCP_NBR                                        40180000
                ,SBMT_PRT_NR_STS_CD                                     40190000
                ,ACAT_CONTROL_NBR                                       40200000
                ,CONTROL_NBR_STS_CD                                     40210000
                ,ASSET_SEQ_NBR                                          40211000
                ,AST_SEQ_NBR_STS_CD                                     40212000
                ,TRANS_TYPE_CD                                          40213000
                ,TRANS_TYPE_STTS_CD                                     40214000
                ,PHSCL_SEQ_NBR                                          40215000
                ,PHSCL_SEQ_STTS_CD                                      40216000
                ,LGCL_SEQ_NBR                                           40217000
                ,LGCL_SEQ_NR_STS_CD                                     40218000
                ,ASSET_PRC_CTGY_CD                                      40219000
                ,AST_PRC_CTG_STS_CD                                     40220000
                ,STTLM_RSN_CD                                           40230000
                ,STTLM_RSN_STTS_CD                                      40240000
                ,ASSET_DESC_TXT                                         40250000
                ,ASSET_DESC_STTS_CD                                     40260000
                ,ASSET_RQST_QTY_CD                                      40270000
                ,ASSET_RQST_STS_CD                                      40280000
                ,AST_RQST_TRANS_CD                                      40290000
                ,AST_RQ_TRAN_STS_CD                                     40300000
                ,ASSET_QTY                                              40310000
                ,ASSET_QTY_STTS_CD                                      40320000
                ,ASSET_PCT                                              40330000
                ,ASSET_PCT_STTS_CD                                      40340000
                ,PSTN_CD                                                40350000
                ,PSTN_CD_STTS_CD                                        40360000
                ,ISO_CRNCY_CD                                           40370000
                ,ISO_CRNCY_STTS_CD                                      40380000
                ,ASSET_AMT                                              40390000
                ,ASSET_AMT_STTS_CD                                      40400000
                ,BEARER_BOND_CD                                         40410000
                ,BEARER_BND_STTS_CD                                     40420000
                ,WHI_CD                                                 40430000
                ,WHI_STTS_CD                                            40440000
                ,TRNFR_TYPE_RSN_CD                                      40450000
                ,TRN_TYP_RSN_STS_CD                                     40460000
                ,MBS_SERIAL_NBR                                         40470000
                ,MBS_SERIAL_STTS_CD                                     40480000
                ,ASSET_CMNT_TXT                                         40490000
                ,ASSET_CMNT_STTS_CD                                     40500000
                ,NSCC_WTHLD_CD                                          40510000
                ,TRANS_RFRN_ID_CD                                       40520000
                ,TRANS_RFRN_STTS_CD                                     40530000
                ,ISIN_SEC_IS_STS_CD                                     40540000
                ,ISIN_SEC_CD_STS_CD                                     40550000
                ,OPTN_CTGY_CD                                           40560000
                ,OPTN_CTGY_STTS_CD                                      40570000
                ,RCRD_LNGTH_STTS_CD                                     40580000
                ,RCRD_STTS_CD                                           40590000
                ,NSCC_PEND_CD                                           40600000
                ,NSCC_ACK_IND                                           40610000
                ,PRGM_NM                                                40620000
                ,CICS_TERM_ID_CD                                        40630000
                ,UPDT_TMSTP                                             40640000
                ,CRT_TMSTP                                              40650000
                ,SECURITY_ADP_NBR                                       40660000
                ,TRNFR_TYPE_STTS_CD                                     40670000
                ,RCV_NBR_STTS_CD                                        40680000
                ,DLVR_NBR_STTS_CD                                       40690000
                ,CAGE_TAG_NBR                                           40700000
                ,SCRTY_866_NBR                                          40710000
                ,ASSET_866_QTY                                          40720000
                ,CICS_SGNON_ID                                          40730000
                ,CICS_NET_NM                                            40740000
                ,TPSCRT_USR_ID                                          40750000
                ,TPSCRT_USR_NM )                                        40760000
                  VALUES                                                40770000
              ( :DCLACTIAST.CLIENT-NBR                                  40780000
               ,:DCLACTIAST.DLVR-NBR                                    40790000
               ,:DCLACTIAST.ACCT-DLVR-NBR                               40800000
               ,:DCLACTIAST.RCV-NBR                                     40810000
               ,:DCLACTIAST.ACCT-RCV-NBR                                40820000
               ,:DCLACTIAST.TRNFR-TYPE-CD                               40830000
               ,:DCLACTIAST.ISIN-CNTRY-CD                               40840000
               ,:DCLACTIAST.ISIN-SEC-ISSUE-CD                           40850000
               ,:DCLACTIAST.ISIN-SEC-CDG-CD                             40860000
               ,:DCLACTIAST.STTLM-LCTN-CD                               40870000
               ,:DCLACTIAST.CSH-MGN-SHRT-CD                             40880000
               ,:DCLACTIAST.CSH-MRG-SHT-STS-CD                          40890000
               ,:DCLACTIAST.STTLM-LCTN-STTS-CD                          40900000
               ,:DCLACTIAST.ISIN-CNTRY-STTS-CD                          40910000
               ,:DCLACTIAST.SBMTG-PRTCP-NBR                             40920000
               ,:DCLACTIAST.SBMT-PRT-NR-STS-CD                          40930000
               ,:DCLACTIAST.ACAT-CONTROL-NBR                            40940000
               ,:DCLACTIAST.CONTROL-NBR-STS-CD                          40950000
               ,:DCLACTIAST.ASSET-SEQ-NBR                               40960000
               ,:DCLACTIAST.AST-SEQ-NBR-STS-CD                          40970000
               ,:DCLACTIAST.TRANS-TYPE-CD                               40980000
               ,:DCLACTIAST.TRANS-TYPE-STTS-CD                          40990000
               ,:DCLACTIAST.PHSCL-SEQ-NBR                               41000000
               ,:DCLACTIAST.PHSCL-SEQ-STTS-CD                           41010000
               ,:DCLACTIAST.LGCL-SEQ-NBR                                41020000
               ,:DCLACTIAST.LGCL-SEQ-NR-STS-CD                          41030000
               ,:DCLACTIAST.ASSET-PRC-CTGY-CD                           41040000
               ,:DCLACTIAST.AST-PRC-CTG-STS-CD                          41050000
               ,:DCLACTIAST.STTLM-RSN-CD                                41060000
               ,:DCLACTIAST.STTLM-RSN-STTS-CD                           41070000
               ,:DCLACTIAST.ASSET-DESC-TXT                              41080000
               ,:DCLACTIAST.ASSET-DESC-STTS-CD                          41090000
               ,:DCLACTIAST.ASSET-RQST-QTY-CD                           41100000
               ,:DCLACTIAST.ASSET-RQST-STS-CD                           41110000
               ,:DCLACTIAST.AST-RQST-TRANS-CD                           41120000
               ,:DCLACTIAST.AST-RQ-TRAN-STS-CD                          41130000
               ,:DCLACTIAST.ASSET-QTY                                   41140000
               ,:DCLACTIAST.ASSET-QTY-STTS-CD                           41150000
               ,:DCLACTIAST.ASSET-PCT                                   41160000
               ,:DCLACTIAST.ASSET-PCT-STTS-CD                           41170000
               ,:DCLACTIAST.PSTN-CD                                     41180000
               ,:DCLACTIAST.PSTN-CD-STTS-CD                             41190000
               ,:DCLACTIAST.ISO-CRNCY-CD                                41200000
               ,:DCLACTIAST.ISO-CRNCY-STTS-CD                           41210000
               ,:DCLACTIAST.ASSET-AMT                                   41220000
               ,:DCLACTIAST.ASSET-AMT-STTS-CD                           41230000
               ,:DCLACTIAST.BEARER-BOND-CD                              41240000
               ,:DCLACTIAST.BEARER-BND-STTS-CD                          41250000
               ,:DCLACTIAST.WHI-CD                                      41260000
               ,:DCLACTIAST.WHI-STTS-CD                                 41270000
               ,:DCLACTIAST.TRNFR-TYPE-RSN-CD                           41280000
               ,:DCLACTIAST.TRN-TYP-RSN-STS-CD                          41290000
               ,:DCLACTIAST.MBS-SERIAL-NBR                              41300000
               ,:DCLACTIAST.MBS-SERIAL-STTS-CD                          41310000
               ,:DCLACTIAST.ASSET-CMNT-TXT                              41320000
               ,:DCLACTIAST.ASSET-CMNT-STTS-CD                          41330000
               ,:DCLACTIAST.NSCC-WTHLD-CD                               41340000
               ,:DCLACTIAST.TRANS-RFRN-ID-CD                            41350000
               ,:DCLACTIAST.TRANS-RFRN-STTS-CD                          41360000
               ,:DCLACTIAST.ISIN-SEC-IS-STS-CD                          41370000
               ,:DCLACTIAST.ISIN-SEC-CD-STS-CD                          41380000
               ,:DCLACTIAST.OPTN-CTGY-CD                                41390000
               ,:DCLACTIAST.OPTN-CTGY-STTS-CD                           41400000
               ,:DCLACTIAST.RCRD-LNGTH-STTS-CD                          41410000
               ,:DCLACTIAST.RCRD-STTS-CD                                41420000
               ,:DCLACTIAST.NSCC-PEND-CD                                41430000
               ,:DCLACTIAST.NSCC-ACK-IND                                41440000
               ,:DCLACTIAST.PRGM-NM                                     41450000
               ,:DCLACTIAST.CICS-TERM-ID-CD                             41460000
               ,:DCLACTIAST.UPDT-TMSTP                                  41470000
               ,:DCLACTIAST.CRT-TMSTP                                   41480000
               ,:DCLACTIAST.SECURITY-ADP-NBR                            41490000
               ,:DCLACTIAST.TRNFR-TYPE-STTS-CD                          41500000
               ,:DCLACTIAST.RCV-NBR-STTS-CD                             41510000
               ,:DCLACTIAST.DLVR-NBR-STTS-CD                            41520000
               ,:DCLACTIAST.CAGE-TAG-NBR                                41530000
               ,:DCLACTIAST.SCRTY-866-NBR                               41540000
               ,:DCLACTIAST.ASSET-866-QTY                               41550000
               ,:DCLACTIAST.CICS-SGNON-ID                               41560000
               ,:DCLACTIAST.CICS-NET-NM                                 41570000
               ,:DCLACTIAST.TPSCRT-USR-ID                               41580000
               ,:DCLACTIAST.TPSCRT-USR-NM )                             41590000
           END-EXEC.                                                    41600000
LRM005 2500-DLT-DLTED-CASH-AUDIT-ROW.                                   41610000
           MOVE SV-CLIENT-NBR     TO WS-DLTE-CLIENT-NBR                 41620000
           MOVE 'D' TO WS-DLTE-CLIENT-NBR (1 : 1)                       41630000
           IF STTLM-LCTN-CD OF DCLACTIAST = '40'                        41640000
             EXEC SQL                                                   41650000
                DELETE                                                  41660000
                FROM ACTIAST                                            41670000
                WHERE (CLIENT_NBR       = :WS-DLTE-CLIENT-NBR           41680000
                  AND  ACAT_CONTROL_NBR = :DCLACTIAST.ACAT-CONTROL-NBR  41690000
                  AND  DLVR_NBR         = :DCLACTIAST.DLVR-NBR          41700000
                  AND  RCV_NBR          = :DCLACTIAST.RCV-NBR           41710000
                  AND  ACCT_DLVR_NBR    = :DCLACTIAST.ACCT-DLVR-NBR     41720000
                  AND  ACCT_RCV_NBR     = :DCLACTIAST.ACCT-RCV-NBR      41730000
                  AND  STTLM_LCTN_CD    = :DCLACTIAST.STTLM-LCTN-CD     41740000
                  AND  CSH_MGN_SHRT_CD  = :DCLACTIAST.CSH-MGN-SHRT-CD)  41750000
             END-EXEC                                                   41760000
           ELSE                                                         41770000
             EXEC SQL                                                   41780000
                DELETE                                                  41790000
                FROM ACTIAST                                            41800000
                WHERE (CLIENT_NBR       = :WS-DLTE-CLIENT-NBR           41810000
                  AND  ACAT_CONTROL_NBR = :DCLACTIAST.ACAT-CONTROL-NBR  41820000
                  AND  DLVR_NBR         = :DCLACTIAST.DLVR-NBR          41830000
                  AND  RCV_NBR          = :DCLACTIAST.RCV-NBR           41840000
                  AND  ACCT_DLVR_NBR    = :DCLACTIAST.ACCT-DLVR-NBR     41850000
                  AND  ACCT_RCV_NBR     = :DCLACTIAST.ACCT-RCV-NBR      41860000
                  AND  STTLM_LCTN_CD    = :DCLACTIAST.STTLM-LCTN-CD     41870000
                  AND  STTLM_RSN_CD     = :DCLACTIAST.STTLM-RSN-CD)     41880000
             END-EXEC                                                   41890000
           END-IF.                                                      41900000
      /                                                                 41910000
                                                                        41920000
LRM005 2600-CRE-DLTED-SMA-AUDIT-ROW.                                    41930000
           EXEC SQL                                                     41940000
                SET :WS-TIMESTAMP = CURRENT TIMESTAMP                   41950000
           END-EXEC.                                                    41960000
           EXEC SQL                                                     41970000
              SELECT                                                    41980000
                 CLIENT_NBR                                             41990000
                ,DLVR_NBR                                               42000000
                ,ACCT_DLVR_NBR                                          42000100
                ,RCV_NBR                                                42000200
                ,ACCT_RCV_NBR                                           42000300
                ,TRNFR_TYPE_CD                                          42000400
                ,ISIN_CNTRY_CD                                          42000500
                ,ISIN_SEC_ISSUE_CD                                      42000600
                ,ISIN_SEC_CDG_CD                                        42000700
                ,STTLM_LCTN_CD                                          42000800
                ,CSH_MGN_SHRT_CD                                        42000900
                ,CSH_MRG_SHT_STS_CD                                     42001000
                ,STTLM_LCTN_STTS_CD                                     42001100
                ,ISIN_CNTRY_STTS_CD                                     42001200
                ,SBMTG_PRTCP_NBR                                        42001300
                ,SBMT_PRT_NR_STS_CD                                     42001400
                ,ACAT_CONTROL_NBR                                       42001500
                ,CONTROL_NBR_STS_CD                                     42001600
                ,ASSET_SEQ_NBR                                          42001700
                ,AST_SEQ_NBR_STS_CD                                     42001800
                ,TRANS_TYPE_CD                                          42001900
                ,TRANS_TYPE_STTS_CD                                     42002000
                ,PHSCL_SEQ_NBR                                          42003000
                ,PHSCL_SEQ_STTS_CD                                      42004000
                ,LGCL_SEQ_NBR                                           42005000
                ,LGCL_SEQ_NR_STS_CD                                     42006000
                ,ASSET_PRC_CTGY_CD                                      42007000
                ,AST_PRC_CTG_STS_CD                                     42008000
                ,STTLM_RSN_CD                                           42009000
                ,STTLM_RSN_STTS_CD                                      42010000
                ,ASSET_DESC_TXT                                         42020000
                ,ASSET_DESC_STTS_CD                                     42030000
                ,ASSET_RQST_QTY_CD                                      42040000
                ,ASSET_RQST_STS_CD                                      42050000
                ,AST_RQST_TRANS_CD                                      42060000
                ,AST_RQ_TRAN_STS_CD                                     42070000
                ,ASSET_QTY                                              42080000
                ,ASSET_QTY_STTS_CD                                      42090000
                ,ASSET_PCT                                              42100000
                ,ASSET_PCT_STTS_CD                                      42110000
                ,PSTN_CD                                                42120000
                ,PSTN_CD_STTS_CD                                        42130000
                ,ISO_CRNCY_CD                                           42140000
                ,ISO_CRNCY_STTS_CD                                      42150000
                ,ASSET_AMT                                              42160000
                ,ASSET_AMT_STTS_CD                                      42170000
                ,BEARER_BOND_CD                                         42180000
                ,BEARER_BND_STTS_CD                                     42190000
                ,WHI_CD                                                 42200000
                ,WHI_STTS_CD                                            42210000
                ,TRNFR_TYPE_RSN_CD                                      42220000
                ,TRN_TYP_RSN_STS_CD                                     42230000
                ,MBS_SERIAL_NBR                                         42240000
                ,MBS_SERIAL_STTS_CD                                     42250000
                ,ASSET_CMNT_TXT                                         42260000
                ,ASSET_CMNT_STTS_CD                                     42270000
                ,NSCC_WTHLD_CD                                          42280000
                ,TRANS_RFRN_ID_CD                                       42290000
                ,TRANS_RFRN_STTS_CD                                     42300000
                ,ISIN_SEC_IS_STS_CD                                     42310000
                ,ISIN_SEC_CD_STS_CD                                     42320000
                ,OPTN_CTGY_CD                                           42330000
                ,OPTN_CTGY_STTS_CD                                      42340000
                ,RCRD_LNGTH_STTS_CD                                     42350000
                ,RCRD_STTS_CD                                           42360000
                ,NSCC_PEND_CD                                           42370000
                ,NSCC_ACK_IND                                           42380000
                ,PRGM_NM                                                42390000
                ,CICS_TERM_ID_CD                                        42400000
                ,UPDT_TMSTP                                             42410000
                ,CRT_TMSTP                                              42420000
                ,SECURITY_ADP_NBR                                       42430000
                ,TRNFR_TYPE_STTS_CD                                     42440000
                ,RCV_NBR_STTS_CD                                        42450000
                ,DLVR_NBR_STTS_CD                                       42460000
                ,CAGE_TAG_NBR                                           42470000
                ,SCRTY_866_NBR                                          42480000
                ,ASSET_866_QTY                                          42490000
                ,CICS_SGNON_ID                                          42500000
                ,CICS_NET_NM                                            42510000
                ,TPSCRT_USR_ID                                          42520000
                ,TPSCRT_USR_NM                                          42530000
              INTO                                                      42540000
                :DCLACTIAST.CLIENT-NBR                                  42550000
               ,:DCLACTIAST.DLVR-NBR                                    42560000
               ,:DCLACTIAST.ACCT-DLVR-NBR                               42570000
               ,:DCLACTIAST.RCV-NBR                                     42580000
               ,:DCLACTIAST.ACCT-RCV-NBR                                42590000
               ,:DCLACTIAST.TRNFR-TYPE-CD                               42600000
               ,:DCLACTIAST.ISIN-CNTRY-CD                               42610000
               ,:DCLACTIAST.ISIN-SEC-ISSUE-CD                           42620000
               ,:DCLACTIAST.ISIN-SEC-CDG-CD                             42630000
               ,:DCLACTIAST.STTLM-LCTN-CD                               42640000
               ,:DCLACTIAST.CSH-MGN-SHRT-CD                             42650000
               ,:DCLACTIAST.CSH-MRG-SHT-STS-CD                          42660000
               ,:DCLACTIAST.STTLM-LCTN-STTS-CD                          42670000
               ,:DCLACTIAST.ISIN-CNTRY-STTS-CD                          42680000
               ,:DCLACTIAST.SBMTG-PRTCP-NBR                             42690000
               ,:DCLACTIAST.SBMT-PRT-NR-STS-CD                          42700000
               ,:DCLACTIAST.ACAT-CONTROL-NBR                            42710000
               ,:DCLACTIAST.CONTROL-NBR-STS-CD                          42720000
               ,:DCLACTIAST.ASSET-SEQ-NBR                               42730000
               ,:DCLACTIAST.AST-SEQ-NBR-STS-CD                          42740000
               ,:DCLACTIAST.TRANS-TYPE-CD                               42750000
               ,:DCLACTIAST.TRANS-TYPE-STTS-CD                          42760000
               ,:DCLACTIAST.PHSCL-SEQ-NBR                               42770000
               ,:DCLACTIAST.PHSCL-SEQ-STTS-CD                           42780000
               ,:DCLACTIAST.LGCL-SEQ-NBR                                42790000
               ,:DCLACTIAST.LGCL-SEQ-NR-STS-CD                          42800000
               ,:DCLACTIAST.ASSET-PRC-CTGY-CD                           42810000
               ,:DCLACTIAST.AST-PRC-CTG-STS-CD                          42820000
               ,:DCLACTIAST.STTLM-RSN-CD                                42830000
               ,:DCLACTIAST.STTLM-RSN-STTS-CD                           42840000
               ,:DCLACTIAST.ASSET-DESC-TXT                              42850000
               ,:DCLACTIAST.ASSET-DESC-STTS-CD                          42860000
               ,:DCLACTIAST.ASSET-RQST-QTY-CD                           42870000
               ,:DCLACTIAST.ASSET-RQST-STS-CD                           42880000
               ,:DCLACTIAST.AST-RQST-TRANS-CD                           42890000
               ,:DCLACTIAST.AST-RQ-TRAN-STS-CD                          42900000
               ,:DCLACTIAST.ASSET-QTY                                   42910000
               ,:DCLACTIAST.ASSET-QTY-STTS-CD                           42920000
               ,:DCLACTIAST.ASSET-PCT                                   42930000
               ,:DCLACTIAST.ASSET-PCT-STTS-CD                           42940000
               ,:DCLACTIAST.PSTN-CD                                     42950000
               ,:DCLACTIAST.PSTN-CD-STTS-CD                             42960000
               ,:DCLACTIAST.ISO-CRNCY-CD                                42970000
               ,:DCLACTIAST.ISO-CRNCY-STTS-CD                           42980000
               ,:DCLACTIAST.ASSET-AMT                                   42990000
               ,:DCLACTIAST.ASSET-AMT-STTS-CD                           43000000
               ,:DCLACTIAST.BEARER-BOND-CD                              43010000
               ,:DCLACTIAST.BEARER-BND-STTS-CD                          43020000
               ,:DCLACTIAST.WHI-CD                                      43030000
               ,:DCLACTIAST.WHI-STTS-CD                                 43040000
               ,:DCLACTIAST.TRNFR-TYPE-RSN-CD                           43050000
               ,:DCLACTIAST.TRN-TYP-RSN-STS-CD                          43060000
               ,:DCLACTIAST.MBS-SERIAL-NBR                              43070000
               ,:DCLACTIAST.MBS-SERIAL-STTS-CD                          43080000
               ,:DCLACTIAST.ASSET-CMNT-TXT                              43090000
               ,:DCLACTIAST.ASSET-CMNT-STTS-CD                          43100000
               ,:DCLACTIAST.NSCC-WTHLD-CD                               43110000
               ,:DCLACTIAST.TRANS-RFRN-ID-CD                            43120000
               ,:DCLACTIAST.TRANS-RFRN-STTS-CD                          43130000
               ,:DCLACTIAST.ISIN-SEC-IS-STS-CD                          43140000
               ,:DCLACTIAST.ISIN-SEC-CD-STS-CD                          43150000
               ,:DCLACTIAST.OPTN-CTGY-CD                                43160000
               ,:DCLACTIAST.OPTN-CTGY-STTS-CD                           43170000
               ,:DCLACTIAST.RCRD-LNGTH-STTS-CD                          43180000
               ,:DCLACTIAST.RCRD-STTS-CD                                43190000
               ,:DCLACTIAST.NSCC-PEND-CD                                43200000
               ,:DCLACTIAST.NSCC-ACK-IND                                43210000
               ,:DCLACTIAST.PRGM-NM                                     43220000
               ,:DCLACTIAST.CICS-TERM-ID-CD                             43230000
               ,:DCLACTIAST.UPDT-TMSTP                                  43240000
               ,:DCLACTIAST.CRT-TMSTP                                   43250000
               ,:DCLACTIAST.SECURITY-ADP-NBR                            43260000
               ,:DCLACTIAST.TRNFR-TYPE-STTS-CD                          43270000
               ,:DCLACTIAST.RCV-NBR-STTS-CD                             43280000
               ,:DCLACTIAST.DLVR-NBR-STTS-CD                            43290000
               ,:DCLACTIAST.CAGE-TAG-NBR                                43300000
               ,:DCLACTIAST.SCRTY-866-NBR                               43310000
               ,:DCLACTIAST.ASSET-866-QTY                               43320000
               ,:DCLACTIAST.CICS-SGNON-ID                               43330000
               ,:DCLACTIAST.CICS-NET-NM                                 43340000
               ,:DCLACTIAST.TPSCRT-USR-ID                               43350000
               ,:DCLACTIAST.TPSCRT-USR-NM                               43360000
             FROM ACTIAST                                               43370000
             WHERE (CLIENT_NBR          = :WS-DLTE-CLIENT-NBR           43380000
                AND DLVR_NBR            = :WS-DLTE-DLVR-NBR             43390000
                AND RCV_NBR             = :WS-DLTE-RCV-NBR              43400000
                AND ACCT_DLVR_NBR       = :WS-DLTE-ACCT-DLVR-NBR        43410000
                AND ACCT_RCV_NBR        = :WS-DLTE-ACCT-RCV-NBR         43420000
                AND ISIN_SEC_ISSUE_CD   = :WS-DLTE-ISIN                 43430000
                AND ACAT_CONTROL_NBR    = :WS-DLTE-ACAT-CNTL-NBR        43440000
                AND STTLM_LCTN_CD       = :WS-DLTE-SLOC                 43450000
                AND STTLM_RSN_CD        = :WS-DLTE-STTLM-RSN-CD)        43460000
           END-EXEC.                                                    43470000
                                                                        43480000
           IF SQLCODE = +0                                              43490000
              MOVE 'D' TO WS-DLTE-CLIENT-NBR (1 : 1)                    43500000
                          TRANS-TYPE-CD OF DCLACTIAST                   43510000
              MOVE WS-DLTE-CLIENT-NBR TO CLIENT-NBR    OF DCLACTIAST    43520000
              MOVE ACAT10IO-NET-NAME  TO CICS-NET-NM   OF DCLACTIAST    43530000
              MOVE ACAT10IO-USER-ID   TO TPSCRT-USR-ID OF DCLACTIAST    43540000
              MOVE ACAT10IO-USER-NAME TO TPSCRT-USR-NM OF DCLACTIAST    43550000
              MOVE 'ACAT10DC'         TO  PRGM-NM      OF DCLACTIAST    43560000
              MOVE ACAT10IO-SIGN-ON-ID TO CICS-SGNON-ID OF DCLACTIAST   43570000
              MOVE  EIBTRMID          TO  CICS-TERM-ID-CD OF DCLACTIAST 43580000
              MOVE WS-TIMESTAMP TO UPDT-TMSTP OF DCLACTIAST             43590000
              EXEC SQL                                                  43600000
              INSERT INTO ACTIAST                                       43610000
               ( CLIENT_NBR                                             43620000
                ,DLVR_NBR                                               43630000
                ,ACCT_DLVR_NBR                                          43640000
                ,RCV_NBR                                                43650000
                ,ACCT_RCV_NBR                                           43660000
                ,TRNFR_TYPE_CD                                          43670000
                ,ISIN_CNTRY_CD                                          43680000
                ,ISIN_SEC_ISSUE_CD                                      43690000
                ,ISIN_SEC_CDG_CD                                        43700000
                ,STTLM_LCTN_CD                                          43710000
                ,CSH_MGN_SHRT_CD                                        43720000
                ,CSH_MRG_SHT_STS_CD                                     43730000
                ,STTLM_LCTN_STTS_CD                                     43740000
                ,ISIN_CNTRY_STTS_CD                                     43750000
                ,SBMTG_PRTCP_NBR                                        43760000
                ,SBMT_PRT_NR_STS_CD                                     43770000
                ,ACAT_CONTROL_NBR                                       43780000
                ,CONTROL_NBR_STS_CD                                     43790000
                ,ASSET_SEQ_NBR                                          43800000
                ,AST_SEQ_NBR_STS_CD                                     43810000
                ,TRANS_TYPE_CD                                          43820000
                ,TRANS_TYPE_STTS_CD                                     43830000
                ,PHSCL_SEQ_NBR                                          43840000
                ,PHSCL_SEQ_STTS_CD                                      43850000
                ,LGCL_SEQ_NBR                                           43860000
                ,LGCL_SEQ_NR_STS_CD                                     43870000
                ,ASSET_PRC_CTGY_CD                                      43880000
                ,AST_PRC_CTG_STS_CD                                     43890000
                ,STTLM_RSN_CD                                           43900000
                ,STTLM_RSN_STTS_CD                                      43910000
                ,ASSET_DESC_TXT                                         43920000
                ,ASSET_DESC_STTS_CD                                     43930000
                ,ASSET_RQST_QTY_CD                                      43940000
                ,ASSET_RQST_STS_CD                                      43950000
                ,AST_RQST_TRANS_CD                                      43960000
                ,AST_RQ_TRAN_STS_CD                                     43970000
                ,ASSET_QTY                                              43980000
                ,ASSET_QTY_STTS_CD                                      43990000
                ,ASSET_PCT                                              44000000
                ,ASSET_PCT_STTS_CD                                      44010000
                ,PSTN_CD                                                44020000
                ,PSTN_CD_STTS_CD                                        44030000
                ,ISO_CRNCY_CD                                           44040000
                ,ISO_CRNCY_STTS_CD                                      44050000
                ,ASSET_AMT                                              44060000
                ,ASSET_AMT_STTS_CD                                      44070000
                ,BEARER_BOND_CD                                         44080000
                ,BEARER_BND_STTS_CD                                     44090000
                ,WHI_CD                                                 44100000
                ,WHI_STTS_CD                                            44110000
                ,TRNFR_TYPE_RSN_CD                                      44120000
                ,TRN_TYP_RSN_STS_CD                                     44130000
                ,MBS_SERIAL_NBR                                         44140000
                ,MBS_SERIAL_STTS_CD                                     44150000
                ,ASSET_CMNT_TXT                                         44160000
                ,ASSET_CMNT_STTS_CD                                     44170000
                ,NSCC_WTHLD_CD                                          44180000
                ,TRANS_RFRN_ID_CD                                       44190000
                ,TRANS_RFRN_STTS_CD                                     44200000
                ,ISIN_SEC_IS_STS_CD                                     44210000
                ,ISIN_SEC_CD_STS_CD                                     44220000
                ,OPTN_CTGY_CD                                           44230000
                ,OPTN_CTGY_STTS_CD                                      44240000
                ,RCRD_LNGTH_STTS_CD                                     44250000
                ,RCRD_STTS_CD                                           44260000
                ,NSCC_PEND_CD                                           44270000
                ,NSCC_ACK_IND                                           44280000
                ,PRGM_NM                                                44290000
                ,CICS_TERM_ID_CD                                        44300000
                ,UPDT_TMSTP                                             44310000
                ,CRT_TMSTP                                              44320000
                ,SECURITY_ADP_NBR                                       44330000
                ,TRNFR_TYPE_STTS_CD                                     44340000
                ,RCV_NBR_STTS_CD                                        44350000
                ,DLVR_NBR_STTS_CD                                       44360000
                ,CAGE_TAG_NBR                                           44370000
                ,SCRTY_866_NBR                                          44380000
                ,ASSET_866_QTY                                          44390000
                ,CICS_SGNON_ID                                          44400000
                ,CICS_NET_NM                                            44410000
                ,TPSCRT_USR_ID                                          44420000
                ,TPSCRT_USR_NM )                                        44430000
                  VALUES                                                44440000
              ( :DCLACTIAST.CLIENT-NBR                                  44450000
               ,:DCLACTIAST.DLVR-NBR                                    44460000
               ,:DCLACTIAST.ACCT-DLVR-NBR                               44470000
               ,:DCLACTIAST.RCV-NBR                                     44480000
               ,:DCLACTIAST.ACCT-RCV-NBR                                44490000
               ,:DCLACTIAST.TRNFR-TYPE-CD                               44500000
               ,:DCLACTIAST.ISIN-CNTRY-CD                               44510000
               ,:DCLACTIAST.ISIN-SEC-ISSUE-CD                           44520000
               ,:DCLACTIAST.ISIN-SEC-CDG-CD                             44530000
               ,:DCLACTIAST.STTLM-LCTN-CD                               44540000
               ,:DCLACTIAST.CSH-MGN-SHRT-CD                             44550000
               ,:DCLACTIAST.CSH-MRG-SHT-STS-CD                          44560000
               ,:DCLACTIAST.STTLM-LCTN-STTS-CD                          44570000
               ,:DCLACTIAST.ISIN-CNTRY-STTS-CD                          44580000
               ,:DCLACTIAST.SBMTG-PRTCP-NBR                             44590000
               ,:DCLACTIAST.SBMT-PRT-NR-STS-CD                          44600000
               ,:DCLACTIAST.ACAT-CONTROL-NBR                            44610000
               ,:DCLACTIAST.CONTROL-NBR-STS-CD                          44620000
               ,:DCLACTIAST.ASSET-SEQ-NBR                               44630000
               ,:DCLACTIAST.AST-SEQ-NBR-STS-CD                          44640000
               ,:DCLACTIAST.TRANS-TYPE-CD                               44650000
               ,:DCLACTIAST.TRANS-TYPE-STTS-CD                          44660000
               ,:DCLACTIAST.PHSCL-SEQ-NBR                               44670000
               ,:DCLACTIAST.PHSCL-SEQ-STTS-CD                           44680000
               ,:DCLACTIAST.LGCL-SEQ-NBR                                44690000
               ,:DCLACTIAST.LGCL-SEQ-NR-STS-CD                          44700000
               ,:DCLACTIAST.ASSET-PRC-CTGY-CD                           44710000
               ,:DCLACTIAST.AST-PRC-CTG-STS-CD                          44720000
               ,:DCLACTIAST.STTLM-RSN-CD                                44730000
               ,:DCLACTIAST.STTLM-RSN-STTS-CD                           44740000
               ,:DCLACTIAST.ASSET-DESC-TXT                              44750000
               ,:DCLACTIAST.ASSET-DESC-STTS-CD                          44760000
               ,:DCLACTIAST.ASSET-RQST-QTY-CD                           44770000
               ,:DCLACTIAST.ASSET-RQST-STS-CD                           44780000
               ,:DCLACTIAST.AST-RQST-TRANS-CD                           44790000
               ,:DCLACTIAST.AST-RQ-TRAN-STS-CD                          44800000
               ,:DCLACTIAST.ASSET-QTY                                   44810000
               ,:DCLACTIAST.ASSET-QTY-STTS-CD                           44820000
               ,:DCLACTIAST.ASSET-PCT                                   44830000
               ,:DCLACTIAST.ASSET-PCT-STTS-CD                           44840000
               ,:DCLACTIAST.PSTN-CD                                     44850000
               ,:DCLACTIAST.PSTN-CD-STTS-CD                             44860000
               ,:DCLACTIAST.ISO-CRNCY-CD                                44870000
               ,:DCLACTIAST.ISO-CRNCY-STTS-CD                           44880000
               ,:DCLACTIAST.ASSET-AMT                                   44890000
               ,:DCLACTIAST.ASSET-AMT-STTS-CD                           44900000
               ,:DCLACTIAST.BEARER-BOND-CD                              44910000
               ,:DCLACTIAST.BEARER-BND-STTS-CD                          44920000
               ,:DCLACTIAST.WHI-CD                                      44930000
               ,:DCLACTIAST.WHI-STTS-CD                                 44940000
               ,:DCLACTIAST.TRNFR-TYPE-RSN-CD                           44950000
               ,:DCLACTIAST.TRN-TYP-RSN-STS-CD                          44960000
               ,:DCLACTIAST.MBS-SERIAL-NBR                              44970000
               ,:DCLACTIAST.MBS-SERIAL-STTS-CD                          44980000
               ,:DCLACTIAST.ASSET-CMNT-TXT                              44990000
               ,:DCLACTIAST.ASSET-CMNT-STTS-CD                          45000000
               ,:DCLACTIAST.NSCC-WTHLD-CD                               45010000
               ,:DCLACTIAST.TRANS-RFRN-ID-CD                            45020000
               ,:DCLACTIAST.TRANS-RFRN-STTS-CD                          45030000
               ,:DCLACTIAST.ISIN-SEC-IS-STS-CD                          45040000
               ,:DCLACTIAST.ISIN-SEC-CD-STS-CD                          45050000
               ,:DCLACTIAST.OPTN-CTGY-CD                                45060000
               ,:DCLACTIAST.OPTN-CTGY-STTS-CD                           45070000
               ,:DCLACTIAST.RCRD-LNGTH-STTS-CD                          45080000
               ,:DCLACTIAST.RCRD-STTS-CD                                45090000
               ,:DCLACTIAST.NSCC-PEND-CD                                45100000
               ,:DCLACTIAST.NSCC-ACK-IND                                45110000
               ,:DCLACTIAST.PRGM-NM                                     45120000
               ,:DCLACTIAST.CICS-TERM-ID-CD                             45130000
               ,:DCLACTIAST.UPDT-TMSTP                                  45140000
               ,:DCLACTIAST.CRT-TMSTP                                   45150000
               ,:DCLACTIAST.SECURITY-ADP-NBR                            45160000
               ,:DCLACTIAST.TRNFR-TYPE-STTS-CD                          45170000
               ,:DCLACTIAST.RCV-NBR-STTS-CD                             45180000
               ,:DCLACTIAST.DLVR-NBR-STTS-CD                            45190000
               ,:DCLACTIAST.CAGE-TAG-NBR                                45200000
               ,:DCLACTIAST.SCRTY-866-NBR                               45210000
               ,:DCLACTIAST.ASSET-866-QTY                               45220000
               ,:DCLACTIAST.CICS-SGNON-ID                               45230000
               ,:DCLACTIAST.CICS-NET-NM                                 45240000
               ,:DCLACTIAST.TPSCRT-USR-ID                               45250000
               ,:DCLACTIAST.TPSCRT-USR-NM )                             45260000
           END-EXEC.                                                    45270000
      /                                                                 45280000
                                                                        45290000
LRM005 2700-CRE-DLTED-SEC-AUDIT-ROW.                                    45300000
           EXEC SQL                                                     45310000
                SET :WS-TIMESTAMP = CURRENT TIMESTAMP                   45320000
           END-EXEC.                                                    45330000
           EXEC SQL                                                     45340000
              SELECT                                                    45350000
                 CLIENT_NBR                                             45360000
                ,DLVR_NBR                                               45370000
                ,ACCT_DLVR_NBR                                          45380000
                ,RCV_NBR                                                45390000
                ,ACCT_RCV_NBR                                           45400000
                ,TRNFR_TYPE_CD                                          45410000
                ,ISIN_CNTRY_CD                                          45420000
                ,ISIN_SEC_ISSUE_CD                                      45430000
                ,ISIN_SEC_CDG_CD                                        45440000
                ,STTLM_LCTN_CD                                          45450000
                ,CSH_MGN_SHRT_CD                                        45460000
                ,CSH_MRG_SHT_STS_CD                                     45470000
                ,STTLM_LCTN_STTS_CD                                     45480000
                ,ISIN_CNTRY_STTS_CD                                     45490000
                ,SBMTG_PRTCP_NBR                                        45491000
                ,SBMT_PRT_NR_STS_CD                                     45492000
                ,ACAT_CONTROL_NBR                                       45493000
                ,CONTROL_NBR_STS_CD                                     45494000
                ,ASSET_SEQ_NBR                                          45495000
                ,AST_SEQ_NBR_STS_CD                                     45496000
                ,TRANS_TYPE_CD                                          45497000
                ,TRANS_TYPE_STTS_CD                                     45498000
                ,PHSCL_SEQ_NBR                                          45499000
                ,PHSCL_SEQ_STTS_CD                                      45500000
                ,LGCL_SEQ_NBR                                           45510000
                ,LGCL_SEQ_NR_STS_CD                                     45520000
                ,ASSET_PRC_CTGY_CD                                      45530000
                ,AST_PRC_CTG_STS_CD                                     45540000
                ,STTLM_RSN_CD                                           45550000
                ,STTLM_RSN_STTS_CD                                      45560000
                ,ASSET_DESC_TXT                                         45570000
                ,ASSET_DESC_STTS_CD                                     45580000
                ,ASSET_RQST_QTY_CD                                      45590000
                ,ASSET_RQST_STS_CD                                      45600000
                ,AST_RQST_TRANS_CD                                      45610000
                ,AST_RQ_TRAN_STS_CD                                     45620000
                ,ASSET_QTY                                              45630000
                ,ASSET_QTY_STTS_CD                                      45640000
                ,ASSET_PCT                                              45650000
                ,ASSET_PCT_STTS_CD                                      45660000
                ,PSTN_CD                                                45670000
                ,PSTN_CD_STTS_CD                                        45680000
                ,ISO_CRNCY_CD                                           45690000
                ,ISO_CRNCY_STTS_CD                                      45700000
                ,ASSET_AMT                                              45710000
                ,ASSET_AMT_STTS_CD                                      45720000
                ,BEARER_BOND_CD                                         45730000
                ,BEARER_BND_STTS_CD                                     45740000
                ,WHI_CD                                                 45750000
                ,WHI_STTS_CD                                            45760000
                ,TRNFR_TYPE_RSN_CD                                      45770000
                ,TRN_TYP_RSN_STS_CD                                     45780000
                ,MBS_SERIAL_NBR                                         45790000
                ,MBS_SERIAL_STTS_CD                                     45800000
                ,ASSET_CMNT_TXT                                         45810000
                ,ASSET_CMNT_STTS_CD                                     45820000
                ,NSCC_WTHLD_CD                                          45830000
                ,TRANS_RFRN_ID_CD                                       45840000
                ,TRANS_RFRN_STTS_CD                                     45850000
                ,ISIN_SEC_IS_STS_CD                                     45860000
                ,ISIN_SEC_CD_STS_CD                                     45870000
                ,OPTN_CTGY_CD                                           45880000
                ,OPTN_CTGY_STTS_CD                                      45890000
                ,RCRD_LNGTH_STTS_CD                                     45900000
                ,RCRD_STTS_CD                                           45910000
                ,NSCC_PEND_CD                                           45920000
                ,NSCC_ACK_IND                                           45930000
                ,PRGM_NM                                                45940000
                ,CICS_TERM_ID_CD                                        45950000
                ,UPDT_TMSTP                                             45960000
                ,CRT_TMSTP                                              45970000
                ,SECURITY_ADP_NBR                                       45980000
                ,TRNFR_TYPE_STTS_CD                                     45990000
                ,RCV_NBR_STTS_CD                                        46000000
                ,DLVR_NBR_STTS_CD                                       46010000
                ,CAGE_TAG_NBR                                           46020000
                ,SCRTY_866_NBR                                          46030000
                ,ASSET_866_QTY                                          46040000
                ,CICS_SGNON_ID                                          46050000
                ,CICS_NET_NM                                            46060000
                ,TPSCRT_USR_ID                                          46070000
                ,TPSCRT_USR_NM                                          46080000
              INTO                                                      46090000
                :DCLACTIAST.CLIENT-NBR                                  46100000
               ,:DCLACTIAST.DLVR-NBR                                    46110000
               ,:DCLACTIAST.ACCT-DLVR-NBR                               46120000
               ,:DCLACTIAST.RCV-NBR                                     46130000
               ,:DCLACTIAST.ACCT-RCV-NBR                                46140000
               ,:DCLACTIAST.TRNFR-TYPE-CD                               46150000
               ,:DCLACTIAST.ISIN-CNTRY-CD                               46160000
               ,:DCLACTIAST.ISIN-SEC-ISSUE-CD                           46170000
               ,:DCLACTIAST.ISIN-SEC-CDG-CD                             46180000
               ,:DCLACTIAST.STTLM-LCTN-CD                               46190000
               ,:DCLACTIAST.CSH-MGN-SHRT-CD                             46200000
               ,:DCLACTIAST.CSH-MRG-SHT-STS-CD                          46210000
               ,:DCLACTIAST.STTLM-LCTN-STTS-CD                          46220000
               ,:DCLACTIAST.ISIN-CNTRY-STTS-CD                          46230000
               ,:DCLACTIAST.SBMTG-PRTCP-NBR                             46240000
               ,:DCLACTIAST.SBMT-PRT-NR-STS-CD                          46250000
               ,:DCLACTIAST.ACAT-CONTROL-NBR                            46260000
               ,:DCLACTIAST.CONTROL-NBR-STS-CD                          46270000
               ,:DCLACTIAST.ASSET-SEQ-NBR                               46280000
               ,:DCLACTIAST.AST-SEQ-NBR-STS-CD                          46290000
               ,:DCLACTIAST.TRANS-TYPE-CD                               46300000
               ,:DCLACTIAST.TRANS-TYPE-STTS-CD                          46310000
               ,:DCLACTIAST.PHSCL-SEQ-NBR                               46320000
               ,:DCLACTIAST.PHSCL-SEQ-STTS-CD                           46330000
               ,:DCLACTIAST.LGCL-SEQ-NBR                                46340000
               ,:DCLACTIAST.LGCL-SEQ-NR-STS-CD                          46350000
               ,:DCLACTIAST.ASSET-PRC-CTGY-CD                           46360000
               ,:DCLACTIAST.AST-PRC-CTG-STS-CD                          46370000
               ,:DCLACTIAST.STTLM-RSN-CD                                46380000
               ,:DCLACTIAST.STTLM-RSN-STTS-CD                           46390000
               ,:DCLACTIAST.ASSET-DESC-TXT                              46400000
               ,:DCLACTIAST.ASSET-DESC-STTS-CD                          46410000
               ,:DCLACTIAST.ASSET-RQST-QTY-CD                           46420000
               ,:DCLACTIAST.ASSET-RQST-STS-CD                           46430000
               ,:DCLACTIAST.AST-RQST-TRANS-CD                           46440000
               ,:DCLACTIAST.AST-RQ-TRAN-STS-CD                          46450000
               ,:DCLACTIAST.ASSET-QTY                                   46460000
               ,:DCLACTIAST.ASSET-QTY-STTS-CD                           46470000
               ,:DCLACTIAST.ASSET-PCT                                   46480000
               ,:DCLACTIAST.ASSET-PCT-STTS-CD                           46490000
               ,:DCLACTIAST.PSTN-CD                                     46500000
               ,:DCLACTIAST.PSTN-CD-STTS-CD                             46510000
               ,:DCLACTIAST.ISO-CRNCY-CD                                46520000
               ,:DCLACTIAST.ISO-CRNCY-STTS-CD                           46530000
               ,:DCLACTIAST.ASSET-AMT                                   46540000
               ,:DCLACTIAST.ASSET-AMT-STTS-CD                           46550000
               ,:DCLACTIAST.BEARER-BOND-CD                              46560000
               ,:DCLACTIAST.BEARER-BND-STTS-CD                          46570000
               ,:DCLACTIAST.WHI-CD                                      46580000
               ,:DCLACTIAST.WHI-STTS-CD                                 46590000
               ,:DCLACTIAST.TRNFR-TYPE-RSN-CD                           46600000
               ,:DCLACTIAST.TRN-TYP-RSN-STS-CD                          46610000
               ,:DCLACTIAST.MBS-SERIAL-NBR                              46620000
               ,:DCLACTIAST.MBS-SERIAL-STTS-CD                          46630000
               ,:DCLACTIAST.ASSET-CMNT-TXT                              46640000
               ,:DCLACTIAST.ASSET-CMNT-STTS-CD                          46650000
               ,:DCLACTIAST.NSCC-WTHLD-CD                               46660000
               ,:DCLACTIAST.TRANS-RFRN-ID-CD                            46670000
               ,:DCLACTIAST.TRANS-RFRN-STTS-CD                          46680000
               ,:DCLACTIAST.ISIN-SEC-IS-STS-CD                          46690000
               ,:DCLACTIAST.ISIN-SEC-CD-STS-CD                          46700000
               ,:DCLACTIAST.OPTN-CTGY-CD                                46710000
               ,:DCLACTIAST.OPTN-CTGY-STTS-CD                           46720000
               ,:DCLACTIAST.RCRD-LNGTH-STTS-CD                          46730000
               ,:DCLACTIAST.RCRD-STTS-CD                                46740000
               ,:DCLACTIAST.NSCC-PEND-CD                                46750000
               ,:DCLACTIAST.NSCC-ACK-IND                                46760000
               ,:DCLACTIAST.PRGM-NM                                     46770000
               ,:DCLACTIAST.CICS-TERM-ID-CD                             46780000
               ,:DCLACTIAST.UPDT-TMSTP                                  46790000
               ,:DCLACTIAST.CRT-TMSTP                                   46800000
               ,:DCLACTIAST.SECURITY-ADP-NBR                            46810000
               ,:DCLACTIAST.TRNFR-TYPE-STTS-CD                          46820000
               ,:DCLACTIAST.RCV-NBR-STTS-CD                             46830000
               ,:DCLACTIAST.DLVR-NBR-STTS-CD                            46840000
               ,:DCLACTIAST.CAGE-TAG-NBR                                46850000
               ,:DCLACTIAST.SCRTY-866-NBR                               46860000
               ,:DCLACTIAST.ASSET-866-QTY                               46870000
               ,:DCLACTIAST.CICS-SGNON-ID                               46880000
               ,:DCLACTIAST.CICS-NET-NM                                 46890000
               ,:DCLACTIAST.TPSCRT-USR-ID                               46900000
               ,:DCLACTIAST.TPSCRT-USR-NM                               46910000
             FROM ACTIAST                                               46920000
             WHERE (CLIENT_NBR          = :WS-DLTE-CLIENT-NBR           46930000
                AND DLVR_NBR            = :WS-DLTE-DLVR-NBR             46940000
                AND RCV_NBR             = :WS-DLTE-RCV-NBR              46950000
                AND ACCT_DLVR_NBR       = :WS-DLTE-ACCT-DLVR-NBR        46960000
                AND ACCT_RCV_NBR        = :WS-DLTE-ACCT-RCV-NBR         46970000
                AND ISIN_SEC_ISSUE_CD   = :WS-DLTE-ISIN                 46980000
                AND ACAT_CONTROL_NBR    = :WS-DLTE-ACAT-CNTL-NBR        46990000
                AND STTLM_LCTN_CD       = :WS-DLTE-SLOC                 47000000
                AND ISIN_CNTRY_CD       = :WS-DLTE-CNTRY-CD)            47010000
           END-EXEC.                                                    47020000
                                                                        47030000
           IF SQLCODE = +0                                              47040000
              MOVE 'D' TO WS-DLTE-CLIENT-NBR (1 : 1)                    47050000
                          TRANS-TYPE-CD OF DCLACTIAST                   47060000
              MOVE WS-DLTE-CLIENT-NBR TO CLIENT-NBR    OF DCLACTIAST    47070000
              MOVE ACAT10IO-NET-NAME  TO CICS-NET-NM   OF DCLACTIAST    47080000
              MOVE ACAT10IO-USER-ID   TO TPSCRT-USR-ID OF DCLACTIAST    47090000
              MOVE ACAT10IO-USER-NAME TO TPSCRT-USR-NM OF DCLACTIAST    47100000
              MOVE 'ACAT10DC'         TO  PRGM-NM      OF DCLACTIAST    47110000
              MOVE ACAT10IO-SIGN-ON-ID TO CICS-SGNON-ID OF DCLACTIAST   47120000
              MOVE  EIBTRMID          TO  CICS-TERM-ID-CD OF DCLACTIAST 47130000
              MOVE WS-TIMESTAMP TO UPDT-TMSTP OF DCLACTIAST             47140000
              EXEC SQL                                                  47150000
              INSERT INTO ACTIAST                                       47160000
               ( CLIENT_NBR                                             47170000
                ,DLVR_NBR                                               47180000
                ,ACCT_DLVR_NBR                                          47190000
                ,RCV_NBR                                                47200000
                ,ACCT_RCV_NBR                                           47210000
                ,TRNFR_TYPE_CD                                          47220000
                ,ISIN_CNTRY_CD                                          47230000
                ,ISIN_SEC_ISSUE_CD                                      47240000
                ,ISIN_SEC_CDG_CD                                        47250000
                ,STTLM_LCTN_CD                                          47260000
                ,CSH_MGN_SHRT_CD                                        47270000
                ,CSH_MRG_SHT_STS_CD                                     47280000
                ,STTLM_LCTN_STTS_CD                                     47290000
                ,ISIN_CNTRY_STTS_CD                                     47300000
                ,SBMTG_PRTCP_NBR                                        47310000
                ,SBMT_PRT_NR_STS_CD                                     47320000
                ,ACAT_CONTROL_NBR                                       47330000
                ,CONTROL_NBR_STS_CD                                     47340000
                ,ASSET_SEQ_NBR                                          47350000
                ,AST_SEQ_NBR_STS_CD                                     47360000
                ,TRANS_TYPE_CD                                          47370000
                ,TRANS_TYPE_STTS_CD                                     47380000
                ,PHSCL_SEQ_NBR                                          47390000
                ,PHSCL_SEQ_STTS_CD                                      47400000
                ,LGCL_SEQ_NBR                                           47410000
                ,LGCL_SEQ_NR_STS_CD                                     47420000
                ,ASSET_PRC_CTGY_CD                                      47430000
                ,AST_PRC_CTG_STS_CD                                     47440000
                ,STTLM_RSN_CD                                           47450000
                ,STTLM_RSN_STTS_CD                                      47460000
                ,ASSET_DESC_TXT                                         47470000
                ,ASSET_DESC_STTS_CD                                     47480000
                ,ASSET_RQST_QTY_CD                                      47490000
                ,ASSET_RQST_STS_CD                                      47500000
                ,AST_RQST_TRANS_CD                                      47510000
                ,AST_RQ_TRAN_STS_CD                                     47520000
                ,ASSET_QTY                                              47530000
                ,ASSET_QTY_STTS_CD                                      47540000
                ,ASSET_PCT                                              47550000
                ,ASSET_PCT_STTS_CD                                      47560000
                ,PSTN_CD                                                47570000
                ,PSTN_CD_STTS_CD                                        47580000
                ,ISO_CRNCY_CD                                           47590000
                ,ISO_CRNCY_STTS_CD                                      47600000
                ,ASSET_AMT                                              47610000
                ,ASSET_AMT_STTS_CD                                      47620000
                ,BEARER_BOND_CD                                         47630000
                ,BEARER_BND_STTS_CD                                     47640000
                ,WHI_CD                                                 47650000
                ,WHI_STTS_CD                                            47660000
                ,TRNFR_TYPE_RSN_CD                                      47670000
                ,TRN_TYP_RSN_STS_CD                                     47680000
                ,MBS_SERIAL_NBR                                         47690000
                ,MBS_SERIAL_STTS_CD                                     47700000
                ,ASSET_CMNT_TXT                                         47710000
                ,ASSET_CMNT_STTS_CD                                     47720000
                ,NSCC_WTHLD_CD                                          47730000
                ,TRANS_RFRN_ID_CD                                       47740000
                ,TRANS_RFRN_STTS_CD                                     47750000
                ,ISIN_SEC_IS_STS_CD                                     47760000
                ,ISIN_SEC_CD_STS_CD                                     47770000
                ,OPTN_CTGY_CD                                           47780000
                ,OPTN_CTGY_STTS_CD                                      47790000
                ,RCRD_LNGTH_STTS_CD                                     47800000
                ,RCRD_STTS_CD                                           47810000
                ,NSCC_PEND_CD                                           47820000
                ,NSCC_ACK_IND                                           47830000
                ,PRGM_NM                                                47840000
                ,CICS_TERM_ID_CD                                        47850000
                ,UPDT_TMSTP                                             47860000
                ,CRT_TMSTP                                              47870000
                ,SECURITY_ADP_NBR                                       47880000
                ,TRNFR_TYPE_STTS_CD                                     47890000
                ,RCV_NBR_STTS_CD                                        47900000
                ,DLVR_NBR_STTS_CD                                       47910000
                ,CAGE_TAG_NBR                                           47920000
                ,SCRTY_866_NBR                                          47930000
                ,ASSET_866_QTY                                          47940000
                ,CICS_SGNON_ID                                          47950000
                ,CICS_NET_NM                                            47960000
                ,TPSCRT_USR_ID                                          47970000
                ,TPSCRT_USR_NM )                                        47980000
                  VALUES                                                47990000
              ( :DCLACTIAST.CLIENT-NBR                                  48000000
               ,:DCLACTIAST.DLVR-NBR                                    48010000
               ,:DCLACTIAST.ACCT-DLVR-NBR                               48020000
               ,:DCLACTIAST.RCV-NBR                                     48030000
               ,:DCLACTIAST.ACCT-RCV-NBR                                48040000
               ,:DCLACTIAST.TRNFR-TYPE-CD                               48050000
               ,:DCLACTIAST.ISIN-CNTRY-CD                               48060000
               ,:DCLACTIAST.ISIN-SEC-ISSUE-CD                           48070000
               ,:DCLACTIAST.ISIN-SEC-CDG-CD                             48080000
               ,:DCLACTIAST.STTLM-LCTN-CD                               48090000
               ,:DCLACTIAST.CSH-MGN-SHRT-CD                             48100000
               ,:DCLACTIAST.CSH-MRG-SHT-STS-CD                          48110000
               ,:DCLACTIAST.STTLM-LCTN-STTS-CD                          48120000
               ,:DCLACTIAST.ISIN-CNTRY-STTS-CD                          48130000
               ,:DCLACTIAST.SBMTG-PRTCP-NBR                             48140000
               ,:DCLACTIAST.SBMT-PRT-NR-STS-CD                          48150000
               ,:DCLACTIAST.ACAT-CONTROL-NBR                            48160000
               ,:DCLACTIAST.CONTROL-NBR-STS-CD                          48170000
               ,:DCLACTIAST.ASSET-SEQ-NBR                               48180000
               ,:DCLACTIAST.AST-SEQ-NBR-STS-CD                          48190000
               ,:DCLACTIAST.TRANS-TYPE-CD                               48200000
               ,:DCLACTIAST.TRANS-TYPE-STTS-CD                          48210000
               ,:DCLACTIAST.PHSCL-SEQ-NBR                               48220000
               ,:DCLACTIAST.PHSCL-SEQ-STTS-CD                           48230000
               ,:DCLACTIAST.LGCL-SEQ-NBR                                48240000
               ,:DCLACTIAST.LGCL-SEQ-NR-STS-CD                          48250000
               ,:DCLACTIAST.ASSET-PRC-CTGY-CD                           48260000
               ,:DCLACTIAST.AST-PRC-CTG-STS-CD                          48270000
               ,:DCLACTIAST.STTLM-RSN-CD                                48280000
               ,:DCLACTIAST.STTLM-RSN-STTS-CD                           48290000
               ,:DCLACTIAST.ASSET-DESC-TXT                              48300000
               ,:DCLACTIAST.ASSET-DESC-STTS-CD                          48310000
               ,:DCLACTIAST.ASSET-RQST-QTY-CD                           48320000
               ,:DCLACTIAST.ASSET-RQST-STS-CD                           48330000
               ,:DCLACTIAST.AST-RQST-TRANS-CD                           48340000
               ,:DCLACTIAST.AST-RQ-TRAN-STS-CD                          48350000
               ,:DCLACTIAST.ASSET-QTY                                   48360000
               ,:DCLACTIAST.ASSET-QTY-STTS-CD                           48370000
               ,:DCLACTIAST.ASSET-PCT                                   48380000
               ,:DCLACTIAST.ASSET-PCT-STTS-CD                           48390000
               ,:DCLACTIAST.PSTN-CD                                     48400000
               ,:DCLACTIAST.PSTN-CD-STTS-CD                             48410000
               ,:DCLACTIAST.ISO-CRNCY-CD                                48420000
               ,:DCLACTIAST.ISO-CRNCY-STTS-CD                           48430000
               ,:DCLACTIAST.ASSET-AMT                                   48440000
               ,:DCLACTIAST.ASSET-AMT-STTS-CD                           48450000
               ,:DCLACTIAST.BEARER-BOND-CD                              48460000
               ,:DCLACTIAST.BEARER-BND-STTS-CD                          48470000
               ,:DCLACTIAST.WHI-CD                                      48480000
               ,:DCLACTIAST.WHI-STTS-CD                                 48490000
               ,:DCLACTIAST.TRNFR-TYPE-RSN-CD                           48500000
               ,:DCLACTIAST.TRN-TYP-RSN-STS-CD                          48510000
               ,:DCLACTIAST.MBS-SERIAL-NBR                              48520000
               ,:DCLACTIAST.MBS-SERIAL-STTS-CD                          48530000
               ,:DCLACTIAST.ASSET-CMNT-TXT                              48540000
               ,:DCLACTIAST.ASSET-CMNT-STTS-CD                          48550000
               ,:DCLACTIAST.NSCC-WTHLD-CD                               48560000
               ,:DCLACTIAST.TRANS-RFRN-ID-CD                            48570000
               ,:DCLACTIAST.TRANS-RFRN-STTS-CD                          48580000
               ,:DCLACTIAST.ISIN-SEC-IS-STS-CD                          48590000
               ,:DCLACTIAST.ISIN-SEC-CD-STS-CD                          48600000
               ,:DCLACTIAST.OPTN-CTGY-CD                                48610000
               ,:DCLACTIAST.OPTN-CTGY-STTS-CD                           48620000
               ,:DCLACTIAST.RCRD-LNGTH-STTS-CD                          48630000
               ,:DCLACTIAST.RCRD-STTS-CD                                48640000
               ,:DCLACTIAST.NSCC-PEND-CD                                48650000
               ,:DCLACTIAST.NSCC-ACK-IND                                48660000
               ,:DCLACTIAST.PRGM-NM                                     48670000
               ,:DCLACTIAST.CICS-TERM-ID-CD                             48680000
               ,:DCLACTIAST.UPDT-TMSTP                                  48690000
               ,:DCLACTIAST.CRT-TMSTP                                   48700000
               ,:DCLACTIAST.SECURITY-ADP-NBR                            48710000
               ,:DCLACTIAST.TRNFR-TYPE-STTS-CD                          48720000
               ,:DCLACTIAST.RCV-NBR-STTS-CD                             48730000
               ,:DCLACTIAST.DLVR-NBR-STTS-CD                            48740000
               ,:DCLACTIAST.CAGE-TAG-NBR                                48750000
               ,:DCLACTIAST.SCRTY-866-NBR                               48760000
               ,:DCLACTIAST.ASSET-866-QTY                               48770000
               ,:DCLACTIAST.CICS-SGNON-ID                               48780000
               ,:DCLACTIAST.CICS-NET-NM                                 48790000
               ,:DCLACTIAST.TPSCRT-USR-ID                               48800000
               ,:DCLACTIAST.TPSCRT-USR-NM )                             48810000
           END-EXEC.                                                    48820000
LRM013 2800-SELECT-ACTIAST-PEND-ACK.                                    48830000
LRM013     IF ACAT-CONTROL-NBR OF DCLACTIAST > SPACES                   48840000
LRM013       EXEC SQL                                                   48850000
LRM013        SELECT                                                    48860000
LRM013           NSCC_PEND_CD                                           48870000
LRM013          ,NSCC_ACK_IND                                           48880000
LRM013        INTO                                                      48890000
LRM013          :WS-INITAST-NSCC-PEND-CD                                48900000
LRM013         ,:WS-INITAST-NSCC-ACK-IND                                48910000
LRM013       FROM ACTIAST                                               48920000
LRM013       WHERE (CLIENT_NBR          = :DCLACTIAST.CLIENT-NBR        48921000
LRM013          AND ACAT_CONTROL_NBR    = :DCLACTIAST.ACAT-CONTROL-NBR) 48922000
LRM013       END-EXEC                                                   48923000
LRM013     ELSE                                                         48924000
LRM013       EXEC SQL                                                   48925000
LRM013        SELECT                                                    48926000
LRM013           NSCC_PEND_CD                                           48927000
LRM013          ,NSCC_ACK_IND                                           48928000
LRM013        INTO                                                      48929000
LRM013          :WS-INITAST-NSCC-PEND-CD                                48930000
LRM013         ,:WS-INITAST-NSCC-ACK-IND                                48940000
LRM013       FROM ACTIAST                                               48950000
LRM013       WHERE (CLIENT_NBR          = :DCLACTIAST.CLIENT-NBR        48960000
LRM013          AND DLVR_NBR = :SV-DLVR-NBR                             48970000
LRM013          AND RCV_NBR = :SV-RCV-NBR                               48980000
LRM013          AND ACCT_DLVR_NBR = :SV-ACCT-DLVR-NBR                   48990000
LRM013          AND ACCT_RCV_NBR = :SV-ACCT-RCV-NBR)                    49000000
LRM013       END-EXEC                                                   49010000
LRM013     END-IF.                                                      49020000
      /                                                                 49030000
LRM015 3000-DELETE-ALL-ASSETS-RTN.                                      49040000
LRM015*** FIRST CLEAR ANY/ALL ACTIAST ROWS FOR THIS CONTROL NUMBER:     49050000
LRM015     MOVE +0 TO ACAT10IO-ASSET-DELETE-COUNT                       49060000
LRM015     INITIALIZE DCLACTIAST.                                       49070000
LRM015     EXEC SQL                                                     49080000
LRM015          SET :WS-TIMESTAMP = CURRENT TIMESTAMP                   49090000
LRM015     END-EXEC.                                                    49100000
LRM015     MOVE 'R' TO NSCC-ACK-IND OF DCLACTIAST                       49110000
LRM015     MOVE 'FUL'          TO   TRNFR-TYPE-CD OF DCLACTIAST.        49120000
LRM015     MOVE ACAT10IO-NET-NAME  TO CICS-NET-NM   OF DCLACTIAST       49121000
LRM015     MOVE ACAT10IO-USER-ID   TO TPSCRT-USR-ID OF DCLACTIAST       49122000
LRM015     MOVE ACAT10IO-USER-NAME TO TPSCRT-USR-NM OF DCLACTIAST       49123000
LRM015     MOVE 'ACAT10DC'         TO  PRGM-NM      OF DCLACTIAST       49124000
LRM015     MOVE ACAT10IO-SIGN-ON-ID TO CICS-SGNON-ID OF DCLACTIAST      49125000
LRM015     MOVE  EIBTRMID          TO  CICS-TERM-ID-CD OF DCLACTIAST    49126000
LRM015     MOVE ZEROS              TO  ASSET-PCT     OF DCLACTIAST      49127000
LRM015                                 ASSET-866-QTY OF DCLACTIAST      49128000
LRM015     EXEC SQL                                                     49129000
LRM015            DELETE                                                49130000
LRM015          FROM ACTIAST                                            49131000
LRM015        WHERE  CLIENT_NBR = :SV-CLIENT-NBR                        49132000
LRM015                    AND  ACAT_CONTROL_NBR = :SV-ACAT-CNTL-NBR     49133000
LRM015     END-EXEC.                                                    49134000
LRM015*                                                                 49135000
LRM015     EVALUATE SQLCODE                                             49135100
LRM015          WHEN +0                                                 49135200
LRM015          WHEN +100                                               49135300
LRM015               CONTINUE                                           49135400
LRM015          WHEN OTHER                                              49135500
LRM015               MOVE SPACES TO ACAT10IO-VINITAST-SW                49135600
LRM015               PERFORM 9000-WRITE-TO-CICS-LOG                     49135700
LRM015               PERFORM 9500-RETURN-DB2-ERROR                      49135800
LRM015     END-EVALUATE.                                                49135900
LRM015                                                                  49136000
LRM015     IF ACAT10IO-DELETE-ALL-ASSETS-RVS                            49137000
LRM015        GO TO 3000-EXIT.                                          49138000
LRM015                                                                  49139000
LRM015     EXEC SQL                                                     49140000
LRM015          OPEN CSR_VASST                                          49150000
LRM015     END-EXEC.                                                    49160000
LRM015     PERFORM 3100-FETCH-VASSET UNTIL SQLCODE NOT = +0.            49170000
LRM015     EXEC SQL                                                     49180000
LRM015          CLOSE CSR_VASST                                         49190000
LRM015     END-EXEC.                                                    49200000
LRM015 3000-EXIT. EXIT.                                                 49210000
LRM015                                                                  49220000
LRM015 3100-FETCH-VASSET.                                               49230000
LRM015                                                                  49240000
LRM015     EXEC SQL                                                     49250000
LRM015          FETCH  CSR_VASST                                        49260000
LRM015          INTO                                                    49270000
LRM015             :DCLVASSET.ASSET-SEQ-NBR                             49280000
LRM015            ,:WS-CNTRY-CD                                         49290000
LRM015            ,:DCLVASSET.ISIN-SEC-ISSUE-CD                         49300000
LRM015            ,:WS-SEC-CDG-CD                                       49310000
LRM015            ,:WS-ADP-NBR                                          49320000
LRM015            ,:WS-TRANS-TYPE-CD                                    49330000
LRM015            ,:WS-CSH-MGN-SHRT-CD                                  49340000
LRM015            ,:WS-PSTN-CD                                          49350000
LRM015            ,:WS-OPTN-CTGY-CD                                     49360000
LRM015            ,:WS-WHEN-ISSUED                                      49370000
LRM015            ,:WS-STTLM-LCTN-CD                                    49380000
LRM015            ,:WS-STTLM-RSN-CD                                     49390000
LRM015            ,:DCLVASSET.ASSET-QTY                                 49400000
LRM015            ,:DCLVASSET.ASSET-AMT                                 49410000
LRM015            ,:WS-ASSET-DESC                                       49420000
LRM015     END-EXEC.                                                    49430000
LRM015*                                                                 49440000
LRM015     EVALUATE SQLCODE                                             49450000
LRM015          WHEN +0                                                 49460000
LRM015               PERFORM 3200-CREATE-ACTIAST-DELETE                 49470000
LRM015               SET ACAT10IO-VINITAST-UPDATED TO TRUE              49480000
LRM015          WHEN +100                                               49490000
LRM015               CONTINUE                                           49500000
LRM015          WHEN OTHER                                              49510000
LRM015               MOVE SPACES TO ACAT10IO-VINITAST-SW                49520000
LRM015               PERFORM 9000-WRITE-TO-CICS-LOG                     49530000
LRM015               PERFORM 9500-RETURN-DB2-ERROR                      49540000
LRM015     END-EVALUATE.                                                49550000
LRM015                                                                  49560000
LRM015 3200-CREATE-ACTIAST-DELETE.                                      49570000
LRM015     EXEC SQL                                                     49580000
LRM015          INSERT INTO ACTIAST                                     49590000
LRM015          ( CLIENT_NBR                                            49600000
LRM015          , DLVR_NBR                                              49610000
LRM015          , ACCT_DLVR_NBR                                         49620000
LRM015          , RCV_NBR                                               49630000
LRM015          , ACCT_RCV_NBR                                          49640000
LRM015          , ISIN_CNTRY_CD                                         49650000
LRM015          , ISIN_SEC_ISSUE_CD                                     49660000
LRM015          , ISIN_SEC_CDG_CD                                       49670000
LRM015          , STTLM_LCTN_CD                                         49680000
LRM015          , CSH_MGN_SHRT_CD                                       49690000
LRM015          , CSH_MRG_SHT_STS_CD                                    49700000
LRM015          , STTLM_LCTN_STTS_CD                                    49710000
LRM015          , ISIN_CNTRY_STTS_CD                                    49720000
LRM015          , SBMTG_PRTCP_NBR                                       49730000
LRM015          , SBMT_PRT_NR_STS_CD                                    49740000
LRM015          , ACAT_CONTROL_NBR                                      49750000
LRM015          , CONTROL_NBR_STS_CD                                    49760000
LRM015          , ASSET_SEQ_NBR                                         49770000
LRM015          , AST_SEQ_NBR_STS_CD                                    49780000
LRM015          , TRANS_TYPE_CD                                         49790000
LRM015          , TRANS_TYPE_STTS_CD                                    49800000
LRM015          , PHSCL_SEQ_NBR                                         49810000
LRM015          , PHSCL_SEQ_STTS_CD                                     49820000
LRM015          , LGCL_SEQ_NBR                                          49830000
LRM015          , LGCL_SEQ_NR_STS_CD                                    49840000
LRM015          , ASSET_PRC_CTGY_CD                                     49850000
LRM015          , AST_PRC_CTG_STS_CD                                    49860000
LRM015          , STTLM_RSN_CD                                          49870000
LRM015          , STTLM_RSN_STTS_CD                                     49880000
LRM015          , ASSET_DESC_TXT                                        49890000
LRM015          , ASSET_DESC_STTS_CD                                    49900000
LRM015          , ASSET_RQST_QTY_CD                                     49910000
LRM015          , ASSET_RQST_STS_CD                                     49920000
LRM015          , AST_RQST_TRANS_CD                                     49930000
LRM015          , AST_RQ_TRAN_STS_CD                                    49940000
LRM015          , ASSET_QTY                                             49950000
LRM015          , ASSET_QTY_STTS_CD                                     49960000
LRM015          , ASSET_PCT                                             49970000
LRM015          , ASSET_PCT_STTS_CD                                     49980000
LRM015          , PSTN_CD                                               49990000
LRM015          , PSTN_CD_STTS_CD                                       50000000
LRM015          , ISO_CRNCY_CD                                          50010000
LRM015          , ISO_CRNCY_STTS_CD                                     50020000
LRM015          , ASSET_AMT                                             50030000
LRM015          , ASSET_AMT_STTS_CD                                     50040000
LRM015          , BEARER_BOND_CD                                        50050000
LRM015          , BEARER_BND_STTS_CD                                    50060000
LRM015          , WHI_CD                                                50070000
LRM015          , WHI_STTS_CD                                           50080000
LRM015          , TRNFR_TYPE_RSN_CD                                     50090000
LRM015          , TRN_TYP_RSN_STS_CD                                    50100000
LRM015          , MBS_SERIAL_NBR                                        50110000
LRM015          , MBS_SERIAL_STTS_CD                                    50120000
LRM015          , ASSET_CMNT_TXT                                        50130000
LRM015          , ASSET_CMNT_STTS_CD                                    50140000
LRM015          , NSCC_WTHLD_CD                                         50150000
LRM015          , TRANS_RFRN_ID_CD                                      50160000
LRM015          , TRANS_RFRN_STTS_CD                                    50170000
LRM015          , ISIN_SEC_IS_STS_CD                                    50180000
LRM015          , ISIN_SEC_CD_STS_CD                                    50190000
LRM015          , OPTN_CTGY_CD                                          50200000
LRM015          , OPTN_CTGY_STTS_CD                                     50210000
LRM015          , RCRD_LNGTH_STTS_CD                                    50220000
LRM015          , RCRD_STTS_CD                                          50230000
LRM015          , NSCC_PEND_CD                                          50240000
LRM015          , NSCC_ACK_IND                                          50250000
LRM015          , PRGM_NM                                               50260000
LRM015          , CICS_TERM_ID_CD                                       50270000
LRM015          , UPDT_TMSTP                                            50280000
LRM015          , CRT_TMSTP                                             50290000
LRM015          , SECURITY_ADP_NBR                                      50300000
LRM015          , TRNFR_TYPE_CD                                         50310000
LRM015          , TRNFR_TYPE_STTS_CD                                    50320000
LRM015          , RCV_NBR_STTS_CD                                       50330000
LRM015          , DLVR_NBR_STTS_CD                                      50340000
LRM015          , SCRTY_866_NBR                                         50350000
LRM015          , ASSET_866_QTY                                         50360000
LRM015          , CICS_SGNON_ID                                         50370000
LRM015          , CICS_NET_NM                                           50380000
LRM015          , TPSCRT_USR_ID                                         50390000
LRM015          , TPSCRT_USR_NM )                                       50400000
LRM015            VALUES                                                50410000
LRM015          (: SV-CLIENT-NBR                                        50420000
LRM015          ,: SV-DLVR-NBR                                          50430000
LRM015          ,: SV-ACCT-DLVR-NBR                                     50440000
LRM015          ,: SV-RCV-NBR                                           50450000
LRM015          ,: SV-ACCT-RCV-NBR                                      50460000
LRM015          ,: WS-CNTRY-CD                                          50470000
LRM015          ,: DCLVASSET.ISIN-SEC-ISSUE-CD                          50480000
LRM015          ,: WS-SEC-CDG-CD                                        50490000
LRM015          ,: WS-STTLM-LCTN-CD                                     50500000
LRM015          ,: WS-CSH-MGN-SHRT-CD                                   50510000
LRM015          ,: DCLACTIAST.CSH-MRG-SHT-STS-CD                        50520000
LRM015          ,: DCLACTIAST.STTLM-LCTN-STTS-CD                        50530000
LRM015          ,: DCLACTIAST.ISIN-CNTRY-STTS-CD                        50540000
LRM015          ,: SV-DLVR-NBR                                          50550000
LRM015          ,: DCLACTIAST.SBMT-PRT-NR-STS-CD                        50560000
LRM015          ,: SV-ACAT-CNTL-NBR                                     50570000
LRM015          ,: DCLACTIAST.CONTROL-NBR-STS-CD                        50580000
LRM015          ,: DCLVASSET.ASSET-SEQ-NBR                              50590000
LRM015          ,: DCLACTIAST.AST-SEQ-NBR-STS-CD                        50600000
LRM015          ,  'D'                                                  50610000
LRM015          ,: DCLACTIAST.TRANS-TYPE-STTS-CD                        50620000
LRM015          ,: DCLACTIAST.PHSCL-SEQ-NBR                             50630000
LRM015          ,: DCLACTIAST.PHSCL-SEQ-STTS-CD                         50640000
LRM015          ,: DCLACTIAST.LGCL-SEQ-NBR                              50650000
LRM015          ,: DCLACTIAST.LGCL-SEQ-NR-STS-CD                        50660000
LRM015          ,: DCLACTIAST.ASSET-PRC-CTGY-CD                         50670000
LRM015          ,: DCLACTIAST.AST-PRC-CTG-STS-CD                        50680000
LRM015          ,: WS-STTLM-RSN-CD                                      50690000
LRM015          ,: DCLACTIAST.STTLM-RSN-STTS-CD                         50700000
LRM015          ,: WS-ASSET-DESC                                        50710000
LRM015          ,: DCLACTIAST.ASSET-DESC-STTS-CD                        50720000
LRM015          ,: DCLACTIAST.ASSET-RQST-QTY-CD                         50730000
LRM015          ,: DCLACTIAST.ASSET-RQST-STS-CD                         50740000
LRM015          ,: DCLACTIAST.AST-RQST-TRANS-CD                         50750000
LRM015          ,: DCLACTIAST.AST-RQ-TRAN-STS-CD                        50760000
LRM015          ,: DCLVASSET.ASSET-QTY                                  50770000
LRM015          ,: DCLACTIAST.ASSET-QTY-STTS-CD                         50780000
LRM015          ,: DCLACTIAST.ASSET-PCT                                 50790000
LRM015          ,: DCLACTIAST.ASSET-PCT-STTS-CD                         50800000
LRM015          ,: WS-PSTN-CD                                           50810000
LRM015          ,: DCLACTIAST.PSTN-CD-STTS-CD                           50820000
LRM015          ,: DCLACTIAST.ISO-CRNCY-CD                              50830000
LRM015          ,: DCLACTIAST.ISO-CRNCY-STTS-CD                         50840000
LRM015          ,: DCLVASSET.ASSET-AMT                                  50850000
LRM015          ,: DCLACTIAST.ASSET-AMT-STTS-CD                         50860000
LRM015          ,: DCLACTIAST.BEARER-BOND-CD                            50870000
LRM015          ,: DCLACTIAST.BEARER-BND-STTS-CD                        50880000
LRM015          ,: DCLACTIAST.WHI-CD                                    50890000
LRM015          ,: DCLACTIAST.WHI-STTS-CD                               50900000
LRM015          ,: DCLACTIAST.TRNFR-TYPE-RSN-CD                         50910000
LRM015          ,: DCLACTIAST.TRN-TYP-RSN-STS-CD                        50920000
LRM015          ,: DCLACTIAST.MBS-SERIAL-NBR                            50930000
LRM015          ,: DCLACTIAST.MBS-SERIAL-STTS-CD                        50940000
LRM015          ,: DCLACTIAST.ASSET-CMNT-TXT                            50950000
LRM015          ,: DCLACTIAST.ASSET-CMNT-STTS-CD                        50960000
LRM015          ,: DCLACTIAST.NSCC-WTHLD-CD                             50970000
LRM015          ,: DCLACTIAST.TRANS-RFRN-ID-CD                          50980000
LRM015          ,: DCLACTIAST.TRANS-RFRN-STTS-CD                        50990000
LRM015          ,: DCLACTIAST.ISIN-SEC-IS-STS-CD                        51000000
LRM015          ,: DCLACTIAST.ISIN-SEC-CD-STS-CD                        51010000
LRM015          ,: WS-OPTN-CTGY-CD                                      51020000
LRM015          ,: DCLACTIAST.OPTN-CTGY-STTS-CD                         51030000
LRM015          ,: DCLACTIAST.RCRD-LNGTH-STTS-CD                        51040000
LRM015          ,: DCLACTIAST.RCRD-STTS-CD                              51050000
LRM015          ,: DCLACTIAST.NSCC-PEND-CD                              51060000
LRM015          ,: DCLACTIAST.NSCC-ACK-IND                              51070000
LRM015          ,: DCLACTIAST.PRGM-NM                                   51080000
LRM015          ,: DCLACTIAST.CICS-TERM-ID-CD                           51090000
LRM015          ,: WS-TIMESTAMP                                         51100000
LRM015          ,: WS-TIMESTAMP                                         51110000
LRM015          ,: WS-ADP-NBR                                           51120000
LRM015          ,: DCLACTIAST.TRNFR-TYPE-CD                             51130000
LRM015          ,: DCLACTIAST.TRNFR-TYPE-STTS-CD                        51140000
LRM015          ,: DCLACTIAST.RCV-NBR-STTS-CD                           51150000
LRM015          ,: DCLACTIAST.DLVR-NBR-STTS-CD                          51160000
LRM015          ,: DCLACTIAST.SCRTY-866-NBR                             51170000
LRM015          ,: DCLACTIAST.ASSET-866-QTY                             51180000
LRM015          ,: DCLACTIAST.CICS-SGNON-ID                             51190000
LRM015          ,: DCLACTIAST.CICS-NET-NM                               51200000
LRM015          ,: DCLACTIAST.TPSCRT-USR-ID                             51210000
LRM015          ,: DCLACTIAST.TPSCRT-USR-NM  )                          51220000
LRM015     END-EXEC.                                                    51230000
LRM015*                                                                 51240000
LRM015     EVALUATE SQLCODE                                             51250000
LRM015          WHEN +0                                                 51260000
LRM015               ADD +1 TO ACAT10IO-ASSET-DELETE-COUNT              51270000
LRM015          WHEN OTHER                                              51280000
LRM015               MOVE SPACES TO ACAT10IO-VINITAST-SW                51290000
LRM015               PERFORM 9000-WRITE-TO-CICS-LOG                     51300000
LRM015               PERFORM 9500-RETURN-DB2-ERROR                      51310000
LRM015     END-EVALUATE.                                                51320000
