000001* PDX    - ACAT10NT C0360817 11/21/14 10:51:57 TBLAMUR            00001000
000001* LRM030 SSR 99150 CONTRA CUSIP SUBMIT WARNING.                           
000001* PDX    - ACAT10NT C0346519 12/06/13 15:42:47 TBLAMUR            00001000
000001* LRM029 - SSR 96477 INCLUDE BANK DEPOSIT MONEY IN DLVY EDIT,             
000001* LRM029 -   ADD TO CMBL-MM-FUND-YEST.                                    
000001* PDX    - ACAT10NT C0335821 07/26/13 15:37:34 TBLAMUR            00001000
000001* LRM028 - SSR# 90275 CORRECT BALANCE EDIT BUG WHEN FCUR IS               
000001*    DISPLAYED IN THE ASSET SECTION.                                      
000001* PDX    - ACAT10NT C0333830 11/15/12 16:22:15 TBLAMUR            00001000
000001* LRM027 - SSR# 84763 WIPE OUT CURRENCY DSPLY WHEN NOT USED.              
000001* PDX    - ACAT10NT C0330171 08/30/12 16:00:19 TBLAMUR            00001000
000001* LRM026 - SSR# 84763 DLVY POSN IN FOREIGN CURRENCY                       
000001*        - SSR# 86856 DLVY BALS IN FOREIGN CURRENCY                       
000001* PDX    - ACAT10NT C0318727 01/11/12 13:26:11 TBLAMUR            00001000
000001* LRM024 - SSR# 80728 EXCEPTION FOR NTWORK LEVEL 4 FUND.                  
000001* PDX    - ACAT10NT C0311767 05/12/11 08:29:21 TBLAMUR            00001000
000001* LRM023 - SSR# 77317 MANUAL SUBMIT CASH ONLY DID NOT WORK.               
000001* PDX    - ACAT10NT C0301531 02/07/11 09:07:43 TBLAMUR            00001000
000001* SSR# 70607 PUT BACK COMMENTED LOGIC.                                    
000001* PDX    - ACAT10NT C0305327 12/23/10 08:58:52 TBLAMUR            00001000
000001* LRM022 - SSR# 73637 SECONDARY SSN EDIT CHANGE, REFER TO B1              
000001* LRM021 - SSR# 73009 USE COPY CATACTYP TO STANDARIZE ACCOUNT             
000001* LRM021 - TYPE LOOKUP.                                                   
000001* PDX    - ACAT10NT C0305442 12/16/10 09:39:32 TBLAMUR            00001000
000001* LRM020 - SSR 73129 FIX REGT ASSET DESCRIPTION, DIDNT REFRESH.           
000001* PDX    - ACAT10NT C0302589 11/22/10 13:41:22 TBLAMUR            00001000
000001* LRM019 - SSR 70666 PASS AUDIT DETAILS ON SUBMIT ASSETS                  
000001* PDX    - ACAT10NT C0301531 10/04/10 07:55:33 TBLAMUR            00001000
000001* LRM018 - SSR 70607 DO NOT ALLOW SUBMIT AFTER CYCLE 4 DAY2               
000001* PDX    - ACAT10NT C0296498 06/14/10 14:35:51 TBLAMUR            00001000
000001* LRM017 - SSR 68510 UPGRADE SUBMIT IND EDIT WHEN ERROR ENTERED           
000001* PDX    - ACAT10NT C0281257 04/23/10 10:43:59 TBLAMUR            00001000
000001* LRM016 - SSR 62882 DELETE ALL ASSETS                                    
000001* PDX    - ACAT10NT C0284083 07/28/09 15:12:23 TBLAMUR            00001000
000001* LRM015 SSR# 64156 LOOK AT TABL FOR EXTENDED CYCLE CUTOFF TIMES.         
000001* PDX    - ACAT10NT C0279780 05/15/09 16:14:30 TBLAMUR            00001000
000001* LRM014 - ASRA FIX ON BAL01 EDIT                                         
000001* PDX    - ACAT10NT C0275533 03/09/09 15:29:03 TBLAMUR            00001000
000001* LRM013 - SSR 57674 UPGRADE REJECT ENTRY MESSAGE TO INFORM THE           
000001* LRM013 - USER THE REJECT WILL SUBMIT.                                   
000001* PDX    - ACAT10NT C0272581 12/02/08 15:14:12 TBLAMUR            00001000
000001* PDX    - ACAT10NT C0273647 11/26/08 13:35:33 TBLAMUR            00001000
000001* LRM012 - SSR# 59508 MEMO ONLY EXCEPTION MSG.                            
000001* PDX    - ACAT10NT C0263391 08/20/08 15:54:00 TBLAMUR            00001000
000001* LRM011 - SSR# 55766 ASCENDIS INTERFACE. BROWSE ONLY UNLESS              
000001*        SCON OVERRIDE.  ALLOW UPDATES TO F/R SCREENS REGARDLESS.         
000001* LRM011 - SSR# 55644 ACCOUNT FLAT RJC2 = D,L                             
000001* PDX    - ACAT10NT C0254958 10/19/07 09:32:55 TBLAMUR            00001000
000001* LRM010 - SSR 54091 CLIENT 6 CONVERSION ACCT DSPLY ON ACCT CHG           
000001* PDX    - ACAT10NT C0250441 06/25/07 11:11:14 TBLAMUR            00001000
000001* LRM009 - SSR 53075 SPIN-OFF CHANGES                                     
000001* PDX    - ACAT10NT C0242236 12/04/06 15:58:37 TBLAMUR            00001000
      * LRM008 - 48334 ADOPTION AGREEMENT EXCEPTION MSG                         
000001* PDX    - ACAT10NT C0238544 08/28/06 15:37:43 TBLAMUR            00001000
      * LRM007 - 45145 CREATE WARNING MSG WHEN USERS ATTEMPT TO REJECT          
      *          AFTER NSCC CUT OFF TIME ON LAST DAY.                           
      *          (LAST DAY MARKED ON VTRNFR BY BATCH).                          
000001* PDX    - ACAT10NT C02315BR 07/07/06 15:41:18 TBEDTAK            00001000
      * ET0006 NON-SSR BUG - DISPLAY COMMENT UPDATE SCREEN WHEN USER            
      * ET0006         REJECT WITH COMMENT.                                     
      * ET0005 NON-SSR BUG - IF ACCT IS REJECTED, PROTECT SCREEN FIELDS.        
      * ET0004 0040661 RETAIN USER ID OF INITIATOR.                             
      * ET0003 0045744 BLOCK DELIVERY BASED ON ACCOUNT FREEZE.                  
000001* PDX    - ACAT10NT C0226668 11/18/05 09:20:40 TBLAMUR            00001000
      * LRM004 0034889 DSPLY ACCOUNT CHANGE MSG                                 
000001* PDX    - ACAT10NT C0209766 08/12/04 10:18:50 TBEDTAK            00001000
      * ET0002 EXPAND RETURN-MSG FIELD FROM 70 TO 79 BYTES.                     
000001* PDX    - ACAT10NT C0204643 04/22/04 14:17:16 TBEDTAK            00001000
      * ET0001 0024351 CORRECT MESSAGES WHEN ITEM IS BEING UPDATED              
000001* PDX    - ACAT10NT C0182233 02/14/03 11:48:19 TBLAMUR            00001000
      * LRM003 0029711 MARGIN RETOOL CALL CUSHOLIO AND CUSBALIO                 
000001* PDX    - ACAT10NT C0179784 10/03/02 11:46:54 TBLAMUR            00001000
      * LRM002 0026952 CREATE RESCIND BLOCK EXCEPTION MESSAGES                  
000001* PDX    - ACAT10NT C0179784 09/13/02 15:38:21 TBLAMUR            00001000
000001* PDX    - ACAT10NT C0173301 04/30/02 14:12:05 TBLAMUR            00001000
000001* PDX    - ACAT10NT C0157168 07/19/01 15:29:00 TBLAMUR            00001000
000001* PDX    - ACAT10NT C0128918 08/16/99 09:35:48 TBTIKUO            00002000
000001* PDX    - ACAT10NT C0126743 07/23/99 13:40:07 TBTIKUO            00020000
000001* PDX    - ACAT10NT C0124783 04/21/99 10:16:30 TBLAMUR            00030000
000001* PDX    - ACAT10NT C0123344 04/19/99 10:59:16 TBLAMUR            00040000
000001* PDX    - ACAT10NT C0122453 03/01/99 12:44:17 TBLAMUR            00050000
000001* PDX    - ACAT10NT C0121429 02/16/99 09:05:15 TBLAMUR            00060000
000001* PDX    - ACAT10NT C0120812 02/03/99 22:18:35 TBDACRA            00070000
000001* PDX    - ACAT10NT C0119861 01/22/99 09:40:43 TBTIKUO            00080000
000001* PDX    - ACAT10NT C0119290 01/05/99 11:19:22 TBTIKUO            00090000
000001* PDX    - ACAT10NT C0118748 12/11/98 12:09:03 TBTIKUO            00100000
000001* PDX    - ACAT10NT C0117770 12/07/98 12:35:41 TBTIKUO            00110000
000001* PDX    - ACAT10NT C0112193 11/11/98 14:50:24 TBTIKUO            00120000
000001* PDX    - ACAT10NT C0117817 11/11/98 10:59:51 TBTIKUO            00130000
000001* PDX    - ACAT10NT C0117770 11/04/98 16:49:32 TBTIKUO            00140000
000001* PDX    - ACAT10NT C0112193 10/28/98 11:00:19 TBTIKUO            00150000
       IDENTIFICATION DIVISION.                                         00160000
       PROGRAM-ID.    ACAT10NT.                                         00170000
       AUTHOR.  T. KUO.                                                 00180000
      *REMARKS.                                                         00190000
      **-------------------------------------------------------------** 00200000
      *           ACATS  REVIEW  NEW TRANSFERS (DELIVERER)            * 00210000
      **-------------------------------------------------------------** 00220000
TCK001* PDX#C0126743 - ALPHA BRANCH                                   * 00230000
      **-------------------------------------------------------------** 00231000
TCK002* PDX#C0128918 - MAKE CHANGES TO XCTL TO & FROM MF SCREEN(PF9)  * 00232000
      * (LOG # 254)                                                   * 00233000
      **-------------------------------------------------------------** 00234000
TCK003* PDX#C0128918 - ASSETS DROP WHEN TRYING TO SCROLL PAST THE LAST* 00235000
      * (LOG # 387)    TIF ON 'H' SCREEN                              * 00236000
      **-------------------------------------------------------------** 00237000
       ENVIRONMENT DIVISION.                                            00238000
       DATA DIVISION.                                                   00239000
       WORKING-STORAGE SECTION.                                         00240000
       COPY PDXIDCOB.                                                   00250000
       77  TWA-SIZE                   PIC S9(4)        COMP.            00260000
       77  WS-CICS-RESP               PIC S9(8)        COMP   VALUE +0. 00270000
       77  WS-ACATNAIO                PIC X(08)        VALUE 'ACAT00NA'.00280000
       77  SUB                        PIC 9(02)        VALUE 0.         00290000
ET0003 77  WS-ACATRST                 PIC X(08)        VALUE 'ACATRST '.        
LRM029 77  WS-MRGRLBB                 PIC X(08)        VALUE 'MRGRLBB '.        
      *******************************************************           00300000
      *      TSQ WORK AREA                                              00310000
      *******************************************************           00320000
       01  TSQ-WORK-AREA.                                               00330000
           05  TSQ-NAME.                                                00340000
               09 TERM-ID             PIC X(04).                        00350000
               09 TRAN-ID             PIC X(04).                        00360000
           05  ITEM-NUM               PIC S9(04) COMP  VALUE +1.        00370000
      /                                                                 00380000
      *******************************************************           00390000
      *      GET DATE TIME LAYOUT                                       00400000
      *******************************************************           00410000
       01  WSWORKAREA.                                                  00420000
           05  WSABSTIME           PIC S9(08) COMP.                     00430000
           05  WSMMDDYY.                                                00440000
               09 WS-CUR-MM        PIC XX.                              00450000
               09  FILLER          PIC X.                               00460000
               09 WS-CUR-DD        PIC XX.                              00470000
               09  FILLER          PIC X.                               00480000
               09 WS-CUR-YY        PIC XX.                              00490000
           05  WSDATESEP           PIC X(01) VALUE '/'.                 00500000
           05  WSTIME.                                                  00510000
               09  WS-TIME-HH      PIC XX.                              00520000
               09  FILLER          PIC X.                               00530000
               09  WS-TIME-MM      PIC XX.                              00540000
               09  FILLER          PIC X.                               00550000
               09  WS-TIME-SS      PIC XX.                              00560000
LRM007     05  WS-TIME-HHMM        PIC X(04).                                   
           05  WSTIMESEP           PIC X(01) VALUE ':'.                 00570000
LRM015     05  WS-CYCLE4-HHMM      PIC X(04) VALUE '1330'.                      
LRM018     05  WS-CYCLE5-HHMM      PIC X(04) VALUE '1530'.                      
LRM018     05  WS-CYCLE5-CUTOFF-SW PIC X(01) VALUE 'N'.                         
LRM018         88  WS-CYCLE4-CUTOFF VALUE 'Y'.                                  
LRM018     05  WS-CYCLE5-CUTOFF-SW PIC X(01) VALUE 'N'.                         
LRM018         88  WS-CYCLE5-CUTOFF VALUE 'Y'.                                  
                                                                        00580000
      *******************************************************           00590000
      *      B1 WORK AREA                                               00600000
      *******************************************************           00610000
       01  B1-RECORD.                                                   00620000
           05  B1-REC-ID.                                               00630000
               09  B1-CLIENT-NO          PIC 9(03) COMP-3.              00640000
               09  B1-CARD-NO            PIC 9(07) COMP-3.              00650000
               09  B1-CLIENT             PIC 9(03) COMP-3.              00660000
               09  B1-SEQUENCE           PIC 9(05) COMP-3 VALUE 1.      00670000
           05  B1-REC-TYP-3              PIC X(01) VALUE '3'.           00680000
           05  B1-COUNTRY                PIC X(03).                     00690000
           05  FILLER REDEFINES B1-COUNTRY.                             00700000
               09  B1-PROCESS-POST-DAYS  PIC X(02).                     00710000
               09  FILLER                PIC X(01).                     00720000
           05  FILLER                    PIC X(07).                     00730000
                                                                        00740000
       EJECT                                                            00750000
      *******************************************************           00760000
      *      ACAT10NT WORK AREA                                         00770000
      *******************************************************           00780000
       01  ACAT10NT-WORK-AREA.                                          00790000
           05  CALLED-PROGRAM-NAME        PIC X(08).                    00800000
           05  WORK-DATE-X.                                             00810000
               09 WORK-DATE-X-MM          PIC X(02).                    00820000
               09 FILLER                  PIC X(01).                    00830000
               09 WORK-DATE-X-YY          PIC X(02).                    00840000
           05  WORK-DATE.                                               00850000
               09 WORK-DATE-MM            PIC X(02).                    00860000
               09 WORK-DATE-YY            PIC X(02).                    00870000
           05  TWA-CLIENT-NO-X.                                         00880000
               09 TWA-CLIENT-NO-9         PIC 9(04).                    00890000
           05  WS-DATE-YYYYMMDD           PIC 9(08).                    00900000
           05  WS-DATE-FIELDS REDEFINES WS-DATE-YYYYMMDD.               00910000
               09  WS-DATE-CC             PIC X(02).                    00920000
               09  WS-DATE-YY             PIC X(02).                    00930000
               09  WS-DATE-MM             PIC X(02).                    00940000
               09  WS-DATE-DD             PIC X(02).                    00950000
           05  WS-DATE-EDIT.                                            00960000
               09  WS-DATE-MM             PIC X(02).                    00970000
               09  FILLER                 PIC X(01)  VALUE '/'.         00980000
               09  WS-DATE-DD             PIC X(02).                    00990000
               09  FILLER                 PIC X(01)  VALUE '/'.         01000000
               09  WS-DATE-YY             PIC X(02).                    01010000
           05  WS-FORMAT-DATE.                                          01020000
               09  WS-MM                  PIC X(02).                    01030000
               09  FILLER                 PIC X(01)  VALUE '/'.         01040000
               09  WS-DD                  PIC X(02).                    01050000
               09  FILLER                 PIC X(01)  VALUE '/'.         01060000
               09  WS-YY                  PIC X(02).                    01070000
           05  DATE-FOUND-FLAG            PIC X(01) VALUE 'N'.          01080000
           05  WS-MRGN-POSN-QTY-TYPE1   PIC S9(12)V9(5) COMP-3 VALUE +0.01090000
           05  WS-MRGN-POSN-QTY-TYPE2   PIC S9(12)V9(5) COMP-3 VALUE +0.01100000
           05  WS-MRGN-POSN-QTY-TYPE5   PIC S9(12)V9(5) COMP-3 VALUE +0.01110000
           05  WS-MRGN-BAL-TYPE1          PIC S9(15)V99 COMP-3 VALUE +0.01120000
           05  WS-MRGN-BAL-TYPE2          PIC S9(15)V99 COMP-3 VALUE +0.01130000
           05  WS-MRGN-BAL-TYPE5          PIC S9(15)V99 COMP-3 VALUE +0.01140000
           05  WS-MRGN-BAL-SMA            PIC S9(15)V99 COMP-3 VALUE +0.01150000
           05  UNPK-TYPE.                                               01160000
               10  FILLER                 PIC 9 VALUE ZERO.             01170000
               10  WK-PS-TYPE             PIC X VALUE ZERO.             01180000
           05  B1-CARD-OPTION             PIC X.                        01190000
           05  REAL-CODE                  PIC 99 VALUE 0.               01200000
           05  WS-99-MEMO-SUBS-AREA.                                    01210000
               09  WS-99-MEMO-SUB OCCURS 18 TIMES PIC 99.               01220000
           05  WS-REJECT-CODE-POPUP-SW    PIC X(01).                    01230000
               88  REJECT-CODE-POPUP-YES  VALUE 'Y'.                    01240000
           05  WS-SEND-CMNT-SW            PIC X(02).                    01250000
               88  VIEW-ACCT-CMNT         VALUE 'VT'.                   01260000
               88  VIEW-BAL1-CMNT         VALUE 'V1'.                   01270000
               88  VIEW-BAL2-CMNT         VALUE 'V2'.                   01280000
               88  VIEW-BAL5-CMNT         VALUE 'V5'.                   01290000
               88  VIEW-SMA-CMNT          VALUE 'VS'.                   01300000
               88  VIEW-SECR-CMNT         VALUE 'VA'.                   01310000
               88  VIEW-REJC-CMNT         VALUE 'JC'.                   01320000
               88  UPDT-ACCT-CMNT         VALUE 'UT'.                   01330000
               88  UPDT-BAL1-CMNT         VALUE 'U1'.                   01340000
               88  UPDT-BAL2-CMNT         VALUE 'U2'.                   01350000
               88  UPDT-BAL5-CMNT         VALUE 'U5'.                   01360000
               88  UPDT-SMA-CMNT          VALUE 'US'.                   01370000
               88  UPDT-SECR-CMNT         VALUE 'UA'.                   01380000
           05  WK-BROWSE-FORWARD-FLAG     PIC X(01) VALUE 'Y'.          01390000
               88  WK-BROWSE-FORWARD      VALUE 'Y'.                    01400000
               88  WK-BROWSE-BACKWARD     VALUE 'N'.                    01410000
           05  FIRST-TIME-FLAG            PIC X(01)  VALUE 'N'.         01420000
               88  FIRST-TIME             VALUE  'Y'.                   01430000
           05  WS-UPDATE-IND              PIC X(01)  VALUE 'N'.         01440000
           05  ERASE-KEY-VALUE            PIC S9(04) COMP VALUE +128.   01450000
           05  FILLER REDEFINES ERASE-KEY-VALUE.                        01460000
               09  FILLER                 PIC X(01).                    01470000
               09  ERASE-KEY              PIC X(01).                    01480000
           05  WS-MSSN1                   PIC X(11).                    01490000
           05  WS-MSSN2                   PIC X(11).                    01500000
           05  WS-SSN-ONE.                                              01510000
               09  WS-SSN-ONE-1           PIC X(03).                    01520000
               09  WS-SSN-ONE-2           PIC X(02).                    01530000
               09  WS-SSN-ONE-3           PIC X(04).                    01540000
           05  WS-SSN-ONE-REFORM.                                       01550000
               09  WS-SSN-ONE-1R          PIC X(03).                    01560000
               09  FILLER                 PIC X(01)  VALUE '-'.         01570000
               09  WS-SSN-ONE-2R          PIC X(02).                    01580000
               09  FILLER                 PIC X(01)  VALUE '-'.         01590000
               09  WS-SSN-ONE-3R          PIC X(04).                    01600000
           05  WS-SSN-TWO.                                              01610000
               09  WS-SSN-TWO-1           PIC X(03).                    01620000
               09  WS-SSN-TWO-2           PIC X(02).                    01630000
               09  WS-SSN-TWO-3           PIC X(04).                    01640000
           05  WS-SSN-TWO-REFORM.                                       01650000
               09  WS-SSN-TWO-1R          PIC X(03).                    01660000
               09  FILLER                 PIC X(01)  VALUE '-'.         01670000
               09  WS-SSN-TWO-2R          PIC X(02).                    01680000
               09  FILLER                 PIC X(01)  VALUE '-'.         01690000
               09  WS-SSN-TWO-3R          PIC X(04).                    01700000
           05  WS-ERROR-SW                PIC X(01).                    01710000
               88  ERROR-YES              VALUE 'Y'.                    01720000
01/20      05  WS-MRGN-MBAL01-ERROR-SW    PIC X(01)  VALUE 'N'.         01730000
01/20          88 MRGN-MBAL01-ERROR-YES   VALUE 'Y'.                    01740000
01/20          88 MRGN-MBAL01-ERROR-NO    VALUE 'N'.                    01750000
01/20      05  WS-MRGN-MBAL02-ERROR-SW    PIC X(01)  VALUE 'N'.         01760000
01/20          88 MRGN-MBAL02-ERROR-YES   VALUE 'Y'.                    01770000
01/20          88 MRGN-MBAL02-ERROR-NO    VALUE 'N'.                    01780000
01/20      05  WS-MRGN-MBAL05-ERROR-SW    PIC X(01)  VALUE 'N'.         01790000
01/20          88 MRGN-MBAL05-ERROR-YES   VALUE 'Y'.                    01800000
01/20          88 MRGN-MBAL05-ERROR-NO    VALUE 'N'.                    01810000
01/20      05  WS-MRGN-MSMA-ERROR-SW      PIC X(01)  VALUE 'N'.         01820000
01/20          88 MRGN-MSMA-ERROR-YES     VALUE 'Y'.                    01830000
01/20          88 MRGN-MSMA-ERROR-NO      VALUE 'N'.                    01840000
01/20      05  WS-MRGN-MQTY-ERROR-SW      PIC X(01)  VALUE 'N'.         01850000
01/20          88 MRGN-MQTY-ERROR-YES     VALUE 'Y'.                    01860000
01/20          88 MRGN-MQTY-ERROR-NO      VALUE 'N'.                    01870000
LRM016     05  WS-SAVE-MDEL-IND           PIC X(01)  VALUE SPACES.              
           05  DATA-ONLY-FLAG             PIC X(01)  VALUE 'N'.         01880000
               88  DATA-ONLY              VALUE  'Y'.                   01890000
           05  WK-CURSOR                  PIC S9(04) COMP.              01900000
           05  WK-CURSOR-MAP-ID           PIC X.                        01910000
               88  CURSOR-MAP-A                     VALUE 'A'.          01920000
               88  CURSOR-MAP-B                     VALUE 'B'.          01930000
               88  CURSOR-MAP-T                     VALUE 'T'.          01940000
           05  SYSTEM-MSG                 PIC X(79) VALUE SPACES.       01950000
           05  ABEND-LINE.                                              01960000
               09  ABEND-MSG              PIC X(30).                    01970000
               09  FILLER                 PIC X(11) VALUE ' EIBRESP ='. 01980000
               09  ABEND-EIBRESP          PIC 99.                       01990000
           05  UNAUTH-MESSAGE             PIC X(79)                     02000000
               VALUE 'UNAUTHORIZED USER.'.                              02010000
           05  SEC-MESSAGE                PIC X(79)                     02020000
               VALUE 'SIGN ON SECURITY NOT AVAILABLE, TRY AGAIN.'.      02030000
           05  WS-MRGN-MSG.                                             02040000
               09  WS-MRGN-MSG-LIT        PIC X(45).                    02050000
               09  WS-MRGN-MSG-AMT        PIC ZZZ,ZZZ,ZZZ,ZZZ.99-.      02060000
01/21      05  WS-MRGN-QTY-MSG.                                         02070000
               09  WS-MRGN-MSG-QTY-LIT    PIC X(45).                    02080000
               09  WS-MRGN-MSG-QTY        PIC ZZZ,ZZZ,ZZZ,ZZZ.99999-.   02090000
           05  ERR-MSG.                                                 02100000
               09  ERR-EIBDS              PIC X(8)  VALUE SPACES.       02110000
               09  ERR-MSG2               PIC X(70) VALUE SPACES.       02120000
           05  ERROR-PROG-MSG.                                          02130000
               09  ERROR-PROG-NAME        PIC X(08).                    02140000
               09  FILLER                 PIC X(71)                     02150000
                   VALUE ' PROGRAM NOT AVAILIABLE.'.                    02160000
           05 WS-DB2-ERROR-MSG.                                         02170000
               10 WS-DB2-ERROR-PGM       PIC X(08).                     02180000
               10 FILLER                 PIC X(13) VALUE                02190000
               ' - DB2 ERROR '.                                         02200000
               10 WS-DB2-ERROR-FUNCTION  PIC X(06) VALUE SPACES.        02210000
               10 WS-DB2-ERROR-TABLE     PIC X(09) VALUE SPACES.        02220000
               10 WS-DB2-ERROR-ID        PIC -999  VALUE SPACES.        02230000
LRM009         10 FILLER                 PIC X(15) VALUE                02240000
LRM009            ' CALL HELP DESK'.                                            
LRM016     05  WS-DLTE-ALL-MSG.                                                 
LRM016         10 FILLER                 PIC X(45) VALUE                        
LRM016         'ALL POSITIONS HAVE BEEN FLAGGED FOR DELETION '.                 
LRM016         10 WS-DLTE-ALL-MSG-CNT    PIC ZZZ9.                              
LRM016     05  WS-DLTE-ALL-MSG-RVS.                                             
LRM016         10 FILLER                 PIC X(40) VALUE                        
LRM016         'ALL POSITIONS ARE FLAGGED FOR DELETION; '.                      
LRM016         10 FILLER                 PIC X(27) VALUE                        
LRM016         'ERASE DELETE IND TO REVERSE'.                                   
           05  ACT-COUNT                  PIC 9(03).                    02250000
           05  LINE-COUNT                 PIC 9(03).                    02260000
           05  IDX                        PIC S9(03) COMP-3.            02270000
           05  C-IDX                      PIC S9(03) COMP-3.            02280000
           05  SECLINK-TABLE-POINTER      PIC S9(8) COMP VALUE +0.      02290000
           05  SECLINK-TABLE-PTR REDEFINES                              02300000
               SECLINK-TABLE-POINTER    USAGE IS POINTER.               02310000
           05  WS-ACAT-NEXT                     PIC X(01).              02320000
           05  WS-CUSTNM.                                               02330000
               10  WS-CUSTNM-LN1                PIC X(30).              02340000
               10  WS-CUSTNM-LN2                PIC X(30).              02350000
ET0003     05  WS-ACCT-FREEZE-MESSAGE.                                          
ET0003         09 WS-FULL-FREEZE-MSG      PIC X(23) VALUE                       
ET0003            'ACCOUNT IS FULLY FROZEN'.                                    
ET0003         09 WS-CASH-FREEZE-MSG      PIC X(30) VALUE                       
ET0003            'ACCOUNT IS FROZEN FOR CASH OUT'.                             
ET0003         09 WS-SEC-FREEZE-MSG       PIC X(30) VALUE                       
ET0003            'ACCOUNT IS FROZEN FOR SEC OUT '.                             
06/04      05  WS-ALERT-MSG                     PIC X(35)  VALUE        02360000
06/04          'THIS ACCOUNT HAS AN ALERT MESSAGE'.                     02370000
06/04      05  WS-RESTRICTED-MSG                PIC X(35)  VALUE        02380000
06/04          'THIS ITEM IS A RESTRICTED SECURITY'.                    02390000
           05  WS-ASSET-DESC-GRP.                                       02400000
               10  WS-ASSET-DESC1               PIC X(60).              02410000
               10  WS-ASSET-DESC2               PIC X(60).              02420000
            05  WS-INPUT-VALIDATE-SW            PIC X(01)  VALUE SPACE. 02430000
                88  INPUT-VALIDATED             VALUE 'Y'.              02440000
                88  NO-INPUT                    VALUE 'N'.              02450000
            05  WS-MTYPE                        PIC X(02).              02460000
            05  WS-MREJ.                                                02470000
                10 WS-MREJ1                     PIC X(01).              02480000
                10 WS-MREJ2                     PIC X(01).              02490000
            05  WS-MREJC.                                               02500000
                10 WS-MREJC1                    PIC X(01).              02510000
                10 WS-MREJC2                    PIC X(01).              02520000
            05  WS-CURSOR                       PIC X(03)  VALUE SPACE. 02530000
                88  CURSOR-ON-MBR               VALUE 'MBR'.            02540000
                88  CURSOR-ON-MAC               VALUE 'MAC'.            02550000
                88  CURSOR-ON-MRR               VALUE 'MRR'.            02560000
                88  CURSOR-ON-MNAME             VALUE 'NM1'.            02570000
                88  CURSOR-ON-MNAME2            VALUE 'NM2'.            02580000
                88  CURSOR-ON-MCSTP             VALUE 'STP'.            02590000
                88  CURSOR-ON-MSSN1             VALUE 'SS1'.            02600000
                88  CURSOR-ON-MSSN2             VALUE 'SS2'.            02610000
                88  CURSOR-ON-MCD               VALUE 'CD '.            02620000
                88  CURSOR-ON-MBAL01            VALUE 'B1 '.            02630000
                88  CURSOR-ON-MBAL02            VALUE 'B2 '.            02640000
                88  CURSOR-ON-MBAL05            VALUE 'B5 '.            02650000
                88  CURSOR-ON-MSMA              VALUE 'SM '.            02660000
                88  CURSOR-ON-MQTY              VALUE 'QT '.            02670000
                88  CURSOR-ON-MSECR             VALUE 'SR '.            02680000
                88  CURSOR-ON-MDESC             VALUE 'D1 '.            02690000
                88  CURSOR-ON-MAMT              VALUE 'AM '.            02700000
                88  CURSOR-ON-MWI               VALUE 'WI '.            02710000
                88  CURSOR-ON-MTYPE             VALUE 'TP '.            02720000
                88  CURSOR-ON-MSTTL             VALUE 'TL '.            02730000
                88  CURSOR-ON-MSRSN             VALUE 'RS '.            02740000
                88  CURSOR-ON-MDESC2            VALUE 'D2 '.            02750000
                88  CURSOR-ON-MDESC3            VALUE 'D3 '.            02760000
                88  CURSOR-ON-MSUBM             VALUE 'SB '.            02770000
                88  CURSOR-ON-MSECC             VALUE 'SC '.            02780000
                88  CURSOR-ON-MREJ              VALUE 'RJ '.            02790000
                88  CURSOR-ON-MREJC             VALUE 'RC '.            02800000
                88  CURSOR-ON-MNEXT             VALUE 'NX '.            02810000
                88  CURSOR-ON-MMBR              VALUE 'BR '.            02820000
                88  CURSOR-ON-MMAC              VALUE 'AC '.            02830000
                88  CURSOR-ON-MMRR              VALUE 'RR '.            02840000
                88  CURSOR-ON-MCBRKR            VALUE 'BK '.            02850000
                88  CURSOR-ON-MTFR              VALUE 'TR '.            02860000
                88  CURSOR-ON-MSTAT             VALUE 'ST '.            02870000
LRM016          88  CURSOR-ON-MDEL              VALUE 'DX '.                    
01/08       05  WS-STATUS-TABLE.                                        02880000
                10  MSG-100.                                            02890000
                    15  MSG-100-X          PIC X(11)  VALUE             02900000
                       '100/REQUEST'.                                   02910000
                    15  FILLER             PIC X(03)  VALUE ' - '.      02920000
                    15  MSG-100-N          PIC X(02).                   02930000
                10  MSG-110.                                            02940000
                    15 MSG-110-X           PIC X(18)  VALUE             02950000
                       '110/REQUEST ADJUST'.                            02960000
                    15  FILLER             PIC X(03)  VALUE ' - '.      02970000
                    15  MSG-110-N          PIC X(02).                   02980000
                10  MSG-120.                                            02990000
                    15  MSG-120-X          PIC X(20)  VALUE             03000000
                        '120/REQUEST ADJ PAST'.                         03010000
                    15  FILLER             PIC X(03)  VALUE ' - '.      03020000
                    15  MSG-120-N          PIC X(02).                   03030000
                10  MSG-130.                                            03040000
                    15 MSG-130-X           PIC X(16)  VALUE             03050000
                        '130/REQUEST PAST'.                             03060000
                    15  FILLER             PIC X(03)  VALUE ' - '.      03070000
                    15  MSG-130-N          PIC X(02).                   03080000
                10  MSG-140.                                            03090000
                    15 MSG-140-X           PIC X(20)  VALUE             03100000
                        '140/REQUEST REJECTED'.                         03110000
                    15  FILLER             PIC X(03)  VALUE ' - '.      03120000
                    15  MSG-140-N          PIC X(02).                   03130000
                10  MSG-200.                                            03140000
                    15 MSG-200-X           PIC X(10)  VALUE             03150000
                       '200/REVIEW'.                                    03160000
                    15  FILLER             PIC X(03)  VALUE ' - '.      03170000
                    15  MSG-200-N          PIC X(02).                   03180000
                10  MSG-210.                                            03190000
                    15 MSG-210-X           PIC X(17)  VALUE             03200000
                       '210/REVIEW ADJUST'.                             03210000
                    15  FILLER             PIC X(03)  VALUE ' - '.      03220000
                    15  MSG-210-N          PIC X(02).                   03230000
                10  MSG-220.                                            03240000
                    15 MSG-220-X           PIC X(16)  VALUE             03250000
                       '220/REVIEW ERROR'.                              03260000
                    15  FILLER             PIC X(03)  VALUE ' - '.      03270000
                    15  MSG-220-N          PIC X(02).                   03280000
                10  MSG-230.                                            03290000
                    15 MSG-230-X           PIC X(22)  VALUE             03300000
                       '230/REVIEW ACCELERATED'.                        03310000
                    15  FILLER             PIC X(03)  VALUE ' - '.      03320000
                    15  MSG-230-N          PIC X(02).                   03330000
DJ0001          10  MSG-240.                                            03290000
DJ0001              15 MSG-240-X           PIC X(19)  VALUE             03300000
DJ0001                 '240/REV-ADJ-REC-ACL'.                           03310000
DJ0001              15  FILLER             PIC X(03)  VALUE ' - '.      03320000
DJ0001              15  MSG-240-N          PIC X(02).                   03330000
                10  MSG-300.                                            03340000
                    15 MSG-300-X           PIC X(15)  VALUE             03350000
                       '300/SETTLE PREP'.                               03360000
                    15  FILLER             PIC X(03)  VALUE ' - '.      03370000
                    15  MSG-300-N          PIC X(02).                   03380000
                10  MSG-310.                                            03390000
                    15 MSG-310-X           PIC X(16)  VALUE             03400000
                       '310/SETTLE CLOSE'.                              03410000
                    15  FILLER             PIC X(03)  VALUE ' - '.      03420000
                    15  MSG-310-N          PIC X(02).                   03430000
                10  MSG-400.                                            03440000
                    15  MSG-400-X           PIC X(15)  VALUE            03450000
                        '400/CLOSE PURGE'.                              03460000
                    15  FILLER             PIC X(03)  VALUE ' - '.      03470000
                    15  MSG-400-N          PIC X(02).                   03480000
                10  MSG-500.                                            03490000
                    15  MSG-500-X           PIC X(25)  VALUE            03500000
                       '500/MEMO PARTIAL TRANSFER'.                     03510000
                    15  FILLER             PIC X(03)  VALUE ' - '.      03520000
                    15  MSG-500-N          PIC X(02).                   03530000
                10  MSG-510.                                            03540000
                    15  MSG-510-X           PIC X(23)  VALUE            03550000
                       '510/MEMO PURGE PART TFR'.                       03560000
                    15  FILLER             PIC X(03)  VALUE ' - '.      03570000
01/08               15  MSG-510-N          PIC X(02).                   03580000
            05  WS-MSG-OUT                 PIC X(79).                   03590000
            05  WS-CICS-MSG.                                            03600000
                10  WS-CICS-DISPLAY        PIC X(21) VALUE SPACES.      03610000
                10  FILLER                 PIC X     VALUE SPACES.      03620000
                10  WS-DISPLAY-CICS-DESC.                               03630000
                    15  FILLER             PIC X(20) VALUE              03640000
                          'CICS RETURN CODE = '.                        03650000
                    15  FILLER             PIC X(02) VALUE SPACES.      03660000
                    15  WS-CICS-RC         PIC X(06) VALUE SPACES.      03670000
                    15  FILLER             PIC X(05) VALUE SPACES.      03680000
                10  FILLER                 PIC X(21) VALUE              03690000
LRM009                    'CONTACT HELP DESK'.                          03700000
                                                                        03710000
LRM001     05  WS-COMBO-SUBM-UPD-IND     PIC X(01) VALUE 'N'.                   
LRM001        88 HAVE-COMBO-UPDATE       VALUE 'Y'.                             
LRM001     05  WS-SAVE-MSUBM             PIC X(01) VALUE LOW-VALUES.            
LRM001     05  WS-SAVE-MCD               PIC X(01) VALUE LOW-VALUES.            
LRM026     05  WS-FCUR-BAL-REQEST-SW     PIC X(01) VALUE 'N'.                   
LRM026         88 WS-FCUR-BAL-REQEST               VALUE 'Y'.                   
LRM029 01  WS-BDF-SECURITY-TABLE.                                               
LRM029     03  WS-BDF-COUNT        PIC 9(02).                                   
LRM029     03  WS-BDF-SEC-ENTRY OCCURS 10 TIMES PIC X(07).                      
LRM029 01  LB-BANK-COMM-AREA.                                                   
LRM029     COPY LBBCOMM.                                                        
           EJECT                                                        03860000
      ****************************************************************  03870000
      *                   ACATEDIT  WORK AREA                        *  03880000
      ****************************************************************  03890000
       01  EDIT-AMT-AREA.                                               03900000
           05  WK-AMT-CODE                PIC X(01) VALUE 'D'.          03910000
           05  WK-AMT-NUM-ITEM            PIC S9(03) COMP-3 VALUE +1.   03920000
           05  WK-AMT-IN-LEN              PIC S9(03) COMP-3 VALUE +19.  03930000
           05  WK-AMT-OUT-LEN             PIC S9(03) COMP-3 VALUE +17.  03940000
           05  WK-AMT-IN                  PIC X(19) VALUE LOW-VALUE.    03950000
           05  WK-AMT-OUT                 PIC S9(15)V99.                03960000
           05  WK-AMT-DECIMAL-LEN         PIC S9(03) COMP-3 VALUE +2.   03970000
           05  WK-AMT-COMMAR              PIC X(01) VALUE 'Y'.          03980000
           05  WK-AMT-RET-CODE            PIC X(01) VALUE SPACE.        03990000
           05  FILLER                     PIC X(01) VALUE HIGH-VALUE.   04000000
                                                                        04010000
       01  WK-FORMATTED-AMT.                                            04020000
           05  WK-AMT-COMMAS-3      PIC ZZZ,ZZZ,ZZZ,ZZZ.99-.            04030000
                                                                        04040000
       01  EDIT-QTY-AREA.                                               04050000
           05  WK-QTY-CODE                PIC X(01) VALUE 'D'.          04060000
           05  WK-QTY-NUM-ITEM            PIC S9(03) COMP-3 VALUE +1.   04070000
           05  WK-QTY-IN-LEN              PIC S9(03) COMP-3 VALUE +22.  04080000
           05  WK-QTY-OUT-LEN             PIC S9(03) COMP-3 VALUE +21.  04090000
           05  WK-QTY-IN                  PIC X(22) VALUE LOW-VALUE.    04100000
           05  WK-QTY-OUT.                                              04110000
               07  FILLER                 PIC X(04).                    04120000
               07  WK-QTY-OUT-D4          PIC S9(13)V9999.              04130000
           05  WK-QTY-DECIMAL-LEN         PIC S9(03) COMP-3 VALUE +4.   04140000
           05  WK-QTY-COMMAR              PIC X(01) VALUE 'Y'.          04150000
           05  WK-QTY-RET-CODE            PIC X(01) VALUE SPACE.        04160000
           05  FILLER                     PIC X(01) VALUE HIGH-VALUE.   04170000
                                                                        04180000
        01  WS-MQTY-AREA.                                               04190000
           05  WS-MQTY-ED-D4           PIC ZZZZ,ZZZ,ZZZ,ZZZ.9999-.      04200000
       EJECT                                                            04210000
       COPY SECLINKC.                                                   04220000
            EJECT                                                       04230000
       COPY ATTR.                                                       04240000
            EJECT                                                       04250000
       COPY DFHAID.                                                     04260000
            EJECT                                                       04270000
       COPY ACATCOM.                                                    04280000
            EJECT                                                       04290000
ET0003 01  ACATRSTIO-CALL-AREA.                                                 
ET0003     COPY ACATRSIO.                                                       
ET0003     EJECT                                                                
LRM021     COPY CATACTYP.                                                       
           EJECT                                                                
LRM003*01  MRGN-COMMAREA.                                               04300000
LRM003**** COPY  IOCOMALP.                                              04320000
LRM003 01  CUSHOLIO-COMM-AREA.                                                  
LRM003     COPY  CUSHOLIO REPLACING ==:IO:== BY ==IOH==.                        
           SKIP3                                                                
LRM003 01  CUSBALIO-COMM-AREA.                                                  
LRM003     COPY  CUSBALIO REPLACING ==:IO:== BY ==IOB==.                        
           EJECT                                                        04330000
      ******************************************************************04360000
      *           FOLLOWING THREE(3) KEYS ARE USED FOR :               *04370000
      *  1) PSKEY IS USED THE SAME WAY AS IF IT REDEFINED THE          *04380000
      *      IO-HOL-KEY, IT IS USED TO HOLD CONTENTES OF IO-HOL-KEY    *04390000
      *      DURRING VALIDATION.                                       *04400000
      *  2)  SAVEKEY IS USED TO HOLD THE CURRENT KEY THAT IS BEEING    *04410000
      *        LOOKED AT.                                              *04420000
      *  3)  TEMPKEY IS USED TO HOLD CHLD-KEY DURRING VALIDATCIO, AND  *04430000
      *        REFLECTS CHLD-KEY DURRING EXECUTION.                    *04440000
      ******************************************************************04450000
       01  PSKEY.                                                       04460000
           03  MAIN-PSKEY.                                              04470000
               05  MAIN-KEY.                                            04480000
                   10  KEY-CLIENT                    PIC 9(05) COMP-3.  04490000
TCK001             10  KEY-BRANCH                PIC X(03).             04510000
TCK001             10  KEY-ACCNT                 PIC X(05).             04530000
               05  KEY-CURCOD.                                          04540000
                   10  KEY-CURR-CODE                 PIC 9(6).          04550000
               05  KEY-REC-TYPE                  PIC X(02).             04560000
           03  KEY-ACCNT-TYPE.                                          04570000
TCK001         05  ZERO-ACCNT                PIC X.                     04580000
               05  PS-ACCNT-TYPE             PIC X.                     04590000
           03  KEY-ACCOUNT-TYPE-NUM REDEFINES                           04600000
                 KEY-ACCNT-TYPE              PIC 99.                    04610000
           03  KEY-CUSIP-NUM                 PIC X(15).                 04620000
           03  KEY-WIC-KEY                   PIC X(01).                 04630000
TCK001     03  FILLER                        PIC X      VALUE SPACE.    04640000
           03  KEY-SEQ-KEY                   PIC 9(04).                 04650000
           SKIP3                                                        04660000
       01  SAVEKEY.                                                     04670000
           03  MAIN-SAVKEY.                                             04680000
               05  SVKEY.                                               04690000
                   10  SAV-KEY.                                         04700000
                       15  SAV-CLIENT        PIC 9(05) COMP-3.          04710000
TCK001                 15  SAV-BRANCH        PIC X(03).                 04730000
TCK001                 15  SAV-ACCNT         PIC X(05).                 04750000
                   10  SAV-CURCOD.                                      04760000
                       15  SAV-CURR-CODE     PIC 9(6).                  04770000
               05  SAV-REC-TYPE              PIC X(02).                 04780000
           03  SAV-ACCNT-TYPE                PIC X(02).                 04790000
           03  SAV-ACCOUNT-TYPE-NUM REDEFINES                           04800000
               SAV-ACCNT-TYPE                PIC 9(02).                 04810000
           03  SAV-CUSIP-NUM                 PIC X(15).                 04820000
           03  SAV-WIC-KEY                   PIC X(01).                 04830000
TCK001     03  FILLER                        PIC X(01)  VALUE SPACE.    04840000
           03  SAV-SEQ-KEY                   PIC 9(04).                 04850000
       01  TEMPKEY.                                                     04860000
           03  MAIN-TEMPKEY.                                            04870000
               05  TMPKEY.                                              04880000
                   10  TEMP-KEY.                                        04890000
                       15  TEMP-CLIENT        PIC 9(05) COMP-3.         04900000
TCK001                 15  TEMP-BRANCH        PIC X(03).                04920000
TCK001                 15  TEMP-ACCNT         PIC X(05).                04940000
                   10  TEMP-CURCOD.                                     04950000
                       15  TEMP-CURR-CODE     PIC 9(6).                 04960000
               05  TEMP-REC-TYPE              PIC X(02).                04970000
           03  TEMP-ACCNT-TYPE                PIC X(02).                04980000
           03  TEMP-ACCOUNT-TYPE-NUM REDEFINES                          04990000
               TEMP-ACCNT-TYPE.                                         05000000
               05  FILLER                     PIC 9.                    05010000
               05  TEMP-ACC-TYPE              PIC 9.                    05020000
           03  TEMP-CUSIP-NUM.                                          05030000
               05  TEMP-SEC                   PIC X(7).                 05040000
               05  FILLER                     PIC X(8).                 05050000
           03  TEMP-WIC-KEY                   PIC X(01).                05060000
TCK001     03  FILLER                         PIC X(01)  VALUE SPACE.   05070000
           03  TEMP-SEQ-KEY                   PIC 9(04).                05080000
                                                                        05090000
       01  WS-BALNC-KEY.                                                05100000
           05  WS-BALNC-CLIENT                   PIC 9(5) COMP-3.       05110000
TCK001     05  WS-BALNC-BRANCH                   PIC X(03).             05130000
TCK001     05  WS-BALNC-ACCOUNT                  PIC X(05).             05150000
           05  WS-BALNC-ID                       PIC 9(02) VALUE 28.    05160000
           05  WS-BALNC-CURR-X.                                         05170000
               07  WS-BALNC-CURR                 PIC 9(06).             05170000
TCK001     05  FILLER                            PIC X(01) VALUE SPACE. 05180000
       EJECT                                                            05190000
01/27  01  WS-TWA-AREA.                                                 05200000
           03 TWA-ACAT10IO-AREA.                                        05210000
              05 TWA-ACAT10IO-FIRST-TIME-SW       PIC X(01).            05220000
                 88  TWA-ACAT10IO-FIRST-TIME      VALUE 'Y'.            05230000
              05 TWA-DB2-INFO.                                          05240000
                 07  TWA-FUNCTION                     PIC X(02).        05250000
                     88 TWA-SRCH-VASSET                 VALUE 'RA'.     05260000
                     88 TWA-SRCH-VOPTN                  VALUE 'RO'.     05270000
01/23                88 TWA-SRCH-VINITOPN               VALUE 'RP'.     05280000
                     88 TWA-SRCH-VTRNFR                 VALUE 'RT'.     05290000
                     88 TWA-UPDT-VTRNFR                 VALUE 'UT'.     05300000
                     88 TWA-INSR-VINITRNF               VALUE 'II'.     05310000
                     88 TWA-DLTE-VINITRNF               VALUE 'DI'.     05320000
                     88 TWA-UPDT-VINITRNF               VALUE 'UI'.     05330000
                     88 TWA-INSR-VINITAST               VALUE 'IA'.     05340000
                     88 TWA-DLTE-VINITAST               VALUE 'DA'.     05350000
                     88 TWA-UPDT-VINITAST               VALUE 'UA'.     05360000
01/23                88 TWA-ISRT-VINITOPN               VALUE 'IO'.     05370000
01/23                88 TWA-UPDT-VINITOPN               VALUE 'UO'.     05380000
01/23                88 TWA-DLRT-VINITOPN               VALUE 'DO'.     05390000
                 07  TWA-SRCH-ACTION.                                   05400000
                     10  TWA-SEARCH-VTRNFR            PIC X(01).        05410000
                         88 TWA-SRCH-VTRNFR-FWD          VALUE 'F'.     05420000
                         88 TWA-SRCH-VTRNFR-BWD          VALUE 'B'.     05430000
                         88 TWA-SRCH-VTRNFR-PND          VALUE 'P'.     05440000
                     10  TWA-SEARCH-VINITAST          PIC X(01).        05450000
                         88 TWA-SRCH-VINITAST-FWD          VALUE 'F'.   05460000
                         88 TWA-SRCH-VINITAST-BWD          VALUE 'B'.   05470000
                     10 TWA-PREV-VINITAST-ACT     PIC X(01).            05480000
                         88 TWA-PREV-VINITAST-FWD      VALUE 'F'.       05490000
                         88 TWA-PREV-VINITAST-BWD      VALUE 'B'.       05500000
                     10 TWA-VINITAST-FETCH-SW     PIC X(01).            05510000
                         88 TWA-VINITAST-FETCHED       VALUE 'Y'.       05520000
                         88 TWA-VINITAST-NOT-FETCHED   VALUE 'N'.       05530000
                     10  TWA-SEARCH-VASSET            PIC X(01).        05540000
                         88 TWA-SRCH-VASSET-FWD          VALUE 'F'.     05550000
                         88 TWA-SRCH-VASSET-BWD          VALUE 'B'.     05560000
                     10 TWA-VASSET-FETCH-SW           PIC X(01).        05570000
                         88 TWA-VASSET-FETCHED           VALUE 'Y'.     05580000
                         88 TWA-VASSET-NOT-FETCHED       VALUE 'N'.     05590000
                     10  TWA-PREV-VASSET-ACT          PIC X(01).        05600000
                         88 TWA-PREV-VASSET-FWD          VALUE 'F'.     05610000
                         88 TWA-PREV-VASSET-BWD          VALUE 'B'.     05620000
03/22                10  TWA-SUPER-SIGN-ON-IND        PIC X(01).        05630000
                         88 TWA-SUPER-SIGN-ON  VALUES ARE 'B' 'U'.      05640000
                 05  TWA-RETURN-CODES.                                  05650000
                     07 TWA-DB2-ERROR-SW              PIC X(01).        05660000
                        88 TWA-DB2-ERROR                  VALUE 'Y'.    05670000
                     07 TWA-VTRNFR-SW                 PIC X(01).        05680000
                        88 TWA-VTRNFR-FOUND               VALUE 'Y'.    05690000
                        88 TWA-VTRNFR-NOT-FOUND           VALUE 'N'.    05700000
                        88 TWA-VTRNFR-UPDATED             VALUE 'U'.    05710000
11/18                   88 TWA-VTRNFR-FIRST               VALUE 'F'.    05720000
11/18                   88 TWA-VTRNFR-LAST                VALUE 'L'.    05730000
01/25                07  TWA-TIF-RETURN               PIC X(01).        05740000
01/25                   88 TWA-TIF-ACCT-CHG               VALUE 'C'.    05750000
01/25                   88 TWA-TIF-ACCT-NEW               VALUE 'N'.    05760000
01/25                   88 TWA-TIF-UPDT                   VALUE 'U'.    05770000
                     07 TWA-VINITRNF-SW               PIC X(01).        05780000
                        88 TWA-VINITRNF-FOUND               VALUE 'Y'.  05790000
                        88 TWA-VINITRNF-NOT-FOUND           VALUE 'N'.  05800000
                        88 TWA-VINITRNF-UPDATED             VALUE 'U'.  05810000
                        88 TWA-VINITRNF-INSERTED            VALUE 'I'.  05820000
                        88 TWA-VINITRNF-DELETED             VALUE 'D'.  05830000
                     07 TWA-VASSET-SW                 PIC X(01).        05840000
                        88 TWA-VASSET-FOUND                 VALUE 'Y'.  05850000
                        88 TWA-VASSET-NOT-FOUND             VALUE 'N'.  05860000
                        88 TWA-VASSET-UPDATED               VALUE 'U'.  05870000
11/18                   88 TWA-VASSET-FIRST                 VALUE 'F'.  05880000
11/18                   88 TWA-VASSET-LAST                  VALUE 'L'.  05890000
                     07 TWA-VINITAST-SW               PIC X(01).        05900000
                        88 TWA-VINITAST-FOUND           VALUE 'Y'.      05910000
                        88 TWA-VINITAST-NOT-FOUND       VALUE 'N'.      05920000
                        88 TWA-VINITAST-UPDATED         VALUE 'U'.      05930000
                        88 TWA-VINITAST-INSERTED        VALUE 'I'.      05940000
                        88 TWA-VINITAST-DELETED         VALUE 'D'.      05950000
11/18                   88 TWA-VINITAST-FIRST           VALUE 'F'.      05960000
11/18                   88 TWA-VINITAST-LAST            VALUE 'L'.      05970000
01/21                07 TWA-VOPTN-SW                  PIC X(01).        05980000
                        88 TWA-VOPTN-FOUND               VALUE 'Y'.     05990000
                        88 TWA-VOPTN-NOT-FOUND           VALUE 'N'.     06000000
01/21                07 TWA-VINITOPN-SW               PIC X(01).        06010000
                        88 TWA-VINITOPN-FOUND            VALUE 'Y'.     06020000
                        88 TWA-VINITOPN-NOT-FOUND        VALUE 'N'.     06030000
                        88 TWA-VINITOPN-UPDATED          VALUE 'U'.     06040000
                        88 TWA-VINITOPN-INSERTED         VALUE 'I'.     06050000
                        88 TWA-VINITOPN-DELETED          VALUE 'D'.     06060000
                     07  TWA-SQLCA.                                     06070000
                        10  TWA-SQLCAID               PIC X(08).        06080000
                        10  TWA-SQLCODE               PIC S9(9) COMP-4. 06090000
                        10  TWA-SQLERRM.                                06100000
                            13  TWA-SQLERRML          PIC S9(04) COMP.  06110000
                            13  TWA-SQLERRMC          PIC X(70).        06120000
               05  TWA-ACAT10IO-COUNT.                                  06130000
                   07 TWA-ACAT10IO-VTRNFR-COUNT       PIC S9(9) COMP.   06140000
                   07 TWA-ACAT10IO-VINITAST-COUNT     PIC S9(9) COMP.   06150000
                   07 TWA-ACAT10IO-VINITAST-COUNT-SV  PIC S9(9) COMP.   06160000
                   07 TWA-ACAT10IO-VASSET-COUNT       PIC S9(9) COMP.   06170000
                   07 TWA-ACAT10IO-VASSET-COUNT-SV    PIC S9(9) COMP.   06180000
                   07 TWA-ACAT10IO-MAX-VINITAST-SEQ   PIC S9(4) COMP.   06190000
                   07 TWA-ACAT10IO-MAX-VASSET-SEQ     PIC S9(4) COMP.   06200000
LRM016             07 TWA-ASSET-DELETE-COUNT          PIC S9(9) COMP.           
               05 TWA-SV-KEYS.                                          06210000
                   10 TWA-SV-CLIENT-NBR         PIC X(04).              06220000
                   10 TWA-SV-ACAT-CNTL-NO       PIC X(14).              06230000
                   10 TWA-SV-BRANCH-CD          PIC X(03).              06240000
                   10 TWA-SV-ACCT-CD            PIC X(05).              06250000
                   10 TWA-SV-RR-CD              PIC X(03).              06260000
                   10 TWA-SV-BRKR               PIC X(04).              06270000
                   10 TWA-SV-TFR                PIC X(03).              06280000
                   10 TWA-SV-STCD               PIC X(03).              06290000
                   10 TWA-SV-ASSET-SEQ-NBR      PIC S9(4) COMP.         06300000
                   10 TWA-SV-INITAST-SEQ-NBR    PIC S9(4) COMP.         06310000
                   10 TWA-SV-DLVR-NBR           PIC X(04).              06320000
                   10 TWA-SV-RCV-NBR            PIC X(04).              06330000
                   10 TWA-SV-ACCT-DLVR-NBR      PIC X(20).              06340000
                   10 TWA-SV-ACCT-RCV-NBR       PIC X(20).              06350000
                   10 TWA-SV-STTLM-LCTN-CD      PIC X(02).              06360000
                   10 TWA-SV-CNTRY-CD           PIC X(02).              06370000
                   10 TWA-SV-SEC-ISSUE-CD       PIC X(09).              06380000
                   10 TWA-SV-SEC-CDG-CD         PIC X(01).              06390000
LRM026             10 TWA-SV-CRNCY-CD           PIC X(03).              06390000
ET0003         05  TWA-ACCT-FREEZ-AREA.                                 06400000
ET0003             10 TWA-ACCT-FREEZ-PROCESS    PIC X(01).              06400000
ET0003             10 TWA-ACCT-FREEZ-TYPE       PIC X(01).              06400000
               05  ACAT10DA-TWA-AREA.                                   06400000
LRM004             10 TWA-SNON-ID               PIC X(04).                      
ET0004             10 TWA-NET-NAME              PIC X(08).                      
ET0004             10 TWA-USER-ID               PIC X(08).                      
ET0004             10 TWA-USER-NAME             PIC X(20).                      
                   10 TWA-SCREEN-IND            PIC X(01).              06410000
                   10 TWA-CLIENT-NBR            PIC X(04).              06420000
                   10 TWA-ACAT-CONTROL-NBR      PIC X(14).              06430000
                   10 TWA-BRANCH-CD             PIC X(03).              06440000
                   10 TWA-ACCT-CD               PIC X(05).              06470000
                   10 TWA-RR-CD                 PIC X(03).              06500000
                   10 TWA-TFR-TYPE              PIC X(03).              06510000
                   10 TWA-STCD                  PIC X(03).              06520000
                   10 TWA-DAYS                  PIC 9(02).              06530000
                   10 TWA-RCV-NBR               PIC X(04).              06540000
                   10 TWA-DLVR-NBR              PIC X(04).              06550000
                   10 TWA-ACCT-DLVR-NBR         PIC X(20).              06560000
                   10 TWA-ACCT-RCV-NBR          PIC X(20).              06570000
                   10 TWA-RCV-CUST-NM           PIC X(60).              06580000
                   10 TWA-RCV-SS-PRIM-NBR       PIC X(09).              06590000
                   10 TWA-RCV-SS-SCNDY-NBR      PIC X(09).              06600000
                   10 TWA-RCV-ACCT-TYPE-CD      PIC X(02).              06610000
                   10 TWA-INIT-TRANS-TYPE-CD    PIC X(01).              06620000
                   10 TWA-TIF-NSCC-PEND-CD      PIC X(01).              06630000
                   10 TWA-TRNFR-TYPE-RJCT-CD    PIC X(02).              06640000
                   10 TWA-STTLM-DT              PIC X(10).              06650000
                   10 TWA-VTRNFR-CMNT           PIC X(120).             06660000
06/04              10 TWA-ALERT-IND             PIC X(01).              06670000
01/04              10 TWA-BAL01               PIC S9(15)V9(2) COMP-3.   06680000
12/15              10 TWA-BAL01-STTLM-RSN-CD    PIC X(04).              06690000
                      88 TWA-BAL01-CREDIT         VALUE 'CRED'.         06700000
                      88 TWA-BAL01-DEBIT          VALUE 'DEB '.         06710000
01/21              10 TWA-BAL01-SEQ-NBR         PIC S9(4) COMP.         06720000
01/27              10 TWA-BAL01-CMNT            PIC X(120).             06730000
01/04              10 TWA-BAL02               PIC S9(15)V9(2) COMP-3.   06740000
12/15              10 TWA-BAL02-STTLM-RSN-CD    PIC X(04).              06750000
                      88 TWA-BAL02-CREDIT         VALUE 'CRED'.         06760000
                      88 TWA-BAL02-DEBIT          VALUE 'DEB '.         06770000
01/21              10 TWA-BAL02-SEQ-NBR         PIC S9(4) COMP.         06780000
01/27              10 TWA-BAL02-CMNT            PIC X(120).             06790000
01/04              10 TWA-BAL05               PIC S9(15)V9(2) COMP-3.   06800000
12/15              10 TWA-BAL05-STTLM-RSN-CD    PIC X(04).              06810000
                      88 TWA-BAL05-CREDIT         VALUE 'CRED'.         06820000
                      88 TWA-BAL05-DEBIT          VALUE 'DEB '.         06830000
01/21              10 TWA-BAL05-SEQ-NBR         PIC S9(4) COMP.         06840000
01/27              10 TWA-BAL05-CMNT            PIC X(120).             06850000
01/04              10 TWA-SMA                PIC S9(15)V9(2) COMP-3.    06860000
01/21              10 TWA-SMA-SEQ-NBR           PIC S9(4) COMP.         06870000
01/21              10 TWA-SMA-CMS-CD            PIC X(01).              06880000
01/27              10 TWA-SMA-CMNT              PIC X(120).             06890000
ET0002             10 TWA-RETURN-MSG            PIC X(79).              06900000
               05 ACAT10IO-TWA-EXCEPTIONS.                              06910000
                   10 FILLER                      PIC X.                06920000
                   10 TWA-ACCT-ACTIVITY-IND       PIC X(1).             06930000
                   10 TWA-ACCT-ORDERS-IND         PIC X(1).             06940000
                   10 TWA-ACCT-RJCT-RSBM-IND      PIC X(1).             06950000
                   10 TWA-ACCT-DB-BAL-T1-IND      PIC X(1).             06960000
                   10 TWA-ACCT-MRGN-DB-IND        PIC X(1).             06970000
                   10 TWA-ACCT-SHRT-PSTN-IND      PIC X(1).             06980000
                   10 TWA-ACCT-SEC-RSTRD-IND      PIC X(1).             06990000
                   10 TWA-ACCT-AST-EXCS-IND       PIC X(1).             07000000
                   10 TWA-ACCT-OPTN-PSTN-IND      PIC X(1).             07010000
                   10 TWA-ACCT-LTD-PRTNR-IND      PIC X(1).             07020000
                   10 TWA-ACCT-TIN-MSMTH-IND      PIC X(1).             07030000
                   10 TWA-ACCT-DPLCT-TRN-IND      PIC X(1).             07040000
                   10 TWA-ACCT-CUST-70-IND        PIC X(1).             07050000
                   10 TWA-ACCT-QULFD-PLN-IND      PIC X(1).             07060000
                   10 TWA-ACCT-MNGD-IND           PIC X(1).             07070000
                   10 TWA-ACCT-PRVT-RNG-IND       PIC X(1).             07080000
                   10 TWA-ACCT-BRKR-TIF-IND       PIC X(1).             07090000
                   10 TWA-NSCC-NON-ADP-IND        PIC X(1).             07100000
                   10 TWA-COMMENTS-IND            PIC X(1).             07110000
01/27              10 TWA-CUST-TYPE-MISMATCH      PIC X(1).             07120000
01/27              10 TWA-CMNT-STTS-CD            PIC X(1).             07140000
04/21              10 TWA-TRNFR-RJC1-CD           PIC X(2).             07150000
04/21              10 TWA-TRNFR-RJC2-CD           PIC X(1).             07160000
LRM002             10 TWA-TRNFR-ACCT-CLT-RSCND-IND PIC X(01).                   
LRM002             10 TWA-TRNFR-ACCT-LGL-BLK-IND   PIC X(01).                   
LRM002             10 TWA-TRNFR-ACCT-RB-SEC-IND    PIC X(01).                   
ET0003             10 TWA-ACCT-FRZN-IND            PIC X(01).           06670000
LRM007             10 TWA-STTLM-TM-CD              PIC X(01).                   
LRM008             10 TWA-ADOPT-AGRMT-IND          PIC X(01).                   
LRM024             10 TWA-NETWORK-LVL4-IND         PIC X(01).                   
LRM010             10 TWA-CVRSN-ACCT-NBR           PIC X(12).                   
LRM022             10 TWA-NA-SS-PRIM-NBR           PIC X(09).           06590000
LRM022             10 TWA-NA-SS-SCNDY-NBR          PIC X(09).           06600000
               05  ACAT10DC-TWA-AREA.                                   07170000
                   10 TWA-SEC-NBR                 PIC X(12).            07180000
                   10 TWA-ADP-NBR                 PIC X(07).            07190000
                   10 TWA-TRANS-TYPE-CD           PIC X(01).            07200000
                   10 TWA-CSH-MGN-SHRT-CD         PIC X(01).            07210000
                      88 TWA-CASH-ASSET           VALUE 'C'.            07220000
                      88 TWA-MARGIN-ASSET         VALUE 'M'.            07230000
                      88 TWA-SHORT-ASSET          VALUE 'S'.            07240000
                   10 TWA-PSTN-CD                 PIC X(01).            07250000
                      88 TWA-SHORT-ASSET-QTY      VALUE 'S'.            07260000
                      88 TWA-LONG-ASSET-QTY       VALUE 'L'.            07270000
                      88 TWA-NA-ASSET-QTY         VALUE 'N'.            07280000
01/21              10 TWA-OPTN-CTGY-CD            PIC X(02).            07290000
01/21              10 TWA-OPT-BS-CD               PIC X(01).            07300000
01/21                 88 TWA-OPT-BUY              VALUE 'B'.            07310000
01/21                 88 TWA-OPT-SELL             VALUE 'S'.            07320000
                   10 TWA-WHEN-ISSUED             PIC X(01).            07330000
                   10 TWA-STTLM-LCTN-CD           PIC X(02).            07340000
                   10 TWA-CNTRY-CD                PIC X(02).            07350000
                   10 TWA-STTLM-RSN-CD            PIC X(04).            07360000
                      88 TWA-CREDIT-BALANCE       VALUE 'CRED'.         07370000
                      88 TWA-DEBIT-BALANCE        VALUE 'DEB '.         07380000
                   10 TWA-VINITAST-NSCC-PEND-CD   PIC X(01).            07400000
LRM011             10 TWA-VINITAST-NSCC-ACK-IND   PIC X(01).            06630000
                   10 TWA-NSCC-WTHLD-CD           PIC X(01).            07410000
01/04              10 TWA-ASSET-QTY          PIC S9(13)V9(4) COMP-3.    07420000
01/04              10 TWA-ASSET-AMT          PIC S9(15)V9(2) COMP-3.    07430000
                   10 TWA-ASSET-DESC.                                   07440000
                      15  TWA-MDESC               PIC X(30).            07450000
                      15  TWA-MDESC2              PIC X(30).            07460000
                      15  TWA-MDESC3              PIC X(30).            07470000
                      15  FILLER                  PIC X(50).            07480000
                   10 TWA-ASSET-CMNT              PIC X(120).           07490000
01/23              10 TWA-OPTN-CMNT-TXT           PIC X(16).            07500000
06/04              10 TWA-RESTRICTED-IND          PIC X(01).            07510000
LRM026             10 TWA-CRNCY-CD                PIC X(03).            06390000
LRM030             10 TWA-WHI-STTS-CD             PIC X(01).                    
               05  TWA-INPUT-AREA.                                      07520000
                 07  ACAT10IO-TWA-INPUT.                                07530000
                   10 TWA-TIF-CHG-AREA.                                 07540000
                      15 TWA-MBR                PIC X(03).              07550000
                      15 TWA-MAC                PIC X(05).              07560000
                      15 TWA-MRR                PIC X(03).              07570000
                      15 TWA-MNAME1             PIC X(30).              07580000
                      15 TWA-MNAME2             PIC X(30).              07590000
                      15 TWA-MCSTP              PIC X(02).              07600000
                      15 TWA-MSSN1.                                     07610000
                         17 TWA-MSSN1A          PIC X(03).              07620000
                         17 FILLER              PIC X.                  07630000
                         17 TWA-MSSN1B          PIC X(02).              07640000
                         17 FILLER              PIC X.                  07650000
                         17 TWA-MSSN1C          PIC X(04).              07660000
                      15 TWA-MSSN2.                                     07670000
                         17 TWA-MSSN2A          PIC X(03).              07680000
                         17 FILLER              PIC X.                  07690000
                         17 TWA-MSSN2B          PIC X(02).              07700000
                         17 FILLER              PIC X.                  07710000
                         17 TWA-MSSN2C          PIC X(04).              07720000
                   10 TWA-MBAL01                PIC X(19).              07730000
12/15              10 TWA-MBAL01-STTLM-RSN-CD   PIC X(04).              07740000
12/15                 88  TWA-MBAL01-CREDIT     VALUE 'CRED'.           07750000
12/15                 88  TWA-MBAL01-DEBIT      VALUE 'DEB '.           07760000
                   10 TWA-MBAL02                PIC X(19).              07770000
12/15              10 TWA-MBAL02-STTLM-RSN-CD   PIC X(04).              07780000
12/15                 88  TWA-MBAL02-CREDIT     VALUE 'CRED'.           07790000
12/15                 88  TWA-MBAL02-DEBIT      VALUE 'DEB '.           07800000
                   10 TWA-MBAL05                PIC X(19).              07810000
12/15              10 TWA-MBAL05-STTLM-RSN-CD   PIC X(04).              07820000
12/15                 88  TWA-MBAL05-CREDIT     VALUE 'CRED'.           07830000
12/15                 88  TWA-MBAL05-DEBIT      VALUE 'DEB '.           07840000
                   10 TWA-MSMA                  PIC X(19).              07850000
                   10 TWA-MSECR                 PIC X(12).              07860000
                   10 TWA-MQTY                  PIC X(22).              07870000
                   10 TWA-MAMT                  PIC X(22).              07880000
                   10 TWA-MNEXT                 PIC X(01).              07890000
                   10 TWA-MCD                   PIC X(01).              07900000
                       88 TWA-CHG-SEC           VALUE 'C'.              07910000
                       88 TWA-DLT-SEC           VALUE 'D'.              07920000
                       88 TWA-WLD-SEC           VALUE 'W'.              07930000
                   10 TWA-MSUBM                 PIC X(01).              07940000
                       88 TWA-SUBM-YES          VALUE 'S'.              07950000
                       88 TWA-SUBM-NO           VALUE ' '.              07960000
                   10 TWA-MSECC                 PIC X(01).              07970000
                       88 TWA-SECC-YES          VALUE 'S'.              07980000
                       88 TWA-SECC-NO           VALUE ' '.              07990000
                   10 TWA-MREJ                  PIC X(02).              08000000
                       88 TWA-REJ-CD-REQ        VALUE '? '.             08010000
                       88 TWA-XFR-REJ-NO        VALUE '  '.             08020000
                       88 TWA-XFR-REJ-YES       VALUE '01' THRU '09'.   08030000
                   10 TWA-MREJC                 PIC X(02).              08040000
                       88 TWA-REJC-CD-REQ       VALUE '? '.             08050000
                       88 TWA-XFR-REJC-NO       VALUE '  '.             08060000
                       88 TWA-XFR-REJC-YES      VALUE '01' THRU '09'.   08070000
                   10 TWA-VINITRNF-TYPE-RJCT-CD PIC X(02).              08080000
                   10 TWA-VINITRNF-NSCC-PEND-CD PIC X(01).              08090000
LRM011             10 TWA-VINITRNF-NSCC-ACK-IND PIC X(01).              08090000
                   10 TWA-VINITRNF-CMNT         PIC X(120).             08100000
LRM016             10 TWA-MDEL                  PIC X(01).              07490000
LRM016             10 TWA-MDEL-ORIG             PIC X(01).              07490000
 01/26           07  TWA-INPUT-CHANGE-SW.                               08110000
                     10 TWA-BAL01-CHANGE-SW PIC X(01).                  08120000
                         88 TWA-BAL01-UPDATED     VALUE 'U'.            08130000
                         88 TWA-BAL01-CHANGED     VALUE 'Y'.            08140000
                         88 TWA-BAL01-NO-CHANGE   VALUE 'N'.            08150000
                     10 TWA-BAL02-CHANGE-SW PIC X(01).                  08160000
                         88 TWA-BAL02-UPDATED     VALUE 'U'.            08170000
                         88 TWA-BAL02-CHANGED     VALUE 'Y'.            08180000
                         88 TWA-BAL02-NO-CHANGE   VALUE 'N'.            08190000
                     10 TWA-BAL05-CHANGE-SW   PIC X(01).                08200000
                         88 TWA-BAL05-UPDATED     VALUE 'U'.            08210000
                         88 TWA-BAL05-CHANGED     VALUE 'Y'.            08220000
                         88 TWA-BAL05-NO-CHANGE   VALUE 'N'.            08230000
                     10 TWA-SMA-CHANGE-SW     PIC X(01).                08240000
                         88 TWA-SMA-UPDATED       VALUE 'U'.            08250000
                         88 TWA-SMA-CHANGED       VALUE 'Y'.            08260000
                         88 TWA-SMA-NO-CHANGE     VALUE 'N'.            08270000
                     10 TWA-QTY-CHANGE-SW     PIC X(01).                08280000
                         88 TWA-QTY-UPDATED       VALUE 'U'.            08290000
                         88 TWA-QTY-CHANGED       VALUE 'Y'.            08300000
                         88 TWA-QTY-NO-CHANGE     VALUE 'N'.            08310000
                     10 TWA-AMT-CHANGE-SW     PIC X(01).                08320000
                         88 TWA-AMT-UPDATED       VALUE 'U'.            08330000
                         88 TWA-AMT-CHANGED       VALUE 'Y'.            08340000
01/26                    88 TWA-AMT-NO-CHANGE     VALUE 'N'.            08350000
                 07 TWA-TRLM-INPUT.                                     08360000
                   10 TWA-MMBR                  PIC X(03).              08370000
                   10 TWA-MMAC                  PIC X(05).              08380000
                   10 TWA-MMRR                  PIC X(03).              08390000
                   10 TWA-MCBRKR                PIC X(04).              08400000
                   10 TWA-MTFR                  PIC X(03).              08410000
                   10 TWA-MSTAT                 PIC X(03).              08420000
               05  TWA-EDIT-FIELDS.                                     08430000
                   10  TWA-BAL01-9              PIC S9(15)V9(2)  COMP-3.08440000
                   10  TWA-BAL01-N              PIC ZZZ,ZZZ,ZZZ,ZZZ.99-.08450000
                   10  TWA-BAL02-9              PIC S9(15)V9(2)  COMP-3.08460000
                   10  TWA-BAL02-N              PIC ZZZ,ZZZ,ZZZ,ZZZ.99-.08470000
                   10  TWA-BAL05-9              PIC S9(15)V9(2)  COMP-3.08480000
                   10  TWA-BAL05-N              PIC ZZZ,ZZZ,ZZZ,ZZZ.99-.08490000
                   10  TWA-SMA-9                PIC S9(15)V9(2)  COMP-3.08500000
                   10  TWA-SMA-N                PIC ZZZ,ZZZ,ZZZ,ZZZ.99-.08510000
                   10  TWA-QTY-9                PIC S9(13)V9(4)  COMP-3.08520000
                   10  TWA-QTY-N                PIC Z,ZZZ,ZZZ,ZZZ.9999-.08530000
                   10  TWA-AMT-9                PIC S9(15)V9(2)  COMP-3.08540000
                   10  TWA-AMT-N                PIC ZZZ,ZZZ,ZZZ,ZZZ.99-.08550000
               05  TWA-ORIGINAL-INPUT.                                  08560000
01/25              10  TWA-O-RCV-NBR            PIC X(04).              08570000
01/25              10  TWA-O-DLVR-NBR           PIC X(04).              08580000
01/25              10  TWA-O-ACCT-DLVR-NBR      PIC X(20).              08590000
01/25              10  TWA-O-ACCT-RCV-NBR       PIC X(20).              08600000
                   10  TWA-ORIG-BAL01           PIC X(19).              08610000
                   10  TWA-ORIG-BAL02           PIC X(19).              08620000
                   10  TWA-ORIG-BAL05           PIC X(19).              08630000
                   10  TWA-ORIG-SMA             PIC X(19).              08640000
                   10  TWA-ORIG-QTY             PIC X(22).              08650000
                   10  TWA-ORIG-AMT             PIC X(22).              08660000
               05  TWA-BAL-TRAN-TYPES.                                  08670000
                   10  TWA-BAL01-TRAN-TYPE      PIC X.                  08680000
                   10  TWA-BAL02-TRAN-TYPE      PIC X.                  08690000
                   10  TWA-BAL05-TRAN-TYPE      PIC X.                  08700000
                   10  TWA-SMA-TRAN-TYPE        PIC X.                  08710000
                                                                        08720000
      *******************************************************           08730000
       01  ACAT10M-IO-AREA                PIC X(1000).                  08740000
      *---  HDR & TRL MAPS --------------*                              08750000
       COPY ACAT00M.                                                    08760000
      *---  ACAT10NT MAP   --------------*                              08770000
       COPY ACAT10M.                                                    08780000
      /                                                                 08790000
      ******************************************************************08800000
       01  ACAT10IO-AREA.                                               08810000
       COPY ACAT10IO.                                                   08820000
      /                                                                 08830000
       01  ACATNAIO-CALL-AREA.                                          08840000
       COPY ACATNAIO.                                                   08850000
      /                                                                 08860000
       01  ACAT90CM-AREA.                                               08870000
       COPY ACAT90TS.                                                   08880000
      /                                                                 08890000
      *** IO AREA FOR FUND REGISTRATION *****                           08900000
       COPY ACATFIO.                                                    08910000
                                                                                
LRM015 01  TABL-RECORD.                                                         
LRM015    03  TABL-KEY4.                                                        
LRM015        05  TABL-LITERAL4  PIC X(33) VALUE 'ACAT        DCYCLE4'.         
LRM018    03  TABL-KEY5.                                                        
LRM018        05  TABL-LITERAL5  PIC X(33) VALUE 'ACAT        DCYCLE5'.         
LRM015    03  TABL-DATA.                                                        
LRM015        05  FILLER         PIC X(01).                                     
LRM015        05  TABL-HHMM      PIC X(04).                                     
LRM015        05  FILLER         PIC X(56).                                     
      /                                                                 08920000
       LINKAGE SECTION.                                                 08930000
       01  DFHCOMMAREA.                                                 08940000
           03  FILLER                           PIC X(2000).            08950000
       COPY TWACOMM.                                                    08960000
01/27 **** MOVE TWA-ACAT10IO-AREA TO WORKING-STORAGE *****              08970000
      /                                                                 08980000
TCK001 COPY ACBALALP.                                                   09000000
      /                                                                 09010000
       COPY ADVMAST.                                                    09020000
      /                                                                 09030000
TCK001 COPY HOLDAVSM.                                                   09050000
      /                                                                 09060000
TCK001 COPY OPNOAVSM.                                                   09080000
      ************************* BOTTOM OF DATA *************************09090000
      /                                                                 09100000
                                                                        09110000
       PROCEDURE DIVISION.                                              09120000
       0000-INITIALIZATION.                                             09130000
           EXEC CICS IGNORE CONDITION   ERROR  ITEMERR MAPFAIL LENGERR  09140000
                     NOSPACE NOSTG  NOTFND    PGMIDERR QIDERR           09150000
           END-EXEC.                                                    09160000
                                                                        09170000
           EXEC CICS ASSIGN TWALENG (TWA-SIZE)                          09180000
           END-EXEC.                                                    09190000
           IF TWA-SIZE = 0                                              09200000
              MOVE LOW-VALUE TO ACAT10AO, ACAT10BO, TRLMAPO             09210000
              MOVE 'TWA SIZE EQUAL ZERO, FATAL ERROR' TO SYSTEM-MSG     09220000
              SET ERROR-YES TO TRUE                                     09230000
              PERFORM  0830-ERROR-RTN.                                  09240000
                                                                        09250000
           EXEC CICS ADDRESS TWA (ADDRESS OF TWA-AREA)                  09260000
           END-EXEC.                                                    09270000
                                                                        09280000
      /                                                                 09290000
       0100-MAIN-PROCESSING.                                            09300000
           MOVE TWA-CLIENT-NO TO TWA-CLIENT-NO-9.                       09310000
           MOVE SPACES        TO SYSTEM-MSG.                            09320000
           MOVE LOW-VALUE  TO ACAT10AO, ACAT10BO, TRLMAPO.              09330000
           MOVE ATT-UNPROT TO MNEXTA MREJA, MREJCA, MSUBMA, MSECCA      09340000
                              MMBRA, MMACA, MMRRA, MMTFRA, MMRDA, MMSDA.09350000
           PERFORM 0150-GET-DATE-TIME-RTN.                              09360000
           MOVE DFHCOMMAREA          TO ACATCOMM-COMMAREA.              09370000
           PERFORM SET-TRANSACTION-SECURITY-RTN.                        09380000
                                                                        09390000
      **  XCTL FROM "PENDING TRANSFER INQ" ************                 09400000
           IF ACAT-CALLING-PROG-NAME = 'ACAT21PT'  AND                  09410000
              ACAT-PROGRAM-NAME = 'ACAT21PT'       AND                  09420000
              ACAT-CONTROL-NBR > SPACE             AND                  09430000
              ACAT-BR-AC > LOW-VALUES                                   09440000
              MOVE EIBTRMID   TO TERM-ID                                09450000
              MOVE 'ACA0'     TO TRAN-ID                                09460000
              PERFORM 0600-DELETE-TSQ                                   09470000
              SET FIRST-TIME TO TRUE                                    09480000
              SET  TWA-ACAT10IO-FIRST-TIME TO TRUE                      09490000
              MOVE ACAT-CONTROL-NBR  TO ACAT10IO-SV-ACAT-CNTL-NBR       09500000
              MOVE LOW-VALUES TO TWA-SV-BRANCH-CD, TWA-SV-ACCT-CD,      09510000
                                 TWA-SV-RR-CD, TWA-SV-BRKR, TWA-SV-TFR, 09520000
                                 TWA-SV-STCD                            09530000
              PERFORM 0400-DISPLAY-ACAT10M                              09540000
              MOVE SPACE TO FIRST-TIME-FLAG, ACAT10IO-FIRST-TIME-SW     09550000
           END-IF.                                                      09560000
                                                                        09570000
           IF EIBAID = DFHPF10    AND                                   09580000
              ACAT-CALLING-PROG-NAME = 'ACAT90CM'                       09590000
              PERFORM 0240-RETURN-FROM-ACAT90CM                         09600000
           ELSE                                                         09610000
TCK002        IF (EIBAID = DFHPF10 OR DFHPF12) AND                      09620000
                 ACAT-CALLING-PROG-NAME = 'ACAT5FSC'                    09630000
                 PERFORM 0260-RETURN-FROM-ACAT5FSC                      09640000
              ELSE                                                      09650000
                 IF ACAT-PROGRAM-NAME = 'ACAT10NT'                      09660000
                     PERFORM 0230-CONTINUE-PROCESS                      09670000
                 ELSE                                                   09680000
                    IF ACAT-PROGRAM-NAME = 'RATT01  '                   09690000
                        MOVE EIBTRMID TO TERM-ID                        09700000
                        MOVE 'ACA0' TO TRAN-ID                          09710000
                        PERFORM 0610-READ-TSQ                           09720000
                        MOVE TWA-ACAT10IO-AREA TO ACAT10IO-AREA         09730000
                        MOVE LOW-VALUE TO ACAT10AO ACAT10BO             09740000
                        PERFORM 0810-MAP-INPUT-AREA THRU 0810-EXIT      09750000
                        PERFORM 0620-WRITE-TSQ                          09760000
                        SET CURSOR-ON-MNEXT TO TRUE                     09770000
                        PERFORM 0800-SEND-MAP-RETURN                    09780000
                    ELSE                                                09790000
                        PERFORM 0200-FIRST-TIME-THRU                    09800000
                    END-IF                                              09810000
                 END-IF                                                 09820000
              END-IF                                                    09830000
           END-IF.                                                      09840000
      /                                                                 09850000
       SET-TRANSACTION-SECURITY-RTN.                                    09860000
LRM004     MOVE ACAT-SIGN-ON-ID TO ACAT10IO-SIGN-ON-ID.                         
ET0004     MOVE ACAT-CICS-NETNAME    TO ACAT10IO-NET-NAME.              43440000
ET0004     MOVE ACAT-CICS-USER-ID    TO ACAT10IO-USER-ID.               43440000
ET0004     MOVE ACAT-CICS-USER-NAME  TO ACAT10IO-USER-NAME.             43440000
           IF ACAT-SUPER-SIGN-ON-UPDATE                                 09870000
              SET ACAT-SIGN-ON-UPDATE TO TRUE                           09880000
           ELSE                                                         09890000
               MOVE 'HU'         TO ACAT-SCREEN-IND                     09900000
               SET ACAT-UPDATE-MODE TO TRUE                             09910000
               MOVE SPACES    TO SECLINK-LIST                           09920000
               MOVE '2'       TO SECLINK-ACTION-CODE                    09930000
               MOVE 'SCON'    TO SECLINK-TYPE                           09940000
               MOVE ACAT-SEC-LIT TO SECLINK-ITEM                        09950000
               PERFORM CALL-SECLINK-RTN                                 09960000
               IF SECLINK-RETURN-CODE = '00' OR '20'                    09970000
                  SET ACAT-SIGN-ON-UPDATE TO TRUE                       09980000
               ELSE                                                     09990000
                  SET ACAT-SIGN-ON-BROWSE TO TRUE                       10000000
           END-IF.                                                      10010000
LRM011*----------------------------------------------------------------         
LRM011* WHEN ASCENDIS CLIENT, AND USER ORIGINALLY HAD UPDATE AUTH, LOOK         
LRM011* FOR SPECIAL OVERRIDE SCON TO ALLOW UPDATE.  IF NOT SPECIAL SCON         
LRM011* ONLY ALLOW UPDATE TO REGISTRATION SCREENS, OTHERWISE BROWSE             
LRM011* ONLY ON ALL FUNCTIONS.                                                  
LRM011*----------------------------------------------------------------         
LRM011     IF ACAT-ASCENDIS-CLIENT                                              
LRM011        IF ACAT-SIGN-ON-UPDATE                                            
LRM011           MOVE SPACES         TO SECLINK-LIST                            
LRM011           MOVE '2'            TO SECLINK-ACTION-CODE                     
LRM011           MOVE 'SCON'         TO SECLINK-TYPE                            
LRM011           MOVE 'ACAXASCENDIS' TO SECLINK-ITEM                            
LRM011           PERFORM CALL-SECLINK-RTN                                       
LRM011           IF (SECLINK-RETURN-CODE = '00' OR '20')                        
LRM011              CONTINUE                                                    
LRM011           ELSE                                                           
LRM011              SET ACAT-SIGN-ON-ASCENDIS-RSTRCT TO TRUE                    
LRM011        ELSE                                                              
LRM011           SET ACAT-SIGN-ON-BROWSE TO TRUE                        10000000
LRM011        END-IF                                                            
LRM011     END-IF.                                                              
      /                                                                 10020000
       0150-GET-DATE-TIME-RTN.                                          10030000
           EXEC  CICS ASKTIME                                           10040000
                 ABSTIME(WSABSTIME)                                     10050000
           END-EXEC.                                                    10060000
           EXEC  CICS FORMATTIME                                        10070000
                 ABSTIME(WSABSTIME)                                     10080000
                 MMDDYY(WSMMDDYY)                                       10090000
                 DATESEP(WSDATESEP)                                     10100000
                 TIME(WSTIME)                                           10110000
                 TIMESEP(WSTIMESEP)                                     10120000
           END-EXEC.                                                    10130000
LRM007     MOVE WS-TIME-HH TO WS-TIME-HHMM(1 : 2).                              
LRM007     MOVE WS-TIME-MM TO WS-TIME-HHMM(3 : 2).                              
LRM015     EXEC CICS READ DATASET('TABLFLE ' )                                  
LRM015                INTO   (TABL-RECORD)                                      
LRM015                RIDFLD (TABL-KEY4)                                        
LRM015                RESP   (WS-CICS-RESP)                                     
LRM015     END-EXEC                                                             
LRM015                                                                          
LRM015     IF WS-CICS-RESP = DFHRESP(NORMAL)                                    
LRM015     AND TABL-HHMM > WS-CYCLE4-HHMM                                       
LRM015         MOVE TABL-HHMM TO WS-CYCLE4-HHMM                                 
LRM015     END-IF.                                                              
                                                                        10140000
LRM018     EXEC CICS READ DATASET('TABLFLE ' )                                  
LRM018                INTO   (TABL-RECORD)                                      
LRM018                RIDFLD (TABL-KEY5)                                        
LRM018                RESP   (WS-CICS-RESP)                                     
LRM018     END-EXEC                                                             
LRM018                                                                          
LRM018     IF WS-CICS-RESP = DFHRESP(NORMAL)                                    
LRM018     AND TABL-HHMM > WS-CYCLE5-HHMM                                       
LRM018         MOVE TABL-HHMM TO WS-CYCLE5-HHMM                                 
LRM018     END-IF.                                                              
                                                                        10140000
       0200-FIRST-TIME-THRU.                                            10150000
           MOVE EIBTRMID      TO TERM-ID.                               10160000
           MOVE 'ACA0'        TO TRAN-ID.                               10170000
           PERFORM 0600-DELETE-TSQ.                                     10180000
           SET FIRST-TIME  TO TRUE.                                     10190000
           SET TWA-ACAT10IO-FIRST-TIME  TO TRUE.                        10200000
           SET ACAT10IO-FIRST-TIME  TO TRUE.                            10210000
8/15       MOVE ZEROS TO TWA-BAL01-9                                    10220000
 -                       TWA-BAL02-9                                    10230000
 -                       TWA-BAL05-9                                    10240000
 -                       TWA-SMA-9                                      10250000
 -                       TWA-AMT-9                                      10260000
                                                                        10270000
      **------------- GET TRAILER INPUT FROM ACAT01CP -----------------*10280000
           MOVE TWA-CLIENT-NO-9      TO TWA-SV-CLIENT-NBR.              10300000
           IF ACAT-INP-BRANCH > SPACES                                  10310000
              MOVE ACAT-INP-BRANCH   TO TWA-MMBR, TWA-SV-BRANCH-CD,     10320000
           END-IF.                                                      10330000
           IF ACAT-INP-ACCOUNT > SPACES                                 10340000
              MOVE ACAT-INP-ACCOUNT  TO TWA-MMAC, TWA-SV-ACCT-CD        10350000
           END-IF.                                                      10360000
           IF ACAT-INP-RR > SPACES                                      10370000
              MOVE ACAT-INP-RR       TO TWA-MMRR, TWA-SV-RR-CD          10380000
           END-IF.                                                      10390000
           IF ACAT-INP-CONTRA-BKR > SPACES                              10400000
              MOVE ACAT-INP-CONTRA-BKR TO TWA-MCBRKR, TWA-SV-BRKR       10410000
           END-IF.                                                      10420000
           IF ACAT-INP-TFR-TYP > SPACES                                 10430000
              MOVE ACAT-INP-TFR-TYP  TO  TWA-MTFR, TWA-SV-TFR           10440000
           END-IF.                                                      10450000
           IF ACAT-INP-STATUS > SPACES                                  10460000
              MOVE ACAT-INP-STATUS  TO  TWA-MSTAT                       10470000
10/13         EVALUATE TWA-MSTAT                                        10480000
                 WHEN 'REQ'     MOVE  '100' TO TWA-SV-STCD              10490000
                 WHEN 'RQA'     MOVE  '110' TO TWA-SV-STCD              10500000
                 WHEN 'RAP'     MOVE  '120' TO TWA-SV-STCD              10510000
                 WHEN 'RQP'     MOVE  '130' TO TWA-SV-STCD              10520000
                 WHEN 'RQR'     MOVE  '140' TO TWA-SV-STCD              10530000
                 WHEN 'REV'     MOVE  '200' TO TWA-SV-STCD              10540000
                 WHEN 'RVA'     MOVE  '210' TO TWA-SV-STCD              10550000
                 WHEN 'RVE'     MOVE  '220' TO TWA-SV-STCD              10560000
                 WHEN 'RVX'     MOVE  '230' TO TWA-SV-STCD              10570000
                 WHEN 'STP'     MOVE  '300' TO TWA-SV-STCD              10580000
                 WHEN 'STC'     MOVE  '310' TO TWA-SV-STCD              10590000
                 WHEN 'CLP'     MOVE  '400' TO TWA-SV-STCD              10600000
                 WHEN 'PUR'     MOVE  '500' TO TWA-SV-STCD              10610000
                 WHEN 'MPP'     MOVE  '510' TO TWA-SV-STCD              10620000
                 WHEN 'REJ'     MOVE  '600' TO TWA-SV-STCD              10630000
              END-EVALUATE                                              10640000
           END-IF.                                                      10650000
           MOVE LOW-VALUES           TO ACAT10IO-SAVE-KEYS.             10660000
           MOVE TWA-SV-KEYS          TO ACAT10IO-SAVE-KEYS.             10680000
           MOVE TWA-TRLM-INPUT       TO ACAT10IO-TRLM-INPUT.            10690000
10/24      IF ACAT10IO-TRLM-INPUT > SPACES                              10700000
              MOVE LOW-VALUES  TO ACAT10IO-INPUT                        10710000
           END-IF.                                                      10720000
                                                                        10730000
           PERFORM 0400-DISPLAY-ACAT10M.                                10740000
           MOVE SPACE TO FIRST-TIME-FLAG, ACAT10IO-FIRST-TIME-SW.       10750000
                                                                        10760000
      /                                                                 10860000
       0220-XCTL-TO-ACAT21PT.                                           10780000
           MOVE 'ACAT21PT' TO CALLED-PROGRAM-NAME.                      10810000
           PERFORM 0710-INVOKE-DETAIL-PROGRAM-RTN.                      10820000
                                                                        10830000
       0220-EXIT.                                                       10840000
           EXIT.                                                        10850000
      /                                                                 10860000
       0230-CONTINUE-PROCESS.                                           10870000
                                                                        10880000
           PERFORM 0250-RECEIVE-MAP-RTN.                                10890000
           EVALUATE TRUE                                                10900000
                WHEN EIBAID = DFHENTER                                  10910000
                     PERFORM 0300-ENTER-KEY-RTN                         10920000
                WHEN EIBAID = DFHPF1                                    10930000
                     PERFORM 0310-VIEW-COMMENTS                         10940000
                WHEN EIBAID = DFHPF2                                    10950000
                     PERFORM 0320-CHANGE-TIF-INFO                       10960000
                WHEN EIBAID = DFHPF3                                    10970000
                     PERFORM 0323-PF3-TO-MARGIN                         10980000
                WHEN EIBAID = DFHPF5                                    10990000
                     PERFORM 0325-PF5-TO-NAMEADDR                       11000000
                WHEN EIBAID = DFHPF6                                    11010000
                     PERFORM 0326-PF6-TO-EXCEPTIONS                     11020000
                WHEN EIBAID = DFHPA1                                    11030000
                     PERFORM 0290-ASSETS-PAGING                         11040000
                WHEN EIBAID = DFHPA2                                    11050000
                     PERFORM 0290-ASSETS-PAGING                         11060000
                WHEN EIBAID = DFHPF7                                    11070000
                     PERFORM 0370-PREV-TFR-PF7                          11080000
                WHEN EIBAID = DFHPF8                                    11090000
                     PERFORM 0380-NEXT-TFR-PF8                          11100000
                WHEN EIBAID = DFHPF9                                    11110000
                     PERFORM 0390-FUND-REGISTRATION                     11120000
                WHEN EIBAID = DFHPF10 OR DFHPF12                        11130000
                     PERFORM 0900-RETURN-TO-CICS                        11140000
                WHEN EIBAID = DFHPF11 OR DFHCLEAR                       11150000
                     PERFORM 0910-RETURN-CONTROL-RTN                    11160000
                WHEN OTHER                                              11170000
                     MOVE EIBTRMID      TO TERM-ID                      11180000
                     MOVE 'ACA0'        TO TRAN-ID                      11190000
                     PERFORM 0610-READ-TSQ                              11200000
                     SET CURSOR-ON-MNEXT   TO TRUE                      11210000
                     MOVE 'ERROR FUNCTION KEY' TO SYSTEM-MSG            11220000
                     SET ERROR-YES TO TRUE                              11230000
                     PERFORM 0830-ERROR-RTN                             11240000
           END-EVALUATE.                                                11250000
      /                                                                 11260000
       0240-RETURN-FROM-ACAT90CM.                                       11270000
                                                                        11280000
           MOVE EIBTRMID         TO TERM-ID.                            11290000
           MOVE 'ACA0'           TO TRAN-ID.                            11300000
           PERFORM 0610-READ-TSQ.                                       11310000
           MOVE TWA-ACAT10IO-AREA TO ACAT10IO-AREA.                     11320000
           PERFORM 0550-READ-ACAT90CM-TS-RTN.                           11330000
           IF ACAT90CM-TS-UPDATE                                        11340000
              PERFORM 0450-PROCESS-INPUT THRU 0450-EXIT                 11350000
           END-IF.                                                      11360000
                                                                        11370000
           MOVE LOW-VALUE TO ACAT10AO ACAT10BO.                         11380000
TCK        PERFORM 0810-MAP-INPUT-AREA  THRU 0810-EXIT.                 11390000
           PERFORM 0620-WRITE-TSQ.                                      11400000
           PERFORM 0800-SEND-MAP-RETURN.                                11410000
      /                                                                 11420000
       0250-RECEIVE-MAP-RTN.                                            11430000
           MOVE LOW-VALUE TO ACAT10AO ACAT10BO.                         11440000
           MOVE +1000   TO  ACAT-RECEIVE-MAP-LENGTH.                    11450000
                                                                        11460000
      ***  HEADER MAP PORTION                                           11470000
           EXEC CICS RECEIVE MAP('HDRMAP')                              11480000
                     MAPSET('ACAT00M')                                  11490000
                     FROM(ACAT-RECEIVE-MAP)                             11500000
                     INTO(HDRMAPI)                                      11510000
           END-EXEC                                                     11520000
                                                                        11530000
      ***  MAP BODY PORTION                                             11540000
           EXEC CICS RECEIVE MAP('ACAT10A')                             11550000
                             MAPSET('ACAT10M')                          11560000
                             FROM(ACAT-RECEIVE-MAP)                     11570000
                             LENGTH(ACAT-RECEIVE-MAP-LENGTH)            11580000
                             INTO(ACAT10AI)                             11590000
           END-EXEC.                                                    11600000
                                                                        11610000
           EXEC CICS RECEIVE MAP('ACAT10B')                             11620000
                             MAPSET('ACAT10M')                          11630000
                             FROM(ACAT-RECEIVE-MAP)                     11640000
                             LENGTH(ACAT-RECEIVE-MAP-LENGTH)            11650000
                             INTO(ACAT10BI)                             11660000
           END-EXEC.                                                    11670000
                                                                        11680000
      ***  TRAILER MAP PORTION                                          11690000
           EXEC CICS RECEIVE MAP('TRLMAP')                              11700000
                     MAPSET('ACAT00M')                                  11710000
                     FROM(ACAT-RECEIVE-MAP)                             11720000
                     INTO(TRLMAPI)                                      11730000
           END-EXEC.                                                    11740000
                                                                        11750000
      /                                                                 11760000
       0260-RETURN-FROM-ACAT5FSC.                                       11770000
                                                                        11780000
           MOVE EIBTRMID         TO TERM-ID.                            11790000
           MOVE 'ACA0'           TO TRAN-ID.                            11800000
           PERFORM 0610-READ-TSQ.                                       11810000
           MOVE TWA-ACAT10IO-AREA TO ACAT10IO-AREA.                     11820000
TCK002     PERFORM 0580-READ-ACAT5FSC-TS-RTN.                           11830000
           MOVE LOW-VALUE     TO ACAT10AO  ACAT10BO.                    11840000
           PERFORM 0810-MAP-INPUT-AREA THRU 0810-EXIT                   11850000
           MOVE SPACES  TO  MREJO, MREJCO, MSUBMO, MSECCO.              11860000
           PERFORM 0800-SEND-MAP-RETURN.                                11870000
      /                                                                 11880000
       0290-ASSETS-PAGING.                                              11890000
                                                                        11900000
           MOVE EIBTRMID      TO TERM-ID.                               11910000
           MOVE 'ACA0'        TO TRAN-ID.                               11920000
           PERFORM 0610-READ-TSQ.                                       11930000
           MOVE TWA-ACAT10IO-AREA TO ACAT10IO-AREA.                     11950000
                                                                        11960000
            IF EIBAID = DFHPA1                                          11970000
               IF ACAT10IO-STCD LESS THAN 200                           11980000
                  PERFORM 0350-VINITAST-FORWARD-PA1                     11990000
               ELSE                                                     12000000
                  PERFORM 0355-PAGE-FORWARD-PA1                         12010000
               END-IF                                                   12020000
            END-IF.                                                     12030000
                                                                        12040000
            IF EIBAID = DFHPA2                                          12050000
               IF ACAT10IO-STCD LESS THAN 200                           12060000
                  PERFORM 0360-VINITAST-BACKWARD-PA2                    12070000
               ELSE                                                     12080000
                  PERFORM 0365-PAGE-BACKWARD-PA2                        12090000
               END-IF                                                   12100000
            END-IF.                                                     12110000
      /                                                                 12120000
       0300-ENTER-KEY-RTN.                                              12130000
                                                                        12140000
           IF MNEXTI > SPACES AND NOT = 'H'                             12150000
              PERFORM 0700-PROCESS-JUMP-RTN                             12160000
           END-IF.                                                      12170000
           MOVE SPACE TO WS-INPUT-VALIDATE-SW.                          12180000
           MOVE EIBTRMID      TO TERM-ID.                               12190000
           MOVE 'ACA0'        TO TRAN-ID.                               12200000
           PERFORM 0610-READ-TSQ.                                       12210000
11/20      MOVE SPACES TO TWA-RETURN-MSG.                               12220000
           MOVE TWA-ACAT10IO-AREA TO ACAT10IO-AREA.                     12230000
12/18****  CHECK IF BLANK COMMENT SCREEN IS REQUESTED                   12240000
12/18      IF (TWA-MREJ = SPACE OR LOW-VALUE)  AND                      12250000
  |           TWA-XFR-REJC-YES                 AND                      12260000
  |           (EIBCPOSN = 1739  OR 1740)                                12270000
  |            MOVE ATT-UNPROT-BRT TO MREJA MREJCA                      12280000
  |            SET ACAT90CM-TS-ACCT-COMMENTS TO TRUE                    12290000
  |            PERFORM 0540-SEND-POPUP-SCREEN                           12300000
12/18      END-IF.                                                      12310000
     ***                                                                12320000
           PERFORM 0410A-EDIT-TIF-INFO-CHG THRU 0410A-EXIT.             12480000
           PERFORM 0410-EDIT-INPUT-FIELDS  THRU 0410-EXIT.              12490000
12/04      IF NO-INPUT  AND                                             12500000
01/14         TWA-TIF-CHG-AREA = LOW-VALUES  AND                        12510000
01/15         NOT TWA-TIF-ACCT-CHG                                      12520000
              CONTINUE                                                  12530000
           ELSE                                                         12540000
              PERFORM 0420-VALIDATE-MAP-INPUT THRU 0420-EXIT            12550000
           END-IF.                                                      12560000
           PERFORM 0415-EDIT-ACAT00M-RTN.                               12570000
           PERFORM 0610-READ-TSQ.                                       12630000
           MOVE SPACES  TO  MREJO, MREJCO, MSUBMO, MSECCO.              12640000
      ***                                                               12650000
12/29      IF (NO-INPUT AND ACAT-NO-SRCH-ENTRY)                         12660000
  |           OR                                                        12670000
  |           (INPUT-VALIDATED  AND ACAT-NO-SRCH-ENTRY)                 12680000
  |           IF EIBCPOSN = 1713                                        12690000
  |              IF MSECCI = 'S'                                        12700000
  |                 MOVE ATT-UNPROT-BRT TO MSECCA                       12710000
  |                 SET ACAT90CM-TS-SECR-COMMENTS TO TRUE               12720000
  |                 PERFORM 0540-SEND-POPUP-SCREEN                      12730000
  |              ELSE                                                   12740000
  |                 MOVE                                                12750000
  |                 ' PF1 TO VIEW SECURITY COMMENT, "S" TO UPDT' TO     12760000
  |                 SYSTEM-MSG                                          12770000
  |                 MOVE ATT-UNPROT-BRT TO MSECCA                       12780000
  |                 SET DATA-ONLY TO TRUE                               12790000
  |                 PERFORM 0800-SEND-MAP-RETURN                        12800000
  |              END-IF                                                 12810000
  |           END-IF                                                    12820000
12/29      END-IF.                                                      12830000
12/10      IF (NO-INPUT AND ACAT-NO-SRCH-ENTRY)                         12840000
              OR                                                        12850000
              (INPUT-VALIDATED  AND ACAT-NO-SRCH-ENTRY)                 12860000
12/10         MOVE EIBTRMID   TO TERM-ID                                12870000
              MOVE 'ACA0'     TO TRAN-ID                                12880000
12/10         PERFORM 0600-DELETE-TSQ                                   12890000
              PERFORM 0810-MAP-INPUT-AREA THRU 0810-EXIT                12900000
              PERFORM 0620-WRITE-TSQ                                    12910000
              PERFORM 0800-SEND-MAP-RETURN                              12930000
           ELSE                                                         12940000
              MOVE TWA-SV-KEYS       TO ACAT10IO-SAVE-KEYS              12950000
              MOVE SPACES            TO ACAT10IO-RETURN-MSG             12960000
              MOVE LOW-VALUES        TO ACAT10IO-SV-ACAT-CNTL-NBR       12970000
              MOVE TWA-TRLM-INPUT    TO ACAT10IO-TRLM-INPUT             12980000
              PERFORM 0400-DISPLAY-ACAT10M                              12990000
           END-IF.                                                      13000000
      /                                                                 13010000
       0310-VIEW-COMMENTS.                                              13020000
      ***** PF1 KEY ENTERED                                             13030000
      *===> SEND POP UP SCREEN                                          13040000
           MOVE EIBTRMID     TO TERM-ID.                                13050000
           MOVE 'ACA0'       TO TRAN-ID.                                13060000
           PERFORM 0610-READ-TSQ.                                       13070000
           PERFORM 0480-CHECK-EIBCPOSN.                                 13080000
           PERFORM 0530-PREP-FOR-POPUP.                                 13090000
                                                                        13100000
       0320-CHANGE-TIF-INFO.                                            13110000
           MOVE EIBTRMID    TO TERM-ID.                                 13130000
           MOVE 'ACA0'      TO TRAN-ID.                                 13140000
           PERFORM 0610-READ-TSQ.                                       13150000
                                                                        13160000
LRM***** THE FOLLOWING 22 LINES ADDED TO HAVE MEANINGFUL MESSAGE        13170000
LRM***** AND TO KEEP THE FIELDS PROTECTED WHEN ALREADY SENT TO NSCC.    13180000
LRM018     IF WS-CYCLE4-CUTOFF                                                  
LRM018        CONTINUE                                                          
LRM018     ELSE                                                                 
           IF NOT ACAT-SIGN-ON-UPDATE OR                                13190000
              TWA-VINITRNF-NSCC-PEND-CD = 'Y' OR                        13200000
              TWA-VINITAST-NSCC-PEND-CD = 'Y' OR                        13210000
             (TWA-STCD NOT LESS '300'   AND                             13220000
              NOT TWA-TIF-ACCT-NEW      AND                             13230000
              NOT TWA-TIF-UPDT)                                         13240000
                 SET CURSOR-ON-MNEXT TO TRUE                            13250000
                 MOVE ATT-UNPROT TO MMBRA, MMACA, MMRRA, MMBKRA, MMTFRA,13260000
                                 MMSTATA, MNEXTA                        13270000
                 MOVE ATT-PROT TO MBRA, MACA, MRRA, MNAMEA, MNAME2A,    13280000
                                 MCSTPA, MSSN1AA, MSSN1BA, MSSN1CA,     13290000
                                 MSSN2AA, MSSN2BA, MSSN2CA,             13300000
                                 MBAL01A, MBAL02A, MBAL05A, MSMAA,      13310000
                                 MWIA, MQTYA, MAMTA, MCDA,              13320000
                                 MSUBMA, MSECCA,                        13330000
                                 MREJA, MREJCA                          13340000
LRM016                           MDELA                                          
LRM016           MOVE ATT-ASKIP-DRK  TO MDELTA                                  
                 MOVE SPACE TO MCDO, MSUBMO, MSECCO, MREJO, MREJCO      13350000
                 MOVE LOW-VALUE TO TWA-MCD, TWA-MREJ, TWA-MREJC,        13360000
                                    TWA-MSUBM, TWA-MSECC                13370000
                 IF NOT ACAT-SIGN-ON-UPDATE                             13380000
                    MOVE 'PF2 IGNORED; USER SIGNON NON UPDATE'          13390000
                       TO SYSTEM-MSG                                    13400000
                 ELSE                                                   13410000
                    MOVE 'PF2 IGNORED; NSCC PENDING, BROWSE ONLY'       13420000
                       TO SYSTEM-MSG                                    13430000
                 END-IF                                                 13440000
                 PERFORM 0830-ERROR-RTN                                 13450000
           END-IF.                                                      13460000
                                                                        13470000
           IF TWA-TRLM-INPUT > SPACE                                    13480000
              MOVE ' NO SEARCH FIELDS ALLOWED WHEN PF2 IS SELECTED '    13490000
               TO SYSTEM-MSG                                            13500000
              SET ERROR-YES TO TRUE                                     13510000
              SET CURSOR-ON-MBR  TO TRUE                                13520000
01/11         PERFORM 0830-ERROR-RTN                                    13530000
           END-IF.                                                      13560000
                                                                        13570000
LRM004     IF TWA-MREJ > SPACE                                          13480000
LRM004        MOVE 'PLEASE ERASE REJECT PRIOR TO PF2 SELECTION'         13490000
LRM004         TO SYSTEM-MSG                                            13500000
LRM004        SET ERROR-YES TO TRUE                                     13510000
LRM004        SET CURSOR-ON-MREJ TO TRUE                                13520000
LRM004        MOVE ATT-UNPROT-BRT TO MREJCA                             38770000
LRM004        MOVE DFHENTER TO EIBAID                                           
LRM004        PERFORM 0830-ERROR-RTN                                    13530000
LRM004     END-IF.                                                      13560000
                                                                        13570000
LRM004     IF TWA-MREJC > SPACE                                         13480000
LRM004        MOVE 'PLEASE ERASE REJECT PRIOR TO PF2 SELECTION'         13490000
LRM004         TO SYSTEM-MSG                                            13500000
LRM004        SET ERROR-YES TO TRUE                                     13510000
LRM004        SET CURSOR-ON-MREJC TO TRUE                               13520000
LRM004        MOVE ATT-UNPROT-BRT TO MREJCA                             38770000
LRM004        MOVE DFHENTER TO EIBAID                                           
LRM004        PERFORM 0830-ERROR-RTN                                    13530000
LRM004     END-IF.                                                      13560000
                                                                        13570000
01/04      IF TWA-STCD LESS THAN 200                                    13580000
              MOVE                                                      13590000
              '  ****** READY TO CHANGE ACCOUNT LEVEL INFORMATION *****'13600000
                TO  SYSTEM-MSG                                          13610000
              SET ERROR-YES  TO TRUE                                    13620000
              SET CURSOR-ON-MBR TO TRUE                                 13630000
12/12         PERFORM 0830-ERROR-RTN                                    13640000
           ELSE                                                         13670000
              MOVE                                                      13680000
              ' CAN NOT CHANGE ACCOUNT INFORMATION ! ' TO  SYSTEM-MSG   13690000
              SET ERROR-YES  TO TRUE                                    13700000
              PERFORM 0810-MAP-INPUT-AREA THRU 0810-EXIT                13710000
12/12         PERFORM 0830-ERROR-RTN                                    13720000
           END-IF.                                                      13750000
                                                                        13760000
       0323-PF3-TO-MARGIN.                                              13770000
      *===> JUMP TO ACAT01CP & MARGIN                                   13780000
           MOVE EIBTRMID     TO TERM-ID.                                13790000
           MOVE 'ACA0'       TO TRAN-ID.                                13800000
           PERFORM 0610-READ-TSQ.                                       13810000
           PERFORM 0900-RETURN-TO-CICS.                                 13840000
                                                                        13850000
       0325-PF5-TO-NAMEADDR.                                            13860000
      *===> DISPLAY CHANGES IN NAME AND ADDRESS                         13870000
           PERFORM 0530-PREP-FOR-POPUP.                                 13880000
                                                                        13890000
       0326-PF6-TO-EXCEPTIONS.                                          13900000
      *===> DISPLAY EXCEPTION INDICATORS                                13910000
           PERFORM 0530-PREP-FOR-POPUP.                                 13920000
                                                                        13930000
       0350-VINITAST-FORWARD-PA1.                                       13940000
      *===> SCROLL DOWN INITAL ASSETT INFO WITHIN THE ACCOUNT           13950000
           MOVE EIBTRMID      TO TERM-ID.                               13960000
           MOVE 'ACA0'        TO TRAN-ID.                               13970000
           PERFORM 0610-READ-TSQ.                                       13980000
           MOVE TWA-ACAT10IO-AREA TO ACAT10IO-AREA.                     14000000
12/11      MOVE SPACES             TO ACAT10IO-RETURN-MSG.              14010000
12/11      MOVE LOW-VALUES         TO  ACAT10IO-INPUT.                  14020000
ET0003     MOVE TWA-MREJ           TO  ACAT10IO-MREJ.                   08000000
ET0003     MOVE TWA-MREJC          TO  ACAT10IO-MREJC.                  08040000
ET0003     MOVE TWA-VINITRNF-TYPE-RJCT-CD                               08040000
ET0003                             TO  ACAT10IO-VINITRNF-TYPE-RJCT-CD.  08040000
ET0003     MOVE TWA-VINITRNF-CMNT  TO  ACAT10IO-VINITRNF-CMNT.          08040000
12/11      MOVE TWA-TRLM-INPUT     TO  ACAT10IO-TRLM-INPUT.             14030000
           SET ACAT10IO-SRCH-VINITAST     TO TRUE.                      14040000
           SET ACAT10IO-SRCH-VINITAST-FWD TO TRUE.                      14050000
           PERFORM 0520-CALL-ACAT10DC.                                  14060000
12/14      IF ACAT10IO-DB2-ERROR                                        14070000
              MOVE 'ACAT10DC'       TO WS-DB2-ERROR-PGM                 14080000
              MOVE 'SELECT'         TO WS-DB2-ERROR-FUNCTION            14090000
              MOVE ACAT10IO-SQLCAID TO WS-DB2-ERROR-TABLE               14100000
              MOVE ACAT10IO-SQLCODE TO WS-DB2-ERROR-ID                  14110000
              MOVE WS-DB2-ERROR-MSG TO SYSTEM-MSG                       14120000
              SET ERROR-YES TO TRUE                                     14130000
12/12         SET DATA-ONLY TO TRUE                                     14150000
12/12         PERFORM 0800-SEND-MAP-RETURN                              14160000
           ELSE                                                         14170000
10/28         IF ACAT10IO-RETURN-MSG > SPACES                           14180000
                 MOVE ACAT10IO-RETURN-MSG TO SYSTEM-MSG                 14190000
              END-IF                                                    14200000
           END-IF.                                                      14210000
           MOVE ACAT10IO-AREA   TO  TWA-ACAT10IO-AREA.                  14220000
           PERFORM 0405-MOVE-SV-KEYS.                                   14230000
           MOVE LOW-VALUES TO  ACAT10BO.                                14240000
           MOVE SPACES     TO MREJO, MREJCO, MSUBMO, MSECCO.            14250000
           MOVE EIBTRMID   TO TERM-ID.                                  14260000
           MOVE 'ACA0'     TO TRAN-ID.                                  14270000
           PERFORM 0600-DELETE-TSQ.                                     14280000
           PERFORM 0810-MAP-INPUT-AREA  THRU  0810-EXIT.                14290000
           PERFORM 0620-WRITE-TSQ.                                      14300000
12/16      SET DATA-ONLY TO TRUE.                                       14310000
           PERFORM 0800-SEND-MAP-RETURN.                                14320000
                                                                        14330000
      /                                                                 14340000
       0355-PAGE-FORWARD-PA1.                                           14350000
      *===> SCROLL DOWN ASSET INFO WITHIN THE ACCOUNT ---ACAT21PT       14360000
           MOVE EIBTRMID      TO TERM-ID.                               14370000
           MOVE 'ACA0'        TO TRAN-ID.                               14380000
           PERFORM 0610-READ-TSQ.                                       14390000
      *=================================>                               14400000
           MOVE TWA-ACAT10IO-AREA TO ACAT10IO-AREA.                     14420000
12/11      MOVE SPACES             TO ACAT10IO-RETURN-MSG.              14430000
12/11      MOVE LOW-VALUES         TO  ACAT10IO-INPUT.                  14440000
ET0003     MOVE TWA-MREJ           TO  ACAT10IO-MREJ.                   08000000
ET0003     MOVE TWA-MREJC          TO  ACAT10IO-MREJC.                  08040000
ET0003     MOVE TWA-VINITRNF-TYPE-RJCT-CD                               08040000
ET0003                             TO  ACAT10IO-VINITRNF-TYPE-RJCT-CD.  08040000
ET0003     MOVE TWA-VINITRNF-CMNT  TO  ACAT10IO-VINITRNF-CMNT.          08040000
12/11      MOVE TWA-TRLM-INPUT     TO  ACAT10IO-TRLM-INPUT.             14450000
           SET ACAT10IO-SRCH-VASSET     TO TRUE.                        14460000
           SET ACAT10IO-SRCH-VASSET-FWD TO TRUE.                        14470000
           PERFORM 0520-CALL-ACAT10DC.                                  14480000
12/14      IF ACAT10IO-DB2-ERROR                                        14490000
              MOVE 'ACAT10DC'       TO WS-DB2-ERROR-PGM                 14500000
              MOVE 'SELECT'         TO WS-DB2-ERROR-FUNCTION            14510000
              MOVE ACAT10IO-SQLCAID TO WS-DB2-ERROR-TABLE               14520000
              MOVE ACAT10IO-SQLCODE TO WS-DB2-ERROR-ID                  14530000
              MOVE WS-DB2-ERROR-MSG TO SYSTEM-MSG                       14540000
              SET ERROR-YES TO TRUE                                     14550000
12/12         SET DATA-ONLY TO TRUE                                     14570000
12/12         PERFORM 0800-SEND-MAP-RETURN                              14580000
           ELSE                                                         14590000
10/28         IF ACAT10IO-RETURN-MSG > SPACES                           14600000
                 MOVE ACAT10IO-RETURN-MSG TO SYSTEM-MSG                 14610000
              END-IF                                                    14620000
           END-IF.                                                      14630000
           MOVE ACAT10IO-AREA   TO  TWA-ACAT10IO-AREA.                  14640000
           PERFORM 0405-MOVE-SV-KEYS.                                   14650000
           MOVE LOW-VALUES TO  ACAT10BO.                                14660000
           MOVE SPACES     TO MREJO, MREJCO, MSUBMO, MSECCO.            14670000
           MOVE ATT-ASKIP  TO MREJA, MREJCA, MSUBMA, MSECCA.            14680000
           MOVE EIBTRMID   TO TERM-ID.                                  14690000
           MOVE 'ACA0'     TO TRAN-ID.                                  14700000
           PERFORM 0600-DELETE-TSQ.                                     14710000
           PERFORM 0810-MAP-INPUT-AREA  THRU  0810-EXIT.                14720000
           PERFORM 0620-WRITE-TSQ.                                      14730000
12/16      SET DATA-ONLY TO TRUE.                                       14740000
           PERFORM 0800-SEND-MAP-RETURN.                                14750000
      /                                                                 14770000
       0360-VINITAST-BACKWARD-PA2.                                      14780000
      *===> SCROLL UP INITAL ASSETT INFO WITHIN THE ACCOUNT             14790000
           MOVE EIBTRMID      TO TERM-ID.                               14800000
           MOVE 'ACA0'        TO TRAN-ID.                               14810000
           PERFORM 0610-READ-TSQ.                                       14820000
           MOVE TWA-ACAT10IO-AREA TO ACAT10IO-AREA.                     14840000
12/11      MOVE SPACES             TO ACAT10IO-RETURN-MSG.              14850000
12/11      MOVE LOW-VALUES         TO  ACAT10IO-INPUT.                  14860000
ET0003     MOVE TWA-MREJ           TO  ACAT10IO-MREJ.                   08000000
ET0003     MOVE TWA-MREJC          TO  ACAT10IO-MREJC.                  08040000
ET0003     MOVE TWA-VINITRNF-TYPE-RJCT-CD                               08040000
ET0003                             TO  ACAT10IO-VINITRNF-TYPE-RJCT-CD.  08040000
ET0003     MOVE TWA-VINITRNF-CMNT  TO  ACAT10IO-VINITRNF-CMNT.          08040000
12/11      MOVE TWA-TRLM-INPUT     TO  ACAT10IO-TRLM-INPUT.             14870000
           SET ACAT10IO-SRCH-VINITAST     TO TRUE.                      14880000
           SET ACAT10IO-SRCH-VINITAST-BWD TO TRUE.                      14890000
           PERFORM 0520-CALL-ACAT10DC.                                  14900000
12/14      IF ACAT10IO-DB2-ERROR                                        14910000
              MOVE 'ACAT10DC'       TO WS-DB2-ERROR-PGM                 14920000
              MOVE 'SELECT'         TO WS-DB2-ERROR-FUNCTION            14930000
              MOVE ACAT10IO-SQLCAID TO WS-DB2-ERROR-TABLE               14940000
              MOVE ACAT10IO-SQLCODE TO WS-DB2-ERROR-ID                  14950000
              MOVE WS-DB2-ERROR-MSG TO SYSTEM-MSG                       14960000
              SET ERROR-YES TO TRUE                                     14970000
              SET DATA-ONLY TO TRUE                                     14990000
              PERFORM 0800-SEND-MAP-RETURN                              15000000
12/14      ELSE                                                         15010000
              IF ACAT10IO-RETURN-MSG > SPACES                           15020000
                 MOVE ACAT10IO-RETURN-MSG TO SYSTEM-MSG                 15030000
              END-IF                                                    15040000
           END-IF.                                                      15050000
           MOVE ACAT10IO-AREA   TO  TWA-ACAT10IO-AREA.                  15060000
           PERFORM 0405-MOVE-SV-KEYS.                                   15070000
           MOVE LOW-VALUES TO  ACAT10BO.                                15080000
           MOVE SPACES     TO MREJO, MREJCO, MSUBMO, MSECCO.            15090000
           MOVE EIBTRMID   TO TERM-ID.                                  15100000
           MOVE 'ACA0'     TO TRAN-ID.                                  15110000
           PERFORM 0600-DELETE-TSQ.                                     15120000
           PERFORM 0810-MAP-INPUT-AREA  THRU  0810-EXIT.                15130000
           PERFORM 0620-WRITE-TSQ.                                      15140000
12/13      SET DATA-ONLY TO TRUE.                                       15150000
           PERFORM 0800-SEND-MAP-RETURN.                                15160000
      /                                                                 15180000
       0365-PAGE-BACKWARD-PA2.                                          15190000
      *===> SCROLL UP ASSET INFO WITHIN THE ACCOUNT                     15200000
           MOVE EIBTRMID      TO TERM-ID.                               15210000
           MOVE 'ACA0'        TO TRAN-ID.                               15220000
      *====>                                                            15240000
           MOVE TWA-ACAT10IO-AREA TO ACAT10IO-AREA.                     15260000
12/11      MOVE SPACES             TO ACAT10IO-RETURN-MSG.              15270000
12/11      MOVE LOW-VALUES         TO  ACAT10IO-INPUT.                  15280000
ET0003     MOVE TWA-MREJ           TO  ACAT10IO-MREJ.                   08000000
ET0003     MOVE TWA-MREJC          TO  ACAT10IO-MREJC.                  08040000
ET0003     MOVE TWA-VINITRNF-TYPE-RJCT-CD                               08040000
ET0003                             TO  ACAT10IO-VINITRNF-TYPE-RJCT-CD.  08040000
ET0003     MOVE TWA-VINITRNF-CMNT  TO  ACAT10IO-VINITRNF-CMNT.          08040000
12/11      MOVE TWA-TRLM-INPUT     TO  ACAT10IO-TRLM-INPUT.             15290000
           SET ACAT10IO-SRCH-VASSET       TO TRUE.                      15300000
           SET ACAT10IO-SRCH-VASSET-BWD   TO TRUE.                      15310000
           PERFORM 0520-CALL-ACAT10DC.                                  15320000
12/14      IF ACAT10IO-DB2-ERROR                                        15330000
              MOVE 'ACAT10DC'       TO WS-DB2-ERROR-PGM                 15340000
              MOVE 'SELECT'         TO WS-DB2-ERROR-FUNCTION            15350000
              MOVE ACAT10IO-SQLCAID TO WS-DB2-ERROR-TABLE               15360000
              MOVE ACAT10IO-SQLCODE TO WS-DB2-ERROR-ID                  15370000
              MOVE WS-DB2-ERROR-MSG TO SYSTEM-MSG                       15380000
              SET ERROR-YES TO TRUE                                     15390000
12/12         SET DATA-ONLY TO TRUE                                     15410000
12/12         PERFORM 0800-SEND-MAP-RETURN                              15420000
           ELSE                                                         15430000
10/28         IF ACAT10IO-RETURN-MSG > SPACES                           15440000
                 MOVE ACAT10IO-RETURN-MSG TO SYSTEM-MSG                 15450000
              END-IF                                                    15460000
           END-IF.                                                      15470000
           MOVE ACAT10IO-AREA   TO  TWA-ACAT10IO-AREA.                  15480000
           PERFORM 0405-MOVE-SV-KEYS.                                   15490000
           MOVE LOW-VALUES TO  ACAT10BO.                                15500000
           MOVE SPACES     TO MREJO, MREJCO, MSUBMO, MSECCO.            15510000
           MOVE ATT-ASKIP  TO MREJA, MREJCA, MSUBMA, MSECCA.            15520000
           MOVE EIBTRMID   TO TERM-ID.                                  15530000
           MOVE 'ACA0'     TO TRAN-ID.                                  15540000
           PERFORM 0600-DELETE-TSQ.                                     15550000
           PERFORM 0810-MAP-INPUT-AREA  THRU  0810-EXIT.                15560000
           PERFORM 0620-WRITE-TSQ.                                      15570000
12/14      SET DATA-ONLY TO TRUE.                                       15580000
           PERFORM 0800-SEND-MAP-RETURN.                                15590000
      /                                                                 15600000
       0370-PREV-TFR-PF7.                                               15610000
      *===> SCROLL UP TO PREVIOUS TRANSFER                              15620000
           SET CURSOR-ON-MNEXT TO TRUE.                                 15630000
           MOVE EIBTRMID      TO TERM-ID.                               15640000
           MOVE 'ACA0'        TO TRAN-ID.                               15650000
           PERFORM 0610-READ-TSQ.                                       15660000
           MOVE LOW-VALUES    TO TWA-TIF-RETURN                         15670000
           IF ACAT-CALLING-PROG-NAME = 'ACAT21PT'  OR                   15680000
              TWA-SRCH-VTRNFR-PND                                       15690000
              MOVE 'ACAT21PT' TO ACAT-CALLING-PROG-NAME                 15700000
              MOVE '       **** PAGEING UP IS NOT AVAILABLE ****'       15710000
                    TO SYSTEM-MSG                                       15720000
              SET ERROR-YES TO TRUE                                     15730000
12/12         SET DATA-ONLY TO TRUE                                     15750000
12/12         PERFORM 0800-SEND-MAP-RETURN                              15760000
           END-IF.                                                      15770000
                                                                        15780000
           MOVE LOW-VALUES TO ACAT10AO, ACAT10BO.                       15790000
           MOVE SPACE      TO MNEXTO, MSUBMO, MSECCO, MREJO, MREJCO.    15800000
           MOVE LOW-VALUES TO ACAT10IO-TWA-INPUT.                       15810000
           MOVE TWA-ACAT10IO-AREA  TO  ACAT10IO-AREA.                   15820000
           MOVE SPACES             TO ACAT10IO-RETURN-MSG.              15830000
           MOVE LOW-VALUES         TO  ACAT10IO-INPUT.                  15840000
           MOVE TWA-TRLM-INPUT     TO  ACAT10IO-TRLM-INPUT.             15850000
           SET ACAT10IO-SRCH-VTRNFR     TO TRUE.                        15870000
           SET ACAT10IO-SRCH-VTRNFR-BWD TO TRUE.                        15880000
           PERFORM 0500-CALL-ACAT10DA.                                  15890000
           IF ACAT10IO-DB2-ERROR                                        15900000
              MOVE 'ACAT10DA'       TO WS-DB2-ERROR-PGM                 15910000
              MOVE 'SELECT'         TO WS-DB2-ERROR-FUNCTION            15920000
              MOVE ACAT10IO-SQLCAID TO WS-DB2-ERROR-TABLE               15930000
              MOVE ACAT10IO-SQLCODE TO WS-DB2-ERROR-ID                  15940000
              MOVE WS-DB2-ERROR-MSG TO SYSTEM-MSG                       15950000
              SET ERROR-YES TO TRUE                                     15960000
12/12         SET DATA-ONLY TO TRUE                                     15980000
12/12         PERFORM 0800-SEND-MAP-RETURN                              15990000
           ELSE                                                         16000000
TCK003        IF ACAT10IO-RETURN-MSG > SPACES                           16010000
TCK003           MOVE ACAT10IO-RETURN-MSG TO SYSTEM-MSG                 16020000
TCK003        END-IF                                                    16030000
TCK003        MOVE ACAT10IO-AREA TO  TWA-ACAT10IO-AREA                  16040000
              MOVE LOW-VALUES       TO ACAT10IO-SEARCH-VINITAST         16050000
                                       ACAT10IO-SEARCH-VASSET           16060000
              IF ACAT10IO-VTRNFR-FOUND                                  16070000
                 IF ACAT10IO-STCD LESS THAN 200                         16080000
                    IF ACAT10IO-VINITAST-FOUND                          16090000
                       SET ACAT10IO-SRCH-VINITAST-FWD TO TRUE           16100000
                       PERFORM 0520-CALL-ACAT10DC                       16110000
                    END-IF                                              16120000
                 ELSE                                                   16130000
                    IF ACAT10IO-VASSET-FOUND                            16140000
                       SET ACAT10IO-SRCH-VASSET-FWD TO TRUE             16150000
                       PERFORM 0520-CALL-ACAT10DC                       16160000
                    ELSE                                                16170000
                       IF ACAT10IO-VINITAST-FOUND                       16180000
                          SET ACAT10IO-SRCH-VINITAST-FWD TO TRUE        16190000
                          PERFORM 0520-CALL-ACAT10DC                    16200000
                       END-IF                                           16210000
                    END-IF                                              16220000
                 END-IF                                                 16230000
              ELSE                                                      16240000
TCK003            IF ACAT10IO-VTRNFR-FIRST                              16250000
TCK003               SET ACAT10IO-SRCH-VASSET-BWD TO TRUE               16251000
TCK003               PERFORM 0520-CALL-ACAT10DC                         16252000
TCK003            ELSE                                                  16253000
                     INITIALIZE ACAT10IO-DC                             16254000
TCK003            END-IF                                                16255000
              END-IF                                                    16256000
           END-IF.                                                      16257000
      *////////////////////////////////////////////////////////////////*16258000
12/14      IF ACAT10IO-DB2-ERROR                                        16259000
              MOVE 'ACAT10DC'       TO WS-DB2-ERROR-PGM                 16260000
              MOVE 'SELECT'         TO WS-DB2-ERROR-FUNCTION            16270000
              MOVE ACAT10IO-SQLCAID TO WS-DB2-ERROR-TABLE               16280000
              MOVE ACAT10IO-SQLCODE TO WS-DB2-ERROR-ID                  16290000
              MOVE WS-DB2-ERROR-MSG TO SYSTEM-MSG                       16300000
              SET ERROR-YES TO TRUE                                     16310000
12/12         SET DATA-ONLY TO TRUE                                     16330000
12/12         PERFORM 0800-SEND-MAP-RETURN                              16340000
           ELSE                                                         16350000
10/28         IF ACAT10IO-RETURN-MSG > SPACES                           16360000
                 MOVE ACAT10IO-RETURN-MSG TO SYSTEM-MSG                 16380000
              END-IF                                                    16390000
           END-IF.                                                      16400000
           MOVE ACAT10IO-AREA   TO  TWA-ACAT10IO-AREA.                  16410000
           PERFORM 0405-MOVE-SV-KEYS.                                   16420000
           MOVE SPACES        TO  MREJO, MREJCO, MSUBMO, MSECCO.        16430000
           MOVE EIBTRMID      TO TERM-ID.                               16440000
           MOVE 'ACA0'        TO TRAN-ID.                               16450000
           PERFORM 0600-DELETE-TSQ.                                     16460000
           PERFORM 0810-MAP-INPUT-AREA THRU 0810-EXIT.                  16470000
           PERFORM 0620-WRITE-TSQ.                                      16480000
           PERFORM 0800-SEND-MAP-RETURN.                                16500000
      /                                                                 16510000
       0380-NEXT-TFR-PF8.                                               16520000
      *===> SCROLL DOWN TO NEXT TRANSFER                                16530000
           SET CURSOR-ON-MNEXT TO TRUE.                                 16540000
           MOVE EIBTRMID      TO TERM-ID.                               16550000
           MOVE 'ACA0'        TO TRAN-ID.                               16560000
           PERFORM 0610-READ-TSQ.                                       16570000
           MOVE LOW-VALUES    TO TWA-TIF-RETURN                         16580000
           IF ACAT-CALLING-PROG-NAME = 'ACAT21PT' OR                    16590000
              TWA-SRCH-VTRNFR-PND                                       16600000
              MOVE 'ACAT21PT' TO ACAT-CALLING-PROG-NAME                 16610000
              MOVE '        **** PAGEING DOWN IS NOT AVAILABLE *****'   16620000
                     TO SYSTEM-MSG                                      16630000
              SET ERROR-YES TO TRUE                                     16640000
12/12         SET DATA-ONLY TO TRUE                                     16660000
12/12         PERFORM 0800-SEND-MAP-RETURN                              16670000
           END-IF.                                                      16680000
                                                                        16690000
           MOVE LOW-VALUES TO ACAT10AO, ACAT10BO.                       16700000
           MOVE SPACE      TO MNEXTO, MSUBMO, MSECCO, MREJO, MREJCO.    16710000
           MOVE +0                 TO  TWA-SV-ASSET-SEQ-NBR.            16720000
           MOVE LOW-VALUES         TO  ACAT10IO-TWA-INPUT.              16730000
           MOVE TWA-ACAT10IO-AREA  TO  ACAT10IO-AREA.                   16740000
           MOVE LOW-VALUES         TO  ACAT10IO-INPUT,                  16750000
12/05                                  ACAT10IO-SV-SEC-ISSUE-CD.        16760000
           MOVE SPACES             TO  ACAT10IO-RETURN-MSG.             16770000
           MOVE TWA-TRLM-INPUT     TO  ACAT10IO-TRLM-INPUT.             16780000
           SET ACAT10IO-SRCH-VTRNFR     TO TRUE.                        16790000
           SET ACAT10IO-SRCH-VTRNFR-FWD TO TRUE.                        16800000
           PERFORM 0500-CALL-ACAT10DA.                                  16810000
           IF ACAT10IO-DB2-ERROR                                        16820000
              MOVE 'SELECT'         TO WS-DB2-ERROR-FUNCTION            16830000
              MOVE 'ACAT10DA'       TO WS-DB2-ERROR-PGM                 16840000
              MOVE ACAT10IO-SQLCAID TO WS-DB2-ERROR-TABLE               16850000
              MOVE ACAT10IO-SQLCODE TO WS-DB2-ERROR-ID                  16860000
              MOVE WS-DB2-ERROR-MSG TO SYSTEM-MSG                       16870000
               SET ERROR-YES TO TRUE                                    16880000
12/12         SET DATA-ONLY TO TRUE                                     16900000
12/12         PERFORM 0800-SEND-MAP-RETURN                              16910000
           ELSE                                                         16920000
TCK003       IF ACAT10IO-RETURN-MSG > SPACES                            16930000
TCK003           MOVE ACAT10IO-RETURN-MSG TO SYSTEM-MSG                 16940000
TCK003        END-IF                                                    16950000
TCK003        MOVE ACAT10IO-AREA TO  TWA-ACAT10IO-AREA                  16960000
              MOVE LOW-VALUES       TO ACAT10IO-SEARCH-VINITAST         16970000
                                       ACAT10IO-SEARCH-VASSET           16980000
              IF ACAT10IO-VTRNFR-FOUND                                  16990000
                 IF ACAT10IO-STCD LESS THAN 200                         17000000
                    IF ACAT10IO-VINITAST-FOUND                          17010000
                       SET ACAT10IO-SRCH-VINITAST-FWD TO TRUE           17020000
                       PERFORM 0520-CALL-ACAT10DC                       17030000
                    END-IF                                              17040000
                 ELSE                                                   17050000
                    IF ACAT10IO-VASSET-FOUND                            17060000
                       SET ACAT10IO-SRCH-VASSET-FWD TO TRUE             17070000
                       PERFORM 0520-CALL-ACAT10DC                       17080000
                    ELSE                                                17090000
                       IF ACAT10IO-VINITAST-FOUND                       17100000
                          SET ACAT10IO-SRCH-VINITAST-FWD TO TRUE        17110000
                          PERFORM 0520-CALL-ACAT10DC                    17120000
                       END-IF                                           17130000
                    END-IF                                              17140000
                 END-IF                                                 17150000
              ELSE                                                      17160000
TCK003            IF ACAT10IO-VTRNFR-LAST                               17161000
TCK003               SET ACAT10IO-SRCH-VASSET-FWD TO TRUE               17162000
TCK003               PERFORM 0520-CALL-ACAT10DC                         17163000
TCK003            ELSE                                                  17164000
                     INITIALIZE ACAT10IO-DC                             17165000
TCK003            END-IF                                                17166000
              END-IF                                                    17167000
           END-IF.                                                      17168000
      *////////////////////////////////////////////////////////////////*17169000
12/14      IF ACAT10IO-DB2-ERROR                                        17170000
              MOVE 'ACAT10DC'       TO WS-DB2-ERROR-PGM                 17180000
              MOVE 'SELECT'         TO WS-DB2-ERROR-FUNCTION            17190000
              MOVE ACAT10IO-SQLCAID TO WS-DB2-ERROR-TABLE               17200000
              MOVE ACAT10IO-SQLCODE TO WS-DB2-ERROR-ID                  17210000
              MOVE WS-DB2-ERROR-MSG TO SYSTEM-MSG                       17220000
               SET ERROR-YES TO TRUE                                    17230000
12/12         SET DATA-ONLY TO TRUE                                     17250000
12/12         PERFORM 0800-SEND-MAP-RETURN                              17260000
           ELSE                                                         17270000
10/28        IF ACAT10IO-RETURN-MSG > SPACES                            17280000
                 MOVE ACAT10IO-RETURN-MSG TO SYSTEM-MSG                 17300000
              END-IF                                                    17310000
           END-IF.                                                      17320000
           MOVE ACAT10IO-AREA   TO  TWA-ACAT10IO-AREA.                  17330000
           PERFORM 0405-MOVE-SV-KEYS.                                   17340000
           MOVE SPACES        TO  MREJO, MREJCO, MSUBMO, MSECCO.        17350000
           MOVE EIBTRMID      TO TERM-ID.                               17360000
           MOVE 'ACA0'        TO TRAN-ID.                               17370000
           PERFORM 0600-DELETE-TSQ.                                     17380000
           PERFORM 0810-MAP-INPUT-AREA THRU 0810-EXIT.                  17390000
           PERFORM 0620-WRITE-TSQ.                                      17400000
           PERFORM 0800-SEND-MAP-RETURN.                                17420000
                                                                        17430000
      /                                                                 17440000
       0390-FUND-REGISTRATION.                                          17450000
           MOVE EIBTRMID      TO TERM-ID.                               17460000
           MOVE 'ACA0'          TO TRAN-ID.                             17470000
           PERFORM 0610-READ-TSQ.                                       17480000
                                                                        17490000
           IF TWA-STTLM-LCTN-CD  = '10'                                 17500000
      *===> XCTL TO ACAT5FSC                                            17510000
              MOVE EIBTRMID TO TERM-ID                                  17520000
              MOVE 'AMF5'  TO  TRAN-ID                                  17530000
              INITIALIZE ACATFIO-COMMAREA                               17540000
              PERFORM 0630-BUILD-ACATFIO-TS-RTN                         17550000
           ELSE                                                         17560000
               MOVE 'THIS ASSET DOES NOT HAVE FUND/REG INFO' TO         17570000
                    SYSTEM-MSG                                          17580000
               MOVE ATT-UNPROT-BRT  TO MNEXTA                           17590000
               SET CURSOR-ON-MNEXT  TO TRUE                             17600000
               SET ERROR-YES TO TRUE                                    17610000
12/12         SET DATA-ONLY TO TRUE                                     17630000
12/12         PERFORM 0800-SEND-MAP-RETURN                              17640000
           END-IF.                                                      17650000
      /                                                                 17660000
       0400-DISPLAY-ACAT10M.                                            17670000
      ***************************************************************** 17680000
      **     THIS ROUTINE SHOULD RETRIEVE INFO FROM ACAT_TRNFR       ** 17690000
      **          ACAT_INT_TRNF  ACAT_ASSET                          ** 17700000
      ***************************************************************** 17710000
                                                                        17720000
           MOVE LOW-VALUES TO ACAT10AO, ACAT10BO.                       17730000
           MOVE 'RT'  TO  ACAT10IO-FUNCTION.                            17740000
           MOVE LOW-VALUES     TO ACAT10IO-SV-DLVR-NBR,                 17750000
                                  ACAT10IO-SV-RCV-NBR,                  17760000
                                  ACAT10IO-SV-ACCT-DLVR-NBR,            17770000
                                  ACAT10IO-SV-ACCT-RCV-NBR,             17780000
                                  ACAT10IO-SV-STTLM-LCTN-CD,            17790000
                                  ACAT10IO-SV-SEC-ISSUE-CD,             17800000
LRM026                            ACAT10IO-SV-CRNCY-CD                          
12/07                             ACAT10IO-DC                           17810000
                                  ACAT10IO-DA.                          17820000
           MOVE ZERO           TO ACAT10IO-SV-ASSET-SEQ-NBR,            17830000
           IF FIRST-TIME                                                17840000
              MOVE 'N' TO FIRST-TIME-FLAG                               17850000
              IF ACAT-CALLING-PROG-NAME = 'ACAT21PT'                    17860000
                 SET ACAT10IO-SRCH-VTRNFR     TO TRUE                   17870000
                 SET ACAT10IO-SRCH-VTRNFR-PND TO TRUE                   17880000
                 MOVE SPACE TO ACAT10IO-SEARCH-VINITAST                 17890000
                 MOVE ACAT-CONTROL-NBR  TO ACAT10IO-SV-ACAT-CNTL-NBR    17900000
                 MOVE +0                TO TWA-SV-ASSET-SEQ-NBR         17910000
              ELSE                                                      17920000
                 SET ACAT10IO-SRCH-VTRNFR        TO TRUE                17930000
                 SET ACAT10IO-SRCH-VTRNFR-FWD    TO TRUE                17940000
                 MOVE SPACE TO ACAT10IO-SEARCH-VASSET                   17950000
              END-IF                                                    17960000
           ELSE                                                         17970000
              SET ACAT10IO-SRCH-VTRNFR        TO TRUE                   17980000
              SET ACAT10IO-SRCH-VTRNFR-FWD    TO TRUE                   17990000
              MOVE SPACE TO ACAT10IO-SEARCH-VASSET                      18000000
           END-IF.                                                      18010000
           IF  TWA-CLIENT-NO-9 = ACAT10IO-SV-CLIENT-NBR                 18020000
               CONTINUE                                                 18030000
           ELSE                                                         18040000
              SET ACAT10IO-FIRST-TIME   TO TRUE                         18050000
              MOVE TWA-CLIENT-NO-9      TO ACAT10IO-SV-CLIENT-NBR.      18060000
     **============================================================*    18070000
           PERFORM 0500-CALL-ACAT10DA.                                  18080000
           IF ACAT10IO-DB2-ERROR                                        18090000
              MOVE 'SELECT'         TO WS-DB2-ERROR-FUNCTION            18100000
              MOVE 'ACAT10DA'       TO WS-DB2-ERROR-PGM                 18110000
              MOVE ACAT10IO-SQLCAID TO WS-DB2-ERROR-TABLE               18120000
              MOVE ACAT10IO-SQLCODE TO WS-DB2-ERROR-ID                  18130000
              MOVE WS-DB2-ERROR-MSG TO SYSTEM-MSG                       18140000
              SET ERROR-YES TO TRUE                                     18150000
12/12         SET DATA-ONLY TO TRUE                                     18160000
12/12         PERFORM 0800-SEND-MAP-RETURN                              18170000
           ELSE                                                         18180000
              MOVE LOW-VALUES       TO ACAT10IO-SEARCH-VINITAST         18190000
                                       ACAT10IO-SEARCH-VASSET           18200000
              IF ACAT10IO-VTRNFR-FOUND                                  18210000
                 IF ACAT10IO-STCD LESS THAN 200                         18220000
                    IF ACAT10IO-VINITAST-FOUND                          18230000
                       SET ACAT10IO-SRCH-VINITAST-FWD TO TRUE           18240000
                       PERFORM 0520-CALL-ACAT10DC                       18250000
                    END-IF                                              18260000
                 ELSE                                                   18270000
                    IF ACAT10IO-VASSET-FOUND                            18280000
                       SET ACAT10IO-SRCH-VASSET-FWD TO TRUE             18290000
                       PERFORM 0520-CALL-ACAT10DC                       18300000
                    ELSE                                                18310000
                       IF ACAT10IO-VINITAST-FOUND                       18320000
                          SET ACAT10IO-SRCH-VINITAST-FWD TO TRUE        18330000
                          PERFORM 0520-CALL-ACAT10DC                    18340000
                       END-IF                                           18350000
                    END-IF                                              18360000
                 END-IF                                                 18370000
              ELSE                                                      18380000
                 INITIALIZE ACAT10IO-DC                                 18390000
              END-IF                                                    18400000
           END-IF.                                                      18410000
      *////////////////////////////////////////////////////////////////*18420000
12/14      IF ACAT10IO-DB2-ERROR                                        18430000
              MOVE 'ACAT10DC'       TO WS-DB2-ERROR-PGM                 18440000
              MOVE 'SELECT'         TO WS-DB2-ERROR-FUNCTION            18450000
              MOVE ACAT10IO-SQLCAID TO WS-DB2-ERROR-TABLE               18460000
              MOVE ACAT10IO-SQLCODE TO WS-DB2-ERROR-ID                  18470000
              MOVE WS-DB2-ERROR-MSG TO SYSTEM-MSG                       18480000
              SET ERROR-YES TO TRUE                                     18490000
12/12         SET DATA-ONLY TO TRUE                                     18510000
12/12         PERFORM 0800-SEND-MAP-RETURN                              18520000
           ELSE                                                         18530000
10/28        IF ACAT10IO-RETURN-MSG > SPACES                            18540000
                 MOVE ACAT10IO-RETURN-MSG TO SYSTEM-MSG                 18550000
              END-IF                                                    18560000
           END-IF.                                                      18570000
           MOVE ACAT10IO-AREA TO  TWA-ACAT10IO-AREA.                    18580000
           PERFORM 0405-MOVE-SV-KEYS.                                   18590000
                                                                        18600000
           MOVE EIBTRMID   TO TERM-ID.                                  18610000
           MOVE 'ACA0'     TO TRAN-ID.                                  18620000
           PERFORM 0600-DELETE-TSQ.                                     18630000
           PERFORM 0810-MAP-INPUT-AREA  THRU  0810-EXIT.                18640000
           PERFORM 0620-WRITE-TSQ.                                      18650000
           PERFORM 0800-SEND-MAP-RETURN.                                18660000
      *////////////////////////////////////////////////////////////////*18670000
      /                                                                 18680000
       0405-MOVE-SV-KEYS.                                               18690000
           MOVE TWA-CLIENT-NBR        TO TWA-SV-CLIENT-NBR.             18700000
           MOVE TWA-ACAT-CONTROL-NBR  TO TWA-SV-ACAT-CNTL-NO.           18710000
                                                                        18720000
           MOVE TWA-RR-CD          TO TWA-SV-RR-CD.                     18910000
           MOVE TWA-RCV-NBR        TO TWA-SV-BRKR.                      18920000
10/13      EVALUATE TWA-STCD                                            18940000
                 WHEN 'REQ'     MOVE  '100' TO TWA-SV-STCD              18950000
                 WHEN 'RQA'     MOVE  '110' TO TWA-SV-STCD              18960000
                 WHEN 'RAP'     MOVE  '130' TO TWA-SV-STCD              18970000
                 WHEN 'RQP'     MOVE  '130' TO TWA-SV-STCD              18980000
                 WHEN 'RQR'     MOVE  '140' TO TWA-SV-STCD              18990000
                 WHEN 'REV'     MOVE  '200' TO TWA-SV-STCD              19000000
                 WHEN 'RVA'     MOVE  '210' TO TWA-SV-STCD              19010000
                 WHEN 'RVE'     MOVE  '220' TO TWA-SV-STCD              19020000
                 WHEN 'RVX'     MOVE  '230' TO TWA-SV-STCD              19030000
DJ0001           WHEN 'RAR'     MOVE  '240' TO TWA-SV-STCD              19030000
                 WHEN 'STP'     MOVE  '300' TO TWA-SV-STCD              19040000
                 WHEN 'STC'     MOVE  '310' TO TWA-SV-STCD              19050000
                 WHEN 'CLP'     MOVE  '400' TO TWA-SV-STCD              19060000
                 WHEN 'MPT'     MOVE  '500' TO TWA-SV-STCD              19070000
                 WHEN 'MPP'     MOVE  '510' TO TWA-SV-STCD              19080000
                 WHEN 'REJ'     MOVE  '600' TO TWA-SV-STCD              19090000
           END-EVALUATE.                                                19100000
           MOVE TWA-RCV-NBR        TO TWA-SV-RCV-NBR.                   19110000
           MOVE TWA-ACCT-DLVR-NBR  TO TWA-SV-ACCT-DLVR-NBR.             19120000
           MOVE TWA-ACCT-RCV-NBR   TO TWA-SV-ACCT-RCV-NBR.              19130000
           MOVE TWA-STTLM-LCTN-CD  TO TWA-SV-STTLM-LCTN-CD.             19140000
LRM026     MOVE TWA-CRNCY-CD       TO TWA-SV-CRNCY-CD.                  19140000
           MOVE TWA-CNTRY-CD       TO TWA-SV-CNTRY-CD                   19150000
           MOVE TWA-SEC-NBR        TO TWA-SV-SEC-ISSUE-CD.              19160000
           MOVE ACAT10IO-SV-ASSET-SEQ-NBR                               19170000
                                   TO TWA-SV-ASSET-SEQ-NBR.             19180000
      /                                                                 19190000
       0410A-EDIT-TIF-INFO-CHG.                                         19200000
                                                                        19210000
           IF MBRL > +0                                                 19220000
              MOVE MBRI      TO  TWA-MBR                                19230000
           ELSE                                                         19240000
              IF MBRA = ERASE-KEY                                       19250000
                 MOVE SPACES TO TWA-MBR                                 19260000
              END-IF                                                    19270000
           END-IF.                                                      19280000
                                                                        19290000
           IF MACL > +0                                                 19300000
              MOVE MACI      TO  TWA-MAC                                19310000
           ELSE                                                         19320000
              IF MACA = ERASE-KEY                                       19330000
                 MOVE SPACES TO TWA-MAC                                 19340000
              END-IF                                                    19350000
           END-IF.                                                      19360000
                                                                        19370000
           IF MRRL > +0                                                 19380000
              MOVE MRRI      TO  TWA-MRR                                19390000
           ELSE                                                         19400000
              IF MRRA = ERASE-KEY                                       19410000
                 MOVE SPACES TO TWA-MRR                                 19420000
              END-IF                                                    19430000
           END-IF.                                                      19440000
                                                                        19450000
           IF MNAMEL > +0                                               19460000
              MOVE MNAMEI    TO  TWA-MNAME1                             19470000
           ELSE                                                         19480000
              IF MNAMEA = ERASE-KEY                                     19490000
                 MOVE SPACES TO TWA-MNAME1                              19500000
              END-IF                                                    19510000
           END-IF.                                                      19520000
                                                                        19530000
           IF MCSTPL > +0                                               19540000
              MOVE MCSTPI    TO  TWA-MCSTP                              19550000
           ELSE                                                         19560000
              IF MCSTPA = ERASE-KEY                                     19570000
                 MOVE SPACES TO TWA-MCSTP                               19580000
              END-IF                                                    19590000
           END-IF.                                                      19600000
                                                                        19610000
           IF MNAME2L > +0                                              19620000
              MOVE MNAME2I   TO  TWA-MNAME2                             19630000
           ELSE                                                         19640000
              IF MNAME2A = ERASE-KEY                                    19650000
                 MOVE SPACES TO TWA-MNAME2                              19660000
              END-IF                                                    19670000
           END-IF.                                                      19680000
                                                                        19690000
           IF MSSN1AL > +0                                              19700000
              MOVE MSSN1AI    TO  WS-SSN-ONE-1R, WS-SSN-ONE-1           19710000
           ELSE                                                         19720000
              IF MSSN1AA = ERASE-KEY                                    19730000
                 MOVE SPACES TO  WS-SSN-ONE-1R, WS-SSN-ONE-1            19740000
              END-IF                                                    19750000
           END-IF.                                                      19760000
                                                                        19770000
           IF MSSN1BL > +0                                              19780000
              MOVE MSSN1BI    TO  WS-SSN-ONE-2R, WS-SSN-ONE-2           19790000
           ELSE                                                         19800000
              IF MSSN1BA = ERASE-KEY                                    19810000
                 MOVE SPACES TO  WS-SSN-ONE-2R, WS-SSN-ONE-2            19820000
              END-IF                                                    19830000
           END-IF.                                                      19840000
                                                                        19850000
           IF MSSN1CL > +0                                              19860000
              MOVE MSSN1CI    TO  WS-SSN-ONE-3R, WS-SSN-ONE-3           19870000
           ELSE                                                         19880000
              IF MSSN1CA = ERASE-KEY                                    19890000
                 MOVE SPACES TO  WS-SSN-ONE-3R, WS-SSN-ONE-3            19900000
              END-IF                                                    19910000
           END-IF.                                                      19920000
                                                                        19930000
           MOVE WS-SSN-ONE-REFORM  TO  TWA-MSSN1.                       19940000
                                                                        19950000
           IF MSSN2AL > +0                                              19960000
              MOVE MSSN2AI    TO  WS-SSN-TWO-1R, WS-SSN-TWO-1           19970000
           ELSE                                                         19980000
              IF MSSN2AA = ERASE-KEY                                    19990000
                 MOVE SPACES TO  WS-SSN-TWO-1R, WS-SSN-TWO-1            20000000
              END-IF                                                    20010000
           END-IF.                                                      20020000
                                                                        20030000
           IF MSSN2BL > +0                                              20040000
              MOVE MSSN2BI    TO  WS-SSN-TWO-2R, WS-SSN-TWO-2           20050000
           ELSE                                                         20060000
              IF MSSN2BA = ERASE-KEY                                    20070000
                 MOVE SPACES TO  WS-SSN-TWO-2R, WS-SSN-TWO-2            20080000
              END-IF                                                    20090000
           END-IF.                                                      20100000
                                                                        20110000
           IF MSSN2CL > +0                                              20120000
              MOVE MSSN2CI   TO  WS-SSN-TWO-3R, WS-SSN-TWO-3            20130000
           ELSE                                                         20140000
              IF MSSN2CA = ERASE-KEY                                    20150000
                 MOVE SPACES TO  WS-SSN-TWO-3R, WS-SSN-TWO-3            20160000
              END-IF                                                    20170000
           END-IF.                                                      20180000
                                                                        20190000
           MOVE WS-SSN-TWO-REFORM  TO  TWA-MSSN2.                       20200000
                                                                        20210000
       0410A-EXIT.                                                      20220000
           EXIT.                                                        20230000
      /                                                                 20240000
       0410-EDIT-INPUT-FIELDS.                                          20250000
                                                                        20260000
           IF MBAL01L > +0                                              20280000
              MOVE MBAL01I  TO  TWA-MBAL01                              20290000
           ELSE                                                         20300000
              IF MBAL01A = ERASE-KEY                                    20310000
                 MOVE SPACES TO TWA-MBAL01                              20320000
LRM001           MOVE +1 TO MBAL01L                                             
              END-IF                                                    20330000
           END-IF.                                                      20340000
                                                                        20350000
           IF MBAL02L > +0                                              20360000
              MOVE MBAL02I  TO  TWA-MBAL02                              20370000
           ELSE                                                         20380000
              IF MBAL02A = ERASE-KEY                                    20390000
                 MOVE SPACES TO TWA-MBAL02                              20400000
LRM001           MOVE +1 TO MBAL02L                                             
              END-IF                                                    20410000
           END-IF.                                                      20420000
                                                                        20430000
           IF MBAL05L > +0                                              20440000
              MOVE MBAL05I  TO  TWA-MBAL05                              20450000
           ELSE                                                         20460000
              IF MBAL05A = ERASE-KEY                                    20470000
                 MOVE SPACES TO TWA-MBAL05                              20480000
LRM001           MOVE +1 TO MBAL05L                                             
              END-IF                                                    20490000
           END-IF.                                                      20500000
                                                                        20510000
           IF MSMAL > +0                                                20520000
              MOVE MSMAI  TO  TWA-MSMA                                  20530000
           ELSE                                                         20540000
              IF MSMAA = ERASE-KEY                                      20550000
                 MOVE SPACES TO TWA-MSMA                                20560000
LRM001           MOVE +1 TO MSMAL                                               
              END-IF                                                    20570000
           END-IF.                                                      20580000
                                                                        20590000
           IF MCDL > +0                                                 20600000
              MOVE MCDI    TO  TWA-MCD                                  20610000
           ELSE                                                         20620000
              IF MCDA = ERASE-KEY                                       20630000
                 MOVE SPACES  TO TWA-MCD                                20640000
              END-IF                                                    20650000
           END-IF.                                                      20660000
                                                                        20670000
           IF MQTYL > +0                                                20680000
              MOVE MQTYI   TO  TWA-MQTY                                 20690000
           ELSE                                                         20700000
              IF MQTYA = ERASE-KEY                                      20710000
                 MOVE SPACES  TO TWA-MQTY                               20720000
              END-IF                                                    20730000
           END-IF.                                                      20740000
                                                                        20750000
           IF MAMTL > +0                                                20760000
              MOVE MAMTI   TO  TWA-MAMT                                 20770000
           ELSE                                                         20780000
              IF MAMTA = ERASE-KEY                                      20790000
                 MOVE SPACES  TO TWA-MAMT                               20800000
              END-IF                                                    20810000
           END-IF.                                                      20820000
                                                                        20830000
           IF MDESCL > +0                                               20840000
              MOVE MDESCI  TO  TWA-MDESC                                20850000
           ELSE                                                         20860000
              IF MDESCA = ERASE-KEY                                     20870000
                 MOVE SPACES  TO TWA-MDESC                              20880000
              END-IF                                                    20890000
           END-IF.                                                      20900000
                                                                        20910000
           IF MDESC2L > +0                                              20920000
              MOVE MDESC2I TO  TWA-MDESC2                               20930000
           ELSE                                                         20940000
              IF MDESC2A = ERASE-KEY                                    20950000
                 MOVE SPACES  TO TWA-MDESC2                             20960000
              END-IF                                                    20970000
           END-IF.                                                      20980000
                                                                        20990000
           IF MDESC3L > +0                                              21000000
              MOVE MDESC3I TO  TWA-MDESC3                               21010000
           ELSE                                                         21020000
              IF MDESC3A = ERASE-KEY                                    21030000
                 MOVE SPACES  TO TWA-MDESC3                             21040000
              END-IF                                                    21050000
           END-IF.                                                      21060000
                                                                                
LRM016     IF MDELL > +0                                                        
LRM016        MOVE MDELI TO    TWA-MDEL                                         
LRM016     ELSE                                                                 
LRM016        IF MDELA = ERASE-KEY                                              
LRM016           MOVE SPACES  TO TWA-MDEL                                       
LRM016        END-IF                                                            
LRM016     END-IF.                                                              
LRM016     MOVE TWA-MDEL TO WS-SAVE-MDEL-IND.                                   
      **************************************************************    21070000
                                                                        21080000
           IF MNEXTL > +0                                               21090000
              MOVE MNEXTI TO   TWA-MNEXT MNEXTO                         21100000
           ELSE                                                         21110000
              IF MNEXTA = ERASE-KEY                                     21120000
                 MOVE SPACES  TO TWA-MNEXT MNEXTO                       21130000
              END-IF                                                    21140000
           END-IF.                                                      21150000
                                                                        21160000
           IF MSUBML > +0                                               21170000
              MOVE MSUBMI   TO TWA-MSUBM , MSUBMO                       21180000
           ELSE                                                         21190000
              IF MSUBMA = ERASE-KEY                                     21200000
                 MOVE SPACES TO TWA-MSUBM, MSUBMO                       21210000
              END-IF                                                    21220000
           END-IF.                                                      21230000
                                                                        21240000
           IF MSECCL > +0                                               21250000
              MOVE MSECCI   TO TWA-MSECC, MSECCO                        21260000
           ELSE                                                         21270000
              IF MSECCA = ERASE-KEY                                     21280000
                 MOVE SPACES TO TWA-MSECC MSECCO                        21290000
              END-IF                                                    21300000
           END-IF.                                                      21310000
                                                                        21320000
           IF MREJL > +0                                                21330000
              MOVE MREJI    TO TWA-MREJ MREJO                           21340000
              MOVE TWA-MREJ TO WS-MREJ                                  21350000
              IF (WS-MREJ1 = '?' OR SPACE )  AND                        21360000
                  WS-MREJ2 = LOW-VALUE                                  21370000
                 MOVE SPACE TO WS-MREJ2                                 21380000
                 MOVE WS-MREJ TO TWA-MREJ                               21390000
              ELSE                                                      21400000
                 IF (WS-MREJ2 = '?' OR SPACE ) AND                      21410000
                     WS-MREJ1 = LOW-VALUE                               21420000
                    MOVE SPACE TO WS-MREJ1                              21430000
                    MOVE WS-MREJ TO TWA-MREJ                            21440000
                 ELSE                                                   21450000
                    CONTINUE                                            21460000
                 END-IF                                                 21470000
              END-IF                                                    21480000
           ELSE                                                         21490000
              IF MREJA = ERASE-KEY                                      21500000
                 MOVE SPACES TO TWA-MREJ  MREJO                         21510000
              END-IF                                                    21520000
           END-IF.                                                      21530000
                                                                        21540000
           IF MREJCL > +0                                               21550000
              MOVE MREJCI   TO TWA-MREJC   MREJCO                       21560000
              MOVE TWA-MREJC TO WS-MREJC                                21570000
              IF (WS-MREJC1 = '?' OR SPACE ) AND                        21580000
                 WS-MREJC2 = LOW-VALUE                                  21590000
                 MOVE SPACE TO WS-MREJC2                                21600000
                 MOVE WS-MREJC TO TWA-MREJC                             21610000
              ELSE                                                      21620000
                 IF (WS-MREJC2 = '?' OR SPACE) AND                      21630000
                    WS-MREJC1 = LOW-VALUE                               21640000
                    MOVE SPACE TO WS-MREJC1                             21650000
                    MOVE WS-MREJC TO TWA-MREJC                          21660000
                 ELSE                                                   21670000
                    CONTINUE                                            21680000
                 END-IF                                                 21690000
              END-IF                                                    21700000
           ELSE                                                         21710000
              IF MREJCA = ERASE-KEY                                     21720000
                 MOVE SPACES TO TWA-MREJC  MREJCO                       21730000
              END-IF                                                    21740000
           END-IF.                                                      21750000
                                                                        21760000
           EVALUATE TWA-CSH-MGN-SHRT-CD                                 21770000
              WHEN 'C'  MOVE '01' TO WS-MTYPE                           21780000
              WHEN 'M'  MOVE '02' TO WS-MTYPE                           21790000
              WHEN 'S'  MOVE '05' TO WS-MTYPE                           21800000
           END-EVALUATE.                                                21810000
                                                                        21820000
           IF MBAL01L = +0   AND  MNEXTL = +0  AND MWIL = +0    AND     21830000
              MBAL02L = +0   AND  MTYPEL = +0  AND MCDL = +0    AND     21840000
              MBAL05L = +0   AND  MSTTLL = +0  AND MQTYL = +0   AND     21850000
              MSECRL  = +0   AND  MDESCL = +0  AND MAMTL = +0   AND     21860000
              MDESC2L = +0   AND  MSUBML = +0  AND MSECCL = +0  AND     21870000
              MDESC3L = +0   AND  MREJL = +0   AND MREJCL = +0  AND     21880000
              MSRSNL = +0    AND  MSMAL = +0                            21890000
              MOVE ATT-UNPROT TO MBAL01A, MBAL02A, MBAL05A, MSMAA,      21900000
                                 MCDA, MQTYA, MAMTA, MSUBMA, MSECCA,    21910000
                                 MREJA, MREJCA, MNEXTA                  21920000
LRM016        IF TWA-STCD >= '200' AND < '300'                                  
LRM016        AND ACAT-FULL-DLVY-ASSET-DELETE = '1'                             
LRM016           MOVE ATT-UNPROT TO MDELA                                       
LRM016        ELSE                                                              
LRM016           MOVE ATT-PROT   TO MDELA                                       
LRM016           MOVE ATT-ASKIP-DRK  TO MDELTA                                  
LRM016        END-IF                                                            
              SET NO-INPUT     TO  TRUE                                 21940000
           END-IF.                                                      21950000
                                                                        21960000
       0410-EXIT.                                                       21970000
           EXIT.                                                        21980000
      ***************************************************************** 21990000
      /                                                                 22000000
       0415-EDIT-ACAT00M-RTN.                                           22010000
      *----------------------------------------------------------------*22020000
      *             EDIT  TRAILER  MAP   (SEARCH BAR ENTRIES)          *22030000
      *----------------------------------------------------------------*22040000
                                                                        22050000
           MOVE LOW-VALUES  TO ACAT10IO-SAVE-KEYS, ACAT10IO-DA,         22060000
                               ACAT10IO-SEARCH-VTRNFR.                  22070000
                                                                        22080000
           MOVE ZERO    TO ACAT10IO-BAL01, ACAT10IO-BAL02,              22090000
                           ACAT10IO-BAL05, ACAT10IO-SMA.                22100000
                                                                        22110000
           MOVE TWA-CLIENT-NO-9      TO TWA-SV-CLIENT-NBR.              22120000
                                                                        22130000
           IF MMBRL > 0                                                 22140000
              SET ACAT-SRCH-ENTRY   TO TRUE                             22150000
              IF MMBRI = SPACES                                         22160000
                 MOVE SPACES TO ACAT-INP-BRANCH, TWA-MMBR               22170000
                                TWA-SV-BRANCH-CD                        22180000
              ELSE                                                      22190000
                 MOVE MMBRI TO ACAT-INP-BRANCH, TWA-MMBR                22200000
                                TWA-SV-BRANCH-CD                        22210000
           ELSE                                                         22220000
              IF MMBRA = ERASE-KEY                                      22230000
                 MOVE SPACES TO ACAT-INP-BRANCH, TWA-MMBR               22240000
                                TWA-SV-BRANCH-CD                        22250000
              ELSE                                                      22260000
                 MOVE ACAT-INP-BRANCH  TO  TWA-MMBR                     22270000
                                           TWA-SV-BRANCH-CD             22280000
              END-IF                                                    22290000
           END-IF.                                                      22300000
                                                                        22310000
           IF MMACL > 0                                                 22320000
              SET ACAT-SRCH-ENTRY TO TRUE                               22330000
              IF MMACI = SPACES                                         22340000
                 MOVE SPACES TO ACAT-INP-ACCOUNT, TWA-MMAC              22350000
                                TWA-SV-ACCT-CD                          22360000
              ELSE                                                      22370000
                 MOVE MMACI TO ACAT-INP-ACCOUNT, TWA-MMAC               22380000
                                TWA-SV-ACCT-CD                          22390000
           ELSE                                                         22400000
              IF MMACA = ERASE-KEY                                      22410000
                 MOVE SPACES TO ACAT-INP-ACCOUNT, TWA-MMAC              22420000
                                TWA-SV-ACCT-CD                          22430000
              ELSE                                                      22440000
                 MOVE ACAT-INP-ACCOUNT TO  TWA-MMAC, TWA-SV-ACCT-CD     22450000
              END-IF                                                    22460000
           END-IF.                                                      22470000
                                                                        22480000
           IF MMRRL > 0                                                 22490000
              SET ACAT-SRCH-ENTRY TO TRUE                               22500000
              IF MMRRI = SPACES                                         22510000
                 MOVE SPACES TO ACAT-INP-RR, TWA-MMRR, TWA-SV-RR-CD     22520000
              ELSE                                                      22530000
                 MOVE MMRRI TO ACAT-INP-RR, TWA-MMRR, TWA-SV-RR-CD      22540000
           ELSE                                                         22550000
              IF MMRRA = ERASE-KEY                                      22560000
                 MOVE SPACES TO ACAT-INP-RR, TWA-SV-RR-CD, TWA-MMRR,    22570000
              ELSE                                                      22580000
                 MOVE ACAT-INP-RR  TO  TWA-SV-RR-CD, TWA-MMRR,          22590000
              END-IF                                                    22600000
           END-IF.                                                      22610000
                                                                        22620000
           IF MMTFRL > 0                                                22630000
              SET ACAT-SRCH-ENTRY TO TRUE                               22640000
              IF MMTFRI = SPACES                                        22650000
                 MOVE SPACES TO ACAT-INP-TFR-TYP, TWA-TFR-TYPE, TWA-MTFR22660000
              ELSE                                                      22670000
                 MOVE MMTFRI TO ACAT-INP-TFR-TYP, TWA-TFR-TYPE, TWA-MTFR22680000
           ELSE                                                         22690000
              IF MMTFRA = ERASE-KEY                                     22700000
                 MOVE SPACES TO ACAT-INP-TFR-TYP, TWA-TFR-TYPE, TWA-MTFR22710000
              ELSE                                                      22720000
                 MOVE ACAT-INP-TFR-TYP TO TWA-TFR-TYPE, TWA-MTFR        22730000
              END-IF                                                    22740000
           END-IF.                                                      22750000
                                                                        22760000
           IF MMBKRL > 0                                                22770000
              SET ACAT-SRCH-ENTRY TO TRUE                               22780000
              IF MMBKRI = SPACES                                        22790000
                 MOVE SPACES TO ACAT-INP-CONTRA-BKR,                    22800000
                                TWA-SV-BRKR, TWA-MCBRKR                 22810000
              ELSE                                                      22820000
              MOVE MMBKRI TO ACAT-INP-CONTRA-BKR,                       22830000
                                TWA-SV-BRKR, TWA-MCBRKR                 22840000
           ELSE                                                         22850000
              IF MMBKRA = ERASE-KEY                                     22860000
                 MOVE SPACES TO ACAT-INP-CONTRA-BKR,                    22870000
                                TWA-SV-BRKR, TWA-MCBRKR                 22880000
              ELSE                                                      22890000
                 MOVE ACAT-INP-CONTRA-BKR TO TWA-SV-BRKR, TWA-MCBRKR    22900000
              END-IF                                                    22910000
           END-IF.                                                      22920000
                                                                        22930000
           IF MMSTATL > 0                                               22940000
              SET ACAT-SRCH-ENTRY TO TRUE                               22950000
              IF MMSTATI = SPACES                                       22960000
                 MOVE SPACES TO ACAT-INP-STATUS, TWA-SV-STCD TWA-MSTAT  22970000
              ELSE                                                      22980000
                 MOVE MMSTATI  TO  TWA-MSTAT, ACAT-INP-STATUS           22990000
10/13            EVALUATE TWA-MSTAT                                     23000000
                    WHEN 'REQ'  MOVE  '100' TO TWA-SV-STCD              23010000
                    WHEN 'RQA'  MOVE  '110' TO TWA-SV-STCD              23020000
                    WHEN 'RAP'  MOVE  '120' TO TWA-SV-STCD              23030000
                    WHEN 'RQP'  MOVE  '130' TO TWA-SV-STCD              23040000
                    WHEN 'RQR'  MOVE  '140' TO TWA-SV-STCD              23050000
                    WHEN 'REV'  MOVE  '200' TO TWA-SV-STCD              23060000
                    WHEN 'RVA'  MOVE  '210' TO TWA-SV-STCD              23070000
                    WHEN 'RVE'  MOVE  '220' TO TWA-SV-STCD              23080000
                    WHEN 'RVX'  MOVE  '230' TO TWA-SV-STCD              23090000
                    WHEN 'STP'  MOVE  '300' TO TWA-SV-STCD              23100000
                    WHEN 'STC'  MOVE  '310' TO TWA-SV-STCD              23110000
                    WHEN 'CLP'  MOVE  '400' TO TWA-SV-STCD              23120000
                    WHEN 'PUR'  MOVE  '500' TO TWA-SV-STCD              23130000
                    WHEN 'MPP'  MOVE  '510' TO TWA-SV-STCD              23140000
                    WHEN 'REJ'  MOVE  '600' TO TWA-SV-STCD              23150000
                 END-EVALUATE                                           23160000
              END-IF                                                    23170000
           ELSE                                                         23180000
              IF MMSTATA = ERASE-KEY                                    23190000
                 MOVE SPACES TO ACAT-INP-STATUS, TWA-MSTAT, TWA-SV-STCD 23200000
              ELSE                                                      23210000
                 MOVE ACAT-INP-STATUS TO TWA-SV-STCD, TWA-MSTAT         23220000
              END-IF                                                    23230000
           END-IF.                                                      23240000
                                                                        23250000
           IF MMBRL = +0  AND  MMACL = +0   AND  MMRRL = +0  AND        23340000
              MMTFRL = +0  AND MMBKRL = +0  AND  MMSTATL = +0           23350000
               MOVE SPACES TO ACAT-SEARCH-RETURN                        23360000
               SET ACAT-NO-SRCH-ENTRY TO TRUE                           23370000
           END-IF.                                                      23380000
     *                                                                  23390000
           IF ACAT-SRCH-ENTRY                                           23400000
              MOVE SPACES TO ACAT-SEARCH-RETURN                         23410000
              MOVE LOW-VALUES  TO ACAT10IO-INPUT                        23420000
              PERFORM 0490-CALL-ACATSRCH-RTN                            23430000
              IF ACAT-SRCH-MSG = SPACES OR LOW-VALUES                   23440000
                 CONTINUE                                               23450000
              ELSE                                                      23460000
                 MOVE ACAT-SRCH-MSG TO TWA-RETURN-MSG                   23470000
                 SET ERROR-YES TO TRUE                                  23480000
01/14            PERFORM 0830-ERROR-RTN                                 23490000
              END-IF                                                    23520000
           END-IF.                                                      23530000
      ***************************************************************** 23540000
      /                                                                 23550000
       0420-VALIDATE-MAP-INPUT.                                         23560000
                                                                        23570000
           IF (TWA-TIF-CHG-AREA > LOW-VALUES                            23580000
           AND (MBRL > +0 OR MACL > +0 OR MRRL > +0 OR                  23590000
                MNAMEL > +0 OR MNAME2L > +0 OR MCSTPL > +0 OR           23600000
                MSSN1AL > +0 OR MSSN1BL > +0 OR MSSN1CL > +0 OR         23610000
                MSSN2AL > +0 OR MSSN2BL > +0 OR MSSN2CL > +0 ))         23620000
01/14      OR  TWA-TIF-ACCT-CHG                                         23630000
              PERFORM 0420A-VALIDATE-TIF-INPUT THRU 0420A-EXIT          23640000
LRM*****    TIF-ACCT REALLY CHANGED ???                                 23650000
              IF (TWA-MBR > SPACE                                       23660000
              AND TWA-MBR NOT = TWA-BRANCH-CD)                          23670000
              OR (TWA-MAC > SPACE                                       23680000
              AND TWA-MAC NOT = TWA-ACCT-CD)                            23690000
                 PERFORM 0460-INSERT-INITRNF                            23700000
           END-IF.                                                      23710000
                                                                        23720000
           IF MCDL > +0    AND                                          23730000
              MSUBML > +0  AND   MSECCL > +0  AND                       23740000
              MREJL  > +0  AND   MREJCL > +0                            23750000
              MOVE ATT-UNPROT-BRT        TO MSUBMA                      23760000
              MOVE 'INVALID ENTRIES'     TO SYSTEM-MSG                  23770000
              SET CURSOR-ON-MSUBM        TO TRUE                        23780000
              SET ERROR-YES TO TRUE                                     23790000
01/14         PERFORM 0830-ERROR-RTN                                    23800000
           END-IF.                                                      23830000
                                                                        23840000
01/15      IF TWA-VINITAST-NOT-FOUND  AND                               23850000
01/15         TWA-STCD < '200'        AND                               23860000
              MCDL > +0               AND                               23870000
              (MBAL01L > +0     OR                                      23880000
               MBAL02L > +0     OR                                      23890000
               MBAL05L > +0     OR                                      23900000
               MSMAL > +0       OR                                      23910000
               MQTYL > +0       OR                                      23920000
               MAMTL > +0)                                              23930000
               MOVE 'NO ASSET POSITION, CAN NOT MAKE CHANGES'           23940000
                 TO SYSTEM-MSG                                          23950000
01/19         MOVE TWA-MCD               TO MCDO                        23960000
              MOVE ATT-UNPROT-BRT        TO MCDA                        23970000
              SET CURSOR-ON-MCD          TO TRUE                        23980000
              SET ERROR-YES TO TRUE                                     23990000
01/19         SET DATA-ONLY TO TRUE                                     24000000
              PERFORM 0830-ERROR-RTN                                    24010000
01/15      END-IF.                                                      24020000
                                                                        24030000
           IF (MBAL01L > +0            OR                               24040000
               TWA-MBAL01 NOT = TWA-ORIG-BAL01)                         24050000
           OR (MBAL02L > +0            OR                               24060000
               TWA-MBAL02 NOT = TWA-ORIG-BAL02)                         24070000
           OR (MBAL05L > +0            OR                               24080000
               TWA-MBAL05 NOT = TWA-ORIG-BAL05)                         24090000
           OR (MSMAL > +0              OR                               24100000
               TWA-MSMA   NOT = TWA-ORIG-SMA)                           24110000
           OR (MQTYL > +0              OR                               24120000
               TWA-MQTY   NOT = TWA-ORIG-QTY)                           24130000
           OR (MAMTL > +0              OR                               24140000
               TWA-MAMT   NOT = TWA-ORIG-AMT)                           24150000
              PERFORM 0425-VALIDATE-AMOUNT THRU 0425-EXIT               24160000
           END-IF.                                                      24170000
                                                                        24180000
           IF (TWA-MBAL01 = LOW-VALUE  AND                              24190000
               TWA-MBAL02 = LOW-VALUE  AND                              24200000
               TWA-MBAL05 = LOW-VALUE  AND                              24210000
               TWA-MSMA   = LOW-VALUE  AND                              24220000
               TWA-MQTY   = LOW-VALUE  AND                              24230000
               TWA-MAMT   = LOW-VALUE )                                 24240000
           OR                                                           24250000
              (TWA-MBAL01  = TWA-ORIG-BAL01  AND                        24260000
               TWA-MBAL02  = TWA-ORIG-BAL02  AND                        24270000
               TWA-MBAL05  = TWA-ORIG-BAL05  AND                        24280000
               TWA-MSMA    = TWA-ORIG-SMA    AND                        24290000
               TWA-MQTY    = TWA-ORIG-QTY    AND                        24300000
               TWA-MAMT    = TWA-ORIG-AMT)                              24310000
12/17          IF TWA-MCD = LOW-VALUE                                   24320000
                  MOVE SPACE TO WS-CURSOR                               24330000
                  GO TO VALIDATE-OTHER-FIELDS                           24340000
               ELSE                                                     24350000
                  IF TWA-MCD = SPACE                                    24360000
                    IF TWA-NSCC-WTHLD-CD = 'W'                          24370000
LRM030                 IF TWA-WHI-STTS-CD = 'C'                                 
LRM030                    MOVE                                          24450000
LRM030                    'WARNING - SUBMITTING CONTRA CUSIP' TO        24460000
LRM030                             SYSTEM-MSG                           24470000
LRM030                    MOVE 'W' TO TWA-WHI-STTS-CD                           
LRM030                    SET CURSOR-ON-MCD TO TRUE                     24480000
LRM030                    SET ERROR-YES TO TRUE                         24490000
LRM030                    PERFORM 0830-ERROR-RTN                        24500000
LRM030                 END-IF                                                   
                       PERFORM 0450-PROCESS-INPUT THRU    0450-EXIT     24380000
                    ELSE                                                24390000
                       IF (TWA-STCD = '200'   OR                        24400000
                          (TWA-STCD > '200' AND                         24410000
                           TWA-STCD < '300'))                           24420000
                          PERFORM 0450-PROCESS-INPUT THRU  0450-EXIT    24430000
                       ELSE                                             24440000
                          MOVE                                          24450000
                          'CAN NOT REVERSE CHANGES ' TO                 24460000
                                   SYSTEM-MSG                           24470000
                          SET CURSOR-ON-MCD TO TRUE                     24480000
                          SET ERROR-YES TO TRUE                         24490000
01/14                     PERFORM 0830-ERROR-RTN                        24500000
01/15                  END-IF                                           24510000
12/17               END-IF                                              24520000
                  ELSE                                                  24530000
01/26               IF MCDL > +0     AND                                24540000
                       TWA-MCD = 'C'                                    24550000
                        MOVE TWA-MCD TO MCDO                            24560000
01/22                   SET CURSOR-ON-MBAL01 TO TRUE                    24570000
                        MOVE ' ENTER AMOUNT CHANGES ! ' TO SYSTEM-MSG   24580000
                        SET ERROR-YES TO TRUE                           24590000
                        PERFORM 0830-ERROR-RTN                          24600000
12/23               END-IF                                              24630000
12/23             END-IF                                                24640000
               END-IF                                                   24650000
12/23      END-IF.                                                      24660000
                                                                        24670000
????       IF TWA-MCD = 'W'                                             24680000
12/12         IF TWA-STCD < '200'                                       24690000
                 PERFORM 0450-PROCESS-INPUT THRU 0450-EXIT              24700000
              ELSE                                                      24710000
                 SET CURSOR-ON-MCD TO TRUE                              24720000
                 MOVE TWA-MCD      TO MCDO                              24730000
                 MOVE ATT-UNPROT-BRT TO MCDA                            24740000
                 MOVE                                                   24750000
                 'CAN"T WITHHOLD ASSET IN THIS STATUS' TO SYSTEM-MSG    24760000
01/19            SET DATA-ONLY TO TRUE                                  24770000
01/14            PERFORM 0830-ERROR-RTN                                 24780000
              END-IF                                                    24800000
           ELSE                                                         24810000
              IF TWA-MCD = 'D'                                          24820000
12/23            IF  TWA-STCD < '300'                                   24830000
                    PERFORM 0450-PROCESS-INPUT THRU 0450-EXIT           24840000
                 ELSE                                                   24850000
                    SET CURSOR-ON-MCD TO TRUE                           24860000
                    MOVE TWA-MCD        TO MCDO                         24870000
                    MOVE ATT-UNPROT-BRT TO MCDA                         24880000
                    MOVE                                                24890000
                    'CAN"T DELETE ASSET IN THIS STATUS'                 24900000
                                         TO SYSTEM-MSG                  24910000
01/19               SET DATA-ONLY TO TRUE                               24920000
01/14               PERFORM 0830-ERROR-RTN                              24930000
                 END-IF                                                 24950000
           END-IF.                                                      25070000
                                                                        25080000
       VALIDATE-OTHER-FIELDS.                                           25090000
                                                                        25100000
           IF MSUBML = +0                                               25110000
              CONTINUE                                                  25120000
           ELSE                                                         25130000
              PERFORM 0430-VALIDATE-SUBMIT-FIELDS                       25140000
           END-IF.                                                      25150000
                                                                        25160000
12/28      IF MSECCL > +0                                               25170000
12/28         PERFORM 0430A-VALIDATE-SECCMNT-FIELD THRU 0430A-EXIT      25180000
12/28      END-IF.                                                      25190000
                                                                        25200000
      **--------------------------------------------------------------* 25210000
      *             VALIDATE REJ & REJC FIELDS                        * 25220000
      **--------------------------------------------------------------* 25230000
                                                                        25240000
           IF TWA-INIT-TRANS-TYPE-CD = 'R'                              25250000
              PERFORM 0440B-VALIDATE-R-FIELDS THRU 0440B-EXIT           25260000
           ELSE                                                         25270000
              PERFORM 0440A-VALIDATE-NON-R-FIELDS THRU 0440A-EXIT       25280000
           END-IF.                                                      25290000
                                                                        25300000
           SET INPUT-VALIDATED TO TRUE.                                 25310000
                                                                        25320000
       0420-EXIT.                                                       25330000
           EXIT.                                                        25340000
      /                                                                 25350000
       0420A-VALIDATE-TIF-INPUT.                                        25360000
                                                                        25370000
           SET ACATNAIO-NA-READ TO TRUE.                                25380000
           MOVE TWA-CLIENT-NO-X(2 : 3) TO ACATNAIO-CLIENT.              25390000
                                                                        25400000
           IF TWA-MBR > SPACE                                           25410000
              MOVE TWA-MBR             TO ACATNAIO-BR                   25420000
           ELSE                                                         25430000
              MOVE TWA-BRANCH-CD       TO ACATNAIO-BR                   25440000
           END-IF.                                                      25450000
                                                                        25460000
           IF TWA-MAC > SPACE                                           25470000
              MOVE TWA-MAC             TO ACATNAIO-AC                   25480000
           ELSE                                                         25490000
              MOVE TWA-ACCT-CD         TO ACATNAIO-AC                   25500000
           END-IF.                                                      25510000
                                                                        25520000
           PERFORM LINK-TO-ACATNAIO-RTN.                                25530000
                                                                        25540000
           IF ACATNAIO-NOT-FOUND                                        25550000
              IF TWA-MBR > SPACE   AND                                  25560000
                 TWA-MAC > SPACE                                        25570000
                 MOVE ATT-UNPROT-BRT TO MBRA                            25580000
                 SET CURSOR-ON-MBR   TO TRUE                            25590000
                 MOVE 'BRANCH/ACCOUNT NOT ON N/A' TO SYSTEM-MSG         25600000
                 SET ERROR-YES TO TRUE                                  25610000
12/12            PERFORM 0830-ERROR-RTN                                 25620000
              ELSE                                                      25650000
                 IF TWA-MBR > SPACE  AND                                25660000
                    (TWA-MAC = SPACE OR LOW-VALUE)                      25670000
                    MOVE ATT-UNPROT-BRT TO MBRA                         25680000
                    SET CURSOR-ON-MBR   TO TRUE                         25690000
                    MOVE 'BRANCH NOT ON N/A' TO SYSTEM-MSG              25700000
                    SET ERROR-YES TO TRUE                               25710000
12/12               PERFORM 0830-ERROR-RTN                              25720000
                 ELSE                                                   25750000
                    IF TWA-MAC > SPACE   AND                            25760000
                       (TWA-MBR = SPACE OR LOW-VALUES)                  25770000
                       MOVE ATT-UNPROT-BRT TO MACA                      25780000
                       SET CURSOR-ON-MBR   TO TRUE                      25790000
                       MOVE 'BRANCH/ACCOUNT NOT ON N/A' TO SYSTEM-MSG   25800000
                       SET ERROR-YES TO TRUE                            25810000
12/12                  PERFORM 0830-ERROR-RTN                           25820000
                    END-IF                                              25850000
                 END-IF                                                 25860000
              END-IF                                                    25870000
           END-IF.                                                      25880000
                                                                        25890000
           IF TWA-MRR > SPACE                                           25900000
              IF TWA-MRR = ACATNAIO-RR                                  25910000
                 CONTINUE                                               25920000
              ELSE                                                      25930000
                 MOVE ATT-UNPROT-BRT TO MRRA                            25940000
                 SET CURSOR-ON-MRR TO TRUE                              25950000
                 MOVE 'RR NOT MATCH WITH BRANCH/ACCT' TO SYSTEM-MSG     25960000
                 SET ERROR-YES TO TRUE                                  25970000
12/12            PERFORM 0830-ERROR-RTN                                 25980000
              END-IF                                                    26010000
           ELSE                                                         26020000
              MOVE ACATNAIO-RR TO TWA-MRR, MRRO                         26030000
           END-IF.                                                      26040000
                                                                        26050000
           IF TWA-MNAME1 > SPACES                                       26060000
              IF TWA-MNAME1 = ACATNAIO-NAME                             26070000
                 CONTINUE                                               26080000
              ELSE                                                      26090000
                 IF TWA-MNAME1 NOT = ACATNAIO-NAME                      26100000
                    MOVE ATT-UNPROT-BRT TO MNAMEA, MNAME2A              26110000
                    SET CURSOR-ON-MNAME TO TRUE                         26120000
                    MOVE ' **** INVALID NAME ****' TO SYSTEM-MSG        26130000
                    SET ERROR-YES TO TRUE                               26140000
12/12               PERFORM 0830-ERROR-RTN                              26150000
                 ELSE                                                   26180000
01/14               MOVE ACATNAIO-NAME TO MNAMEO, TWA-MNAME1            26190000
                    MOVE ACATNAIO-NAME2 TO MNAME2O, TWA-MNAME2          26200000
                 END-IF                                                 26210000
              END-IF                                                    26220000
           ELSE                                                         26230000
              IF TWA-MNAME1 = SPACES                                    26240000
01/14            MOVE ACATNAIO-NAME TO MNAMEO, TWA-MNAME1               26250000
                 MOVE ACATNAIO-NAME2 TO MNAME2O, TWA-MNAME2             26260000
              END-IF                                                    26270000
           END-IF.                                                      26280000
                                                                        26290000
           IF TWA-MNAME2 > SPACES                                       26300000
              IF TWA-MNAME2 = ACATNAIO-NAME2                            26310000
                 CONTINUE                                               26320000
              ELSE                                                      26330000
                 IF TWA-MNAME2 NOT = ACATNAIO-NAME2                     26340000
                    MOVE ATT-UNPROT-BRT TO MNAME2A                      26350000
                    SET CURSOR-ON-MNAME2 TO TRUE                        26360000
                    MOVE ' **** INVALID NAME ****' TO SYSTEM-MSG        26370000
                    SET ERROR-YES TO TRUE                               26380000
12/12               PERFORM 0830-ERROR-RTN                              26390000
                 ELSE                                                   26400000
                    MOVE ACATNAIO-NAME2 TO MNAME2O, TWA-MNAME2          26410000
                 END-IF                                                 26420000
              END-IF                                                    26430000
           ELSE                                                         26440000
              IF TWA-MNAME2 = SPACES                                    26450000
                 MOVE ACATNAIO-NAME2 TO MNAME2O, TWA-MNAME2             26460000
              END-IF                                                    26470000
           END-IF.                                                      26480000
                                                                        26490000
01/14      IF (TWA-MNAME1 = LOW-VALUE OR SPACES) AND                    26500000
              (TWA-MNAME2 = LOW-VALUE OR SPACES)                        26510000
01/14         MOVE ACATNAIO-NAME TO MNAMEO, TWA-MNAME1                  26520000
              MOVE ACATNAIO-NAME2 TO MNAME2O, TWA-MNAME2                26530000
           END-IF.                                                      26540000
                                                                        26600000
           IF ACATNAIO-SSN(1 : 1) GREATER SPACES                        26610000
              MOVE ACATNAIO-SSN(1 : 3) TO WS-MSSN1(1 : 3)               26620000
              MOVE '-'                 TO WS-MSSN1(4 : 1)               26630000
              MOVE ACATNAIO-SSN(4 : 2) TO WS-MSSN1(5 : 2)               26640000
              MOVE '-'                 TO WS-MSSN1(7 : 1)               26650000
              MOVE ACATNAIO-SSN(6 : 4) TO WS-MSSN1(8 : 4)               26660000
           ELSE                                                         26670000
              MOVE SPACES TO WS-MSSN1                                   26680000
           END-IF.                                                      26690000
                                                                        26700000
           IF ACATNAIO-SSN2(1 : 1) GREATER SPACES                       26710000
              MOVE ACATNAIO-SSN2(1 : 3) TO WS-MSSN2(1 : 3)              26720000
              MOVE '-'                  TO WS-MSSN2(4 : 1)              26730000
              MOVE ACATNAIO-SSN2(4 : 2) TO WS-MSSN2(5 : 2)              26740000
              MOVE '-'                  TO WS-MSSN2(7 : 1)              26750000
              MOVE ACATNAIO-SSN2(6 : 4) TO WS-MSSN2(8 : 4)              26760000
           ELSE                                                         26770000
              MOVE SPACES TO WS-MSSN2                                   26780000
           END-IF.                                                      26790000
                                                                        26800000
LRM022     IF ((ACATNAIO-SSN = SPACES OR LOW-VALUES OR ZEROS)           53700000
LRM022     AND TWA-RCV-SS-PRIM-NBR NOT > ZEROS)                                 
LRM022     OR ACATNAIO-SSN = TWA-RCV-SS-PRIM-NBR                        53740000
LRM022        MOVE SPACES        TO TWA-NA-SS-PRIM-NBR                  53740000
LRM022     ELSE                                                                 
LRM022        MOVE ACATNAIO-SSN  TO TWA-NA-SS-PRIM-NBR                  53740000
LRM022     END-IF.                                                      53780000
                                                                                
LRM022     IF ((ACATNAIO-SSN2 = SPACES OR LOW-VALUES OR ZEROS)          53700000
LRM022     AND TWA-RCV-SS-SCNDY-NBR NOT > ZEROS)                                
LRM022     OR TWA-RCV-SS-SCNDY-NBR = ACATNAIO-SSN2                              
LRM022        MOVE SPACES TO TWA-NA-SS-SCNDY-NBR                                
LRM022     ELSE                                                         53730000
LRM022        MOVE ACATNAIO-SSN2 TO TWA-NA-SS-SCNDY-NBR                 53740000
LRM022     END-IF.                                                      53780000
                                                                                
           IF WS-SSN-ONE > SPACE                                        26810000
              IF TWA-MSSN1 = WS-MSSN1                                   26820000
                 CONTINUE                                               26830000
              ELSE                                                      26840000
                 SET CURSOR-ON-MSSN1  TO TRUE                           26850000
                 MOVE ATT-UNPROT-BRT  TO MSSN1AA                        26860000
                 MOVE 'INVALID TIN NUMBER'  TO SYSTEM-MSG               26870000
                 SET ERROR-YES TO TRUE                                  26880000
12/12            PERFORM 0830-ERROR-RTN                                 26890000
              END-IF                                                    26920000
           ELSE                                                         26930000
              IF MSSN1AL = +0  AND                                      26940000
                 MSSN1BL = +0  AND                                      26950000
                 MSSN1CL = +0                                           26960000
                    CONTINUE                                            26980000
              ELSE                                                      27080000
                 SET CURSOR-ON-MSSN1  TO TRUE                           27090000
                 MOVE WS-MSSN1        TO TWA-MSSN1                      27100000
              END-IF                                                    27110000
           END-IF.                                                      27120000
                                                                        27130000
           IF WS-SSN-TWO > SPACE                                        27140000
              IF TWA-MSSN2 = WS-MSSN2                                   27150000
                 CONTINUE                                               27160000
              ELSE                                                      27170000
                 SET CURSOR-ON-MSSN2  TO TRUE                           27180000
                 MOVE ATT-UNPROT-BRT  TO MSSN2AA MSSN2BA MSSN2CA        27190000
                 MOVE 'INVALID TIN NUMBER'  TO SYSTEM-MSG               27200000
LRM022           MOVE ' - EXPECTING ' TO SYSTEM-MSG(19 : 13)                    
LRM022           MOVE WS-MSSN2  TO SYSTEM-MSG(23 : 9)                           
                 SET ERROR-YES TO TRUE                                  27210000
12/12            PERFORM 0830-ERROR-RTN                                 27220000
              END-IF                                                    27250000
           ELSE                                                         27260000
              IF MSSN2AL = +0  AND                                      27270000
                 MSSN2BL = +0  AND                                      27280000
                 MSSN2CL = +0                                           27290000
                 IF ACATNAIO-SSN2 = TWA-RCV-SS-SCNDY-NBR                27300000
LRM001           OR (ACATNAIO-SSN2 NOT > SPACES                                 
LRM001             AND TWA-RCV-SS-SCNDY-NBR NOT > SPACES)                       
LRM022           OR ACAT-SECONDARY-SSN-EDIT NOT =  '1'                          
                    CONTINUE                                            27310000
                 ELSE                                                   27320000
LRM022**** NEED CAT513 EDIT DETAILS....                                         
                    SET CURSOR-ON-MSSN2 TO TRUE                         27330000
                    MOVE ATT-UNPROT-BRT TO MSSN2AA MSSN2BA MSSN2CA      27340000
                    MOVE 'INVALID TIN NUMBER' TO SYSTEM-MSG             27350000
                    SET ERROR-YES TO TRUE                               27360000
12/12               PERFORM 0830-ERROR-RTN                              27370000
                 END-IF                                                 27400000
              ELSE                                                      27410000
                 SET CURSOR-ON-MSSN2  TO TRUE                           27420000
                 MOVE WS-MSSN2        TO TWA-MSSN2                      27430000
              END-IF                                                    27440000
           END-IF.                                                      27450000
                                                                        27460000
           IF TWA-MCSTP >  SPACES                                       27470000
              MOVE 1 TO SUB                                             27480000
LRM021        PERFORM UNTIL SUB > WS-ACCOUNT-TYPE-CHOICES               27500000
                        OR WS-ACCOUNT-TYPE(SUB) = TWA-MCSTP                     
                 ADD 1 TO SUB                                           27510000
              END-PERFORM                                               27520000
LRM021        IF SUB > WS-ACCOUNT-TYPE-CHOICES                          27530000
                 MOVE ATT-UNPROT-BRT TO MCSTPA                          27540000
                 SET CURSOR-ON-MCSTP TO TRUE                            27550000
                    MOVE                                                27560000
                     'CUST ACCOUNT TYPE IS INVALID'                     27570000
                            TO SYSTEM-MSG                               27580000
                    SET ERROR-YES TO TRUE                               27590000
12/12               PERFORM 0830-ERROR-RTN                              27600000
              END-IF                                                    27630000
           END-IF.                                                      27640000
                                                                        27650000
       0420A-EXIT.                                                      27660000
           EXIT.                                                        27670000
      /                                                                 27680000
      *----------------------------------------------------------------*27690000
      *          VALIDATE ALL DOLLAR/ QTY AMOUNT FIELD CHANGES         *27700000
      *----------------------------------------------------------------*27710000
       0425-VALIDATE-AMOUNT.                                            27720000
           IF TWA-MCD = 'D'                                             27730000
              IF TWA-MBAL01 > SPACES OR                                 27740000
                 TWA-MBAL02 > SPACES OR                                 27750000
                 TWA-MBAL05 > SPACES OR                                 27760000
                 TWA-MSMA > SPACES  OR                                  27770000
                 TWA-MQTY > SPACES OR                                   27780000
                 TWA-MAMT > SPACES                                      27790000
                 MOVE                                                   27800000
              'CAN"T MODIFY AMOUNT AND DELETE ASSET AT SAME TIME'       27810000
                  TO SYSTEM-MSG                                         27820000
                  MOVE TWA-MCD TO MCDO                                  27830000
                  MOVE ATT-UNPROT-BRT TO MCDA                           27840000
                  SET CURSOR-ON-MCD TO TRUE                             27850000
                  SET ERROR-YES TO TRUE                                 27860000
12/12             SET DATA-ONLY TO TRUE                                 27870000
12/12             PERFORM 0830-ERROR-RTN                                27880000
               END-IF                                                   27890000
           ELSE                                                         27900000
              IF TWA-MCD = 'W'                                          27910000
                 IF TWA-MBAL01 > SPACES OR                              27920000
                    TWA-MBAL02 > SPACES OR                              27930000
                    TWA-MBAL05 > SPACES OR                              27940000
                    TWA-MSMA > SPACES OR                                27950000
                    TWA-MQTY > SPACES OR                                27960000
                    TWA-MAMT > SPACES                                   27970000
                    MOVE 'CAN"T MODIFY AMOUNT FOR WITHHELD ASSET'       27980000
                    TO SYSTEM-MSG                                       27990000
                    MOVE ATT-UNPROT-BRT TO MCDA                         28000000
                    MOVE TWA-MCD TO MCDO                                28010000
                    SET CURSOR-ON-MCD TO TRUE                           28020000
                    SET ERROR-YES TO TRUE                               28030000
12/12               SET DATA-ONLY TO TRUE                               28040000
12/12               PERFORM 0830-ERROR-RTN                              28050000
                 END-IF                                                 28060000
              ELSE                                                      28070000
                 IF TWA-MCD = 'C' OR SPACE OR LOW-VALUE                 28080000
                    CONTINUE                                            28090000
                 ELSE                                                   28100000
                     MOVE TWA-MCD TO MCDO                               28110000
                     SET CURSOR-ON-MCD TO TRUE                          28120000
                     MOVE                                               28130000
                'ENTER "C" TO CHANGE, "W" TO WITHHOLD, "D" TO DELETE'   28140000
                                                       TO SYSTEM-MSG    28150000
                     MOVE ATT-UNPROT-BRT TO MCDA                        28160000
12/12                SET DATA-ONLY TO TRUE                              28170000
                     SET ERROR-YES TO TRUE                              28180000
01/14                PERFORM 0830-ERROR-RTN                             28190000
                 END-IF                                                 28200000
              END-IF                                                    28210000
           END-IF.                                                      28220000
                                                                        28230000
           IF TWA-MBAL01 GREATER SPACES                                 28240000
           OR TWA-MBAL02 GREATER SPACES                                 28250000
           OR TWA-MBAL05 GREATER SPACES                                 28260000
           OR TWA-MSMA   GREATER SPACES                                 28270000
LRM026        MOVE 'N' TO WS-FCUR-BAL-REQEST-SW                                 
              PERFORM 0740-OBTAIN-MARGIN-BAL-RTN                        28280000
                 THRU 0740-OBTAIN-MARGIN-BAL-EXIT.                      28290000
                                                                        28300000
           IF TWA-MBAL01 GREATER SPACES                                 28310000
              PERFORM VALIDATE-MBAL01                                   28320000
           ELSE                                                         28330000
              MOVE TWA-ORIG-BAL01 TO TWA-MBAL01                         28340000
           END-IF.                                                      28350000
           IF TWA-MBAL02 GREATER SPACES                                 28360000
              PERFORM VALIDATE-MBAL02                                   28370000
           ELSE                                                         28380000
              MOVE TWA-ORIG-BAL02 TO TWA-MBAL02                         28390000
           END-IF.                                                      28400000
           IF TWA-MBAL05 GREATER SPACES                                 28410000
              PERFORM VALIDATE-MBAL05                                   28420000
           ELSE                                                         28430000
              MOVE TWA-ORIG-BAL05 TO TWA-MBAL05                         28440000
           END-IF.                                                      28450000
           IF TWA-MSMA   GREATER SPACES                                 28460000
              PERFORM VALIDATE-MSMA                                     28470000
           ELSE                                                         28480000
              MOVE TWA-ORIG-SMA  TO TWA-MSMA                            28490000
           END-IF.                                                      28500000
LRM026     IF TWA-STTLM-LCTN-CD = '50'                                          
LRM026     AND TWA-STTLM-RSN-CD = 'FCUR'                                        
LRM026     AND TWA-MQTY = '                .0000 '                      28510000
LRM026        CONTINUE                                                  28510000
LRM026     ELSE                                                         28510000
           IF TWA-MQTY GREATER SPACES                                   28510000
              PERFORM VALIDATE-ASSET-QTY                                28520000
           ELSE                                                         28530000
              MOVE TWA-ORIG-QTY  TO TWA-MQTY                            28540000
           END-IF.                                                      28550000
           IF TWA-MAMT GREATER SPACES                                   28560000
              PERFORM VALIDATE-ASSET-AMT                                28570000
           ELSE                                                         28580000
              MOVE TWA-ORIG-AMT  TO TWA-MAMT                            28590000
           END-IF.                                                      28600000
                                                                        28610000
           IF MBAL01L > +0                                              28620000
              SET TWA-BAL01-CHANGED TO TRUE                             28630000
           ELSE                                                         28670000
              IF TWA-MBAL01 > SPACE                                     28680000
                 IF TWA-MBAL01 = TWA-ORIG-BAL01                         28690000
                    SET TWA-BAL01-NO-CHANGE TO TRUE                     28700000
                 END-IF                                                 28710000
              END-IF                                                    28720000
           END-IF.                                                      28730000
                                                                        28740000
???        IF MBAL02L > +0                                              28750000
              SET TWA-BAL02-CHANGED TO TRUE                             28760000
           ELSE                                                         28800000
           IF TWA-MBAL02 > SPACE                                        28810000
              IF TWA-MBAL02 = TWA-ORIG-BAL02                            28820000
                 SET TWA-BAL02-NO-CHANGE TO TRUE                        28830000
              END-IF                                                    28840000
           END-IF.                                                      28850000
                                                                        28860000
???        IF MBAL05L > +0                                              28870000
              SET TWA-BAL05-CHANGED TO TRUE                             28880000
           ELSE                                                         28920000
           IF TWA-MBAL05 > SPACE                                        28930000
              IF TWA-MBAL05 = TWA-ORIG-BAL05                            28940000
                 SET TWA-BAL05-NO-CHANGE TO TRUE                        28950000
              END-IF                                                    28960000
           END-IF.                                                      28970000
                                                                        28980000
           IF MSMAL > +0                                                28990000
              SET TWA-SMA-CHANGED TO TRUE                               29000000
           ELSE                                                         29040000
           IF TWA-MSMA > SPACE                                          29050000
              IF TWA-MSMA = TWA-ORIG-SMA                                29060000
                 SET TWA-SMA-NO-CHANGE TO TRUE                          29070000
              END-IF                                                    29080000
           END-IF.                                                      29090000
                                                                        29100000
           IF MQTYL > +0                                                29110000
              SET TWA-QTY-CHANGED TO TRUE                               29120000
           ELSE                                                         29130000
           IF TWA-MQTY > SPACE                                          29140000
              IF TWA-MQTY = TWA-ORIG-QTY                                29150000
                 SET TWA-QTY-NO-CHANGE TO TRUE                          29160000
              END-IF                                                    29170000
           END-IF.                                                      29180000
                                                                        29190000
           IF MAMTL > +0                                                29200000
              SET TWA-AMT-CHANGED TO TRUE                               29210000
           ELSE                                                         29220000
           IF TWA-MAMT > SPACE                                          29230000
              IF TWA-MAMT = TWA-ORIG-AMT                                29240000
                 SET TWA-AMT-NO-CHANGE TO TRUE                          29250000
              END-IF                                                    29260000
           END-IF.                                                      29270000
                                                                        29280000
01/31      IF MRGN-MBAL01-ERROR-YES   OR                                29290000
01/31         MRGN-MBAL02-ERROR-YES   OR                                29300000
01/31         MRGN-MBAL05-ERROR-YES   OR                                29310000
01/31         MRGN-MSMA-ERROR-YES   OR                                  29320000
01/31         MRGN-MQTY-ERROR-YES  OR                                   29330000
LRM001        ERROR-YES                                                 30980000
12/12         SET DATA-ONLY TO TRUE                                     29340000
              SET ERROR-YES TO TRUE                                     29350000
12/12         PERFORM 0830-ERROR-RTN                                    29360000
01/31      END-IF.                                                      29370000
                                                                        29380000
           IF TWA-MCD = 'C'                                             29390000
              IF TWA-BAL01-NO-CHANGE AND                                29400000
                 TWA-BAL02-NO-CHANGE AND                                29410000
                 TWA-BAL05-NO-CHANGE AND                                29420000
                 TWA-SMA-NO-CHANGE AND                                  29430000
                 TWA-QTY-NO-CHANGE AND                                  29440000
                 TWA-AMT-NO-CHANGE                                      29450000
                 INITIALIZE TWA-MBAL01, TWA-MBAL02, TWA-MBAL05,         29460000
                            TWA-MSMA, TWA-MQTY, TWA-MAMT                29470000
                 MOVE TWA-MCD   TO MCDO                                 29480000
12/10            MOVE 'NO AMOUNT CHANGE IS MADE !' TO SYSTEM-MSG        29490000
                 MOVE ATT-UNPROT-BRT TO MCDA                            29500000
                 SET CURSOR-ON-MCD TO TRUE                              29510000
12/12            SET DATA-ONLY TO TRUE                                  29520000
                 SET ERROR-YES TO TRUE                                  29530000
12/12            PERFORM 0800-SEND-MAP-RETURN                           29550000
              ELSE                                                      29560000
01/20             IF ERROR-YES                                          29570000
01/20                SET DATA-ONLY TO TRUE                              29580000
01/20                PERFORM 0830-ERROR-RTN                             29590000
01/20             ELSE                                                  29600000
                     PERFORM 0450-PROCESS-INPUT THRU 0450-EXIT          29610000
                  END-IF                                                29620000
              END-IF                                                    29630000
           ELSE                                                         29640000
              IF (TWA-BAL01-CHANGED OR                                  29650000
                  TWA-BAL02-CHANGED OR                                  29660000
                  TWA-BAL05-CHANGED OR                                  29670000
                  TWA-SMA-CHANGED   OR                                  29680000
                  TWA-QTY-CHANGED   OR                                  29690000
                  TWA-AMT-CHANGED)  AND                                 29700000
                  WK-AMT-RET-CODE = SPACE                               29710000
                 PERFORM 0450-PROCESS-INPUT THRU 0450-EXIT              29720000
              ELSE                                                      29730000
01/31             IF ERROR-YES                                          29740000
01/31                SET DATA-ONLY TO TRUE                              29750000
01/31                PERFORM 0830-ERROR-RTN                             29760000
                  END-IF                                                29770000
              END-IF                                                    29780000
           END-IF.                                                      29790000
                                                                        29800000
       0425-EXIT.                                                       29810000
           EXIT.                                                        29820000
      /                                                                 29830000
      ***************************************************************** 29840000
       VALIDATE-MBAL01.                                                 29850000
           MOVE ATT-UNPROT TO MBAL01A.                                  29860000
           IF TWA-MBAL01 GREATER SPACES                                 29870000
LRM001        IF (TWA-MBAL01 NOT = TWA-ORIG-BAL01                       29880000
LRM001        OR MBAL01L > +0)                                          24040000
                 MOVE TWA-MBAL01  TO WK-AMT-IN                          29890000
                 EXEC CICS LINK PROGRAM('ACATEDIT')                     29900000
                             COMMAREA(EDIT-AMT-AREA)                    29910000
                             LENGTH(LENGTH OF EDIT-AMT-AREA)            29920000
                 END-EXEC                                               29930000
                 IF WK-AMT-RET-CODE = SPACE                             29940000
                    PERFORM 0750-FORMAT-AMT-RTN                         29950000
                    MOVE WK-FORMATTED-AMT TO MBAL01I                    29960000
                    MOVE WK-AMT-OUT TO TWA-BAL01-9, TWA-BAL01-N         29970000
                    MOVE MBAL01I TO TWA-MBAL01                          29980000
                    PERFORM VALIDATE-MBAL01-WITH-MRGN                   29990000
                    SET TWA-BAL01-CHANGED TO TRUE                       30000000
                 ELSE                                                   30010000
                    MOVE ATT-UNPROT-BRT TO MBAL01A                      30020000
                    IF WS-CURSOR = SPACES                               30030000
                       SET CURSOR-ON-MBAL01 TO TRUE                     30040000
                       MOVE 'INVALID AMOUNT ON BALANCE 01'              30050000
                          TO SYSTEM-MSG                                 30060000
                    END-IF                                              30070000
                    SET ERROR-YES TO TRUE                               30080000
                 END-IF                                                 30120000
              END-IF                                                    30130000
           END-IF.                                                      30140000
                                                                        30150000
      ****************                                                  30160000
       VALIDATE-MBAL02.                                                 30170000
           MOVE ATT-UNPROT TO MBAL02A.                                  30180000
           IF TWA-MBAL02 GREATER SPACES                                 30190000
LRM001        IF (TWA-MBAL02 NOT = TWA-ORIG-BAL02                       30200000
LRM001        OR MBAL02L > +0)                                          24040000
                 MOVE TWA-MBAL02  TO WK-AMT-IN                          30210000
                 EXEC CICS LINK PROGRAM('ACATEDIT')                     30220000
                             COMMAREA(EDIT-AMT-AREA)                    30230000
                             LENGTH(LENGTH OF EDIT-AMT-AREA)            30240000
                 END-EXEC                                               30250000
                 IF WK-AMT-RET-CODE = SPACE                             30260000
                    PERFORM 0750-FORMAT-AMT-RTN                         30270000
                    MOVE WK-FORMATTED-AMT TO MBAL02I                    30280000
                    MOVE WK-AMT-OUT       TO TWA-BAL02-9 TWA-BAL02-N    30290000
                    MOVE MBAL02I          TO TWA-MBAL02                 30300000
                    PERFORM VALIDATE-MBAL02-WITH-MRGN                   30310000
                    SET TWA-BAL02-CHANGED TO TRUE                       30320000
                 ELSE                                                   30340000
                    MOVE ATT-UNPROT-BRT TO MBAL02A                      30350000
                    SET ERROR-YES TO TRUE                               30080000
                    IF WS-CURSOR = SPACES                               30360000
                       SET CURSOR-ON-MBAL02 TO TRUE                     30370000
                       MOVE 'INVALID AMOUNT ON BALANCE 02'              30380000
                          TO SYSTEM-MSG                                 30390000
                    END-IF                                              30400000
                 END-IF                                                 30430000
              END-IF                                                    30440000
           END-IF.                                                      30450000
                                                                        30460000
      ****************                                                  30470000
       VALIDATE-MBAL05.                                                 30480000
           MOVE ATT-UNPROT TO MBAL05A.                                  30490000
           IF TWA-MBAL05 GREATER SPACES                                 30500000
LRM001        IF (TWA-MBAL05 NOT = TWA-ORIG-BAL05                       30510000
LRM001        OR MBAL05L > +0)                                          24040000
                 MOVE TWA-MBAL05  TO WK-AMT-IN                          30520000
                 EXEC CICS LINK PROGRAM('ACATEDIT')                     30530000
                             COMMAREA(EDIT-AMT-AREA)                    30540000
                             LENGTH(LENGTH OF EDIT-AMT-AREA)            30550000
                 END-EXEC                                               30560000
                 IF WK-AMT-RET-CODE = SPACE                             30570000
                    PERFORM 0750-FORMAT-AMT-RTN                         30580000
                    MOVE WK-FORMATTED-AMT TO MBAL05I                    30590000
                    MOVE WK-AMT-OUT TO TWA-BAL05-9 TWA-BAL05-N          30600000
                    MOVE MBAL05I    TO TWA-MBAL05,                      30610000
                    PERFORM VALIDATE-MBAL05-WITH-MRGN                   30620000
                    SET TWA-BAL05-CHANGED TO TRUE                       30630000
                 ELSE                                                   30650000
                    MOVE ATT-UNPROT-BRT TO MBAL05A                      30660000
                    IF WS-CURSOR = SPACES                               30670000
                       SET CURSOR-ON-MBAL05 TO TRUE                     30680000
                       MOVE 'INVALID AMOUNT ON BALANCE 05'              30690000
                          TO SYSTEM-MSG                                 30700000
                    END-IF                                              30710000
                    SET ERROR-YES TO TRUE                               30720000
                 END-IF                                                 30740000
              END-IF                                                    30750000
           END-IF.                                                      30760000
                                                                        30770000
      ****************                                                  30780000
       VALIDATE-MSMA.                                                   30790000
           MOVE ATT-UNPROT TO MSMAA.                                    30800000
           IF TWA-MSMA GREATER SPACES                                   30810000
LRM001        IF (TWA-MSMA NOT = TWA-ORIG-SMA                           30820000
LRM001        OR MSMAL > +0)                                            24040000
                 MOVE TWA-MSMA    TO WK-AMT-IN                          30830000
                 EXEC CICS LINK PROGRAM('ACATEDIT')                     30840000
                             COMMAREA(EDIT-AMT-AREA)                    30850000
                             LENGTH(LENGTH OF EDIT-AMT-AREA)            30860000
                 END-EXEC                                               30870000
                 IF WK-AMT-RET-CODE = SPACE                             30880000
                    PERFORM 0750-FORMAT-AMT-RTN                         30890000
                    MOVE WK-FORMATTED-AMT TO MSMAI                      30900000
                    MOVE WK-AMT-OUT TO TWA-SMA-9 TWA-SMA-N              30910000
                    MOVE MSMAI      TO TWA-MSMA,                        30920000
                    PERFORM VALIDATE-MSMA-WITH-MRGN                     30930000
                    SET TWA-SMA-CHANGED TO TRUE                         30940000
                 ELSE                                                   30960000
                    MOVE ATT-UNPROT-BRT TO MSMAA                        30970000
                    SET ERROR-YES TO TRUE                               30980000
                    IF WS-CURSOR = SPACES                               30990000
                       SET CURSOR-ON-MSMA TO TRUE                       31000000
                       MOVE 'INVALID AMOUNT ON SMA  ' TO SYSTEM-MSG     31010000
                    END-IF                                              31020000
                 END-IF                                                 31060000
              END-IF                                                    31070000
           END-IF.                                                      31080000
                                                                        31090000
     *** SET QTY POSITIVE OR NEGATIVE BASED ON ACAT10IO-PSTN-CD.        31100000
                                                                        31110000
       VALIDATE-ASSET-QTY.                                              31120000
                                                                        31130000
           IF TWA-MQTY  > SPACES                                        31140000
              MOVE TWA-MQTY TO WK-QTY-IN                                31150000
              EXEC CICS LINK PROGRAM('ACATEDIT')                        31160000
                          COMMAREA(EDIT-QTY-AREA)                       31170000
                          LENGTH(LENGTH OF EDIT-QTY-AREA)               31180000
              END-EXEC                                                  31190000
              IF WK-QTY-RET-CODE = SPACE                                31200000
                 MOVE WK-QTY-OUT-D4 TO WS-MQTY-ED-D4 TWA-QTY-9          31210000
                                                        TWA-QTY-N       31220000
                 MOVE WS-MQTY-AREA TO MQTYO,                            31230000
                 PERFORM 0730-OBTAIN-MARGIN-POSN-RTN  THRU              31240000
                         0730-OBTAIN-MARGIN-POSN-EXIT                   31250000
                 PERFORM VALIDATE-QTY-WITH-MRGN-POSN                    31260000
                 SET TWA-QTY-CHANGED TO TRUE                            31270000
                 MOVE WS-MQTY-AREA TO TWA-MQTY                          31280000
              ELSE                                                      31290000
                 MOVE ATT-UNPROT-BRT TO MQTYA                           31300000
                 IF WS-CURSOR = SPACE                                   31310000
                    SET CURSOR-ON-MQTY TO TRUE                          31320000
                    MOVE 'QUANTITY FIELD IS INVALID' TO SYSTEM-MSG      31330000
                 END-IF                                                 31340000
                 SET ERROR-YES TO TRUE                                  31350000
              END-IF.                                                   31390000
                                                                        31400000
       VALIDATE-ASSET-AMT.                                              31420000
                                                                        31430000
           IF TWA-MAMT  >  SPACES                                       31440000
              MOVE TWA-MAMT TO WK-AMT-IN                                31450000
              EXEC CICS LINK PROGRAM('ACATEDIT')                        31460000
                          COMMAREA(EDIT-AMT-AREA)                       31470000
                          LENGTH(LENGTH OF EDIT-AMT-AREA)               31480000
              END-EXEC                                                  31490000
              IF WK-AMT-RET-CODE = SPACE                                31500000
                 MOVE WK-AMT-OUT       TO        TWA-AMT-9              31510000
                                                 TWA-AMT-N              31520000
                                                 WK-AMT-COMMAS-3        31530000
                 PERFORM 0750-FORMAT-AMT-RTN                            31540000
                 MOVE WK-FORMATTED-AMT TO MAMTO,  TWA-MAMT              31550000
                 SET TWA-AMT-CHANGED TO TRUE                            31560000
              ELSE                                                      31570000
                 MOVE ATT-UNPROT-BRT TO MAMTA                           31580000
                 IF WS-CURSOR = SPACE                                   31590000
                    SET CURSOR-ON-MAMT TO TRUE                          31600000
                    MOVE 'AMOUNT FIELD IS INVALID'  TO SYSTEM-MSG       31610000
                 END-IF                                                 31620000
                 SET ERROR-YES TO TRUE                                  31630000
              END-IF.                                                   31670000
                                                                                
LRM026     IF TWA-CRNCY-CD > '000'                                      06390000
LRM026     AND TWA-CRNCY-CD NUMERIC                                     06390000
LRM026           IF TWA-AMT-CHANGED                                     31560000
LRM026           AND TWA-AMT-9 < ZERO                                   31740000
LRM026               SET TWA-LONG-ASSET-QTY  TO TRUE                    07270000
LRM026           ELSE                                                           
LRM026               SET TWA-SHORT-ASSET-QTY TO TRUE                    07260000
LRM026           END-IF                                                         
LRM026           SET WS-FCUR-BAL-REQEST TO TRUE                                 
LRM026           PERFORM 0740-OBTAIN-MARGIN-BAL-RTN                     28280000
LRM026              THRU 0740-OBTAIN-MARGIN-BAL-EXIT                    28290000
LRM026           IF TWA-CSH-MGN-SHRT-CD = 'C'                           07210000
LRM026              IF TWA-AMT-9 < WS-MRGN-BAL-TYPE1 AND                31740000
LRM026                     TWA-AMT-9  < ZERO                            31750000
LRM026                 MOVE ATT-UNPROT-BRT TO MAMTA                     31760000
LRM026                 IF WS-CURSOR = SPACE                             31770000
LRM026                    SET CURSOR-ON-MAMT TO TRUE                    31780000
LRM026                    MOVE WS-MRGN-BAL-TYPE1 TO WS-MRGN-MSG-AMT     31790000
LRM026                    MOVE 'FCUR AMT CREDIT EXCEEDS MARGIN CREDIT'  31800000
LRM026                       TO WS-MRGN-MSG-LIT                         31810000
                          MOVE WS-MRGN-MSG TO SYSTEM-MSG                31820000
                       END-IF                                           31830000
                       SET ERROR-YES TO TRUE                            31840000
            END-IF.                                                     31890000
                                                                        31680000
      *----------------------------------------------------------------*31690000
       VALIDATE-MBAL01-WITH-MRGN.                                       31700000
******** THE BAL CAN'T EXCEED MRGN.                                     31710000
           IF TWA-BAL01-9 < WS-MRGN-BAL-TYPE1 AND                       31740000
              TWA-BAL01-9 < ZERO                                        31750000
                    MOVE ATT-UNPROT-BRT TO MBAL01A                      31760000
 01/19              IF WS-CURSOR = SPACE                                31770000
                       SET CURSOR-ON-MBAL01 TO TRUE                     31780000
                       MOVE WS-MRGN-BAL-TYPE1 TO WS-MRGN-MSG-AMT        31790000
                       MOVE 'BALANCE 01 CREDIT EXCEEDS MARGIN CREDIT'   31800000
                             TO WS-MRGN-MSG-LIT                         31810000
                       MOVE WS-MRGN-MSG TO SYSTEM-MSG                   31820000
01/19               END-IF                                              31830000
                    SET ERROR-YES TO TRUE                               31840000
01/20               SET MRGN-MBAL01-ERROR-YES TO TRUE                   31850000
            END-IF.                                                     31890000
                                                                        32490000
       VALIDATE-MBAL02-WITH-MRGN.                                       32500000
******** THE BAL CAN'T EXCEED MRGN.                                     32510000
           IF TWA-BAL02-9 < WS-MRGN-BAL-TYPE2 AND                       32540000
              TWA-BAL02-9 < ZERO                                        32550000
                    MOVE ATT-UNPROT-BRT TO MBAL02A                      32560000
01/19               IF WS-CURSOR = SPACE                                32570000
                       SET CURSOR-ON-MBAL02 TO TRUE                     32580000
                       MOVE 'BALANCE 02 CREDIT EXCEEDS MARGIN CREDIT'   32590000
                             TO WS-MRGN-MSG-LIT                         32600000
                       MOVE WS-MRGN-BAL-TYPE2 TO WS-MRGN-MSG-AMT        32610000
                       MOVE WS-MRGN-MSG TO SYSTEM-MSG                   32620000
01/19               END-IF                                              32630000
                    SET ERROR-YES TO TRUE                               32640000
01/20               SET MRGN-MBAL02-ERROR-YES TO TRUE                   32650000
            END-IF.                                                     32690000
       VALIDATE-MBAL05-WITH-MRGN.                                       33290000
******** THE BAL CAN'T EXCEED MRGN.                                     33300000
           IF TWA-BAL05-9 < WS-MRGN-BAL-TYPE5 AND                       33330000
              TWA-BAL05-9 < ZERO                                        33340000
                    MOVE ATT-UNPROT-BRT TO MBAL05A                      33350000
01/19               IF WS-CURSOR = SPACE                                33360000
                       SET CURSOR-ON-MBAL05 TO TRUE                     33370000
                       MOVE 'BALANCE 05 CREDIT EXCEEDS MARGIN CREDIT'   33380000
                             TO WS-MRGN-MSG-LIT                         33390000
                       MOVE WS-MRGN-BAL-TYPE5 TO WS-MRGN-MSG-AMT        33400000
                       MOVE WS-MRGN-MSG TO SYSTEM-MSG                   33410000
01/19               END-IF                                              33420000
                    SET ERROR-YES TO TRUE                               33430000
01/20               SET MRGN-MBAL05-ERROR-YES TO TRUE                   33440000
            END-IF.                                                     33480000
      /                                                                 34100000
       VALIDATE-MSMA-WITH-MRGN.                                         34110000
**SMA*** THE BAL CAN'T EXCEED MRGN.                                     34120000
LRM001     IF TWA-SMA-9 = ZEROS                                         34300000
LRM001        CONTINUE                                                  34310000
LRM001     ELSE                                                         34320000
           IF TWA-SMA-9 < ZERO                                          34130000
              IF WS-MRGN-BAL-SMA   < ZERO                               34140000
                 IF TWA-SMA-9 < WS-MRGN-BAL-SMA                         34150000
                    MOVE ATT-UNPROT-BRT TO MSMAA                        34160000
01/19               IF WS-CURSOR = SPACE                                34170000
                       MOVE 'SMA CREDIT EXCEEDS MARGIN CREDIT'          34180000
                                              TO WS-MRGN-MSG-LIT        34190000
                       MOVE WS-MRGN-BAL-SMA TO WS-MRGN-MSG-AMT          34200000
                       MOVE WS-MRGN-MSG TO SYSTEM-MSG                   34210000
                       SET CURSOR-ON-MSMA TO TRUE                       34220000
01/19               END-IF                                              34230000
                    SET ERROR-YES TO TRUE                               34240000
01/20               SET MRGN-MSMA-ERROR-YES TO TRUE                     34250000
12/12               SET DATA-ONLY TO TRUE                               34260000
12/12               PERFORM 0800-SEND-MAP-RETURN                        34270000
                 END-IF                                                 34280000
              ELSE                                                      34290000
                 IF TWA-SMA-9 = WS-MRGN-BAL-SMA                         34300000
                    SET TWA-SMA-CHANGED TO TRUE                         34310000
                 ELSE                                                   34320000
                    MOVE ATT-UNPROT-BRT TO MSMAA                        34330000
                    SET TWA-SMA-CHANGED TO TRUE                         34340000
                 END-IF                                                 34470000
              END-IF                                                    34480000
           ELSE                                                         34490000
              IF WS-MRGN-BAL-SMA   > ZERO                               34510000
                 IF TWA-SMA-9 > WS-MRGN-BAL-SMA                         34520000
                    MOVE ATT-UNPROT-BRT TO MSMAA                        34530000
01/19               IF WS-CURSOR = SPACE                                34540000
                       MOVE 'SMA DEBIT EXCEEDS MARGIN DEBIT'            34550000
                             TO WS-MRGN-MSG-LIT                         34560000
                       MOVE WS-MRGN-BAL-SMA TO WS-MRGN-MSG-AMT          34570000
                       SET CURSOR-ON-MSMA TO TRUE                       34580000
                       MOVE WS-MRGN-MSG TO SYSTEM-MSG                   34590000
01/19               END-IF                                              34600000
                    SET ERROR-YES TO TRUE                               34610000
01/20               SET MRGN-MSMA-ERROR-YES TO TRUE                     34620000
                 END-IF                                                 34660000
              ELSE                                                      34670000
                 IF TWA-SMA-9 = WS-MRGN-BAL-SMA                         34680000
                    SET TWA-SMA-CHANGED TO TRUE                         34690000
                    CONTINUE                                            34700000
                 ELSE                                                   34710000
                    MOVE ATT-UNPROT-BRT TO MSMAA                        34720000
                    SET TWA-SMA-CHANGED TO TRUE                         34730000
01/19               IF WS-CURSOR = SPACE                                34740000
                       MOVE 'MARGIN DOES NOT CARRY A DEBIT SMA '        34750000
                                TO WS-MRGN-MSG-LIT                      34760000
                       MOVE WS-MRGN-BAL-SMA TO WS-MRGN-MSG-AMT          34770000
                       SET CURSOR-ON-MSMA TO TRUE                       34780000
                       MOVE WS-MRGN-MSG TO SYSTEM-MSG                   34790000
01/19               END-IF                                              34800000
                    SET ERROR-YES TO TRUE                               34810000
01/20               SET MRGN-MSMA-ERROR-YES TO TRUE                     34820000
                 END-IF                                                 34860000
              END-IF                                                    34870000
           END-IF.                                                      34880000
      /                                                                 34890000
       VALIDATE-QTY-WITH-MRGN-POSN.                                     34900000
           IF WS-MTYPE = '01'                                           34910000
             IF TWA-QTY-9   < ZERO                                      34920000
                IF WS-MRGN-POSN-QTY-TYPE1 < ZERO                        34930000
                   IF TWA-QTY-9 < WS-MRGN-POSN-QTY-TYPE1                34940000
                      MOVE ATT-UNPROT-BRT TO MQTYA                      34950000
01/19                 IF WS-CURSOR = SPACE                              34960000
                         SET CURSOR-ON-MQTY TO TRUE                     34970000
                         MOVE 'QTY (SHORT) EXCEEDS MARGIN TYPE 01 QTY'  34980000
                               TO WS-MRGN-MSG-QTY-LIT                   34990000
                         MOVE WS-MRGN-POSN-QTY-TYPE1 TO WS-MRGN-MSG-QTY 35000000
                         MOVE WS-MRGN-QTY-MSG TO SYSTEM-MSG             35010000
01/19                 END-IF                                            35020000
                      SET ERROR-YES TO TRUE                             35030000
01/20                 SET MRGN-MQTY-ERROR-YES TO TRUE                   35040000
12/12                 SET DATA-ONLY TO TRUE                             35050000
12/12                 PERFORM 0800-SEND-MAP-RETURN                      35060000
                   ELSE                                                 35070000
                      IF TWA-QTY-9 = WS-MRGN-POSN-QTY-TYPE1             35080000
                       SET TWA-QTY-CHANGED TO TRUE                      35090000
                      END-IF                                            35100000
                   END-IF                                               35110000
                ELSE                                                    35120000
                   MOVE ATT-UNPROT-BRT TO MQTYA                         35130000
01/19              IF WS-CURSOR = SPACE                                 35140000
                      SET CURSOR-ON-MQTY TO TRUE                        35150000
                      MOVE                                              35160000
                       'MARGIN DOES NOT HAVE A SHORT TYPE 01 POSITION'  35170000
                       TO WS-MRGN-MSG-QTY-LIT                           35180000
                      MOVE WS-MRGN-POSN-QTY-TYPE1 TO WS-MRGN-MSG-QTY    35190000
                      MOVE WS-MRGN-QTY-MSG TO SYSTEM-MSG                35200000
01/19              END-IF                                               35210000
                   SET ERROR-YES TO TRUE                                35220000
01/20              SET MRGN-MQTY-ERROR-YES TO TRUE                      35230000
                END-IF                                                  35270000
             ELSE                                                       35280000
                IF WS-MRGN-POSN-QTY-TYPE1 > ZERO                        35290000
                   IF TWA-QTY-9 > WS-MRGN-POSN-QTY-TYPE1                35300000
                      MOVE ATT-UNPROT-BRT TO MQTYA                      35310000
01/19                 IF WS-CURSOR = SPACE                              35320000
                         SET CURSOR-ON-MQTY TO TRUE                     35330000
                         MOVE 'QTY (LONG) EXCEEDS MARGIN TYPE 01 QTY'   35340000
                               TO WS-MRGN-MSG-QTY-LIT                   35350000
                         MOVE WS-MRGN-POSN-QTY-TYPE1 TO WS-MRGN-MSG-QTY 35360000
                         MOVE WS-MRGN-QTY-MSG TO SYSTEM-MSG             35370000
01/19                 END-IF                                            35380000
                      SET ERROR-YES TO TRUE                             35390000
01/20                 SET MRGN-MQTY-ERROR-YES TO TRUE                   35400000
                   ELSE                                                 35440000
                      IF TWA-QTY-9 = WS-MRGN-POSN-QTY-TYPE1             35450000
                       SET TWA-QTY-CHANGED TO TRUE                      35460000
                      END-IF                                            35470000
                   END-IF                                               35480000
                ELSE                                                    35490000
                   MOVE ATT-UNPROT-BRT TO MQTYA                         35500000
01/19              IF WS-CURSOR = SPACE                                 35510000
                      SET CURSOR-ON-MQTY TO TRUE                        35520000
                      MOVE                                              35530000
                      'MARGIN DOES NOT HAVE A LONG TYPE 01 POSITION'    35540000
                         TO WS-MRGN-MSG-QTY-LIT                         35550000
                      MOVE WS-MRGN-POSN-QTY-TYPE1 TO WS-MRGN-MSG-QTY    35560000
                      MOVE WS-MRGN-QTY-MSG TO SYSTEM-MSG                35570000
01/19              END-IF                                               35580000
                    SET ERROR-YES TO TRUE                               35590000
01/20               SET MRGN-MQTY-ERROR-YES TO TRUE                     35600000
               END-IF                                                   35640000
             END-IF                                                     35650000
           END-IF.                                                      35660000
                                                                        35670000
           IF WS-MTYPE = '02'                                           35680000
              IF TWA-QTY-9 < ZERO                                       35690000
                 IF WS-MRGN-POSN-QTY-TYPE2 < ZERO                       35700000
                    IF TWA-QTY-9 < WS-MRGN-POSN-QTY-TYPE2               35710000
                       MOVE ATT-UNPROT-BRT TO MQTYA                     35720000
01/19                  IF WS-CURSOR = SPACE                             35730000
                          SET CURSOR-ON-MQTY TO TRUE                    35740000
                          MOVE 'QTY (SHORT) EXCEEDS MARGIN TYPE 02 QTY' 35750000
                              TO WS-MRGN-MSG-QTY-LIT                    35760000
                          MOVE WS-MRGN-POSN-QTY-TYPE2 TO WS-MRGN-MSG-QTY35770000
                          MOVE WS-MRGN-QTY-MSG TO SYSTEM-MSG            35780000
01/19                  END-IF                                           35790000
                       SET ERROR-YES TO TRUE                            35800000
01/20                  SET MRGN-MQTY-ERROR-YES TO TRUE                  35810000
                    ELSE                                                35850000
                       IF TWA-QTY-9 = WS-MRGN-POSN-QTY-TYPE2            35860000
                          SET TWA-QTY-CHANGED TO TRUE                   35870000
                       END-IF                                           35880000
                    END-IF                                              35890000
                 ELSE                                                   35900000
                    MOVE ATT-UNPROT-BRT TO MQTYA                        35910000
01/19               IF WS-CURSOR = SPACE                                35920000
                       SET CURSOR-ON-MQTY TO TRUE                       35930000
                       MOVE                                             35940000
                       'MARGIN DOES NOT HAVE A SHORT TYPE 02 POSITION'  35950000
                             TO WS-MRGN-MSG-QTY-LIT                     35960000
                       MOVE WS-MRGN-POSN-QTY-TYPE2 TO WS-MRGN-MSG-QTY   35970000
                       MOVE WS-MRGN-QTY-MSG TO SYSTEM-MSG               35980000
01/19               END-IF                                              35990000
                    SET ERROR-YES TO TRUE                               36000000
01/20               SET MRGN-MQTY-ERROR-YES TO TRUE                     36010000
                 END-IF                                                 36050000
              ELSE                                                      36060000
                 IF WS-MRGN-POSN-QTY-TYPE2 > ZERO                       36070000
                    IF TWA-QTY-9 > WS-MRGN-POSN-QTY-TYPE2               36080000
                       MOVE ATT-UNPROT-BRT TO MQTYA                     36090000
01/19                  IF WS-CURSOR = SPACE                             36100000
                          SET CURSOR-ON-MQTY TO TRUE                    36110000
                          MOVE 'QTY (LONG) EXCEEDS MARGIN TYPE 02 QTY'  36120000
                                TO WS-MRGN-MSG-QTY-LIT                  36130000
                          MOVE WS-MRGN-POSN-QTY-TYPE2 TO WS-MRGN-MSG-QTY36140000
                          MOVE WS-MRGN-QTY-MSG TO SYSTEM-MSG            36150000
01/19                  END-IF                                           36160000
                       SET ERROR-YES TO TRUE                            36170000
01/20                  SET MRGN-MQTY-ERROR-YES TO TRUE                  36180000
                    ELSE                                                36220000
                       IF TWA-QTY-9 = WS-MRGN-POSN-QTY-TYPE2            36230000
                          SET TWA-QTY-CHANGED TO TRUE                   36240000
                       END-IF                                           36250000
                    END-IF                                              36260000
                 ELSE                                                   36270000
                    MOVE ATT-UNPROT-BRT TO MQTYA                        36280000
01/19               IF WS-CURSOR = SPACE                                36290000
                       SET CURSOR-ON-MQTY TO TRUE                       36300000
                       MOVE                                             36310000
                          'MARGIN DOES NOT HAVE A LONG TYPE 02 POSITION'36320000
                       TO WS-MRGN-MSG-QTY-LIT                           36330000
                       MOVE WS-MRGN-POSN-QTY-TYPE2 TO WS-MRGN-MSG-QTY   36340000
                       MOVE WS-MRGN-QTY-MSG TO SYSTEM-MSG               36350000
01/19               END-IF                                              36360000
                    SET ERROR-YES TO TRUE                               36370000
01/20               SET MRGN-MQTY-ERROR-YES TO TRUE                     36380000
                END-IF                                                  36420000
              END-IF                                                    36430000
           END-IF.                                                      36440000
                                                                        36450000
           IF WS-MTYPE = '05'                                           36460000
              IF TWA-QTY-9 < ZERO                                       36470000
                 IF WS-MRGN-POSN-QTY-TYPE5 < ZERO                       36480000
                    IF TWA-QTY-9 < WS-MRGN-POSN-QTY-TYPE5               36490000
                       MOVE ATT-UNPROT-BRT TO MQTYA                     36500000
01/19                  IF WS-CURSOR = SPACE                             36510000
                          SET CURSOR-ON-MQTY TO TRUE                    36520000
                          MOVE 'QTY (SHORT) EXCEEDS MARGIN TYPE 05 QTY' 36530000
                                TO WS-MRGN-MSG-QTY-LIT                  36540000
                          MOVE WS-MRGN-POSN-QTY-TYPE5 TO WS-MRGN-MSG-QTY36550000
                          MOVE WS-MRGN-QTY-MSG TO SYSTEM-MSG            36560000
01/19                  END-IF                                           36570000
                       SET ERROR-YES TO TRUE                            36580000
01/20                  SET MRGN-MQTY-ERROR-YES TO TRUE                  36590000
                    ELSE                                                36630000
                       IF TWA-QTY-9 = WS-MRGN-POSN-QTY-TYPE5            36640000
                          SET TWA-QTY-CHANGED TO TRUE                   36650000
                       END-IF                                           36660000
                    END-IF                                              36670000
                 ELSE                                                   36680000
                    MOVE ATT-UNPROT-BRT TO MQTYA                        36690000
01/19               IF WS-CURSOR = SPACE                                36700000
                       MOVE                                             36710000
                         'MARGIN DOES NOT HAVE A SHORT TYPE 05 POSITION'36720000
                                TO WS-MRGN-MSG-QTY-LIT                  36730000
                       MOVE WS-MRGN-POSN-QTY-TYPE5 TO WS-MRGN-MSG-QTY   36740000
                       MOVE WS-MRGN-QTY-MSG TO SYSTEM-MSG               36750000
                       SET CURSOR-ON-MQTY TO TRUE                       36760000
01/19               END-IF                                              36770000
                    SET ERROR-YES TO TRUE                               36780000
01/20               SET MRGN-MQTY-ERROR-YES TO TRUE                     36790000
                 END-IF                                                 36830000
              ELSE                                                      36840000
                 IF WS-MRGN-POSN-QTY-TYPE5 > ZERO                       36850000
                    IF TWA-QTY-9 > WS-MRGN-POSN-QTY-TYPE5               36860000
                       MOVE ATT-UNPROT-BRT TO MQTYA                     36870000
01/19                  IF WS-CURSOR = SPACE                             36880000
                          MOVE 'QTY (LONG) EXCEEDS MARGIN TYPE 05 QTY'  36890000
                                TO WS-MRGN-MSG-QTY-LIT                  36900000
                          MOVE WS-MRGN-POSN-QTY-TYPE5 TO WS-MRGN-MSG-QTY36910000
                          MOVE WS-MRGN-QTY-MSG TO SYSTEM-MSG            36920000
                          SET CURSOR-ON-MQTY TO TRUE                    36930000
01/19                  END-IF                                           36940000
                       SET ERROR-YES TO TRUE                            36950000
01/20                  SET MRGN-MQTY-ERROR-YES TO TRUE                  36960000
                    ELSE                                                37000000
                       IF TWA-QTY-9 = WS-MRGN-POSN-QTY-TYPE5            37010000
                          SET TWA-QTY-CHANGED TO TRUE                   37020000
                       END-IF                                           37030000
                    END-IF                                              37040000
                 ELSE                                                   37050000
                    MOVE ATT-UNPROT-BRT TO MQTYA                        37060000
01/19               IF WS-CURSOR = SPACE                                37070000
                       MOVE                                             37080000
                       'MARGIN DOES NOT HAVE A LONG TYPE 05 POSITION'   37090000
                       TO WS-MRGN-MSG-QTY-LIT                           37100000
                       MOVE WS-MRGN-POSN-QTY-TYPE5 TO WS-MRGN-MSG-QTY   37110000
                       MOVE WS-MRGN-QTY-MSG TO SYSTEM-MSG               37120000
                       SET CURSOR-ON-MQTY TO TRUE                       37130000
01/19               END-IF                                              37140000
                    SET ERROR-YES TO TRUE                               37150000
01/20               SET MRGN-MQTY-ERROR-YES TO TRUE                     37160000
                END-IF                                                  37200000
              END-IF                                                    37210000
           END-IF.                                                      37220000
      /                                                                 37230000
      ***************************************************************** 37240000
      **--------------------------------------------------------------* 37250000
      *             VALIDATE SUBM & SECC FIELDS                       * 37260000
      **--------------------------------------------------------------* 37270000
       0430-VALIDATE-SUBMIT-FIELDS.                                     37280000
                                                                        37290000
12/29      IF (ACAT10IO-VINITAST-NOT-FOUND    AND                       37300000
01/26          TWA-STCD < '200')                                        37310000
12/29      OR ACAT10IO-VASSET-NOT-FOUND                                 37320000
                  IF MSECCI = 'S'                                       37410000
                     MOVE ATT-UNPROT-BRT TO MSUBMA                      37420000
                     SET CURSOR-ON-MSUBM TO TRUE                        37430000
                     SET ERROR-YES TO TRUE                              37440000
                     MOVE '!!!! NO ASSET POSITION, CAN NOT UPDATE !!!!' 37450000
                                                       TO  SYSTEM-MSG   37460000
12/12                SET DATA-ONLY TO TRUE                              37470000
12/12               PERFORM 0830-ERROR-RTN                              37480000
                  END-IF                                                37490000
           END-IF.                                                      37510000
                                                                        37520000
12/24      IF TWA-TIF-NSCC-PEND-CD = 'S'                                37530000
              MOVE ATT-PROT    TO MSECCA, MREJA, MREJCA                 37540000
               IF MSUBMI = 'S'                                          37550000
                  MOVE ATT-UNPROT-BRT TO MSUBMA                         37560000
                  MOVE 'Y'            TO MSUBMO                         37570000
                  SET CURSOR-ON-MSUBM TO TRUE                           37580000
                  SET ERROR-YES TO TRUE                                 37590000
                  MOVE                                                  37600000
                     'ASSETS ARE PENDING SUBMISSION, CAN"T RESUBMIT!'   37610000
                                                      TO  SYSTEM-MSG    37620000
12/12             PERFORM 0830-ERROR-RTN                                37630000
01/28          ELSE                                                     37640000
                  IF TWA-MSUBM = LOW-VALUE                              37650000
                     MOVE 'Y'         TO MSUBMO                         37660000
                     MOVE ATT-UNPROT-BRT TO MSUBMA                      37670000
                     SET CURSOR-ON-MSUBM TO TRUE                        37680000
                     SET ERROR-YES TO TRUE                              37690000
                     MOVE                                               37700000
                         'ASSETS ARE PENDING SUBMISSION TO NSCC'        37710000
                                                      TO  SYSTEM-MSG    37720000
12/12                PERFORM 0830-ERROR-RTN                             37730000
                  END-IF                                                37740000
               END-IF                                                   37750000
           END-IF.                                                      37760000
                                                                        37770000
01/28      IF TWA-TIF-NSCC-PEND-CD NOT = 'S'                            37780000
              IF TWA-MSUBM  > SPACE                                     37790000
01/29            MOVE TWA-MSUBM TO MSUBMO                               37800000
                 IF TWA-MSECC > SPACE  OR                               37810000
                    TWA-MREJ > SPACE    OR                              37820000
                    TWA-MREJC > SPACE                                   37830000
                    MOVE TWA-MSECC TO MSECCO                            37840000
                    MOVE TWA-MREJ  TO MREJO                             37850000
                    MOVE TWA-MREJC TO MREJCO                            37860000
                    MOVE ATT-UNPROT-BRT TO MSUBMA                       37870000
                    MOVE 'ONLY ONE OPTION CAN BE PROCESSED' TO          37880000
                                                     SYSTEM-MSG         37890000
                    SET CURSOR-ON-MSUBM TO TRUE                         37900000
                    SET ERROR-YES TO TRUE                               37910000
                    PERFORM 0830-ERROR-RTN                              37920000
                 ELSE                                                   37930000
                    IF (TWA-MSECC = SPACE OR LOW-VALUE) AND             37940000
                       (TWA-MREJ = SPACES OR LOW-VALUE) AND             37950000
                       (TWA-MREJC = SPACES OR LOW-VALUE)                37960000
LRM013                  IF TWA-MSUBM = 'Y'                              37970000
LRM013                     MOVE 'S' TO TWA-MSUBM ACAT10IO-MSUBM         37970000
LRM013                  END-IF                                          37970000
                        IF TWA-MSUBM = 'S'                              37970000
                           SET TWA-SUBM-YES TO TRUE                     37980000
                           PERFORM 0450-PROCESS-INPUT THRU 0450-EXIT    37990000
                        ELSE                                            38000000
                           MOVE 'ENTER S OR Y TO SUBMIT !' TO SYSTEM-MSG38010000
                           MOVE ATT-UNPROT-BRT TO MSUBMA                38020000
                           SET CURSOR-ON-MSUBM TO TRUE                  38030000
                           SET ERROR-YES TO TRUE                        38040000
12/12                      PERFORM 0830-ERROR-RTN                       38050000
                        END-IF                                          38060000
                    END-IF                                              38070000
                 END-IF                                                 38080000
              END-IF                                                    38090000
01/28      END-IF.                                                      38100000
****                                                                    38110000
                                                                        38120000
01/28      IF TWA-TIF-NSCC-PEND-CD  = 'S'  AND                          38130000
              TWA-MSUBM = SPACE                                         38140000
              MOVE ATT-ASKIP       TO MREJA, MREJCA, MSECCA             38150000
              SET TWA-SUBM-NO      TO TRUE                              38160000
              PERFORM 0450-PROCESS-INPUT THRU 0450-EXIT                 38170000
           ELSE                                                         38180000
              IF TWA-MSUBM = LOW-VALUE                                  38190000
                 CONTINUE                                               38200000
              ELSE                                                      38210000
                 MOVE 'ENTER SPACE TO REVERSE SUBMISSION'               38220000
                                                 TO SYSTEM-MSG          38230000
                 MOVE ATT-UNPROT-BRT TO MSUBMA                          38240000
                 SET CURSOR-ON-MSUBM TO TRUE                            38250000
                 SET ERROR-YES TO TRUE                                  38260000
12/12            PERFORM 0830-ERROR-RTN                                 38270000
              END-IF                                                    38280000
           END-IF.                                                      38290000
      /                                                                 38300000
12/28  0430A-VALIDATE-SECCMNT-FIELD.                                    38310000
  |        IF MSECCI = 'S'                                              38320000
  |           IF TWA-TIF-NSCC-PEND-CD = 'S'                             38330000
  |              MOVE ATT-UNPROT-BRT TO MSECCA, MSUBMA                  38340000
  |              MOVE 'Y'            TO MSUBMO                          38350000
  |              MOVE 'S'            TO MSECCO                          38360000
  |              SET CURSOR-ON-MSECC TO TRUE                            38370000
  |              SET ERROR-YES TO TRUE                                  38380000
  |              MOVE                                                   38390000
  |             'ASSETS ARE PENDING SUBMISSION, CAN"T UPDATE'           38400000
  |                                           TO      SYSTEM-MSG        38410000
12/12            PERFORM 0830-ERROR-RTN                                 38420000
  |           ELSE                                                      38450000
  |              CONTINUE                                               38460000
  |           END-IF                                                    38470000
  |        ELSE                                                         38480000
  |           MOVE 'ENTER "S" TO ADD/UPDATE SECURITY COMMENTS'          38490000
  |           TO SYSTEM-MSG                                             38500000
              MOVE TWA-MSECC  TO  MSECCO                                38510000
  |           SET CURSOR-ON-MSECC TO TRUE                               38520000
  |           SET ERROR-YES TO TRUE                                     38530000
01/14         PERFORM 0830-ERROR-RTN                                    38540000
12/24      END-IF.                                                      38570000
                                                                        38580000
           IF TWA-MSECC = 'S'                                           38590000
              MOVE TWA-MSECC  TO  MSECCO                                38600000
              IF TWA-MSUBM = 'S'                                        38610000
                 MOVE ATT-UNPROT-BRT      TO  MSUBMA                    38620000
                 MOVE                                                   38630000
                 'CAN NOT SUBMIT AND UPDATE COMMENTS AT SAME TIME'      38640000
                 TO SYSTEM-MSG                                          38650000
                 SET CURSOR-ON-MSUBM          TO TRUE                   38660000
                 SET ERROR-YES TO TRUE                                  38670000
01/14            PERFORM 0830-ERROR-RTN                                 38680000
              ELSE                                                      38690000
                 IF (TWA-MREJ > SPACES ) OR                             38700000
                    (TWA-MREJC > SPACES)                                38710000
                    IF TWA-MREJ > SPACE                                 38720000
                       MOVE ATT-UNPROT-BRT TO MREJA,                    38730000
                       SET CURSOR-ON-MREJ TO TRUE                       38740000
                    ELSE                                                38750000
                       IF TWA-MREJC > SPACE                             38760000
                          MOVE ATT-UNPROT-BRT TO MREJCA,                38770000
                          SET CURSOR-ON-MREJC TO TRUE                   38780000
                       END-IF                                           38790000
                    END-IF                                              38800000
                    MOVE                                                38810000
                    'CAN NOT REJECT AND UPDATE COMMENTS AT SAME TIME'   38820000
                    TO SYSTEM-MSG                                       38830000
                    SET ERROR-YES TO TRUE                               38840000
01/14               PERFORM 0830-ERROR-RTN                              38850000
                 ELSE                                                   38860000
                    SET TWA-SECC-YES  TO TRUE                           38870000
                    PERFORM 0540-SEND-POPUP-SCREEN                      38880000
                 END-IF                                                 38890000
              END-IF                                                    38900000
           END-IF.                                                      38910000
                                                                        38920000
       0430A-EXIT.                                                      38930000
           EXIT.                                                        38940000
      /                                                                 38950000
      ***************************************************************** 38960000
       0440A-VALIDATE-NON-R-FIELDS.                                     38970000
                                                                        38980000
           IF TWA-MREJ    > SPACE  AND                                  38990000
              TWA-MREJC   > SPACE                                       39000000
              MOVE ATT-UNPROT-BRT        TO  MREJA MREJCA               39010000
              SET CURSOR-ON-MREJ TO TRUE                                39020000
              MOVE ' ONLY ONE SELECTION IS PERMITTED'                   39030000
              TO SYSTEM-MSG                                             39040000
              SET ERROR-YES TO TRUE                                     39050000
01/14         PERFORM 0830-ERROR-RTN                                    39060000
           END-IF.                                                      39090000
                                                                        39100000
12/05      IF MREJL > +0      AND                                       39110000
              MREJCL = +0                                               39120000
              MOVE ATT-UNPROT-BRT   TO  MREJA                           39130000
              IF TWA-XFR-REJ-YES                                        39140000
                 PERFORM 0450-PROCESS-INPUT THRU 0450-EXIT              39150000
              ELSE                                                      39160000
                 IF TWA-REJ-CD-REQ                                      39170000
                    PERFORM 0540-SEND-POPUP-SCREEN                      39180000
                 ELSE                                                   39190000
                    SET CURSOR-ON-MREJ TO TRUE                          39200000
                    MOVE 'INVALID REJECT CODE, ENTER "?" TO OBTAIN'     39210000
                          TO SYSTEM-MSG                                 39220000
                    SET ERROR-YES TO TRUE                               39230000
01/14               PERFORM 0830-ERROR-RTN                              39240000
                 END-IF                                                 39270000
              END-IF                                                    39280000
           END-IF.                                                      39290000
                                                                        39300000
12/18      IF MREJL = +0      AND                                       39320000
              MREJCL > +0                                               39330000
              MOVE ATT-UNPROT-BRT        TO  MREJCA                     39340000
????          IF TWA-XFR-REJC-YES                                       39350000
ET0006**         IF (EIBCPOSN = 1739  OR 1740)                          39360000
                     MOVE ATT-UNPROT-BRT TO  MREJA  MREJCA              39370000
                     SET ACAT90CM-TS-ACCT-COMMENTS TO TRUE              39380000
                     PERFORM 0540-SEND-POPUP-SCREEN                     39390000
ET0006**         ELSE                                                   39400000
ET0006**             PERFORM 0450-PROCESS-INPUT THRU 0450-EXIT          39410000
ET0006**         END-IF                                                 39420000
              ELSE                                                      39430000
                 IF TWA-REJC-CD-REQ                                     39440000
                    PERFORM 0540-SEND-POPUP-SCREEN                      39450000
                 ELSE                                                   39460000
                    SET CURSOR-ON-MREJC TO TRUE                         39470000
                    MOVE 'INVALID REJECT CODE, ENTER "?" TO OBTAIN'     39480000
                          TO SYSTEM-MSG                                 39490000
                    SET ERROR-YES TO TRUE                               39500000
01/14               PERFORM 0830-ERROR-RTN                              39510000
                 END-IF                                                 39540000
              END-IF                                                    39550000
           END-IF.                                                      39560000
                                                                        39570000
LRM016     IF ACAT-FULL-DLVY-ASSET-DELETE = '1'                                 
LRM016     IF TWA-MDEL    > SPACE  AND                                  38990000
LRM016        TWA-MDEL NOT = 'Y' AND 'N' AND 'S'                        39000000
LRM016        MOVE ATT-UNPROT-BRT        TO  MDELA                      39010000
LRM016        IF WS-CURSOR = SPACE                                      60190000
LRM016           SET CURSOR-ON-MDEL TO TRUE                             39020000
LRM016           MOVE ' DELETE ALL ASSET INDICATOR MUST BE Y OR N'      39030000
LRM016               TO SYSTEM-MSG                                      39040000
LRM016        END-IF                                                    39040000
LRM016        SET ERROR-YES TO TRUE                                     39050000
LRM016        PERFORM 0830-ERROR-RTN                                    39510000
LRM016     END-IF.                                                      39090000
                                                                                
LRM016     IF ACAT-FULL-DLVY-ASSET-DELETE = '1'                                 
LRM016     IF TWA-MDEL ='Y'                                                     
LRM016     AND TWA-MDEL-ORIG = 'Y'                                              
LRM016        MOVE ATT-UNPROT-BRT        TO  MDELA                      39010000
LRM016        IF WS-CURSOR = SPACE                                      60190000
LRM016           SET CURSOR-ON-MDEL TO TRUE                             39020000
LRM016           MOVE WS-DLTE-ALL-MSG-RVS TO SYSTEM-MSG                 39030000
LRM016        END-IF                                                    39040000
LRM016        MOVE ATT-PROT TO MREJA, MREJCA                            59270000
LRM016        SET ERROR-YES TO TRUE                                     39050000
LRM016        PERFORM 0830-ERROR-RTN                                    39510000
LRM016     END-IF.                                                      39090000
                                                                                
LRM016     IF ACAT-FULL-DLVY-ASSET-DELETE = '1'                                 
LRM016     IF TWA-MDEL = 'Y'                                            07490000
LRM016        MOVE                                                      12750000
LRM016           ' PRESS ENTER TO DELETE ALL ASSETS OR ERASE DELETE IND'12760000
LRM016                 TO SYSTEM-MSG                                    12770000
LRM016        MOVE ATT-UNPROT-BRT TO MDELA                              12780000
LRM016        SET CURSOR-ON-MDEL TO TRUE                                39020000
LRM016        MOVE 'S' TO TWA-MDEL  WS-SAVE-MDEL-IND                    07490000
LRM016        SET ERROR-YES TO TRUE                                     39050000
LRM016        PERFORM 0830-ERROR-RTN                                    39510000
LRM016     ELSE                                                                 
LRM016     IF TWA-MDEL = 'S'                                            07490000
LRM016        SET ACAT10IO-DELETE-ALL-ASSETS TO TRUE                    12750000
LRM016        MOVE LOW-VALUES TO ACAT10IO-SEARCH-VASSET                 12750000
LRM016        PERFORM 0520-CALL-ACAT10DC                                14060000
LRM016        IF ACAT10IO-DB2-ERROR                                     14070000
LRM016           MOVE 'ACAT10DC'       TO WS-DB2-ERROR-PGM              14080000
LRM016           MOVE 'DLET ALL'       TO WS-DB2-ERROR-FUNCTION         14090000
LRM016           MOVE ACAT10IO-SQLCAID TO WS-DB2-ERROR-TABLE            14100000
LRM016           MOVE ACAT10IO-SQLCODE TO WS-DB2-ERROR-ID               14110000
LRM016           MOVE WS-DB2-ERROR-MSG TO SYSTEM-MSG                    14120000
LRM016           SET ERROR-YES TO TRUE                                  14130000
LRM016           SET DATA-ONLY TO TRUE                                  14150000
LRM016           PERFORM 0830-ERROR-RTN                                 39510000
LRM016        END-IF                                                            
LRM016        MOVE ACAT10IO-ASSET-DELETE-COUNT TO                               
LRM016            WS-DLTE-ALL-MSG-CNT TWA-ASSET-DELETE-COUNT                    
LRM016        MOVE 'Y' TO TWA-MDEL  WS-SAVE-MDEL-IND                            
LRM016        MOVE 'S' TO TWA-MDEL-ORIG                                         
LRM016        MOVE WS-DLTE-ALL-MSG TO SYSTEM-MSG                                
LRM016        IF TWA-MDESC > SPACES                                     57140000
LRM016           MOVE 'D' TO TWA-MCD MCDO                               57140000
LRM016        END-IF                                                            
LRM016        SET ERROR-YES TO TRUE                                     14130000
LRM016        MOVE ATT-PROT TO MREJA, MREJCA                            59270000
LRM016        PERFORM 0830-ERROR-RTN                                    39510000
LRM016     ELSE                                                                 
LRM016     IF TWA-MDEL NOT > ' '                                        07490000
LRM016     AND TWA-MDEL-ORIG = 'Y'                                              
LRM016        SET ACAT10IO-DELETE-ALL-ASSETS-RVS TO TRUE                12750000
LRM016        MOVE LOW-VALUES TO ACAT10IO-SEARCH-VASSET                 12750000
LRM016        PERFORM 0520-CALL-ACAT10DC                                14060000
LRM016        IF ACAT10IO-DB2-ERROR                                     14070000
LRM016           MOVE 'ACAT10DC'       TO WS-DB2-ERROR-PGM              14080000
LRM016           MOVE 'DLET RVS'       TO WS-DB2-ERROR-FUNCTION         14090000
LRM016           MOVE ACAT10IO-SQLCAID TO WS-DB2-ERROR-TABLE            14100000
LRM016           MOVE ACAT10IO-SQLCODE TO WS-DB2-ERROR-ID               14110000
LRM016           MOVE WS-DB2-ERROR-MSG TO SYSTEM-MSG                    14120000
LRM016           SET ERROR-YES TO TRUE                                  14130000
LRM016           SET DATA-ONLY TO TRUE                                  14150000
LRM016           PERFORM 0800-SEND-MAP-RETURN                           14160000
LRM016        END-IF                                                            
LRM016        MOVE LOW-VALUES TO TWA-BAL01-TRAN-TYPE  TWA-MBAL01        55360000
LRM016                           TWA-BAL02-TRAN-TYPE  TWA-MBAL02        55360000
LRM016                           TWA-BAL05-TRAN-TYPE  TWA-MBAL05        55360000
LRM016                           TWA-SMA-TRAN-TYPE    TWA-MSMA          55360000
LRM016        PERFORM REFORMAT-BAL01 THRU REFORMAT-SMA                  55340000
LRM016        MOVE 'ALL POSITION DELETES WERE REMOVED' TO SYSTEM-MSG            
LRM016        MOVE LOW-VALUES TO TWA-MCD MCDO                           57140000
LRM016                           TWA-MDEL TWA-MDEL-ORIG                 57140000
LRM016        MOVE ZEROS   TO TWA-ASSET-DELETE-COUNT                    07490000
LRM016        SET ERROR-YES TO TRUE                                     39050000
LRM016        PERFORM 0830-ERROR-RTN                                    39510000
LRM016     END-IF.                                                      07490000
       0440A-EXIT.                                                      39580000
           EXIT.                                                        39590000
      /                                                                 39600000
      ***************************************************************** 39610000
       0440B-VALIDATE-R-FIELDS.                                         39620000
                                                                        39630000
      ** WHEN TWA-INIT-TRANS-TYPE-CD = 'R', THIS TIF WAS REJECTED       39640000
      **  ONLY "UNDO" IS PERMITTED                                      39650000
                                                                        39660000
12/18      IF MREJL  > +0    AND                                        39670000
              MREJCL = +0                                               39680000
              MOVE ATT-UNPROT-BRT  TO  MREJCA                           39690000
              IF TWA-XFR-REJ-NO                                         39700000
                 PERFORM 0450-PROCESS-INPUT THRU 0450-EXIT              39710000
              ELSE                                                      39720000
                 IF TWA-XFR-REJ-YES                                     39730000
LRM013              IF TWA-VINITRNF-NSCC-PEND-CD = SPACE                        
LRM013                MOVE                                              39740000
LRM013                  'THIS TIF HAS BEEN FLAGGED TO REJECT FOR SUBMISS39750000
LRM013-                       'ION'                                             
LRM013                  TO SYSTEM-MSG                                   39760000
LRM013              ELSE                                                39760000
                     MOVE                                               39740000
                      'THIS TIF HAS BEEN FLAGGED FOR REJECTION!'        39750000
                        TO SYSTEM-MSG                                   39760000
LRM013              END-IF                                                      
                    MOVE ATT-UNPROT-BRT TO MREJA                        39770000
                    SET CURSOR-ON-MREJ TO TRUE                          39780000
                    SET ERROR-YES TO TRUE                               39790000
01/14               PERFORM 0830-ERROR-RTN                              39800000
                 ELSE                                                   39830000
                    MOVE ATT-UNPROT-BRT TO MREJA                        39840000
                    SET CURSOR-ON-MREJ TO TRUE                          39850000
                    MOVE ' ENTER SPACE TO REVERSE THE REJECTION'        39860000
                     TO SYSTEM-MSG                                      39870000
                    SET ERROR-YES TO TRUE                               39880000
01/14               PERFORM 0830-ERROR-RTN                              39890000
                 END-IF                                                 39920000
              END-IF                                                    39930000
           END-IF.                                                      39940000
                                                                        39950000
12/18      IF MREJL  = +0    AND                                        39960000
              MREJCL > +0                                               39970000
              MOVE ATT-UNPROT-BRT  TO  MREJCA                           39980000
              IF TWA-XFR-REJC-YES  AND                                  39990000
                 (EIBCPOSN = 1739  OR 1740)                             40010000
                  MOVE ATT-UNPROT-BRT   TO  MREJA  MREJCA               40020000
                  SET ACAT90CM-TS-ACCT-COMMENTS TO TRUE                 40030000
                  PERFORM 0540-SEND-POPUP-SCREEN                        40040000
              ELSE                                                      40050000
                 IF TWA-REJC-CD-REQ                                     40060000
                    PERFORM 0540-SEND-POPUP-SCREEN                      40070000
                 ELSE                                                   40080000
                    IF TWA-XFR-REJC-NO                                  40090000
                       PERFORM 0450-PROCESS-INPUT THRU 0450-EXIT        40100000
                    ELSE                                                40110000
                       IF TWA-XFR-REJC-YES                              40120000
                          MOVE                                          40130000
                            'THIS TIF HAS BEEN FLAGGED FOR REJECTION!'  40140000
                              TO SYSTEM-MSG                             40150000
                          MOVE ATT-UNPROT-BRT TO MREJCA                 40160000
                          SET CURSOR-ON-MREJC TO TRUE                   40170000
                          SET ERROR-YES TO TRUE                         40180000
01/14                     PERFORM 0830-ERROR-RTN                        40190000
                       ELSE                                             40220000
                          MOVE ATT-UNPROT-BRT TO MREJCA                 40230000
                          SET CURSOR-ON-MREJC TO TRUE                   40240000
                          MOVE ' ENTER SPACE TO REVERSE THE REJECTION'  40250000
                           TO SYSTEM-MSG                                40260000
                          SET ERROR-YES TO TRUE                         40270000
01/14                     PERFORM 0830-ERROR-RTN                        40280000
                       END-IF                                           40310000
                    END-IF                                              40320000
                 END-IF                                                 40330000
              END-IF                                                    40340000
           END-IF.                                                      40350000
                                                                        40360000
           IF  MREJL  > +0   AND                                        40370000
               MREJCL > +0                                              40380000
               SET CURSOR-ON-MREJ   TO TRUE                             40390000
               MOVE ' CAN NOT ENTER BOTH FIELDS'  TO SYSTEM-MSG         40400000
               SET ERROR-YES TO TRUE                                    40410000
01/14          PERFORM 0830-ERROR-RTN                                   40420000
           END-IF.                                                      40450000
                                                                        40460000
                                                                        40470000
       0440B-EXIT.                                                      40480000
           EXIT.                                                        40490000
      /                                                                 40500000
       0450-PROCESS-INPUT.                                              40510000
                                                                        40520000
12/03      IF MCDL > +0                                                 40530000
01/24      OR (TWA-MBAL01 GREATER SPACES  AND                           40540000
              TWA-BAL01-CHANGED)                                        40550000
           OR (TWA-MBAL02 GREATER SPACES  AND                           40560000
              TWA-BAL02-CHANGED)                                        40570000
           OR (TWA-MBAL05 GREATER SPACES  AND                           40580000
              TWA-BAL05-CHANGED)                                        40590000
01/24      OR (TWA-MSMA   GREATER SPACES  AND                           40600000
              TWA-SMA-CHANGED)                                          40610000
01/24      OR (TWA-MQTY   GREATER SPACES  AND                           40620000
              TWA-QTY-CHANGED)                                          40630000
01/24      OR (TWA-MAMT   GREATER SPACES  AND                           40640000
              TWA-AMT-CHANGED)                                          40650000
              MOVE TWA-ACAT10IO-AREA TO ACAT10IO-AREA                   40660000
LRM001        IF MSUBML > +0                                            40970000
LRM001           SET HAVE-COMBO-UPDATE TO TRUE                                  
LRM001           MOVE TWA-MSUBM  TO WS-SAVE-MSUBM                               
LRM001           MOVE LOW-VALUES TO TWA-MSUBM                                   
LRM001                              ACAT10IO-MSUBM                              
LRM001        END-IF                                                            
              IF TWA-VINITAST-FOUND     OR                              40670000
12/23            TWA-VINITAST-UPDATED   OR                              40680000
12/23            TWA-VINITAST-INSERTED  OR                              40690000
12/23            TWA-VINITAST-FIRST     OR                              40700000
12/23            TWA-VINITAST-LAST                                      40710000
01/15            IF TWA-MCD = 'D'                                       40720000
  |                 IF TWA-STCD LESS THAN 200                           40730000
  |                    SET ACAT10IO-DLTE-VINITAST TO TRUE               40740000
  |                    PERFORM 0510-RETRIEVE-ASSET-INFO                 40750000
  |                 ELSE                                                40760000
  |                    SET ACAT10IO-UPDT-VINITAST TO TRUE               40770000
  |                    PERFORM 0510-RETRIEVE-ASSET-INFO                 40780000
01/15               END-IF                                              40790000
                 ELSE                                                   40800000
01/18               IF TWA-MCD = ' '            AND                     40810000
01/18                  (TWA-STCD NOT LESS THAN 200 AND                  40820000
01/18                   TWA-STCD LESS THAN 300 )                        40830000
01/18                   SET ACAT10IO-DLTE-VINITAST TO TRUE              40840000
01/18                   PERFORM 0510-RETRIEVE-ASSET-INFO                40850000
                    ELSE                                                40860000
                       SET ACAT10IO-UPDT-VINITAST TO TRUE               40870000
                       PERFORM 0510-RETRIEVE-ASSET-INFO                 40880000
12/23               END-IF                                              40890000
                 END-IF                                                 40900000
              ELSE                                                      40910000
                 SET ACAT10IO-ISRT-VINITAST TO TRUE                     40920000
                 PERFORM 0510-RETRIEVE-ASSET-INFO                       40930000
              END-IF                                                    40940000
           END-IF.                                                      40950000
                                                                        40960000
           IF MSUBML > +0                                               40970000
              PERFORM 0450A-PROCESS-SUBM  THRU 0450A-EXIT               40980000
           END-IF.                                                      40990000
                                                                        41000000
11/20 *--------------- RETURN FROM ACAT90CM -------------------*        41050000
BEG                                                                     41060000
12/24      IF ACAT90CM-TS-UPDATE                                        41070000
  |           IF TWA-SECC-YES                                           41080000
  |              IF ACAT90CM-TS-SCREEN = 'S'    AND                     41090000
  |                 ACAT90CM-TS-MCCMNT > SPACES                         41100000
  |                 SET ACAT10IO-UPDT-VINITAST TO TRUE                  41110000
  |                 PERFORM 0510-RETRIEVE-ASSET-INFO                    41120000
  |              END-IF                                                 41130000
  |           END-IF                                                    41140000
12/24      END-IF.                                                      41150000
                                                                        41160000
           IF ACAT90CM-TS-UPDATE                                        41170000
              IF TWA-XFR-REJC-YES                                       41180000
                 IF ACAT90CM-TS-SCREEN = 'J' AND                        41190000
                    TWA-SCREEN-IND = 'J'   AND                          41200000
                    (ACAT90CM-TS-MCCMNT = SPACES OR LOW-VALUES)         41210000
                     MOVE ATT-UNPROT-BRT TO MREJCA                      41220000
                     SET CURSOR-ON-MREJC TO TRUE                        41230000
                     MOVE 'PRESS ENTER TO OBTAIN COMMENT SCREEN' TO     41240000
                                                              SYSTEM-MSG41250000
                     MOVE EIBTRMID TO TERM-ID                           41260000
                     MOVE 'ACA0' TO TRAN-ID                             41270000
                     PERFORM 0600-DELETE-TSQ                            41280000
                     PERFORM 0810-MAP-INPUT-AREA THRU 0810-EXIT         41290000
                     PERFORM 0620-WRITE-TSQ                             41300000
                     PERFORM 0800-SEND-MAP-RETURN                       41310000
                 ELSE                                                   41320000
                    IF ACAT90CM-TS-SCREEN = 'A'    AND                  41330000
                       TWA-SCREEN-IND = 'A'        AND                  41340000
                       (ACAT90CM-TS-MCCMNT > SPACES  OR                 41350000
                        ACAT90CM-TS-MREJECT > SPACES)                   41360000
                       PERFORM 0460-INSERT-INITRNF                      41370000
                    END-IF                                              41380000
                 END-IF                                                 41390000
              ELSE                                                      41400000
                 IF TWA-XFR-REJ-YES                                     41410000
                    PERFORM 0460-INSERT-INITRNF                         41420000
                 END-IF                                                 41430000
              END-IF                                                    41440000
END        END-IF.                                                      41450000
      *--------------------------------------------------------------*  41460000
                                                                        41470000
           IF MREJL > +0  OR                                            41480000
              MREJCL > +0                                               41490000
              IF TWA-XFR-REJ-YES   OR                                   41500000
                 TWA-XFR-REJC-YES                                       41510000
                 PERFORM 0460-INSERT-INITRNF                            41520000
              ELSE                                                      41530000
                 IF TWA-XFR-REJ-NO  OR                                  41540000
                    TWA-XFR-REJC-NO                                     41550000
                    PERFORM 0470-DELETE-INITRNF                         41560000
                 END-IF                                                 41570000
              END-IF                                                    41580000
           END-IF.                                                      41590000
                                                                        41600000
       0450-EXIT.                                                       41610000
           EXIT.                                                        41620000
      /                                                                 41630000
       0450A-PROCESS-SUBM.                                              41640000
      *================================================================*41650000
      *                                                                *41660000
      **  IN DELIVERER SIDE, WHEN STCD IS LESS THAN 300,               *41670000
10/13 **     ONLY ASSET CAN BE SUBMITTED BY CREATING MULTI INIVAST **** 41680000
      **                                                               *41690000
      *================================================================*41700000
10/14 *  WHEN SUBM ='Y' WAS ENTERED,                                    41710000
      *  ALL NSCC-PEND-CD IN VINITAST WILL BE UPDATED TO ' ', EXCEPT    41720000
      *  WITHHELD POSITION. (GROUP UPDATES)                             41730000
      *  THE NSCC-PEND-CD WILL BE UPDATED AS 'S' IN VTRNFR.             41740000
      *                                                                 41750000
           IF TWA-MSUBM = 'S' OR SPACE                                  41760000
              MOVE TWA-ACAT10IO-AREA     TO ACAT10IO-AREA               41770000
              SET ACAT10IO-UPDT-VINITAST TO TRUE                        41780000
12/29         IF (ACAT10IO-VINITAST-NOT-FOUND    AND                    41790000
LRM023            ACAT10IO-BAL01 = 0             AND                    41790000
LRM023            ACAT10IO-BAL02 = 0             AND                    41790000
LRM023            ACAT10IO-BAL05 = 0             AND                    41790000
LRM023            ACAT10IO-SMA   = 0             AND                    41790000
01/26             TWA-STCD < '200')                                     41800000
12/29          OR (ACAT10IO-VASSET-NOT-FOUND AND                        41810000
LRM001            TWA-STCD NOT < '200')                                 41800000
                  SET ACAT10IO-VINITAST-UPDATED TO TRUE                 41820000
              ELSE                                                      41830000
LRM023            SET ACAT10IO-VINITAST-UPDATED TO TRUE                 41820000
                  PERFORM 0520-CALL-ACAT10DC                            41840000
              END-IF                                                    41850000
              IF ACAT10IO-VINITAST-UPDATED                              41860000
                 SET ACAT10IO-UPDT-VTRNFR TO TRUE                       41870000
                 PERFORM 0500-CALL-ACAT10DA                             41880000
                 IF ACAT10IO-VTRNFR-UPDATED                             41890000
                    MOVE ACAT10IO-AREA TO TWA-ACAT10IO-AREA             41900000
                    PERFORM 0405-MOVE-SV-KEYS                           41910000
12/24               IF TWA-SUBM-YES                                     41920000
                       SET CURSOR-ON-MSUBM TO TRUE                      41930000
                       MOVE ATT-PROT       TO MSECCA                    41940000
                       MOVE ATT-UNPROT-BRT TO MSUBMA                    41950000
                       MOVE 'Y'            TO MSUBMO                    41960000
                       MOVE                                             41970000
                       'POSITIONS WILL BE SUBMITTED TO NSCC' TO         41980000
                        SYSTEM-MSG                                      41990000
                    ELSE                                                42000000
                       IF TWA-SUBM-NO                                   42010000
                          SET CURSOR-ON-MSUBM TO TRUE                   42020000
                          MOVE ATT-PROT       TO MSECCA                 42030000
                          MOVE ATT-UNPROT-BRT TO MSUBMA                 42040000
                          MOVE SPACE          TO MSUBMO                 42050000
                          MOVE                                          42060000
                          'POSITIONS WILL NOT BE SUBMITTED TO NSCC' TO  42070000
                           SYSTEM-MSG                                   42080000
                       END-IF                                           42090000
                    END-IF                                              42100000
                 ELSE                                                   42110000
                    MOVE 'ACAT10DC'    TO WS-DB2-ERROR-PGM              42120000
                    MOVE 'SELECT'      TO WS-DB2-ERROR-FUNCTION         42130000
                    MOVE ACAT10IO-SQLCAID TO WS-DB2-ERROR-TABLE         42140000
                    MOVE ACAT10IO-SQLCODE TO WS-DB2-ERROR-ID            42150000
                    MOVE WS-DB2-ERROR-MSG TO SYSTEM-MSG                 42160000
                    SET ERROR-YES TO TRUE                               42170000
12/12                SET DATA-ONLY TO TRUE                              42180000
12/12                PERFORM 0800-SEND-MAP-RETURN                       42190000
                 END-IF                                                 42200000
              END-IF                                                    42210000
           END-IF.                                                      42220000
***                                                                     42230000
           IF TWA-MSUBM NOT =  LOW-VALUE AND                            42240000
              ACAT10IO-VINITAST-UPDATED AND                             42250000
              ACAT10IO-VTRNFR-UPDATED                                   42260000
               MOVE ATT-UNPROT-BRT TO MSUBMA                            42270000
               SET CURSOR-ON-MSUBM TO TRUE                              42280000
               MOVE SPACE TO TWA-SCREEN-IND                             42290000
               MOVE EIBTRMID TO TERM-ID                                 42300000
               MOVE 'ACA0' TO TRAN-ID                                   42310000
               PERFORM 0600-DELETE-TSQ                                  42320000
               PERFORM 0810-MAP-INPUT-AREA THRU 0810-EXIT               42330000
               PERFORM 0620-WRITE-TSQ                                   42340000
               PERFORM 0800-SEND-MAP-RETURN                             42350000
           END-IF.                                                      42360000
                                                                        42370000
       0450A-EXIT.                                                      42380000
           EXIT.                                                        42390000
                                                                        42400000
12/24  0450B-PROCESS-SECC.                                              42410000
      *=============================================================*   42420000
10/15 *  WHEN SECC ='Y' WAS ENTERED, A NEW VINITRNF WILL BE INSERTED    42430000
      *  WITH NSCC-PEND-CD = ' ' AND ALL NSCC-PEND-CD IN VINITAST WILL  42440000
      *  BE UPDATED TO ' ',  EXCEPT "WITHHELD" POSITIONS.               42450000
      *                                                                 42460000
           IF TWA-MSECC  = 'S' OR SPACE                                 42470000
              MOVE TWA-ACAT10IO-AREA     TO ACAT10IO-AREA               42480000
              SET ACAT10IO-UPDT-VINITAST TO TRUE                        42490000
              PERFORM 0520-CALL-ACAT10DC                                42500000
              IF ACAT10IO-VINITAST-UPDATED                              42510000
                 MOVE ACAT10IO-AREA TO TWA-ACAT10IO-AREA                42520000
                 PERFORM 0405-MOVE-SV-KEYS                              42530000
12/24            IF TWA-SECC-YES                                        42540000
                    MOVE ATT-UNPROT-BRT TO MSECCA                       42550000
                    MOVE ATT-PROT          TO MSUBMA                    42560000
                    MOVE 'Y'               TO MSECCO                    42570000
                    SET CURSOR-ON-MSECC TO TRUE                         42580000
                    MOVE                                                42590000
                    'SECURITY COMMENTS WILL BE UPDATED'                 42600000
                    TO TWA-RETURN-MSG                                   42610000
                 END-IF                                                 42620000
              ELSE                                                      42630000
                 MOVE 'ACAT10DC'       TO WS-DB2-ERROR-PGM              42640000
                 MOVE 'SELECT'         TO WS-DB2-ERROR-FUNCTION         42650000
                 MOVE ACAT10IO-SQLCAID TO WS-DB2-ERROR-TABLE            42660000
                 MOVE ACAT10IO-SQLCODE TO WS-DB2-ERROR-ID               42670000
                 MOVE WS-DB2-ERROR-MSG TO SYSTEM-MSG                    42680000
                 SET ERROR-YES TO TRUE                                  42690000
12/12            SET DATA-ONLY TO TRUE                                  42700000
12/12            PERFORM 0800-SEND-MAP-RETURN                           42710000
              END-IF                                                    42720000
           END-IF.                                                      42730000
                                                                        42740000
12/24      IF (TWA-MSECC = 'S' OR SPACE ) AND                           42750000
              ACAT10IO-VINITAST-UPDATED   AND                           42760000
              ACAT10IO-VTRNFR-UPDATED                                   42770000
               MOVE ATT-UNPROT-BRT TO MSECCA                            42780000
               SET CURSOR-ON-MSECC TO TRUE                              42790000
               MOVE SPACE TO TWA-SCREEN-IND                             42800000
               MOVE EIBTRMID TO TERM-ID                                 42810000
               MOVE 'ACA0' TO TRAN-ID                                   42820000
               PERFORM 0600-DELETE-TSQ                                  42830000
               PERFORM 0810-MAP-INPUT-AREA THRU 0810-EXIT               42840000
               PERFORM 0620-WRITE-TSQ                                   42850000
               PERFORM 0800-SEND-MAP-RETURN                             42860000
           END-IF.                                                      42870000
                                                                        42880000
       0450B-EXIT.                                                      42890000
           EXIT.                                                        42900000
      /                                                                 42910000
      ***************************************************************** 42920000
       0455-PROCESS-SEND-ASSET.                                         42930000
           PERFORM 0520-CALL-ACAT10DC.                                  42940000
           IF ACAT10IO-DB2-ERROR                                        42950000
              MOVE 'ACAT10DC'          TO WS-DB2-ERROR-PGM              42960000
              MOVE 'SELECT'          TO WS-DB2-ERROR-FUNCTION           42970000
              MOVE ACAT10IO-SQLCAID TO WS-DB2-ERROR-TABLE               42980000
              MOVE ACAT10IO-SQLCODE TO WS-DB2-ERROR-ID                  42990000
              MOVE WS-DB2-ERROR-MSG TO SYSTEM-MSG                       43000000
              SET ERROR-YES TO TRUE                                     43010000
12/12         SET DATA-ONLY TO TRUE                                     43020000
12/12         PERFORM 0800-SEND-MAP-RETURN                              43030000
           END-IF.                                                      43040000
                                                                        43050000
           MOVE ACAT10IO-AREA TO TWA-ACAT10IO-AREA.                     43060000
10/14                                                                   43070000
           IF TWA-VINITAST-UPDATED  OR                                  43080000
              TWA-VINITAST-INSERTED  OR                                 43090000
              TWA-VINITAST-DELETED                                      43100000
              IF TWA-SUBM-NO                                            43110000
                 SET CURSOR-ON-MSUBM             TO TRUE                43120000
                 MOVE 'THE POSITION WILL NOT BE SUBMITTED TO NSCC'      43130000
                      TO           TWA-RETURN-MSG                       43140000
                 MOVE LOW-VALUE TO TWA-MSUBM                            43150000
                 MOVE SPACE     TO MSUBMO                               43160000
              END-IF                                                    43170000
           END-IF.                                                      43230000
                                                                        43240000
           MOVE EIBTRMID      TO TERM-ID.                               43250000
           MOVE 'ACA0'        TO TRAN-ID.                               43260000
           PERFORM 0600-DELETE-TSQ.                                     43270000
           PERFORM 0810-MAP-INPUT-AREA THRU 0810-EXIT.                  43280000
           PERFORM 0620-WRITE-TSQ.                                      43290000
           PERFORM 0800-SEND-MAP-RETURN.                                43300000
      ***************************************************************** 43310000
      /                                                                 43320000
       0460-INSERT-INITRNF.                                             43330000
      * ALSO HANDLES UPDATE*                                            43340000
           MOVE TWA-ACAT10IO-AREA TO ACAT10IO-AREA.                     43350000
      *???                                                              43360000
           IF TWA-XFR-REJ-YES                                           43370000
              MOVE TWA-MREJ     TO ACAT10IO-VINITRNF-TYPE-RJCT-CD       43380000
LRM004        MOVE LOW-VALUES TO ACAT10IO-MBR ACAT10IO-MAC                      
           ELSE                                                         43390000
              IF TWA-XFR-REJC-YES                                       43400000
                 MOVE TWA-VINITRNF-CMNT TO ACAT10IO-VINITRNF-CMNT       43410000
                 MOVE TWA-MREJC  TO ACAT10IO-VINITRNF-TYPE-RJCT-CD      43420000
LRM004           MOVE LOW-VALUES TO ACAT10IO-MBR ACAT10IO-MAC                   
              END-IF                                                    43430000
           END-IF.                                                      43440000
                                                                        43450000
ET0003     MOVE SPACE                TO ACAT10IO-ACCT-FREEZ-PROCESS.            
ET0004     MOVE ACAT-SIGN-ON-ID      TO ACAT10IO-SIGN-ON-ID.            43440000
ET0004     MOVE ACAT-CICS-NETNAME    TO ACAT10IO-NET-NAME.              43440000
ET0004     MOVE ACAT-CICS-USER-ID    TO ACAT10IO-USER-ID.               43440000
ET0004     MOVE ACAT-CICS-USER-NAME  TO ACAT10IO-USER-NAME.             43440000
                                                                        43450000
           SET ACAT10IO-ISRT-VINITRNF TO TRUE.                          43460000
           PERFORM 0500-CALL-ACAT10DA.                                  43470000
           IF ACAT10IO-DB2-ERROR                                        43480000
              MOVE 'SELECT'             TO WS-DB2-ERROR-FUNCTION        43490000
              MOVE 'ACAT10DA'       TO WS-DB2-ERROR-PGM                 43500000
              MOVE ACAT10IO-SQLCAID     TO WS-DB2-ERROR-TABLE           43510000
              MOVE ACAT10IO-SQLCODE     TO WS-DB2-ERROR-ID              43520000
              MOVE WS-DB2-ERROR-MSG     TO SYSTEM-MSG                   43530000
              SET ERROR-YES TO TRUE                                     43540000
12/12         SET DATA-ONLY TO TRUE                                     43550000
12/12         PERFORM 0800-SEND-MAP-RETURN                              43560000
           END-IF.                                                      43570000
                                                                        43580000
           MOVE ACAT10IO-AREA TO TWA-ACAT10IO-AREA.                     43590000
                                                                        43600000
           IF TWA-VINITRNF-INSERTED   OR                                43610000
              TWA-VINITRNF-UPDATED                                      43620000
              SET TWA-SRCH-VTRNFR TO TRUE                               43630000
              IF TWA-XFR-REJ-YES                                        43640000
                 SET CURSOR-ON-MREJ        TO TRUE                      43650000
                 MOVE TWA-VINITRNF-TYPE-RJCT-CD TO TWA-MREJ             43660000
                 MOVE 'THIS TIF WILL BE FLAGGED FOR REJECTION'          43670000
                                                   TO SYSTEM-MSG        43680000
              ELSE                                                      43690000
                 IF TWA-XFR-REJC-YES                                    43700000
                    SET CURSOR-ON-MREJC         TO TRUE                 43710000
                    MOVE TWA-VINITRNF-TYPE-RJCT-CD TO TWA-MREJC         43720000
                    MOVE                                                43730000
                    'THIS TIF WILL BE FLAGGED FOR REJECT/W COMMENT ' TO 43740000
                                    SYSTEM-MSG                          43750000
                 ELSE                                                   43760000
                    IF TWA-SUBM-YES                                     43770000
                       SET CURSOR-ON-MSUBM TO TRUE                      43780000
                       MOVE 'THIS TIF WILL BE SUBMITTED TO NSCC'        43790000
                                  TO SYSTEM-MSG                         43800000
                    ELSE                                                43810000
                       IF TWA-SECC-YES                                  43820000
                          SET CURSOR-ON-MSECC TO TRUE                   43830000
                          MOVE                                          43840000
                       'THIS TIF/W COMMENT WILL BE SUBMITTED TO NSCC'   43850000
                                          TO SYSTEM-MSG                 43860000
                       ELSE                                             43870000
                          MOVE TWA-RETURN-MSG TO SYSTEM-MSG             43880000
                       END-IF                                           43890000
                    END-IF                                              43900000
                 END-IF                                                 43910000
              END-IF                                                    43920000
           ELSE                                                         43930000
              MOVE TWA-RETURN-MSG         TO  SYSTEM-MSG                43940000
              SET ERROR-YES TO TRUE                                     43950000
              PERFORM 0830-ERROR-RTN                                    43960000
           END-IF.                                                      43970000
                                                                        43980000
           MOVE EIBTRMID      TO TERM-ID.                               43990000
           MOVE 'ACA0'        TO TRAN-ID.                               44000000
           PERFORM 0600-DELETE-TSQ.                                     44010000
           PERFORM 0810-MAP-INPUT-AREA  THRU  0810-EXIT.                44020000
           PERFORM 0620-WRITE-TSQ.                                      44030000
           PERFORM 0800-SEND-MAP-RETURN.                                44040000
                                                                        44050000
      /                                                                 44060000
      ***************************************************************** 44070000
       0470-DELETE-INITRNF.                                             44080000
           MOVE TWA-ACAT10IO-AREA TO ACAT10IO-AREA.                     44090000
           SET  ACAT10IO-DLTE-VINITRNF TO TRUE.                         44100000
           PERFORM 0500-CALL-ACAT10DA.                                  44110000
           IF ACAT10IO-DB2-ERROR                                        44120000
              MOVE 'SELECT'             TO WS-DB2-ERROR-FUNCTION        44130000
              MOVE 'ACAT10DA'       TO WS-DB2-ERROR-PGM                 44140000
              MOVE ACAT10IO-SQLCAID     TO WS-DB2-ERROR-TABLE           44150000
              MOVE ACAT10IO-SQLCODE     TO WS-DB2-ERROR-ID              44160000
              MOVE WS-DB2-ERROR-MSG     TO TWA-RETURN-MSG               44170000
              SET ERROR-YES TO TRUE                                     44180000
12/12         SET DATA-ONLY TO TRUE                                     44190000
12/12         PERFORM 0800-SEND-MAP-RETURN                              44200000
           END-IF.                                                      44210000
                                                                        44220000
           MOVE ACAT10IO-AREA      TO     TWA-ACAT10IO-AREA.            44230000
                                                                        44240000
12/18      IF TWA-VINITRNF-DELETED                                      44250000
              IF TWA-XFR-REJ-NO                                         44260000
                 IF WS-CURSOR = SPACE                                   44270000
                    SET CURSOR-ON-MREJ TO TRUE                          44280000
                    MOVE 'THIS TIF WILL NOT BE REJECTED'                44290000
                                             TO SYSTEM-MSG              44300000
                 END-IF                                                 44310000
                 MOVE LOW-VALUE TO TWA-MREJ                             44320000
                 MOVE ATT-UNPROT-BRT TO                                 44330000
01/01                             MBRA, MACA, MRRA, MNAMEA, MNAME2A,    44340000
01/01                             MSSN1AA, MSSN1BA, MSSN1CA,            44350000
01/01                             MSSN2AA, MSSN2BA, MSSN2CA             44360000
                                  MBAL01A, MBAL02A, MBAL05A, MSECRA,    44370000
                                  MWIA, MTYPEA, MSTTLA, MSRSNA, MCDA,   44380000
                                  MQTYA, MDESCA, MAMTA, MDESC2A, MSMAA, 44390000
                                  MDESC3A, MSUBMA, MSECCA, MREJA, MREJCA44400000
LRM016           IF TWA-STCD >= '200' AND < '300'                               
LRM016           AND ACAT-FULL-DLVY-ASSET-DELETE = '1'                          
LRM016              MOVE ATT-UNPROT TO MDELA                                    
LRM016           ELSE                                                           
LRM016              MOVE ATT-PROT   TO MDELA                                    
LRM016              MOVE ATT-ASKIP-DRK  TO MDELTA                               
LRM016           END-IF                                                         
              ELSE                                                      44410000
                 IF TWA-XFR-REJC-NO                                     44420000
                    IF WS-CURSOR = SPACE                                44430000
                       SET CURSOR-ON-MREJC TO TRUE                      44440000
                       MOVE 'THIS TIF/W CMNT WILL NOT BE REJECTED'      44450000
                                             TO SYSTEM-MSG              44460000
                    END-IF                                              44470000
                    MOVE LOW-VALUE TO TWA-MREJC                         44480000
                    MOVE ATT-UNPROT-BRT TO                              44490000
01/01                              MBRA, MACA, MRRA, MNAMEA, MNAME2A,   44500000
01/01                              MSSN1AA, MSSN1BA, MSSN1CA,           44510000
01/01                              MSSN2AA, MSSN2BA, MSSN2CA            44520000
                                   MBAL01A, MBAL02A, MBAL05A, MSECRA,   44530000
                                   MWIA, MTYPEA, MSTTLA, MSRSNA, MCDA,  44540000
                                   MQTYA, MDESCA, MAMTA, MDESC2A, MSMAA,44550000
                                   MDESC3A, MSECCA, MREJA, MREJCA       44560000
LRM016              IF TWA-STCD >= '200' AND < '300'                            
LRM016              AND ACAT-FULL-DLVY-ASSET-DELETE = '1'                       
LRM016                 MOVE ATT-UNPROT TO MDELA                                 
LRM016              ELSE                                                        
LRM016                 MOVE ATT-PROT   TO MDELA                                 
LRM016              END-IF                                                      
                 END-IF                                                 44570000
              END-IF                                                    44580000
           ELSE                                                         44590000
              MOVE TWA-RETURN-MSG  TO  SYSTEM-MSG                       44600000
              SET ERROR-YES TO TRUE                                     44610000
              PERFORM 0830-ERROR-RTN                                    44620000
           END-IF.                                                      44630000
                                                                        44640000
           MOVE EIBTRMID      TO TERM-ID.                               44650000
           MOVE 'ACA0'        TO TRAN-ID.                               44660000
           PERFORM 0600-DELETE-TSQ.                                     44670000
           PERFORM 0810-MAP-INPUT-AREA THRU 0810-EXIT.                  44680000
           PERFORM 0620-WRITE-TSQ.                                      44690000
           MOVE ATT-UNPROT  TO  MREJA, MREJCA.                          44700000
           PERFORM 0800-SEND-MAP-RETURN.                                44710000
      /                                                                 44720000
      ******************************************************************44730000
       0480-CHECK-EIBCPOSN.                                             44740000
                                                                        44750000
           IF EIBAID = DFHENTER                                         44760000
              IF (EIBCPOSN >= 455  AND <= 480 )                         44770000
                 SET UPDT-BAL1-CMNT            TO TRUE                  44780000
              ELSE                                                      44790000
                 IF (EIBCPOSN >= 535 AND <= 560 )                       44800000
                    SET UPDT-BAL2-CMNT         TO TRUE                  44810000
                 ELSE                                                   44820000
                    IF (EIBCPOSN >= 615 AND <= 640 )                    44830000
                       SET UPDT-BAL5-CMNT      TO TRUE                  44840000
                    ELSE                                                44850000
                     IF (EIBCPOSN >= 694 AND <= 720 )                   44860000
                        SET VIEW-SMA-CMNT   TO TRUE                     44870000
                     ELSE                                               44880000
                       IF EIBCPOSN = 1713                               44890000
                           SET UPDT-SECR-CMNT  TO TRUE                  44900000
                       ELSE                                             44910000
                          IF (EIBCPOSN >= 1 AND < 1121)  OR             44920000
                             (EIBCPOSN = 1694)           OR             44930000
                             (EIBCPOSN = 1731)                          44940000
                             SET UPDT-ACCT-CMNT TO TRUE                 44950000
                          ELSE                                          44960000
                             SET CURSOR-ON-MNEXT TO TRUE                44970000
                             MOVE 'TAB TO THE FIELD TO VIEW COMMENTS'   44980000
                             TO SYSTEM-MSG                              44990000
                             SET ERROR-YES TO TRUE                      45000000
12/12                        SET DATA-ONLY TO TRUE                      45010000
12/12                        PERFORM 0800-SEND-MAP-RETURN               45020000
                          END-IF                                        45030000
                       END-IF                                           45040000
                    END-IF                                              45050000
                 END-IF                                                 45060000
              END-IF                                                    45070000
           END-IF.                                                      45080000
                                                                        45090000
           IF EIBAID = DFHPF1                                           45100000
              IF (EIBCPOSN >= 455  AND <= 480 )                         45110000
                 SET VIEW-BAL1-CMNT            TO TRUE                  45120000
              ELSE                                                      45130000
                 IF (EIBCPOSN >= 535 AND <= 560 )                       45140000
                    SET VIEW-BAL2-CMNT         TO TRUE                  45150000
                 ELSE                                                   45160000
                    IF (EIBCPOSN >= 615 AND <= 640 )                    45170000
                       SET VIEW-BAL5-CMNT      TO TRUE                  45180000
                    ELSE                                                45190000
                     IF (EIBCPOSN >= 694 AND <= 720 )                   45200000
                        SET VIEW-SMA-CMNT   TO TRUE                     45210000
                     ELSE                                               45220000
                       IF (EIBCPOSN >= 1121 AND <= 1600)                45230000
                           SET VIEW-SECR-CMNT  TO TRUE                  45240000
                       ELSE                                             45250000
                          IF (EIBCPOSN >= 1 AND < 1121)                 45260000
                             SET VIEW-ACCT-CMNT TO TRUE                 45270000
                          ELSE                                          45280000
                             IF (EIBCPOSN = 1739)        OR             45290000
                                (EIBCPOSN = 1740)                       45300000
                                SET VIEW-REJC-CMNT TO TRUE              45310000
                             ELSE                                       45320000
                                SET UPDT-ACCT-CMNT TO TRUE              45330000
                                SET CURSOR-ON-MNEXT TO TRUE             45340000
                                MOVE 'TAB TO THE FIELD TO VIEW COMMENTS'45350000
                                TO SYSTEM-MSG                           45360000
                                SET ERROR-YES TO TRUE                   45370000
12/12                           SET DATA-ONLY TO TRUE                   45380000
12/12                           PERFORM 0800-SEND-MAP-RETURN            45390000
                             END-IF                                     45400000
                          END-IF                                        45410000
                       END-IF                                           45420000
                     END-IF                                             45430000
                    END-IF                                              45440000
                 END-IF                                                 45450000
              END-IF                                                    45460000
           END-IF.                                                      45470000
      /                                                                 45480000
       0490-CALL-ACATSRCH-RTN.                                          45490000
           EXEC CICS LINK                                               45500000
                PROGRAM ('ACATSRCH')                                    45510000
                COMMAREA (ACAT-SEARCH-AREA)                             45520000
           END-EXEC.                                                    45530000
           IF EIBRESP NOT = +0                                          45540000
              MOVE 'LINK TO ACATSRCH IS FAILED! ' TO SYSTEM-MSG         45550000
              PERFORM 0495-SRCH-CURSOR-RTN                              45560000
              SET ERROR-YES TO TRUE                                     45570000
12/12         SET DATA-ONLY TO TRUE                                     45580000
12/12         PERFORM 0800-SEND-MAP-RETURN                              45590000
           END-IF.                                                      45600000
                                                                        45610000
       0495-SRCH-CURSOR-RTN.                                            45620000
           IF TWA-MMBR = SPACES OR  LOW-VALUES                          45630000
              CONTINUE                                                  45640000
           ELSE                                                         45650000
              IF ACAT-SRCH-BR > SPACE                                   45660000
                 SET CURSOR-ON-MMBR TO TRUE                             45670000
              END-IF                                                    45680000
           END-IF.                                                      45690000
                                                                        45700000
           IF TWA-MMAC = SPACES OR  LOW-VALUES                          45710000
              CONTINUE                                                  45720000
           ELSE                                                         45730000
              IF ACAT-SRCH-ACCT > SPACE                                 45740000
                 SET CURSOR-ON-MMAC TO TRUE                             45750000
              END-IF                                                    45760000
           END-IF.                                                      45770000
                                                                        45780000
           IF TWA-MMRR  =  SPACES  OR  LOW-VALUES                       45790000
              CONTINUE                                                  45800000
           ELSE                                                         45810000
              IF ACAT-SRCH-RR > SPACE                                   45820000
                 SET CURSOR-ON-MMRR TO TRUE                             45830000
              END-IF                                                    45840000
           END-IF.                                                      45850000
                                                                        45860000
           IF TWA-MTFR  =  SPACES  OR  LOW-VALUES                       45870000
              CONTINUE                                                  45880000
           ELSE                                                         45890000
              IF ACAT-SRCH-TFR > SPACE                                  45900000
                 SET CURSOR-ON-MTFR TO TRUE                             45910000
              END-IF                                                    45920000
           END-IF.                                                      45930000
                                                                        45940000
           IF TWA-MCBRKR =  SPACES  OR  LOW-VALUES                      45950000
              CONTINUE                                                  45960000
           ELSE                                                         45970000
              IF ACAT-SRCH-CONTRA-BKR > SPACE                           45980000
                 SET CURSOR-ON-MCBRKR TO TRUE                           45990000
              END-IF                                                    46000000
           END-IF.                                                      46010000
                                                                        46020000
           IF TWA-MSTAT =  SPACES  OR  LOW-VALUES                       46030000
              CONTINUE                                                  46040000
           ELSE                                                         46050000
              IF ACAT-SRCH-STATUS > SPACE                               46060000
                 SET CURSOR-ON-MSTAT TO TRUE                            46070000
              END-IF                                                    46080000
           END-IF.                                                      46090000
                                                                        46100000
       0495-EXIT.                                                       46110000
           EXIT.                                                        46120000
      /                                                                 46130000
      ******************************************************************46140000
       0500-CALL-ACAT10DA.                                              46150000
      *** LINK TO ACAT10DA, ONE VTRNFR ROW WILL BE RETURNED     ****    46160000
                                                                        46170000
           MOVE ACAT-SUPER-SIGN-ON-SEC-FLAG                             46180000
                    TO ACAT10IO-SUPER-SIGN-FLAG.                        46190000
           EXEC CICS LINK                                               46200000
                PROGRAM ('ACAT10DA')                                    46210000
                COMMAREA (ACAT10IO-AREA)                                46220000
           END-EXEC.                                                    46230000
                                                                        46240000
           IF EIBRESP NOT = +0                                          46250000
              MOVE 'LINK TO ACAT10DA IS FAILED! ' TO SYSTEM-MSG         46260000
              SET CURSOR-ON-MNEXT    TO TRUE                            46270000
              SET ERROR-YES TO TRUE                                     46280000
12/12         SET DATA-ONLY TO TRUE                                     46290000
12/12         PERFORM 0800-SEND-MAP-RETURN                              46300000
           END-IF.                                                      46310000
                                                                        46320000
           MOVE ACAT10IO-SAVE-KEYS  TO  TWA-SV-KEYS.                    46330000
      /                                                                 46340000
       0510-RETRIEVE-ASSET-INFO.                                        46350000
                                                                        46360000
           PERFORM 0520-CALL-ACAT10DC.                                  46370000
           IF ACAT10IO-DB2-ERROR                                        46380000
              MOVE 'ACAT10DC'          TO WS-DB2-ERROR-PGM              46390000
              MOVE 'SELECT'          TO WS-DB2-ERROR-FUNCTION           46400000
              MOVE ACAT10IO-SQLCAID  TO WS-DB2-ERROR-TABLE              46410000
              MOVE ACAT10IO-SQLCODE  TO WS-DB2-ERROR-ID                 46420000
              MOVE WS-DB2-ERROR-MSG  TO TWA-RETURN-MSG                  46430000
              SET ERROR-YES TO TRUE                                     46440000
12/12         SET DATA-ONLY TO TRUE                                     46450000
12/12         PERFORM 0800-SEND-MAP-RETURN                              46460000
           ELSE                                                         46470000
12/23         IF ACAT10IO-RETURN-MSG > SPACES                           46480000
                 MOVE ACAT10IO-RETURN-MSG TO SYSTEM-MSG                 46490000
              END-IF                                                    46500000
           END-IF.                                                      46510000
                                                                        46520000
           MOVE ACAT10IO-AREA TO  TWA-ACAT10IO-AREA.                    46530000
           PERFORM 0405-MOVE-SV-KEYS.                                   46540000
                                                                        46550000
           IF TWA-VINITAST-UPDATED   OR                                 46560000
              TWA-VINITAST-INSERTED  OR                                 46570000
              TWA-VINITAST-DELETED                                      46580000
              IF TWA-SUBM-NO                                            46590000
                 SET CURSOR-ON-MSUBM             TO TRUE                46600000
                 MOVE 'POSITIONS WILL NOT BE SUBMITTED TO NSCC'         46610000
                      TO           TWA-RETURN-MSG                       46620000
                 MOVE LOW-VALUE TO TWA-MSUBM                            46630000
              ELSE                                                      46640000
                 IF TWA-SUBM-YES                                        46650000
                    SET CURSOR-ON-MSUBM TO TRUE                         46660000
                    MOVE                                                46670000
                    'POSITIONS WILL BE SUBMITTED TO NSCC' TO            46680000
                                                         TWA-RETURN-MSG 46690000
                     MOVE LOW-VALUE TO TWA-MSUBM                        46700000
                 ELSE                                                   46710000
                     IF TWA-SECC-YES                                    46720000
                        SET CURSOR-ON-MSECC TO TRUE                     46730000
                        MOVE                                            46740000
                        'SECURITY COMMENT  WILL BE UPDATED'             46750000
                                                      TO TWA-RETURN-MSG 46760000
                     END-IF                                             46770000
                 END-IF                                                 46780000
              END-IF                                                    46790000
           END-IF.                                                      46800000
                                                                        46810000
           MOVE SPACES        TO  MREJO, MREJCO, MSUBMO, MSECCO.        46820000
           MOVE EIBTRMID      TO TERM-ID.                               46830000
           MOVE 'ACA0'        TO TRAN-ID.                               46840000
LRM001     IF HAVE-COMBO-UPDATE                                                 
LRM001        MOVE TWA-MCD TO WS-SAVE-MCD                                       
LRM001        MOVE LOW-VALUES TO TWA-MCD                                        
LRM001        MOVE WS-SAVE-MSUBM TO TWA-MSUBM                                   
LRM001                              ACAT10IO-MSUBM                              
LRM001        MOVE LOW-VALUES TO TWA-MBAL01                             55720000
LRM001        SET TWA-BAL01-NO-CHANGE TO TRUE                           00      
LRM001        MOVE LOW-VALUES TO TWA-MBAL02                             00      
LRM001        SET TWA-BAL05-NO-CHANGE TO TRUE                           00      
LRM001        MOVE LOW-VALUES TO TWA-MBAL05                             00      
LRM001        SET TWA-BAL02-NO-CHANGE TO TRUE                           00      
LRM001        MOVE LOW-VALUES TO TWA-MSMA                               00      
LRM001        SET TWA-SMA-NO-CHANGE TO TRUE                             00      
LRM001        MOVE LOW-VALUES TO TWA-MQTY                               00      
LRM001        SET TWA-QTY-NO-CHANGE TO TRUE                             00      
LRM001        MOVE LOW-VALUES TO TWA-MAMT                               00      
LRM001        SET TWA-AMT-NO-CHANGE TO TRUE                             00      
LRM001        PERFORM 0450A-PROCESS-SUBM  THRU 0450A-EXIT               40980000
LRM001     END-IF.                                                              
           PERFORM 0600-DELETE-TSQ.                                     46850000
           PERFORM 0810-MAP-INPUT-AREA THRU 0810-EXIT.                  46860000
           PERFORM 0620-WRITE-TSQ.                                      46870000
           PERFORM 0800-SEND-MAP-RETURN.                                46890000
      /                                                                 46900000
       0520-CALL-ACAT10DC.                                              46910000
                                                                        46920000
LRM019     MOVE ACAT-SIGN-ON-ID TO ACAT10IO-SIGN-ON-ID.                         
LRM019     MOVE ACAT-CICS-NETNAME    TO ACAT10IO-NET-NAME.              43440000
LRM019     MOVE ACAT-CICS-USER-ID    TO ACAT10IO-USER-ID.               43440000
LRM019     MOVE ACAT-CICS-USER-NAME  TO ACAT10IO-USER-NAME.             43440000
           EXEC CICS LINK                                               46940000
                PROGRAM ('ACAT10DC')                                    46950000
                COMMAREA (ACAT10IO-AREA)                                46960000
           END-EXEC.                                                    46970000
                                                                        46980000
           IF EIBRESP NOT = +0                                          46990000
              MOVE 'LINK TO ACAT10DC IS FAILED! ' TO SYSTEM-MSG         47000000
              SET CURSOR-ON-MNEXT    TO TRUE                            47010000
              SET ERROR-YES TO TRUE                                     47020000
12/12         SET DATA-ONLY TO TRUE                                     47030000
12/12         PERFORM 0800-SEND-MAP-RETURN                              47040000
           END-IF.                                                      47050000
                                                                        47060000
           MOVE ACAT10IO-SAVE-KEYS  TO  TWA-SV-KEYS.                    47070000
      /                                                                 47080000
       0530-PREP-FOR-POPUP.                                             47090000
                                                                        47100000
           MOVE EIBTRMID      TO TERM-ID.                               47110000
           MOVE 'ACA0'        TO TRAN-ID.                               47120000
           PERFORM 0610-READ-TSQ.                                       47130000
           PERFORM 0540-SEND-POPUP-SCREEN.                              47140000
                                                                        47150000
       0540-SEND-POPUP-SCREEN.                                          47160000
           INITIALIZE ACAT90CM-TS-AREA.                                 47170000
           PERFORM 0560-WRITE-ACAT90CM-TS-RTN.                          47180000
           MOVE '$' TO WS-ACAT-NEXT.                                    47190000
           MOVE 'ACAT90CM' TO CALLED-PROGRAM-NAME.                      47200000
           PERFORM 0710-INVOKE-DETAIL-PROGRAM-RTN.                      47210000
                                                                        47220000
       0550-READ-ACAT90CM-TS-RTN.                                       47230000
           MOVE EIBTRMID TO TERM-ID.                                    47240000
           MOVE 'ACA$'   TO TRAN-ID.                                    47250000
           INITIALIZE ACAT90CM-TS-AREA.                                 47260000
           EXEC CICS READQ TS QUEUE(TSQ-NAME)                           47270000
                              INTO(ACAT90CM-TS-AREA)                    47280000
                              LENGTH(LENGTH OF ACAT90CM-TS-AREA)        47290000
                              ITEM(ITEM-NUM)                            47300000
           END-EXEC.                                                    47310000
                                                                        47320000
           IF EIBRESP = +0                                              47330000
              IF TWA-SCREEN-IND  = 'A' AND                              47340000
                 ACAT90CM-TS-UPDATE                                     47350000
                 MOVE ACAT90CM-TS-MCCMNT-X120 TO TWA-VINITRNF-CMNT      47360000
              ELSE                                                      47370000
                 IF TWA-SCREEN-IND = 'J'                                47380000
                    MOVE ACAT90CM-TS-MREJECT TO TWA-TRNFR-TYPE-RJCT-CD  47390000
                    IF TWA-REJ-CD-REQ                                   47400000
                       MOVE ACAT90CM-TS-MREJECT TO TWA-MREJ             47410000
                    ELSE                                                47420000
                       IF TWA-REJC-CD-REQ                               47430000
                          MOVE ACAT90CM-TS-MREJECT TO TWA-MREJC         47440000
                       END-IF                                           47450000
                    END-IF                                              47460000
                 ELSE                                                   47470000
01/27               IF TWA-SCREEN-IND = 'S' AND  ACAT90CM-TS-UPDATE     47480000
                       MOVE ACAT90CM-TS-MCCMNT-X120 TO TWA-ASSET-CMNT   47490000
                    ELSE                                                47500000
01/27               IF TWA-SCREEN-IND = '1' AND  ACAT90CM-TS-UPDATE     47510000
                       MOVE ACAT90CM-TS-MCCMNT-X120 TO TWA-BAL01-CMNT   47520000
                    ELSE                                                47530000
01/27               IF TWA-SCREEN-IND = '2' AND  ACAT90CM-TS-UPDATE     47540000
                       MOVE ACAT90CM-TS-MCCMNT-X120 TO TWA-BAL02-CMNT   47550000
                    ELSE                                                47560000
01/27               IF TWA-SCREEN-IND = '5' AND  ACAT90CM-TS-UPDATE     47570000
                       MOVE ACAT90CM-TS-MCCMNT-X120 TO TWA-BAL05-CMNT   47580000
                    ELSE                                                47590000
01/27               IF TWA-SCREEN-IND = 'M' AND  ACAT90CM-TS-UPDATE     47600000
                       MOVE ACAT90CM-TS-MCCMNT-X120 TO TWA-SMA-CMNT     47610000
                    END-IF END-IF END-IF END-IF END-IF                  47620000
                 END-IF                                                 47630000
              END-IF                                                    47640000
           END-IF.                                                      47650000
      /                                                                 47670000
       0560-WRITE-ACAT90CM-TS-RTN.                                      47680000
                                                                        47690000
           PERFORM 0570-CALL-ACAT90CM.                                  47700000
                                                                        47710000
           MOVE 'ACA$'   TO TRAN-ID.                                    47720000
           EXEC CICS DELETEQ TS QUEUE(TSQ-NAME)                         47730000
           END-EXEC.                                                    47740000
                                                                        47750000
           EXEC CICS WRITEQ TS QUEUE(TSQ-NAME)                          47760000
                     FROM(ACAT90CM-TS-AREA)                             47770000
                     LENGTH(LENGTH OF ACAT90CM-TS-AREA)                 47780000
                     ITEM(ITEM-NUM)                                     47790000
           END-EXEC.                                                    47800000
           IF EIBRESP NOT = +0                                          47810000
              MOVE LOW-VALUE TO ACAT10AO, ACAT10BO                      47820000
              MOVE 'ACAT10 WRITE TSQ ERROR ON ACA$' TO SYSTEM-MSG       47830000
           END-IF.                                                      47840000
                                                                        47850000
       0570-CALL-ACAT90CM.                                              47860000
                                                                        47870000
           IF EIBAID = DFHPF1                                           47880000
              EVALUATE TRUE                                             47890000
                WHEN VIEW-ACCT-CMNT                                     47900000
                     MOVE 'A'   TO TWA-SCREEN-IND, ACAT90CM-TS-SCREEN   47910000
                     MOVE SPACE TO ACAT90CM-TS-UPDATE-IND               47920000
                WHEN VIEW-SECR-CMNT                                     47930000
                     MOVE 'S' TO TWA-SCREEN-IND, ACAT90CM-TS-SCREEN     47940000
                     MOVE SPACE TO ACAT90CM-TS-UPDATE-IND               47950000
                WHEN VIEW-BAL1-CMNT                                     47960000
                     MOVE '1' TO TWA-SCREEN-IND, ACAT90CM-TS-SCREEN     47970000
                     MOVE SPACE TO ACAT90CM-TS-UPDATE-IND               47980000
                WHEN VIEW-BAL2-CMNT                                     47990000
                     MOVE '2' TO TWA-SCREEN-IND, ACAT90CM-TS-SCREEN     48000000
                     MOVE SPACE TO ACAT90CM-TS-UPDATE-IND               48010000
                WHEN VIEW-BAL5-CMNT                                     48020000
                     MOVE '5' TO TWA-SCREEN-IND, ACAT90CM-TS-SCREEN     48030000
                     MOVE SPACE TO ACAT90CM-TS-UPDATE-IND               48040000
                WHEN VIEW-SMA-CMNT                                      48050000
                     MOVE 'M' TO TWA-SCREEN-IND, ACAT90CM-TS-SCREEN     48060000
                     MOVE SPACE TO ACAT90CM-TS-UPDATE-IND               48070000
                WHEN VIEW-REJC-CMNT                                     48080000
                     MOVE 'A'   TO TWA-SCREEN-IND, ACAT90CM-TS-SCREEN   48090000
                     MOVE SPACE TO ACAT90CM-TS-UPDATE-IND               48100000
                WHEN UPDT-ACCT-CMNT                                     48110000
                     MOVE 'A'   TO TWA-SCREEN-IND, ACAT90CM-TS-SCREEN   48120000
                     MOVE 'Y'   TO ACAT90CM-TS-UPDATE-IND               48130000
                WHEN UPDT-SECR-CMNT                                     48140000
                     MOVE 'S'   TO TWA-SCREEN-IND, ACAT90CM-TS-SCREEN   48150000
                     MOVE 'Y'   TO ACAT90CM-TS-UPDATE-IND               48160000
                WHEN UPDT-BAL1-CMNT                                     48170000
                     MOVE '1'   TO TWA-SCREEN-IND, ACAT90CM-TS-SCREEN   48180000
                     MOVE 'Y'   TO ACAT90CM-TS-UPDATE-IND               48190000
                WHEN UPDT-BAL2-CMNT                                     48200000
                     MOVE '2'   TO TWA-SCREEN-IND, ACAT90CM-TS-SCREEN   48210000
                     MOVE 'Y'   TO ACAT90CM-TS-UPDATE-IND               48220000
                WHEN UPDT-BAL5-CMNT                                     48230000
                     MOVE '5'   TO TWA-SCREEN-IND, ACAT90CM-TS-SCREEN   48240000
                     MOVE 'Y'   TO ACAT90CM-TS-UPDATE-IND               48250000
              END-EVALUATE                                              48260000
           ELSE                                                         48270000
              IF EIBAID = DFHPF5                                        48280000
                 MOVE 'N'   TO TWA-SCREEN-IND, ACAT90CM-TS-SCREEN       48290000
                 MOVE SPACE TO ACAT90CM-TS-UPDATE-IND                   48300000
              ELSE                                                      48310000
                 IF EIBAID = DFHPF6                                     48320000
                    MOVE 'X'   TO TWA-SCREEN-IND, ACAT90CM-TS-SCREEN    48330000
                    MOVE SPACE TO ACAT90CM-TS-UPDATE-IND                48340000
                 ELSE                                                   48350000
                    IF EIBAID = DFHENTER                                48360000
                       IF TWA-XFR-REJC-YES                              48370000
                          MOVE 'A' TO TWA-SCREEN-IND, ACAT90CM-TS-SCREEN48380000
                          MOVE 'Y' TO ACAT90CM-TS-UPDATE-IND            48390000
                       ELSE                                             48400000
                          IF TWA-REJ-CD-REQ   OR                        48410000
                             TWA-REJC-CD-REQ                            48420000
                              MOVE 'J' TO TWA-SCREEN-IND,               48430000
                                          ACAT90CM-TS-SCREEN            48440000
                              MOVE 'Y' TO ACAT90CM-TS-UPDATE-IND        48450000
                          ELSE                                          48460000
                              IF TWA-SECC-YES                           48470000
12/24                            MOVE 'S' TO TWA-SCREEN-IND,            48480000
                                             ACAT90CM-TS-SCREEN         48490000
                                 MOVE 'Y' TO ACAT90CM-TS-UPDATE-IND     48500000
                              END-IF                                    48510000
                          END-IF                                        48520000
                       END-IF                                           48530000
                    END-IF                                              48540000
                 END-IF                                                 48550000
              END-IF                                                    48560000
           END-IF.                                                      48570000
                                                                        48580000
           MOVE EIBTRMID      TO TERM-ID.                               48590000
           MOVE 'ACA0'        TO TRAN-ID.                               48600000
           PERFORM 0600-DELETE-TSQ.                                     48610000
           PERFORM 0620-WRITE-TSQ.                                      48620000
                                                                        48630000
      **** MOVE FIELDS TO ACAT90CM-TS-AREA ========>                    48640000
                                                                        48650000
           MOVE TWA-BRANCH-CD              TO ACAT90CM-TS-MBR.          48660000
           MOVE TWA-ACCT-CD                TO ACAT90CM-TS-MAC.          48670000
           MOVE TWA-RR-CD                  TO ACAT90CM-TS-MRR.          48680000
           MOVE TWA-RCV-ACCT-TYPE-CD       TO ACAT90CM-TS-MCTYPE.       48690000
ET0006     MOVE TWA-RCV-NBR                TO ACAT90CM-TS-MCBRKR.       48700000
           MOVE SPACE                      TO ACAT90CM-TS-MCBNAM.       48710000
           MOVE TWA-ACCT-DLVR-NBR          TO ACAT90CM-TS-MCACCT.       48720000
           MOVE TWA-RCV-CUST-NM            TO WS-CUSTNM.                48730000
           MOVE WS-CUSTNM-LN1              TO ACAT90CM-TS-MNAME.        48740000
           MOVE WS-CUSTNM-LN2              TO ACAT90CM-TS-MNAME2.       48750000
           MOVE SPACE                      TO ACAT90CM-TS-MNAME3.       48760000
           MOVE TWA-RCV-SS-PRIM-NBR        TO ACAT90CM-TS-MSSN.         48770000
           MOVE TWA-RCV-SS-SCNDY-NBR       TO ACAT90CM-TS-MSSN2.        48780000
                                                                        48790000
           IF ACAT90CM-TS-SCREEN = 'X'                                  48800000
              MOVE TWA-ACCT-ACTIVITY-IND  TO ACAT90CM-ACCT-ACTIVITY-IND 48810000
              MOVE TWA-ACCT-ORDERS-IND    TO ACAT90CM-ACCT-ORDERS-IND   48820000
              MOVE TWA-ACCT-RJCT-RSBM-IND TO ACAT90CM-ACCT-RJCT-RSBM-IND48830000
              MOVE TWA-ACCT-DB-BAL-T1-IND TO ACAT90CM-ACCT-DB-BAL-T1-IND48840000
              MOVE TWA-ACCT-MRGN-DB-IND   TO ACAT90CM-ACCT-MRGN-DB-IND  48850000
              MOVE TWA-ACCT-SHRT-PSTN-IND TO ACAT90CM-ACCT-SHRT-PSTN-IND48860000
              MOVE TWA-ACCT-SEC-RSTRD-IND TO ACAT90CM-ACCT-SEC-RSTRD-IND48870000
              MOVE TWA-ACCT-AST-EXCS-IND  TO ACAT90CM-ACCT-AST-EXCS-IND 48880000
              MOVE TWA-ACCT-OPTN-PSTN-IND TO ACAT90CM-ACCT-OPTN-PSTN-IND48890000
              MOVE TWA-ACCT-LTD-PRTNR-IND TO ACAT90CM-ACCT-LTD-PRTNR-IND48900000
              MOVE TWA-ACCT-TIN-MSMTH-IND TO ACAT90CM-ACCT-TIN-MSMTH-IND48910000
              MOVE TWA-ACCT-DPLCT-TRN-IND TO ACAT90CM-ACCT-DPLCT-TRN-IND48920000
              MOVE TWA-ACCT-CUST-70-IND   TO ACAT90CM-ACCT-CUST-70-IND  48930000
              MOVE TWA-ACCT-QULFD-PLN-IND TO ACAT90CM-ACCT-QULFD-PLN-IND48940000
              MOVE TWA-ACCT-MNGD-IND      TO ACAT90CM-ACCT-MNGD-IND     48950000
              MOVE TWA-ACCT-PRVT-RNG-IND  TO ACAT90CM-ACCT-PRVT-RNG-IND 48960000
              MOVE TWA-ACCT-BRKR-TIF-IND  TO ACAT90CM-ACCT-BRKR-TIF-IND 48970000
              MOVE TWA-NSCC-NON-ADP-IND   TO ACAT90CM-NSCC-NON-ADP-IND  48980000
              MOVE TWA-COMMENTS-IND       TO ACAT90CM-COMMENTS-IND      48990000
01/27         IF TWA-TRNFR-TYPE-RJCT-CD = '02'                          49000000
01/27            MOVE 'Y'                 TO ACAT90CM-CUST-TYPE-MISMATCH49010000
01/27         END-IF                                                    49020000
04/21         IF TWA-TRNFR-RJC1-CD = 'SP'                               49030000
04/21            MOVE 'Y'                TO ACAT90CM-SPECIAL-ACCOUNT-IND49040000
01/21         END-IF                                                    49050000
04/21         IF TWA-TRNFR-RJC2-CD = 'F' OR 'L'                         49060000
04/21            MOVE 'Y'                 TO ACAT90CM-ACCOUNT-FLAT-IND  49070000
LRM012        ELSE                                                      49060000
LRM012        IF TWA-TRNFR-RJC2-CD = 'N'                                49060000
LRM012           MOVE 'N'                 TO ACAT90CM-ACCOUNT-FLAT-IND  49070000
LRM011        ELSE                                                      49060000
LRM011        IF TWA-TRNFR-RJC2-CD = 'D'                                49060000
LRM011           MOVE '2'                 TO ACAT90CM-ACCOUNT-FLAT-IND  49060000
01/21         END-IF                                                    49080000
LRM002        MOVE TWA-TRNFR-ACCT-RB-SEC-IND     TO                             
LRM002                                  ACAT90CM-RB-RESTRICTED-SEC-IND          
LRM002        MOVE TWA-TRNFR-ACCT-CLT-RSCND-IND  TO                             
LRM002                                  ACAT90CM-RB-CLIENT-RESCIND-IND          
LRM002        MOVE TWA-TRNFR-ACCT-LGL-BLK-IND    TO                             
LRM002                                  ACAT90CM-RB-LEGAL-BLOCK-IND             
ET0003        MOVE TWA-ACCT-FREEZ-TYPE  TO ACAT90CM-ACCOUNT-FREEZE-IND  06670000
ET0003        MOVE TWA-ACCT-FRZN-IND    TO ACAT90CM-BATCH-FREEZE-FND-IND58450000
LRM008        MOVE TWA-ADOPT-AGRMT-IND  TO ACAT90CM-ADOPTION-AGREEMENT          
LRM024        MOVE TWA-NETWORK-LVL4-IND TO ACAT90CM-NTW-LVL4-FUND-IND           
           ELSE                                                         49090000
              IF ACAT90CM-TS-SCREEN = 'S'                               49100000
                 EVALUATE TRUE                                          49110000
                   WHEN VIEW-SECR-CMNT                                  49120000
                        MOVE TWA-ASSET-CMNT   TO ACAT90CM-TS-MCCMNT-X12049130000
                   WHEN VIEW-BAL1-CMNT                                  49140000
                        MOVE TWA-BAL01-CMNT   TO ACAT90CM-TS-MCCMNT-X12049150000
                   WHEN VIEW-BAL2-CMNT                                  49160000
                        MOVE TWA-BAL02-CMNT   TO ACAT90CM-TS-MCCMNT-X12049170000
                   WHEN VIEW-BAL5-CMNT                                  49180000
                        MOVE TWA-BAL05-CMNT   TO ACAT90CM-TS-MCCMNT-X12049190000
                   WHEN VIEW-SMA-CMNT                                   49200000
                        MOVE TWA-SMA-CMNT     TO ACAT90CM-TS-MCCMNT-X12049210000
                 END-EVALUATE                                           49220000
              ELSE                                                      49230000
                 IF ACAT90CM-TS-SCREEN = 'A'                            49240000
                    IF TWA-VINITRNF-CMNT > SPACES                       49250000
                       MOVE TWA-VINITRNF-CMNT TO ACAT90CM-TS-MCCMNT-X12049260000
                    ELSE                                                49270000
                       MOVE TWA-VTRNFR-CMNT   TO ACAT90CM-TS-MCCMNT-X12049280000
                    END-IF                                              49290000
                 END-IF                                                 49300000
              END-IF                                                    49310000
           END-IF.                                                      49320000
      /                                                                 49330000
TCK002 0580-READ-ACAT5FSC-TS-RTN.                                       49340000
TCK002     MOVE EIBTRMID   TO TERM-ID.                                  49350000
TCK002     MOVE 'AMF5'     TO TRAN-ID.                                  49360000
TCK002     INITIALIZE ACATFIO-COMMAREA.                                 49370000
TCK002     EXEC CICS READQ TS QUEUE(TSQ-NAME)                           49371000
TCK002                        INTO(ACATFIO-COMMAREA)                    49371100
TCK002                        LENGTH(LENGTH OF ACATFIO-COMMAREA)        49371200
TCK002                        ITEM(ITEM-NUM)                            49371300
TCK002     END-EXEC.                                                    49371400
                                                                        49371500
TCK002     IF EIBRESP = +0                                              49372000
TCK002        MOVE ACATFIO-CLIENT-NBR        TO TWA-CLIENT-NBR          49372100
TCK002        MOVE ACATFIO-DLVR-NBR          TO TWA-DLVR-NBR            49372200
TCK002        MOVE ACATFIO-RCV-NBR           TO TWA-RCV-NBR             49372300
TCK002        MOVE ACATFIO-ACCT-DLVR-NBR     TO TWA-ACCT-DLVR-NBR       49372400
TCK002        MOVE ACATFIO-ACCT-RCV-NBR      TO TWA-ACCT-RCV-NBR        49372500
TCK002        MOVE ACATFIO-ISIN-SEC-ISSUE-CD TO TWA-SEC-NBR             49372700
TCK002        MOVE ACATFIO-STTLM-LCTN-CD     TO TWA-STTLM-LCTN-CD       49372800
TCK002        MOVE ACATFIO-TRANS-TYPE-CD     TO TWA-TRANS-TYPE-CD       49372900
TCK002        MOVE ACATFIO-CSH-MGN-SHRT-CD TO TWA-CSH-MGN-SHRT-CD       49373000
TCK002        MOVE ACATFIO-SECURITY-ADP-NBR  TO TWA-ADP-NBR             49373100
TCK002        MOVE ACATFIO-ASSET-DESC-TXT    TO TWA-ASSET-DESC          49373200
TCK002        MOVE ACATFIO-ACAT-CONTROL-NBR  TO TWA-ACAT-CONTROL-NBR    49373300
TCK002        MOVE ACATFIO-ASSET-SEQ-NBR     TO TWA-SV-ASSET-SEQ-NBR    49373400
TCK002        END-IF.                                                   49373900
      /                                                                 49375000
       0600-DELETE-TSQ.                                                 49376000
                                                                        49377000
           EXEC CICS DELETEQ TS QUEUE(TSQ-NAME)                         49378000
           END-EXEC.                                                    49379000
                                                                        49380000
       0610-READ-TSQ.                                                   49390000
                                                                        49400000
           EXEC CICS READQ TS QUEUE(TSQ-NAME)                           49410000
                              INTO (WS-TWA-AREA)                        49420000
                              LENGTH(LENGTH OF WS-TWA-AREA)             49430000
                              ITEM(ITEM-NUM)                            49440000
           END-EXEC.                                                    49450000
           IF (EIBRESP NOT = +0)                                        49460000
           AND (NOT FIRST-TIME)                                         49470000
               MOVE LOW-VALUE TO ACAT10AO, ACAT10BO                     49480000
               MOVE 'ACAT10NT READ TSQ ERROR'                           49490000
               TO SYSTEM-MSG                                            49500000
               SET ERROR-YES TO TRUE                                    49510000
12/12         SET DATA-ONLY TO TRUE                                     49520000
12/12         PERFORM 0800-SEND-MAP-RETURN                              49530000
           END-IF.                                                      49540000
                                                                        49550000
                                                                        49560000
       0620-WRITE-TSQ.                                                  49570000
                                                                        49580000
           EXEC CICS WRITEQ TS QUEUE(TSQ-NAME)                          49590000
                              FROM(WS-TWA-AREA)                         49600000
                              LENGTH(LENGTH OF WS-TWA-AREA)             49610000
                              ITEM(ITEM-NUM)                            49620000
           END-EXEC.                                                    49630000
           IF (EIBRESP NOT = +0)                                        49640000
           AND (NOT FIRST-TIME)                                         49650000
              MOVE 'ACAT10NT WRITE TSQ ERROR.' TO SYSTEM-MSG            49660000
           END-IF.                                                      49670000
                                                                        49680000
       0630-BUILD-ACATFIO-TS-RTN.                                       49690000
                                                                        49700000
           MOVE EIBTRMID      TO TERM-ID.                               49710000
           MOVE 'ACA0'        TO TRAN-ID.                               49720000
           PERFORM 0610-READ-TSQ.                                       49730000
                                                                        49740000
           MOVE TWA-CLIENT-NBR       TO  ACATFIO-CLIENT-NBR.            49750000
           MOVE TWA-DLVR-NBR         TO  ACATFIO-DLVR-NBR.              49760000
           MOVE TWA-RCV-NBR          TO  ACATFIO-RCV-NBR.               49770000
           MOVE TWA-ACCT-DLVR-NBR    TO  ACATFIO-ACCT-DLVR-NBR.         49780000
           MOVE TWA-ACCT-RCV-NBR     TO  ACATFIO-ACCT-RCV-NBR.          49790000
           MOVE 'US'                 TO  ACATFIO-ISIN-CNTRY-CD.         49800000
           MOVE TWA-SEC-NBR          TO  ACATFIO-ISIN-SEC-ISSUE-CD.     49810000
           MOVE SPACE                TO  ACATFIO-ISIN-SEC-CDG-CD.       49820000
           MOVE TWA-STTLM-LCTN-CD    TO  ACATFIO-STTLM-LCTN-CD.         49830000
           MOVE TWA-TRANS-TYPE-CD    TO  ACATFIO-TRANS-TYPE-CD.         49840000
           MOVE TWA-CSH-MGN-SHRT-CD  TO  ACATFIO-CSH-MGN-SHRT-CD.       49850000
           MOVE TWA-ADP-NBR          TO  ACATFIO-SECURITY-ADP-NBR.      49860000
           MOVE TWA-ASSET-DESC       TO  WS-ASSET-DESC-GRP.             49870000
           MOVE WS-ASSET-DESC1       TO  ACATFIO-ASSET-DESC-TXT.        49880000
TCK002     MOVE TWA-ACAT-CONTROL-NBR TO  ACATFIO-ACAT-CONTROL-NBR.      49890000
TCK002     MOVE TWA-SV-ASSET-SEQ-NBR TO  ACATFIO-ASSET-SEQ-NBR.         49900000
TCK002     IF TWA-STCD < '200'                                          49910000
TCK002        SET ACATFIO-UPDATE-ALLOWED TO TRUE                        49920000
TCK002     ELSE                                                         49930000
TCK002        SET ACATFIO-BROWSE-ONLY    TO TRUE                        49940000
TCK002     END-IF.                                                      49950000
                                                                        49960000
           MOVE EIBTRMID      TO TERM-ID.                               49970000
           MOVE 'AMF5'        TO TRAN-ID.                               49980000
           EXEC CICS DELETEQ TS QUEUE(TSQ-NAME)                         49990000
           END-EXEC.                                                    50000000
                                                                        50010000
           EXEC CICS WRITEQ TS QUEUE(TSQ-NAME)                          50020000
                     FROM(ACATFIO-COMMAREA)                             50030000
                     LENGTH(LENGTH OF ACATFIO-COMMAREA)                 50040000
                     ITEM(ITEM-NUM)                                     50050000
           END-EXEC.                                                    50060000
           IF EIBRESP NOT = +0                                          50070000
              MOVE LOW-VALUE TO ACAT10AO, ACAT10BO                      50080000
              MOVE 'ACAT10NT WRITE TSQ ERROR ON AMF5'                   50090000
                TO TWA-RETURN-MSG                                       50100000
           END-IF.                                                      50110000
                                                                        50120000
           MOVE '#' TO WS-ACAT-NEXT.                                    50130000
           MOVE 'ACAT5FSC' TO CALLED-PROGRAM-NAME.                      50140000
           PERFORM 0710-INVOKE-DETAIL-PROGRAM-RTN.                      50150000
                                                                        50160000
       EJECT                                                            50170000
       0700-PROCESS-JUMP-RTN.                                           50180000
           MOVE MNEXTI       TO WS-ACAT-NEXT.                           50190000
           MOVE WS-ACAT-NEXT TO ACAT-NEXT ACAT-INP-SEL.                 50200000
           MOVE TWA-MMBR     TO ACAT-INP-BRANCH.                        50210000
           MOVE TWA-MMAC     TO ACAT-INP-ACCOUNT.                       50220000
           MOVE TWA-MMRR     TO ACAT-INP-RR.                            50230000
           MOVE TWA-MCBRKR   TO ACAT-INP-CONTRA-BKR.                    50240000
           MOVE TWA-MTFR     TO ACAT-INP-TFR-TYP.                       50250000
           MOVE TWA-MSTAT    TO ACAT-INP-STATUS.                        50260000
           MOVE MMSDI        TO ACAT-INP-STTL-DT.                       50270000
           MOVE MMRDI        TO ACAT-INP-RCV-DEL.                       50280000
           PERFORM SCREEN-SECURITY-CHECK.                               50290000
                                                                        50300000
       COPY ACATJUMP.                                                   50310000
                                                                        50300000
           IF CALLED-PROGRAM-NAME = SPACES                              50320000
              SET CURSOR-ON-MNEXT    TO TRUE                            50330000
              MOVE ATT-UNPROT-BRT-MDT TO MNEXTA                         50340000
              MOVE 'NEXT TRANSACTION SELECTION IS INVALID' TO           50350000
                  SYSTEM-MSG                                            50360000
              SET ERROR-YES TO TRUE                                     50370000
12/12         SET DATA-ONLY TO TRUE                                     50380000
12/12         PERFORM 0800-SEND-MAP-RETURN                              50390000
12/31      END-IF.                                                      50400000
           SET CURSOR-ON-MNEXT    TO TRUE                               50410000
01/28      MOVE 'ACAT10NT' TO ACAT-CALLING-PROG-NAME.                   50430000
           PERFORM 0710-INVOKE-DETAIL-PROGRAM-RTN.                      50440000
                                                                        50450000
       EJECT                                                            50460000
                                                                        50470000
       0710-INVOKE-DETAIL-PROGRAM-RTN.                                  50480000
           EXEC CICS XCTL PROGRAM(CALLED-PROGRAM-NAME)                  50490000
                          COMMAREA(ACATCOMM-COMMAREA)                   50500000
           END-EXEC.                                                    50510000
                                                                        50520000
                                                                        50530000
       0720-RETURN-FROM-DETAIL-RTN.                                     50540000
           MOVE EIBTRMID      TO TERM-ID.                               50550000
           MOVE 'ACAX'        TO TRAN-ID.                               50560000
           PERFORM 0600-DELETE-TSQ.                                     50570000
           SET FIRST-TIME TO TRUE.                                      50580000
           EJECT                                                        50590000
                                                                        50600000
       0730-OBTAIN-MARGIN-POSN-RTN.                                     50610000
HOLIO**--------------------------------------------------------------*  50620000
     **  UNTIL ALPHANUMERIC BRANCH ACCOUNT OF HOLIO IS AVAILABLE, WE    50630000
     **  HAVE TO USE NUMERIC BRANCH/ACCOUNTS (PACKED KEYS HERE).        50640000
HOLIO**--------------------------------------------------------------*  50650000
           MOVE TWA-CLIENT-NO         TO KEY-CLIENT.                    50660000
TCK001     MOVE TWA-BRANCH-CD         TO KEY-BRANCH.                    50690000
TCK001     MOVE TWA-ACCT-CD           TO KEY-ACCNT.                     50700000
LRM026     IF TWA-CRNCY-CD > '000'                                      06390000
LRM026        MOVE '000'        TO KEY-CURCOD(1:3)                      06390000
LRM026        MOVE TWA-CRNCY-CD TO KEY-CURCOD(4:3)                      06390000
LRM026     ELSE                                                                 
              MOVE ZEROS                 TO KEY-CURR-CODE.              50710000
           MOVE 'B'                   TO IOH-SHADOW-IND.                50720000
           MOVE 'N'                   TO IOH-FUNC-CODE.                 50730000
           MOVE '01'                  TO KEY-REC-TYPE.                  50740000
           MOVE '0'                   TO ZERO-ACCNT.                    50750000
           MOVE TWA-ADP-NBR           TO KEY-CUSIP-NUM.                 50760000
           MOVE WS-MTYPE              TO KEY-ACCNT-TYPE.                50770000
                                                                        50780000
           MOVE PSKEY                 TO IOH-HOL-KEY                    50790000
                                         SAVEKEY.                       50800000
           SET IOH-MEMO-REQUEST TO TRUE.                                50810000
TCK001     SET IOH-NEW-RECORD       TO TRUE.                            50830000
                                                                        50840000
       0731-GET-MRGN-POSN-RECORD.                                       50850000
           MOVE B1-CARD-OPTION      TO IOH-XREF-B1-CARD-OPTION.         50860000
           SET IOH-ENTERED-SECURITY  TO TRUE.                           50870000
LRM        MOVE ALL '0' TO WS-99-MEMO-SUBS-AREA.                        50880000
LRM        SET IOH-MEMO-REQUEST TO TRUE.                                50890000
                                                                        50900000
           EXEC CICS LINK PROGRAM ('CUSHOLIO')                          50910000
                          COMMAREA(IOH-COMMAREA)                        50920000
                          LENGTH  (LENGTH OF IOH-COMMAREA)              50930000
           END-EXEC.                                                    50940000
                                                                        50950000
                                                                        50960000
           MOVE IOH-RET-CODE       TO REAL-CODE.                        50970000
           IF IOH-OTHER-ERROR                                           50980000
              NEXT SENTENCE                                             50990000
           ELSE                                                         51000000
              ADD 1                TO REAL-CODE.                        51010000
                                                                        51020000
                                                                        51030000
           IF REAL-CODE GREATER THAN 6                                  51040000
                    GO TO IOERROR                                       51050000
           ELSE                                                         51060000
                    GO TO  0732-HOLGO-RTN,                              51070000
                           INVREQERR,                                   51080000
                           OPENERR,                                     51090000
                           0730-OBTAIN-MARGIN-POSN-EXIT,                51100000
                           0730-OBTAIN-MARGIN-POSN-EXIT,                51110000
                           0730-OBTAIN-MARGIN-POSN-EXIT,                51120000
                    DEPENDING ON REAL-CODE.                             51130000
                                                                        51140000
       0732-HOLGO-RTN.                                                  51150000
           SET ADDRESS OF CHLD-SUMMARY-SEGMENT  TO IOH-RECORD-POINTER.  51160000
            MOVE CHLD-KEY          TO TEMPKEY.                          51170000
            MOVE IOH-HOL-KEY       TO PSKEY.                            51180000
                                                                        51190000
            MOVE IOH-XREF-B1-CARD-OPTION TO B1-CARD-OPTION.             51200000
                                                                        51210000
            IF (CHLD-KEY = HIGH-VALUE)                                  51220000
               OR                                                       51230000
                  (SAV-KEY NOT = TEMP-KEY)                              51240000
LRM026         OR (TWA-CRNCY-CD > '000'                                 51250000
LRM026              AND TWA-CRNCY-CD NOT = KEY-CURCOD(4:3))             06390000
LRM026         OR (TWA-CRNCY-CD NOT > '000'                             06390000
LRM026              AND KEY-CURCOD NOT = '000000')                      51260000
                   GO TO 0730-OBTAIN-MARGIN-POSN-EXIT.                  51270000
                                                                        51280000
            IF CHLD-SECURITY-NUMBER = HIGH-VALUE                        51290000
               GO TO 0736-SET-NEXT-HOLIO-ACCT-TYPE.                     51300000
      *-----------------------------------------------------------*     51310000
      *   THIS RTN. IS CHECK ENTERED CURRENCY CODE AND SECURITY   *     51320000
      *-----------------------------------------------------------*     51330000
       0733-CHECK-OPEN-ORDER.                                           51340000
            IF KEY-REC-TYPE = '21'                                      51350000
             SET ADDRESS OF CHOO-SUMMARY-SEGMENT TO IOH-RECORD-POINTER  51360000
             SET ADDRESS OF CHLD-SUMMARY-SEGMENT TO IOH-RECORD-POINTER. 51370000
                                                                        51380000
       0734-CHECK-KEY.                                                  51390000
            IF MAIN-SAVKEY = MAIN-TEMPKEY                               51400000
               GO TO 0735-CHECK-SEC.                                    51410000
                                                                        51420000
            GO TO 0730-OBTAIN-MARGIN-POSN-EXIT.                         51430000
                                                                        51440000
       0735-CHECK-SEC.                                                  51450000
            MOVE CHLD-ACCOUNT-TYPE     TO UNPK-TYPE.                    51460000
                                                                        51470000
            IF TWA-ADP-NBR NOT = CHLD-SECURITY-NUMBER                   51480000
               GO TO 0736-SET-NEXT-HOLIO-ACCT-TYPE.                     51490000
                                                                        51500000
            IF WK-PS-TYPE = HIGH-VALUE                                  51510000
               GO TO 0730-OBTAIN-MARGIN-POSN-EXIT.                      51520000
                                                                        51530000
            IF WK-PS-TYPE = '1'                                         51540000
              MOVE CHLD-YESTERDAY-TOTAL-UNITS TO WS-MRGN-POSN-QTY-TYPE1 51550000
            ELSE                                                        51560000
            IF WK-PS-TYPE = '2'                                         51570000
              MOVE CHLD-YESTERDAY-TOTAL-UNITS TO WS-MRGN-POSN-QTY-TYPE2 51580000
            ELSE                                                        51590000
            IF WK-PS-TYPE = '5'                                         51600000
              MOVE CHLD-YESTERDAY-TOTAL-UNITS TO WS-MRGN-POSN-QTY-TYPE5 51610000
            END-IF END-IF END-IF.                                       51620000
                                                                        51630000
       0736-SET-NEXT-HOLIO-ACCT-TYPE.                                   51640000
            IF WK-PS-TYPE = '1'                                         51650000
               MOVE '02' TO IOH-HOL-ACCT-TYPE                           51660000
               GO TO 0731-GET-MRGN-POSN-RECORD.                         51670000
                                                                        51680000
            IF WK-PS-TYPE < '5'                                         51690000
               MOVE '05' TO IOH-HOL-ACCT-TYPE                           51700000
               GO TO 0731-GET-MRGN-POSN-RECORD.                         51710000
                                                                        51720000
       0730-OBTAIN-MARGIN-POSN-EXIT.                                    51730000
            EXIT.                                                       51740000
                                                                        51750000
       INVREQERR.                                                       51760000
            MOVE EIBDS      TO ERR-EIBDS.                               51770000
            MOVE 'POSN FILE INVALID REQUEST ERROR'                      51780000
                            TO ERR-MSG2                                 51790000
             GO TO DISPERR.                                             51800000
                                                                        51810000
       IOERROR.                                                         51820000
             MOVE EIBDS                   TO ERR-EIBDS.                 51830000
             MOVE 'POSN FILE I/O ERROR'   TO ERR-MSG2.                  51840000
             GO TO DISPERR.                                             51850000
                                                                        51860000
       OPENERR.                                                         51870000
             MOVE EIBDS                   TO ERR-EIBDS.                 51880000
             MOVE 'POSN FILE IS CLOSED'   TO ERR-MSG2.                  51890000
             GO TO DISPERR.                                             51900000
                                                                        51910000
       DISPERR.                                                         51920000
             MOVE ERR-MSG TO SYSTEM-MSG.                                51930000
             SET ERROR-YES TO TRUE.                                     51940000
12/12         SET DATA-ONLY TO TRUE.                                    51960000
12/12         PERFORM 0800-SEND-MAP-RETURN.                             51970000
                                                                        51980000
       EJECT                                                            51990000
      ******************************************************************52000000
       0740-OBTAIN-MARGIN-BAL-RTN.                                      52010000
                                                                        52020000
           MOVE LOW-VALUES                      TO IOB-COMMAREA.        52030000
TCK001     MOVE 'R'                             TO IOB-FUNC-CODE.       52040000
TCK001     MOVE 'N'                             TO IOB-FUNC-CODE-NEW.   52050000
           MOVE TWA-CLIENT-NO                   TO WS-BALNC-CLIENT.     52060000
TCK001     MOVE TWA-BRANCH-CD                   TO WS-BALNC-BRANCH.     52090000
TCK001     MOVE TWA-ACCT-CD                     TO WS-BALNC-ACCOUNT.    52100000
LRM026     IF WS-FCUR-BAL-REQEST                                                
LRM026        MOVE '000'                        TO WS-BALNC-CURR-X(1:3) 52110000
LRM026        MOVE TWA-CRNCY-CD                 TO WS-BALNC-CURR-X(4:3) 52110000
LRM026     ELSE                                                                 
              MOVE ZERO                         TO WS-BALNC-CURR.       52110000
           MOVE WS-BALNC-KEY                    TO IOB-BAL-KEY.         52120000
           MOVE 'B'                             TO IOB-SHADOW-IND.      52130000
                                                                        52140000
           EXEC CICS LINK PROGRAM('CUSBALIO')                           52150000
                          COMMAREA(IOB-COMMAREA)                        52160000
                          LENGTH(LENGTH OF IOB-COMMAREA)                52170000
                          END-EXEC.                                     52180000
                                                                        52190000
           IF IOB-INV-FUNC                                              52200000
                         GO TO BALIO-INVREQ.                            52210000
           IF IOB-FILE-CLOSED                                           52220000
                         GO TO BALIO-NOTOPEN.                           52230000
           IF IOB-NOT-FOUND                                             52240000
                         GO TO 0740-OBTAIN-MARGIN-BAL-EXIT.             52250000
           IF IOB-GOOD-RETURN                                           52260000
                         GO TO 0741-SET-ADDRESS.                        52270000
           IF NOT IOB-GOOD-RETURN                                       52280000
                         GO TO BALIO-ILLOGIC.                           52290000
                                                                        52300000
       0741-SET-ADDRESS.                                                52310000
           SET ADDRESS OF CMBL-CUSTOMER-BALANCE-SEGMENT                 52320000
                       TO IOB-RECORD-POINTER.                           52330000
                                                                        52340000
           IF WS-BALNC-KEY(1:14) NOT = CMBL-KEY(1:14)                   52350000
LRM028     OR (WS-FCUR-BAL-REQEST                                               
LRM028     AND TWA-CRNCY-CD > '000'                                     51250000
LRM026          AND TWA-CRNCY-CD NOT = CMBL-CURRENCY-CODE(4:3))         06390000
LRM028     OR (NOT WS-FCUR-BAL-REQEST                                           
LRM026          AND CMBL-CURRENCY-CODE NOT = '000000')                  51260000
              GO TO 0740-OBTAIN-MARGIN-BAL-EXIT.                        52370000
******** MOVE BALANCES...                                               52380000
           IF CMBL-ACTYP1-PRESENT = 1                                   52390000
              MOVE CMBL1-TRADE-DATE-BAL-YSTDY (1) TO WS-MRGN-BAL-TYPE1  52400000
01/23         IF CMBL-MM-FUND-YEST NUMERIC                              52410000
01/23            SUBTRACT CMBL-MM-FUND-YEST     FROM WS-MRGN-BAL-TYPE1  52420000
01/23         END-IF                                                    52430000
           END-IF.                                                      52440000
LRM029     PERFORM READ-BANK-DEPOSIT-RTN.                                       
           IF CMBL-ACTYP2-PRESENT = 1                                   52450000
              MOVE CMBL2-TRADE-DATE-BAL-YSTDY (1) TO WS-MRGN-BAL-TYPE2  52460000
           END-IF.                                                      52470000
           IF CMBL-ACTYP5-PRESENT = 1                                   52480000
              MOVE CMBL5-TRADE-DATE-BAL-YSTDY (1) TO WS-MRGN-BAL-TYPE5  52490000
           END-IF.                                                      52500000
                                                                        52510000
TCK        MOVE  CMBL-TOTAL-SMA   TO  WS-MRGN-BAL-SMA.                  52520000
                                                                        52530000
       0740-OBTAIN-MARGIN-BAL-EXIT.                                     52540000
            EXIT.                                                       52550000
                                                                        52560000
LRM029 READ-BANK-DEPOSIT-RTN.                                                   
LRM029     MOVE TWA-CLIENT-NO-X  TO ACATRSIO-CLIENT-NBR                         
TEMP********  OBTAIN LIST OF BDF ADP NUMBERS FROM VRSTSEC M### ROWS             
LRM029     SET ACATRSIO-LOOKUP-BANK-DEPOSIT TO TRUE.                            
LRM029     MOVE ZERO TO ACATRSIO-BDF-COUNT                                      
LRM029     PERFORM 1510-LINK-TO-ACATRSTIO.                                      
LRM029     IF ACATRSIO-FOUND                                                    
LRM029        MOVE LOW-VALUE    TO LBB-COMMAREA                                 
LRM029        MOVE TWA-CLIENT-NO-X(2:3) TO LBB-COMM-CLIENT-NO                   
LRM029        MOVE TWA-BRANCH-CD    TO LBB-COMM-BRANCH                          
LRM029        MOVE TWA-ACCT-CD      TO LBB-COMM-ACCOUNT                         
LRM029        MOVE ACATRSIO-BDF-AREA     TO WS-BDF-SECURITY-TABLE               
LRM029        PERFORM VARYING SUB FROM 1 BY 1                                   
LRM029                UNTIL SUB > WS-BDF-COUNT                                  
LRM029           MOVE WS-BDF-SEC-ENTRY(SUB) TO LBB-COMM-SECURITY                
LRM029           EXEC CICS LINK PROGRAM(WS-MRGRLBB)                             
LRM029               COMMAREA(LB-BANK-COMM-AREA)                                
LRM029               LENGTH(LENGTH OF LB-BANK-COMM-AREA)                        
LRM029           END-EXEC                                                       
LRM029           IF LBB-COMM-GOOD-RETURN                                        
LRM029              SUBTRACT LBB-COMM-YEST-TOT-UNITS                            
LRM029                                         FROM WS-MRGN-BAL-TYPE1           
LRM029           END-IF                                                         
LRM029        END-PERFORM                                                       
LRM029     END-IF.                                                              
       BALIO-INVREQ.                                                    52570000
            MOVE EIBDS                   TO ERR-EIBDS.                  52580000
            MOVE 'BALIO INVALID REQUEST ERROR'                          52590000
                  TO ERR-MSG2                                           52600000
             GO TO DISPERR.                                             52610000
                                                                        52620000
       BALIO-ILLOGIC.                                                   52630000
             MOVE EIBDS                   TO ERR-EIBDS.                 52640000
             MOVE 'BALIO I/O ERROR'       TO ERR-MSG2.                  52650000
             GO TO DISPERR.                                             52660000
                                                                        52670000
       BALIO-NOTOPEN.                                                   52680000
             MOVE EIBDS                   TO ERR-EIBDS.                 52690000
             MOVE 'BALIO IS CLOSED'       TO ERR-MSG2.                  52700000
             GO TO DISPERR.                                             52710000
                                                                        52720000
      ***************************************************************** 52730000
       0750-FORMAT-AMT-RTN.                                             52740000
           MOVE WK-AMT-OUT TO WK-AMT-COMMAS-3.                          52750000
                                                                        52760000
           EJECT                                                        52770000
                                                                        52780000
       0800-SEND-MAP-RETURN.                                            52790000
                                                                        52800000
           MOVE SYSTEM-MSG     TO  TRLMSGO.                             52810000
           IF  SYSTEM-MSG NOT = SPACES                                  52820000
               MOVE ATT-ASKIP-BRT  TO  TRLMSGA                          52830000
           END-IF.                                                      52840000
           IF  DATA-ONLY                                                52850000
               PERFORM 0850-SEND-MAP-DATA-ONLY                          52860000
           ELSE                                                         52870000
               PERFORM 0870-SEND-MAP-ERASE                              52880000
           END-IF.                                                      52890000
           MOVE 'ACAT10NT' TO ACAT-PROGRAM-NAME.                        52900000
           MOVE 'H'        TO ACAT-NEXT, ACAT-INP-SEL.                  52910000
           PERFORM 0900-RETURN-TO-CICS.                                 52920000
                                                                        52930000
           EJECT                                                        52940000
      ***************************************************************** 52950000
       0810-MAP-INPUT-AREA.                                             52960000
                                                                        52970000
           MOVE LOW-VALUES TO ACAT10AO, ACAT10BO.                       52980000
                                                                        52990000
           MOVE SPACE TO MNEXTO, MREJO, MREJCO, MSUBMO, MSECCO.         53000000
LRM001     MOVE LOW-VALUES TO TWA-MSUBM.                                        
                                                                        53010000
      ***  FORMAT HDR& TLR SCREEN =======================>              53020000
                                                                        53030000
10/21      MOVE TWA-BRANCH-CD           TO ACAT-BR.                     53040000
           MOVE TWA-ACCT-CD             TO ACAT-AC.                     53050000
                                                                        53060000
           IF TWA-MBR > SPACES                                          53070000
              MOVE TWA-MBR              TO MBRO                         53080000
           ELSE                                                         53090000
              MOVE  TWA-BRANCH-CD       TO MBRO                         53100000
           END-IF.                                                      53110000
                                                                        53120000
           IF TWA-MAC > SPACES                                          53130000
              MOVE TWA-MAC              TO MACO                         53140000
           ELSE                                                         53150000
              MOVE TWA-ACCT-CD          TO MACO                         53160000
           END-IF.                                                      53170000
                                                                        53180000
           IF TWA-MRR > SPACES                                          53190000
              MOVE TWA-MRR              TO MRRO                         53200000
           ELSE                                                         53210000
              MOVE  TWA-RR-CD           TO MRRO                         53220000
           END-IF.                                                      53230000
                                                                        53240000
           MOVE  TWA-ACAT-CONTROL-NBR   TO MCNBRO.                      53250000
           IF TWA-MCSTP > SPACES                                        53260000
              MOVE TWA-MCSTP            TO MCSTPO                       53270000
           ELSE                                                         53280000
              MOVE TWA-RCV-ACCT-TYPE-CD TO MCSTPO                       53290000
           END-IF.                                                      53300000
                                                                        53310000
           IF ACAT-INP-CONTRA-BKR > SPACE                               53320000
              MOVE ACAT-INP-CONTRA-BKR  TO MCBRBRO                      53330000
           ELSE                                                         53340000
              MOVE TWA-RCV-NBR          TO MCBRBRO.                     53350000
           MOVE  TWA-ACCT-RCV-NBR       TO MCACCTO.                     53360000
                                                                        53370000
 8/15      MOVE  TWA-MMBR               TO MMBRO.                       53380000
 -         MOVE  TWA-MMAC               TO MMACO.                       53390000
 -         MOVE  TWA-MMRR               TO MMRRO                        53400000
01/27 *** NEED R/D FIELD                                                53410000
 -         MOVE  TWA-MCBRKR             TO MMBKRO.                      53420000
 -         MOVE  TWA-MTFR               TO MMTFRO.                      53430000
8/15       MOVE  TWA-MSTAT              TO MMSTATO.                     53440000
      ***  FORMAT TFR SCREEN ============================>              53450000
           MOVE  TWA-RCV-CUST-NM        TO WS-CUSTNM.                   53460000
           IF TWA-MNAME1 > SPACES                                       53470000
              MOVE TWA-MNAME1           TO MNAMEO                       53480000
           ELSE                                                         53490000
              MOVE WS-CUSTNM-LN1        TO MNAMEO                       53500000
           END-IF.                                                      53510000
           IF TWA-MNAME2 > SPACES                                       53520000
              MOVE TWA-MNAME2           TO MNAME2O                      53530000
           ELSE                                                         53540000
              MOVE WS-CUSTNM-LN2        TO MNAME2O                      53550000
           END-IF.                                                      53560000
                                                                        53570000
TCK        IF TWA-STTLM-DT = '0001-01-01'                               53580000
              MOVE   SPACES             TO MSDO                         53590000
           ELSE                                                         53600000
              MOVE  TWA-STTLM-DT        TO MSDO                         53610000
           END-IF.                                                      53620000
                                                                        53630000
           IF TWA-MSSN1 > SPACE                                         53640000
              MOVE TWA-MSSN1 (1 : 3)   TO MSSN1AO                       53650000
              MOVE TWA-MSSN1 (5 : 2)   TO MSSN1BO                       53660000
              MOVE TWA-MSSN1 (8 : 4)   TO MSSN1CO                       53670000
              MOVE '-'                 TO MSSN1AXO, MSSN1BXO            53680000
           ELSE                                                         53690000
              IF TWA-RCV-SS-PRIM-NBR = SPACES OR LOW-VALUES OR ZEROS    53700000
                  MOVE SPACES          TO MSSN1AO, MSSN1BO, MSSN1CO     53710000
                                          MSSN1AXO, MSSN1BXO            53720000
              ELSE                                                      53730000
                  MOVE TWA-RCV-SS-PRIM-NBR (1 : 3) TO MSSN1AO           53740000
                  MOVE TWA-RCV-SS-PRIM-NBR (4 : 2) TO MSSN1BO           53750000
                  MOVE TWA-RCV-SS-PRIM-NBR (6 : 4) TO MSSN1CO           53760000
                  MOVE '-'             TO MSSN1AXO, MSSN1BXO            53770000
              END-IF                                                    53780000
           END-IF.                                                      53790000
                                                                        53800000
           IF TWA-MSSN2 > SPACE                                         53810000
              MOVE TWA-MSSN2(1 : 3)     TO MSSN2AO                      53820000
              MOVE TWA-MSSN2(5 : 2)     TO MSSN2BO                      53830000
              MOVE TWA-MSSN2(8 : 4)     TO MSSN2CO                      53840000
              MOVE '-'                  TO MSSN2AXO, MSSN2BXO           53850000
           ELSE                                                         53860000
              IF TWA-RCV-SS-SCNDY-NBR = SPACES OR LOW-VALUES OR ZEROS   53870000
                  MOVE SPACES          TO MSSN2AO, MSSN2BO, MSSN2CO     53880000
              ELSE                                                      53890000
                  MOVE TWA-RCV-SS-SCNDY-NBR (1 : 3) TO MSSN2AO          53900000
                  MOVE TWA-RCV-SS-SCNDY-NBR (4 : 2) TO MSSN2BO          53910000
                  MOVE TWA-RCV-SS-SCNDY-NBR (6 : 4) TO MSSN2CO          53920000
                  MOVE '-'             TO MSSN2AXO, MSSN2BXO            53930000
              END-IF                                                    53940000
           END-IF.                                                      53950000
                                                                        53960000
LRM022     IF TWA-NA-SS-PRIM-NBR > SPACES                               53740000
LRM022        MOVE TWA-NA-SS-PRIM-NBR (1 : 3) TO MSSNA1AO               53740000
LRM022        MOVE TWA-NA-SS-PRIM-NBR (4 : 2) TO MSSNA1BO               53750000
LRM022        MOVE TWA-NA-SS-PRIM-NBR (6 : 4) TO MSSNA1CO               53760000
LRM022        MOVE '-'             TO MSSNA1AXO, MSSNA1BXO              53770000
LRM022     ELSE                                                         53710000
LRM022        MOVE SPACES          TO MSSNA1AO, MSSNA1BO, MSSNA1CO      53710000
LRM022                                MSSNA1AXO, MSSNA1BXO              53720000
LRM022     END-IF.                                                      53780000
                                                                                
LRM022     IF TWA-NA-SS-SCNDY-NBR > SPACES                              53740000
LRM022        MOVE TWA-NA-SS-SCNDY-NBR (1 : 3) TO MSSNA2AO              53740000
LRM022        MOVE TWA-NA-SS-SCNDY-NBR (4 : 2) TO MSSNA2BO              53750000
LRM022        MOVE TWA-NA-SS-SCNDY-NBR (6 : 4) TO MSSNA2CO              53760000
LRM022        MOVE '-'             TO MSSNA2AXO, MSSNA2BXO              53770000
LRM022     ELSE                                                         53710000
LRM022        MOVE SPACES          TO MSSNA2AO, MSSNA2BO, MSSNA2CO      53710000
LRM022                                MSSNA2AXO, MSSNA2BXO              53720000
LRM022     END-IF.                                                      53780000
                                                                                
06/04      IF TWA-ALERT-IND = 'Y'                                       53970000
06/04         MOVE WS-ALERT-MSG    TO  MALERTO                          53980000
06/04         MOVE ATT-PROT-BRT    TO  MALERTA                          53990000
06/04      ELSE                                                         54000000
06/04         MOVE SPACES          TO  MALERTO                          54010000
06/04      END-IF.                                                      54020000
                                                                        54030000
LRM016     MOVE WS-SAVE-MDEL-IND TO TWA-MDEL.                                   
LRM016     IF TWA-MDEL = 'S'                                                    
LRM016        MOVE 'Y' TO MDELO                                                 
LRM016     ELSE                                                                 
LRM016     IF TWA-MDEL > SPACES                                                 
LRM016        MOVE TWA-MDEL TO MDELO                                            
LRM016     END-IF.                                                              
                                                                                
           IF TWA-CASH-ASSET                                            54040000
              MOVE '01'  TO  MTYPEO, WS-MTYPE                           54050000
           ELSE                                                         54060000
              IF TWA-MARGIN-ASSET                                       54070000
                 MOVE '02' TO MTYPEO, WS-MTYPE                          54080000
              ELSE                                                      54090000
                 IF TWA-SHORT-ASSET                                     54100000
                    MOVE '05' TO MTYPEO, WS-MTYPE                       54110000
                 END-IF                                                 54120000
              END-IF                                                    54130000
           END-IF.                                                      54140000
                                                                        54150000
01/08      EVALUATE TWA-STCD                                            54160000
               WHEN '100'                                               54170000
                    MOVE TWA-DAYS            TO MSG-100-N               54180000
                    MOVE MSG-100             TO MSTATO                  54190000
               WHEN '110'                                               54200000
                    MOVE TWA-DAYS            TO MSG-110-N               54210000
                    MOVE MSG-110             TO MSTATO                  54220000
               WHEN '120'                                               54230000
                    MOVE TWA-DAYS            TO MSG-120-N               54240000
                    MOVE MSG-120             TO MSTATO                  54250000
               WHEN '130'                                               54260000
                    MOVE TWA-DAYS            TO MSG-130-N               54270000
                    MOVE MSG-130             TO MSTATO                  54280000
               WHEN '140'                                               54290000
                    MOVE TWA-DAYS            TO MSG-140-N               54300000
                    MOVE MSG-140             TO MSTATO                  54310000
               WHEN '200'                                               54320000
                    MOVE TWA-DAYS            TO MSG-200-N               54330000
                    MOVE MSG-200             TO MSTATO                  54340000
               WHEN '210'                                               54350000
                    MOVE TWA-DAYS            TO MSG-210-N               54360000
                    MOVE MSG-210             TO MSTATO                  54370000
               WHEN '220'                                               54380000
                    MOVE TWA-DAYS            TO MSG-220-N               54390000
                    MOVE MSG-220             TO MSTATO                  54400000
               WHEN '230'                                               54410000
                    MOVE TWA-DAYS            TO MSG-230-N               54420000
                    MOVE MSG-230             TO MSTATO                  54430000
DJ0001         WHEN '240'                                               54410000
DJ0001              MOVE TWA-DAYS            TO MSG-240-N               54420000
DJ0001              MOVE MSG-240             TO MSTATO                  54430000
               WHEN '300'                                               54440000
                    MOVE TWA-DAYS            TO MSG-300-N               54450000
                    MOVE MSG-300             TO MSTATO                  54460000
               WHEN '310'                                               54470000
                    MOVE TWA-DAYS            TO MSG-310-N               54480000
                    MOVE MSG-310             TO MSTATO                  54490000
               WHEN '400'                                               54500000
                    MOVE TWA-DAYS            TO MSG-400-N               54510000
                    MOVE MSG-400             TO MSTATO                  54520000
               WHEN '500'                                               54530000
                    MOVE TWA-DAYS            TO MSG-500-N               54540000
                    MOVE MSG-500             TO MSTATO                  54550000
               WHEN '510'                                               54560000
                    MOVE TWA-DAYS            TO MSG-510-N               54570000
                    MOVE MSG-510             TO MSTATO                  54580000
               WHEN OTHER                                               54590000
                    MOVE TWA-STCD            TO MSTATO                  54600000
           END-EVALUATE.                                                54610000
                                                                        54620000
01/19 **************************************************************    54630000
           IF ERROR-YES                                                 54640000
              CONTINUE                                                  54650000
           ELSE                                                         54660000
12/17         IF TWA-MCD > LOW-VALUE                                    54670000
                 MOVE TWA-MCD      TO MCDO                              54680000
01/19            IF WS-CURSOR = SPACE                                   54690000
                    SET CURSOR-ON-MCD TO TRUE                           54700000
01/19            END-IF                                                 54710000
                 IF TWA-MCD = 'C'                                       54720000
                    MOVE 'THIS ASSET WILL BE MODIFIED ' TO              54730000
                                                        TWA-RETURN-MSG  54740000
                 ELSE                                                   54750000
                    IF TWA-MCD = 'W'                                    54760000
12/12                  IF TWA-STCD < '200'                              54770000
                          MOVE 'THIS ASSET WILL BE WITHHELD ' TO        54780000
                                                        TWA-RETURN-MSG  54790000
                       ELSE                                             54800000
                          MOVE 'THE MODIFIED ASSET WILL BE WITHHELD' TO 54810000
                                                        TWA-RETURN-MSG  54820000
                       END-IF                                           54830000
                    ELSE                                                54840000
                       IF TWA-MCD  = 'D'                                54850000
                          MOVE 'THIS ASSET WILL BE DELETED' TO          54860000
                                                        TWA-RETURN-MSG  54870000
                       END-IF                                           54880000
                    END-IF                                              54890000
                 END-IF                                                 54900000
12/08         ELSE                                                      54910000
                 IF TWA-TRANS-TYPE-CD = 'A' AND                         54920000
                    TWA-STCD          < '300'                           54930000
                     MOVE SPACE TO MCDO                                 54940000
                 ELSE                                                   54950000
                    MOVE TWA-TRANS-TYPE-CD  TO MCDO                     54960000
                    IF TWA-TRANS-TYPE-CD = 'D'                          54970000
12/17                  MOVE ATT-ASKIP TO                                54980000
12/17                        MBAL01A, MBAL02A, MBAL05A, MSECRA,         54990000
12/17                        MWIA, MTYPEA, MSTTLA, MSRSNA, MCDA,        55000000
12/17                        MQTYA, MDESCA, MAMTA, MDESC2A, MSMAA,      55010000
12/17                        MDESC3A, MSUBMA, MSECCA                    55020000
12/17                  MOVE SPACES TO MSUBMO, MSECCO                    55030000
                       MOVE                                             55040000
                          ' THIS POSITION HAS BEEN FLAGGED FOR DELETION'55050000
                          TO TWA-RETURN-MSG                             55060000
ET0001                 IF TWA-VINITAST-NSCC-PEND-CD = 'Y'               58680000
ET0001                     MOVE 'EXTRACTION IN PROGRESS'                55100000
ET0001                       TO  TWA-RETURN-MSG                         55110000
ET0001                     MOVE ATT-ASKIP  TO MCDA                      57310000
LRM016                 ELSE                                                     
LRM016                    IF TWA-STCD >= '200' AND < '300'                      
LRM016                    AND ACAT-FULL-DLVY-ASSET-DELETE = '1'                 
LRM016                       MOVE ATT-UNPROT TO MDELA                           
LRM016                    ELSE                                                  
LRM016                       MOVE ATT-PROT   TO MDELA                           
LRM016                       MOVE ATT-ASKIP-DRK  TO MDELTA                      
LRM016                    END-IF                                                
ET0001                 END-IF                                           58680000
                    ELSE                                                55070000
                       IF TWA-TRANS-TYPE-CD = 'C'                       55080000
                          IF TWA-NSCC-WTHLD-CD = ' '                    55090000
                             MOVE 'THIS ASSET HAS BEEN MODIFIED ' TO    55100000
                                                        TWA-RETURN-MSG  55110000
ET0001                       IF TWA-VINITAST-NSCC-PEND-CD = 'Y'         58680000
ET0001                          MOVE 'EXTRACTION IN PROGRESS'           55100000
ET0001                            TO  TWA-RETURN-MSG                    55110000
ET0001                          MOVE ATT-ASKIP  TO MCDA                 57310000
LRM016                       ELSE                                               
LRM016                          IF TWA-STCD >= '200' AND < '300'                
LRM016                          AND ACAT-FULL-DLVY-ASSET-DELETE = '1'           
LRM016                             MOVE ATT-UNPROT TO MDELA                     
LRM016                          ELSE                                            
LRM016                             MOVE ATT-PROT   TO MDELA                     
LRM016                             MOVE ATT-ASKIP-DRK  TO MDELTA                
LRM016                          END-IF                                          
ET0001                       END-IF                                     58680000
                          ELSE                                          55120000
LRM016                       IF TWA-STCD >= '200' AND < '300'                   
LRM016                       AND ACAT-FULL-DLVY-ASSET-DELETE = '1'              
LRM016                          MOVE ATT-UNPROT TO MDELA                        
LRM016                       ELSE                                               
LRM016                          MOVE ATT-PROT   TO MDELA                        
LRM016                          MOVE ATT-ASKIP-DRK  TO MDELTA                   
LRM016                       END-IF                                             
01/26                        IF TWA-NSCC-WTHLD-CD = 'W'   AND           55130000
01/26                           TWA-VINITAST-NSCC-PEND-CD = 'H'         55140000
12/17                           MOVE ATT-ASKIP TO                       55150000
12/17                                MBAL01A, MBAL02A, MBAL05A, MSECRA, 55160000
12/17                                MWIA, MTYPEA, MSTTLA, MSRSNA, MCDA,55170000
12/17                              MQTYA, MDESCA, MAMTA, MDESC2A, MSMAA,55180000
12/17                                MDESC3A, MSUBMA, MSECCA            55190000
12/17                           MOVE SPACES TO MSUBMO, MSECCO           55200000
                                MOVE 'THIS ASSET HAS BEEN WITHHELD ' TO 55210000
                                                         TWA-RETURN-MSG 55220000
                          END-IF                                        55230000
                       END-IF                                           55240000
                    END-IF                                              55250000
                 END-IF                                                 55260000
              END-IF.                                                   55270000
                                                                        55290000
      ***************************************************************** 55300000
      * IF THE STTLM-RSN-CD IS 'CRED' THAN THE CASH BAL ON THE SCREEN * 55310000
      * WILL SHOWN NEGATIVE.                                          * 55320000
      ***************************************************************** 55330000
       REFORMAT-BAL01.                                                  55340000
           MOVE ATT-UNPROT TO MBAL01A.                                  55350000
           IF TWA-BAL01-TRAN-TYPE       = 'D'                           55360000
              MOVE ZERO                TO TWA-BAL01-9                   55370000
           END-IF                                                       55380000
LRM014     IF (TWA-MBAL01 = SPACES OR LOW-VALUES)                       55390000
01/08         IF TWA-BAL01 IS NOT NUMERIC                               55400000
01/08            MOVE +0        TO TWA-BAL01-9                          55410000
01/08         ELSE                                                      55420000
                 IF TWA-BAL01-TRAN-TYPE       = 'D'                     55430000
                    MOVE ZERO                TO TWA-BAL01-9             55440000
                 ELSE                                                   55450000
12/21               MOVE TWA-BAL01 TO TWA-BAL01-9                       55460000
                 END-IF                                                 55470000
LRM014           IF TWA-BAL01-9 > +0                                    55480000
12/30               IF TWA-BAL01-STTLM-RSN-CD  = 'CRED'                 55490000
LRM014****************AND TWA-BAL01-9 > 0                               55500000
12/15                  COMPUTE TWA-BAL01-9 = TWA-BAL01-9 * -1           55510000
                    END-IF                                              55520000
                 END-IF                                                 55530000
              END-IF                                                    55540000
              MOVE TWA-BAL01-9   TO TWA-BAL01-N                         55550000
01/18         MOVE TWA-BAL01-N   TO MBAL01O                             55560000
                                    TWA-ORIG-BAL01                      55570000
           ELSE                                                         55580000
03/01         IF TWA-BAL01-9 IS NOT NUMERIC                             55590000
03/01            MOVE +0        TO TWA-BAL01-9                          55600000
03/01         END-IF                                                    55610000
01/18         IF WK-AMT-RET-CODE = SPACE                                55620000
LRM014           IF TWA-BAL01-9 > +0                                    55630000
12/30               IF TWA-MBAL01-STTLM-RSN-CD  = 'CRED'                55640000
12/15                  COMPUTE TWA-BAL01-9 = TWA-BAL01-9 * -1           55660000
                    END-IF                                              55670000
                 END-IF                                                 55680000
                 MOVE TWA-BAL01-9 TO TWA-BAL01-N                        55690000
                 MOVE TWA-BAL01-N TO MBAL01O                            55700000
                 IF TWA-BAL01-UPDATED                                   55710000
01/26               MOVE LOW-VALUES TO TWA-MBAL01                       55720000
                    SET TWA-BAL01-NO-CHANGE TO TRUE                     55730000
                 END-IF                                                 55740000
              ELSE                                                      55750000
01/18            MOVE TWA-MBAL01 TO MBAL01O                             55760000
01/19            IF WS-CURSOR = SPACE                                   55770000
                    SET CURSOR-ON-MBAL01 TO TRUE                        55780000
01/19            END-IF                                                 55790000
              END-IF                                                    55800000
           END-IF.                                                      55810000
                                                                        55820000
      ****************                                                  55830000
       REFORMAT-BAL02.                                                  55840000
           MOVE ATT-UNPROT TO MBAL02A.                                  55850000
           IF TWA-BAL02-TRAN-TYPE       = 'D'                           55860000
              MOVE ZERO                TO TWA-BAL02-9                   55870000
           END-IF                                                       55880000
LRM014     IF (TWA-MBAL02 =  SPACES OR LOW-VALUE)                       55890000
01/08         IF TWA-BAL02 IS NOT NUMERIC                               55900000
01/08            MOVE +0      TO TWA-BAL02-9                            55910000
01/08         ELSE                                                      55920000
                 IF TWA-BAL02-TRAN-TYPE       = 'D'                     55930000
                    MOVE ZERO                TO TWA-BAL02-9             55940000
                 ELSE                                                   55950000
12/21               MOVE TWA-BAL02 TO TWA-BAL02-9                       55960000
                 END-IF                                                 55970000
12/15            IF TWA-BAL02-CREDIT                                    55980000
12/21            AND TWA-BAL02-9 > +0                                   55990000
12/15               COMPUTE TWA-BAL02-9 = TWA-BAL02-9 * -1              56000000
                 END-IF                                                 56010000
              END-IF                                                    56020000
              MOVE TWA-BAL02-9   TO TWA-BAL02-N                         56030000
01/18         MOVE TWA-BAL02-N   TO MBAL02O                             56040000
                                    TWA-ORIG-BAL02                      56050000
           ELSE                                                         56060000
03/01         IF TWA-BAL02-9 IS NOT NUMERIC                             56070000
03/01            MOVE +0        TO TWA-BAL02-9                          56080000
03/01         END-IF                                                    56090000
01/18         IF WK-AMT-RET-CODE = SPACE                                56100000
12/15            IF TWA-MBAL02-CREDIT                                   56110000
LRM014           AND TWA-BAL02-9 > +0                                   56120000
12/15               COMPUTE TWA-BAL02-9 = TWA-BAL02-9 * -1              56130000
12/15            END-IF                                                 56140000
                 MOVE TWA-BAL02-9   TO TWA-BAL02-N                      56150000
                 MOVE TWA-BAL02-N   TO MBAL02O                          56160000
01/26            IF TWA-BAL02-UPDATED                                   56170000
01/26               MOVE LOW-VALUES TO TWA-MBAL02                       56180000
                    SET TWA-BAL02-NO-CHANGE TO TRUE                     56190000
                 END-IF                                                 56200000
              ELSE                                                      56210000
01/18            MOVE TWA-MBAL02    TO MBAL02O                          56220000
01/19            IF WS-CURSOR = SPACE                                   56230000
                    SET CURSOR-ON-MBAL02 TO TRUE                        56240000
01/19            END-IF                                                 56250000
              END-IF                                                    56260000
           END-IF.                                                      56270000
                                                                        56280000
      ****************                                                  56290000
       REFORMAT-BAL05.                                                  56300000
           MOVE ATT-UNPROT TO MBAL05A.                                  56310000
           IF TWA-BAL05-TRAN-TYPE       = 'D'                           56320000
              MOVE ZERO                TO TWA-BAL05-9                   56330000
           END-IF                                                       56340000
LRM014     IF (TWA-MBAL05 =  SPACES OR LOW-VALUE)                       56350000
01/08         IF TWA-BAL05 IS NOT NUMERIC                               56360000
01/08            MOVE +0         TO TWA-BAL05-9                         56370000
              ELSE                                                      56380000
                 IF TWA-BAL05-TRAN-TYPE       = 'D'                     56390000
                    MOVE ZERO                TO TWA-BAL05-9             56400000
                 ELSE                                                   56410000
12/21               MOVE TWA-BAL05 TO TWA-BAL05-9                       56420000
                 END-IF                                                 56430000
12/15            IF TWA-BAL05-CREDIT                                    56440000
12/21            AND TWA-BAL05-9 > +0                                   56450000
12/15               COMPUTE TWA-BAL05-9 = TWA-BAL05-9 * -1              56460000
                 END-IF                                                 56470000
01/08         END-IF                                                    56480000
              MOVE TWA-BAL05-9   TO TWA-BAL05-N                         56490000
01/18         MOVE TWA-BAL05-N   TO MBAL05O                             56500000
                                    TWA-ORIG-BAL05                      56510000
           ELSE                                                         56520000
03/01         IF TWA-BAL05-9 IS NOT NUMERIC                             56530000
03/01            MOVE +0        TO TWA-BAL05-9                          56540000
03/01         END-IF                                                    56550000
01/18         IF WK-AMT-RET-CODE = SPACE                                56560000
12/15            IF TWA-MBAL05-CREDIT                                   56570000
12/21            AND TWA-BAL05-9 > +0                                   56580000
12/15               COMPUTE TWA-BAL05-9 = TWA-BAL05-9 * -1              56590000
12/15            END-IF                                                 56600000
                 MOVE TWA-BAL05-9 TO TWA-BAL05-N                        56610000
                 MOVE TWA-BAL05-N TO MBAL05O                            56620000
01/26            IF TWA-BAL05-UPDATED                                   56630000
01/26               MOVE LOW-VALUES TO TWA-MBAL05                       56640000
                    SET TWA-BAL05-NO-CHANGE TO TRUE                     56650000
                 END-IF                                                 56660000
              ELSE                                                      56670000
01/18            MOVE TWA-MBAL05  TO MBAL05O                            56680000
01/19            IF WS-CURSOR = SPACE                                   56690000
                    SET CURSOR-ON-MBAL05 TO TRUE                        56700000
01/19            END-IF                                                 56710000
              END-IF                                                    56720000
           END-IF.                                                      56730000
                                                                        56740000
      ****************                                                  56750000
       REFORMAT-SMA.                                                    56760000
           MOVE ATT-UNPROT TO MSMAA.                                    56770000
           IF TWA-SMA-TRAN-TYPE         = 'D'                           56780000
              MOVE ZERO                TO TWA-SMA-9                     56790000
           END-IF                                                       56800000
           IF TWA-MSMA =    SPACES OR LOW-VALUE                         56810000
              IF TWA-SMA IS NOT NUMERIC                                 56820000
                 MOVE +0         TO TWA-SMA-9                           56830000
              ELSE                                                      56840000
                 IF TWA-SMA-TRAN-TYPE       = 'D'                       56850000
                    MOVE ZERO                TO TWA-SMA-9               56860000
                 ELSE                                                   56870000
12/21               MOVE TWA-SMA TO TWA-SMA-9                           56880000
                 END-IF                                                 56890000
              END-IF                                                    56900000
              MOVE TWA-SMA-9   TO TWA-SMA-N                             56910000
              MOVE TWA-SMA-N  TO MSMAO, TWA-ORIG-SMA                    56920000
           ELSE                                                         56930000
03/01         IF TWA-SMA-9 IS NOT NUMERIC                               56940000
03/01            MOVE +0        TO TWA-SMA-9                            56950000
03/01         END-IF                                                    56960000
01/18         IF WK-AMT-RET-CODE = SPACE                                56970000
                 MOVE TWA-SMA-9  TO TWA-SMA-N                           56980000
                 MOVE TWA-SMA-N  TO MSMAO                               56990000
01/26            IF TWA-SMA-UPDATED                                     57000000
01/26               MOVE LOW-VALUES TO TWA-MSMA                         57010000
                    SET TWA-SMA-NO-CHANGE TO TRUE                       57020000
                 END-IF                                                 57030000
              ELSE                                                      57040000
01/18            MOVE TWA-MSMA   TO MSMAO                               57050000
01/19            IF WS-CURSOR = SPACE                                   57060000
                    SET CURSOR-ON-MSMA TO TRUE                          57070000
01/19            END-IF                                                 57080000
              END-IF                                                    57090000
           END-IF.                                                      57100000
                                                                        57110000
      ***  FORMAT ASSET  SCREEN ============================>           57120000
LRM001     IF HAVE-COMBO-UPDATE                                                 
LRM001        MOVE WS-SAVE-MCD TO TWA-MCD.                                      
           IF TWA-MCD > SPACE                                           57130000
              MOVE  TWA-MCD             TO MCDO                         57140000
           END-IF.                                                      57150000
           IF  TWA-NSCC-WTHLD-CD         = 'W' AND                      57160000
               TWA-STCD                  < '200'                        57170000
               MOVE 'W'                 TO MCDO                         57180000
           END-IF                                                       57190000
           MOVE  TWA-SEC-NBR            TO MSECRO.                      57200000
           MOVE  TWA-RCV-ACCT-TYPE-CD   TO MCSTPO.                      57210000
           MOVE  TWA-WHEN-ISSUED        TO MWIO.                        57220000
           MOVE  TWA-STTLM-LCTN-CD      TO MSTTLO.                      57230000
           MOVE  TWA-STTLM-RSN-CD       TO MSRSNO.                      57240000
                                                                        57250000
      ** SET QTY POSITIVE OR NEGATIVE BASED ON ACAT10IO-PSTN-CD.        57260000
      **     IF "OPTION" USE ACAT10IO-OPT-BS-CD.                        57270000
                                                                        57280000
       REFORMAT-ASSET-QTY.                                              57290000
                                                                        57300000
01/18      MOVE ATT-UNPROT TO MQTYA.                                    57310000
ET0001     IF TWA-VINITAST-NSCC-PEND-CD = 'Y'                           58680000
ET0001        MOVE ATT-ASKIP  TO MQTYA                                  57310000
ET0001     END-IF.                                                      58680000
           IF TWA-MQTY  =  LOW-VALUES OR SPACES                         57320000
              IF TWA-ASSET-QTY IS NOT NUMERIC                           57330000
                 MOVE +0               TO TWA-QTY-9                     57340000
              ELSE                                                      57350000
                 MOVE TWA-ASSET-QTY    TO TWA-QTY-9                     57360000
01/21            IF TWA-OPTN-CTGY-CD > '00'                             57370000
                    IF TWA-OPT-BUY                                      57380000
                      AND TWA-QTY-9 > 0                                 57390000
                       COMPUTE TWA-QTY-9 = TWA-QTY-9 * -1               57400000
                    END-IF                                              57410000
                 ELSE                                                   57420000
                    IF TWA-SHORT-ASSET-QTY                              57430000
                      AND TWA-QTY-9 > 0                                 57440000
                       COMPUTE TWA-QTY-9 = TWA-QTY-9 * -1               57450000
                    END-IF                                              57460000
01/21            END-IF                                                 57470000
              END-IF                                                    57480000
01/04         MOVE TWA-QTY-9     TO WS-MQTY-ED-D4                       57490000
              MOVE WS-MQTY-AREA  TO MQTYO, TWA-ORIG-QTY                 57500000
           ELSE                                                         57510000
01/18         IF WK-QTY-RET-CODE = SPACE                                57520000
01/21            IF TWA-OPTN-CTGY-CD > '00'                             57530000
                    IF TWA-OPT-BUY                                      57540000
                      AND TWA-QTY-9 > 0                                 57550000
                       COMPUTE TWA-QTY-9 = TWA-QTY-9 * -1               57560000
                    END-IF                                              57570000
                 ELSE                                                   57580000
                    IF TWA-SHORT-ASSET-QTY                              57590000
                      AND TWA-QTY-9 > 0                                 57600000
                       COMPUTE TWA-QTY-9 = TWA-QTY-9 * -1               57610000
                    END-IF                                              57620000
                 END-IF                                                 57630000
01/04            MOVE TWA-QTY-9 TO WS-MQTY-ED-D4                        57640000
                 MOVE WS-MQTY-AREA TO MQTYO                             57650000
01/26            IF TWA-QTY-UPDATED                                     57660000
01/26               MOVE LOW-VALUES TO TWA-MQTY                         57670000
                    SET TWA-QTY-NO-CHANGE TO TRUE                       57680000
                 END-IF                                                 57690000
              ELSE                                                      57700000
01/18            MOVE TWA-MQTY    TO MQTYO                              57710000
                 MOVE TWA-MCD      TO MCDO                              57720000
01/19            IF WS-CURSOR = SPACE                                   57730000
                    SET CURSOR-ON-MQTY TO TRUE                          57740000
01/19            END-IF                                                 57750000
              END-IF                                                    57760000
01/18      END-IF.                                                      57770000
                                                                        57780000
AMT    REFORMAT-ASSET-AMT.                                              57790000
                                                                        57800000
01/18      MOVE ATT-UNPROT TO MAMTA.                                    57810000
ET0001     IF TWA-VINITAST-NSCC-PEND-CD = 'Y'                           58680000
ET0001        MOVE ATT-ASKIP  TO MAMTA                                  57310000
ET0001     END-IF.                                                      58680000
01/18      IF TWA-MAMT  =  LOW-VALUES OR SPACES                         57820000
              IF TWA-ASSET-AMT IS NOT NUMERIC                           57830000
                 MOVE +0               TO TWA-AMT-9                     57840000
              ELSE                                                      57850000
                 MOVE TWA-ASSET-AMT    TO TWA-AMT-9                     57860000
01/21            IF TWA-OPTN-CTGY-CD > '00'                             57870000
                    IF TWA-OPT-BUY                                      57880000
                      AND TWA-AMT-9 > 0                                 57890000
                       COMPUTE TWA-AMT-9 = TWA-AMT-9 * -1               57900000
                    END-IF                                              57910000
                 ELSE                                                   57920000
LRM026              IF TWA-STTLM-LCTN-CD = '50'                                 
LRM026              AND TWA-STTLM-RSN-CD = 'FCUR'                               
LRM026                 IF TWA-SHORT-ASSET-QTY                           57930000
LRM026                 AND TWA-AMT-9 > 0                                57940000
LRM026                    CONTINUE                                      57930000
LRM026                 ELSE                                             57930000
LRM026                    COMPUTE TWA-AMT-9 = TWA-AMT-9 * -1            57950000
LRM026                 END-IF                                           57960000
LRM026              ELSE                                                        
                       IF TWA-SHORT-ASSET-QTY                           57930000
                         AND TWA-AMT-9 > 0                              57940000
                          COMPUTE TWA-AMT-9 = TWA-AMT-9 * -1            57950000
                       END-IF                                           57960000
LRM026              END-IF                                              57960000
                 END-IF                                                 57970000
01/21            MOVE TWA-AMT-9  TO WK-AMT-COMMAS-3                     57980000
                 MOVE WK-FORMATTED-AMT TO MAMTO, TWA-ORIG-AMT           57990000
01/21         END-IF                                                    58000000
           ELSE                                                         58010000
01/18         IF WK-AMT-RET-CODE = SPACE                                58020000
01/21            IF TWA-OPTN-CTGY-CD > '00'                             58030000
01/21               IF TWA-OPT-BUY                                      58040000
                      AND TWA-AMT-9 > 0                                 58050000
01/21                  COMPUTE TWA-AMT-9 = TWA-AMT-9 * -1               58060000
01/21               END-IF                                              58070000
01/21            ELSE                                                   58080000
LRM026              IF TWA-STTLM-LCTN-CD = '50'                                 
LRM026              AND TWA-STTLM-RSN-CD = 'FCUR'                               
LRM026                 IF TWA-LONG-ASSET-QTY                            57930000
LRM026                 AND TWA-AMT-9 > 0                                57940000
LRM026                    COMPUTE TWA-AMT-9 = TWA-AMT-9 * -1            57950000
LRM026                 END-IF                                           57960000
LRM026              ELSE                                                        
                       IF TWA-SHORT-ASSET-QTY                           58090000
                       AND TWA-AMT-9 > 0                                58100000
01/04                     COMPUTE TWA-AMT-9 = TWA-AMT-9 * -1            58110000
                       END-IF                                           58120000
LRM026              END-IF                                              57960000
                 END-IF                                                 58130000
                 MOVE TWA-AMT-9  TO WK-AMT-COMMAS-3                     58140000
                 MOVE WK-FORMATTED-AMT TO MAMTO                         58150000
01/26            IF TWA-AMT-UPDATED                                     58160000
01/26               MOVE LOW-VALUES TO TWA-MAMT                         58170000
                    SET TWA-AMT-NO-CHANGE TO TRUE                       58180000
                 END-IF                                                 58190000
              ELSE                                                      58200000
                 MOVE TWA-MAMT      TO MAMTO                            58210000
                 MOVE TWA-MCD      TO MCDO                              58220000
                 IF WS-CURSOR = SPACE                                   58230000
                    SET CURSOR-ON-MAMT TO TRUE                          58240000
                 END-IF                                                 58250000
           END-IF.                                                      58260000
      **************                                                    58270000
                                                                        58280000
06/04      IF TWA-RESTRICTED-IND =  'Y'                                 58290000
06/04         MOVE WS-RESTRICTED-MSG   TO MRSMSGO                       58300000
06/04         MOVE ATT-PROT-BRT        TO  MRSMSGA                      58310000
06/04      ELSE                                                         58320000
06/04         MOVE SPACES  TO  MRSMSGO                                  58330000
06/04      END-IF.                                                      58340000
                                                                        58350000
LRM026     IF TWA-CRNCY-CD > SPACES                                     06390000
LRM026        MOVE 'CURRENCY: ' TO MCRNCYO                                      
LRM026        MOVE TWA-CRNCY-CD TO MCRNCYO(11:3)                                
LRM027     ELSE                                                                 
LRM027        MOVE SPACES       TO MCRNCYO                                      
LRM026     END-IF.                                                              
                                                                                
LRM020     IF TWA-ASSET-DESC = SPACES                                           
LRM020     AND TWA-STTLM-LCTN-CD  = '45'                                        
LRM020     AND TWA-STTLM-RSN-CD > SPACES                                        
LRM020        MOVE TWA-STTLM-RSN-CD     TO TWA-ASSET-DESC                       
LRM020        MOVE 'MEMO'               TO TWA-ASSET-DESC (6 : 4)               
LRM020     END-IF.                                                              
                                                                                
01/23      IF TWA-ASSET-DESC = SPACES                                   58360000
LRM020        IF TWA-OPTN-CMNT-TXT > SPACES                             58370000
                 MOVE TWA-OPTN-CMNT-TXT TO MDESCO                       58370000
LRM020        ELSE                                                              
LRM020           MOVE SPACES   TO MDESCO                                58370000
LRM020        END-IF                                                            
              MOVE SPACES            TO MDESC2O, MDESC3O                58380000
           ELSE                                                         58390000
              MOVE TWA-MDESC    TO MDESCO                               58400000
              MOVE TWA-MDESC2   TO MDESC2O                              58410000
01/23         MOVE TWA-MDESC3   TO MDESC3O                              58420000
01/23      END-IF.                                                      58430000
           MOVE TWA-MNEXT       TO MNEXTO.                              58440000
           IF TWA-MREJ = LOW-VALUE                                      58450000
              MOVE SPACES       TO MREJO                                58460000
           ELSE                                                         58470000
              MOVE TWA-MREJ     TO MREJO                                58480000
           END-IF.                                                      58490000
           IF TWA-MREJC = LOW-VALUE                                     58500000
              MOVE SPACES       TO MREJCO                               58510000
           ELSE                                                         58520000
              MOVE TWA-MREJC    TO MREJCO                               58530000
           END-IF.                                                      58540000
                                                                        58550000
LRM016* WHEN EVERY ASSET MARKED TO DELETE, SHOW DELETE IND ON SCREEN.           
LRM016     IF ACAT-FULL-DLVY-ASSET-DELETE = '1'                                 
LRM016     AND TWA-ACAT10IO-VASSET-COUNT =  TWA-ASSET-DELETE-COUNT      07490000
LRM016     AND TWA-STCD >= '200' AND < '300'                                    
LRM016        IF TWA-MDEL-ORIG = 'S'                                            
LRM016           CONTINUE                                                       
LRM016        ELSE                                                              
LRM016           MOVE WS-DLTE-ALL-MSG-RVS TO SYSTEM-MSG                         
LRM016        END-IF                                                            
LRM016        MOVE 'Y' TO  TWA-MDEL  MDELO                                      
LRM016                     TWA-MDEL-ORIG                                        
LRM016        IF TWA-VINITAST-NSCC-PEND-CD = 'Y'                        02870000
LRM016           MOVE ATT-ASKIP TO MDELA                                58610000
LRM016           MOVE 'ALL POSITION DELETES WERE EXTRACTED'                     
LRM016               TO SYSTEM-MSG                                              
LRM016        ELSE                                                      58610000
LRM016           SET CURSOR-ON-MDEL TO TRUE                             02870000
LRM016        END-IF                                                    58610000
LRM016        MOVE ATT-PROT TO MREJA, MREJCA                            59270000
LRM016        GO TO 0810-EXIT                                           58610000
LRM016     END-IF.                                                      58540000
                                                                                
12/18      IF ACAT90CM-TS-SCREEN = 'J' AND                              58560000
  |           TWA-SCREEN-IND = 'J'     AND                              58570000
  |           (ACAT90CM-TS-MCCMNT = SPACES OR LOW-VALUES)               58580000
  |           IF SYSTEM-MSG > SPACES                                    58590000
  |              SET CURSOR-ON-MREJC TO TRUE                            58600000
  |              GO TO 0810-EXIT                                        58610000
  |           END-IF                                                    58620000
12/18      END-IF.                                                      58630000
                                                                        58640000
      *** MESSAGE AREA ********************>>>>>>>>>>>>                 58650000
                                                                        58660000
LRM004     MOVE SPACES            TO CHGMSGO.                                   
LRM011     IF ACAT-ASCENDIS-OVERRIDE                                            
LRM011       IF TWA-VINITAST-NSCC-ACK-IND  = 'U'                        06630000
LRM011          MOVE 'H' TO TWA-VINITAST-NSCC-PEND-CD                   06630000
LRM011       END-IF                                                             
LRM011       IF TWA-VINITRNF-NSCC-ACK-IND  = 'U'                                
LRM011          MOVE 'H' TO TWA-VINITRNF-NSCC-PEND-CD                           
LRM011       END-IF                                                             
LRM011     ELSE                                                                 
01/28      IF TWA-VINITRNF-NSCC-PEND-CD = 'Y'                           58670000
01/28      OR TWA-VINITAST-NSCC-PEND-CD = 'Y'                           58680000
              GO TO PENDING-MSG-AREA                                    58690000
           END-IF.                                                      58700000
                                                                        58710000
       CHECK-SUBM-MSG.                                                  59100000
           IF ERROR-YES                                                 59110000
              CONTINUE                                                  59120000
           ELSE                                                         59130000
12/22         IF MSUBML = +0                                            59140000
12/24            IF (TWA-VINITRNF-NSCC-PEND-CD = SPACE OR LOW-VALUE)    59150000
01/28            AND (TWA-VINITAST-NSCC-PEND-CD = SPACE OR LOW-VALUE)   59160000
12/22            AND TWA-TIF-NSCC-PEND-CD = 'S' AND                     59170000
                     TWA-STCD             < '200'                       59180000
                     MOVE 'Y'            TO MSUBMO                      59190000
                     MOVE ATT-UNPROT-BRT TO MSUBMA                      59200000
01/01                MOVE ATT-PROT TO MBRA, MACA, MRRA, MNAMEA, MNAME2A,59210000
01/01                              MSSN1AA, MSSN1BA, MSSN1CA,           59220000
01/01                              MSSN2AA, MSSN2BA, MSSN2CA            59230000
                                   MBAL01A, MBAL02A, MBAL05A, MSECRA,   59240000
                                   MWIA, MTYPEA, MSTTLA, MSRSNA, MCDA,  59250000
                                   MQTYA, MDESCA, MAMTA, MDESC2A, MSMAA,59260000
                                   MDESC3A, MSECCA, MREJA, MREJCA       59270000
LRM016                             MDELA                                        
LRM016               MOVE ATT-ASKIP-DRK  TO MDELTA                              
                     IF WS-CURSOR = SPACE                               59280000
                        SET CURSOR-ON-MSUBM TO TRUE                     59290000
                        MOVE                                            59300000
                        ' ASSET POSITIONS WERE FLAGGED FOR SUBMISSION'  59310000
01/26                           TO SYSTEM-MSG                           59320000
                     END-IF                                             59330000
                 END-IF                                                 59340000
              ELSE                                                      59350000
12/01            IF TWA-VINITAST-NSCC-PEND-CD = 'Y'                     59360000
12/18               MOVE ATT-PROT TO MBRA, MACA, MRRA, MNAMEA, MNAME2A, 59370000
                                 MCSTPA, MSSN1AA, MSSN1BA, MSSN1CA,     59380000
                                 MSSN2AA, MSSN2BA, MSSN2CA,             59390000
                                 MBAL01A, MBAL02A, MBAL05A, MSMAA,      59400000
                                 MWIA, MQTYA, MAMTA, MCDA, MSUBMA,      59410000
                                 MSECCA, MREJA, MREJCA                  59420000
LRM016                           MDELA                                          
LRM016               MOVE ATT-ASKIP-DRK  TO MDELTA                              
                     MOVE ATT-UNPROT TO MSUBMA                          59430000
                                 MMBRA, MMACA, MMRRA, MMBKRA, MMTFRA,   59440000
                                  MMSTATA,                              59450000
                     MOVE SPACE TO MCDO, MSUBMO, MSECCO, MREJO, MREJCO  59460000
                     MOVE LOW-VALUE TO  TWA-MCD, TWA-MREJ, TWA-MREJC,   59470000
                                        TWA-MSUBM, TWA-MSECC            59480000
                     SET CURSOR-ON-MNEXT TO TRUE                        59490000
                    MOVE 'ASSET POSITIONS ARE PENDING, BROWSE ONLY! '   59500000
                                   TO  TWA-RETURN-MSG                   59510000
                 ELSE                                                   59520000
                    IF TWA-SUBM-YES                                     59530000
                       MOVE 'S'         TO MSUBMO                       59540000
                       IF WS-CURSOR = SPACE                             59550000
                          SET CURSOR-ON-MSUBM TO TRUE                   59560000
                          MOVE                                          59570000
                          'POSITIONS WILL BE SUBMITTED TO NSCC' TO      59580000
                           TWA-RETURN-MSG                               59590000
                       END-IF                                           59600000
                    ELSE                                                59610000
                       IF TWA-SUBM-NO                                   59620000
                          MOVE SPACE    TO MSUBMO                       59630000
                          MOVE ATT-UNPROT-BRT TO MSUBMA                 59640000
01/01                              MBRA, MACA, MRRA, MNAMEA, MNAME2A,   59650000
01/01                              MSSN1AA, MSSN1BA, MSSN1CA,           59660000
01/01                              MSSN2AA, MSSN2BA, MSSN2CA            59670000
                                   MBAL01A, MBAL02A, MBAL05A, MSECRA,   59680000
                                   MWIA, MTYPEA, MSTTLA, MSRSNA, MCDA,  59690000
                                   MQTYA, MDESCA, MAMTA, MDESC2A, MSMAA,59700000
                                   MDESC3A, MSECCA, MREJA, MREJCA       59710000
LRM016                    IF TWA-STCD >= '200' AND < '300'                      
LRM016                    AND ACAT-FULL-DLVY-ASSET-DELETE = '1'                 
LRM016                       MOVE ATT-UNPROT TO MDELA                           
LRM016                    ELSE                                                  
LRM016                       MOVE ATT-PROT   TO MDELA                           
LRM016                       MOVE ATT-ASKIP-DRK  TO MDELTA                      
LRM016                    END-IF                                                
                          IF WS-CURSOR = SPACE                          59720000
                             SET CURSOR-ON-MSUBM TO TRUE                59730000
                             MOVE                                       59740000
                            'POSITIONS WILL NOT BE SUBMITTED TO NSCC' TO59750000
                              TWA-RETURN-MSG                            59760000
                          END-IF                                        59770000
                       END-IF                                           59780000
                    END-IF                                              59790000
12/01            END-IF                                                 59800000
              END-IF                                                    59810000
           END-IF.                                                      59820000
                                                                        59830000
       CHECK-SECC-MSG.                                                  59840000
12/28      IF ERROR-YES                                                 59850000
LRM017        IF TWA-TIF-NSCC-PEND-CD = 'S'                             06630000
LRM017           MOVE ATT-PROT TO MBAL01A, MBAL02A, MBAL05A, MSMAA,     60130000
LRM017                            MCDA, MQTYA, MAMTA,                   60140000
LRM017                            MMBRA, MMACA, MMRRA, MMBKRA, MMTFRA,  60150000
LRM017                            MMSTATA                               60160000
LRM017                            MDELA                                         
LRM017        ELSE                                                      06630000
              CONTINUE                                                  59860000
           ELSE                                                         59870000
              IF TWA-SECC-YES                                           59880000
                 MOVE ATT-UNPROT-BRT TO MSECCA                          59890000
                 MOVE ATT-PROT             TO MSUBMA                    59900000
                 MOVE 'Y'                  TO MSECCO                    59910000
                 SET CURSOR-ON-MSECC       TO TRUE                      59920000
                 MOVE 'SECURITY COMMENT WILL BE UPDATED'                59930000
                                                    TO TWA-RETURN-MSG   59940000
              END-IF                                                    59950000
12/28      END-IF.                                                      59960000
                                                                        59970000
NEWTIF*~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~*   59990000
      * IF STCD < 200, AND PF2 IS ENTERED - OKAY TO CONTINUE        *   60000000
01/01 * OTHERWISE PF2 ENTRY IS NOT ALLOWED                          *   60010000
      *                                                             *   60020000
      *~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~*   60030000
01/14      IF TWA-STCD LESS THAN 200                                    60040000
01/14         IF EIBAID = DFHPF2                                        60050000
01/19            MOVE SPACE TO WS-CURSOR                                60060000
                 SET CURSOR-ON-MBR TO TRUE                              60070000
                 MOVE LOW-VALUES TO TWA-TIF-CHG-AREA                    60080000
01/14            SET TWA-TIF-ACCT-CHG TO TRUE                           60090000
                 MOVE ATT-UNPROT-BRT TO                                 60100000
                                      MBRA, MACA                        60110000
01/14            MOVE ATT-UNPROT TO MSUBMA, MSECCA, MREJA, MREJCA,      60120000
01/14            MOVE ATT-PROT TO MBAL01A, MBAL02A, MBAL05A, MSMAA,     60130000
                                  MCDA, MQTYA, MAMTA,                   60140000
                                  MMBRA, MMACA, MMRRA, MMBKRA, MMTFRA,  60150000
                                  MMSTATA                               60160000
LRM016                            MDELA                                         
LRM016           MOVE ATT-ASKIP-DRK  TO MDELTA                                  
              ELSE                                                      60170000
01/14            IF TWA-TIF-ACCT-CHG                                    60180000
01/19               IF WS-CURSOR = SPACE                                60190000
                       SET CURSOR-ON-MBR TO TRUE                        60200000
01/19               END-IF                                              60210000
                    MOVE ATT-UNPROT-BRT TO                              60220000
                                      MBRA, MACA                        60230000
01/14               MOVE ATT-UNPROT TO MSUBMA, MREJA, MREJCA,           60240000
01/14               MOVE ATT-PROT   TO MBAL01A, MBAL02A, MBAL05A, MSMAA,60250000
                                       MCDA, MQTYA, MAMTA, MSECCA       60260000
                                       MMBRA, MMACA, MMRRA, MMBKRA,     60270000
                                       MMTFRA, MMSTATA                  60280000
LRM016                                 MDELA                                    
LRM016              MOVE ATT-ASKIP-DRK  TO MDELTA                               
                 ELSE                                                   60290000
01/25               IF TWA-TIF-ACCT-NEW   OR                            60300000
                       TWA-TIF-UPDT                                     60310000
                       CONTINUE                                         60320000
                    ELSE                                                60330000
01/19                  IF WS-CURSOR = SPACE                             60340000
                          SET CURSOR-ON-MBAL01 TO TRUE                  60350000
01/19                  END-IF                                           60360000
                       MOVE ATT-PROT TO MBRA, MACA, MRRA, MNAMEA,       60370000
                                     MNAME2A, MCSTPA, MSSN1AA, MSSN1BA, 60380000
                                     MSSN1CA, MSSN2AA, MSSN2BA, MSSN2CA,60390000
                                     MWIA, MTYPEA, MSTTLA, MSRSNA,      60400000
                                     MDESCA, MDESC2A, MDESC3A, MSECRA   60410000
                       IF  TWA-TIF-NSCC-PEND-CD = 'S' AND               60420000
                           TWA-STCD             < '200'                 60430000
                           CONTINUE                                     60440000
                       ELSE                                             60450000
                           MOVE ATT-UNPROT-BRT TO                       60460000
                                       MBAL01A, MBAL02A, MBAL05A, MSMAA,60470000
                                       MCDA, MQTYA, MAMTA,              60480000
                                       MSECCA, MREJA, MREJCA            60490000
LRM016                     IF TWA-STCD >= '200' AND < '300'                     
LRM016                     AND ACAT-FULL-DLVY-ASSET-DELETE = '1'                
LRM016                        MOVE ATT-UNPROT TO MDELA                          
LRM016                     ELSE                                                 
LRM016                        MOVE ATT-PROT   TO MDELA                          
LRM016                        MOVE ATT-ASKIP-DRK  TO MDELTA                     
LRM016                     END-IF                                               
                       END-IF                                           60500000
                       MOVE ATT-UNPROT-BRT TO                           60510000
                                       MSUBMA,                          60520000
                                       MMBRA, MMACA, MMRRA, MMBKRA,     60530000
                                       MMTFRA, MMSTATA                  60540000
                    END-IF                                              60550000
                 END-IF                                                 60560000
              END-IF                                                    60570000
           ELSE                                                         60580000
      ****----- WHEN STTS-CD = '200' OR > '200' *********************** 60590000
12/01 ****----- MOVE '*** CAN NOT REJECT/SUBMIT   ***' TO TWA-RETURN-MSG60600000
01/19         IF WS-CURSOR = SPACE                                      60610000
                 SET CURSOR-ON-MBAL01 TO TRUE                           60620000
01/19         END-IF                                                    60630000
              MOVE ATT-PROT TO MSUBMA, MSECCA, MREJA, MREJCA,           60640000
01/01                          MBRA, MACA, MRRA, MNAMEA, MNAME2A,       60650000
01/01                          MSSN1AA, MSSN1BA, MSSN1CA,               60660000
01/01                          MSSN2AA, MSSN2BA, MSSN2CA                60670000
              MOVE ATT-UNPROT TO MBAL01A, MBAL02A, MBAL05A, MSMAA,      60680000
                                 MQTYA, MAMTA, MCDA,                    60690000
                                 MMBRA, MMACA, MMRRA, MMBKRA, MMTFRA,   60700000
                                 MMSTATA                                60710000
LRM016        IF TWA-STCD >= '200' AND < '300'                                  
LRM016        AND ACAT-FULL-DLVY-ASSET-DELETE = '1'                             
LRM016           MOVE ATT-UNPROT TO MDELA                                       
LRM016        ELSE                                                              
LRM016           MOVE ATT-PROT   TO MDELA                                       
LRM016           MOVE ATT-ASKIP-DRK  TO MDELTA                                  
LRM016        END-IF                                                            
01/11      END-IF.                                                      60720000
                                                                        60730000
01/25      IF TWA-STCD LESS THAN 200   AND                              60740000
              (TWA-TIF-ACCT-NEW   OR                                    60750000
               TWA-TIF-UPDT)                                            60760000
              MOVE ATT-UNPROT-BRT TO                                    60770000
                             MSUBMA, MREJA, MREJCA,                     60780000
                             MMBRA, MMACA, MMRRA, MMBKRA,               60790000
                             MMTFRA, MMSTATA                            60800000
              MOVE ATT-PROT TO                                          60810000
                             MBRA, MACA, MRRA, MNAMEA, MNAME2A,         60820000
                             MSSN1AA, MSSN1BA, MSSN1CA, MCSTPA,         60830000
                             MSSN2AA, MSSN2BA, MSSN2CA,                 60840000
                            MBAL01A, MBAL02A, MBAL05A, MSMAA,           60850000
                            MWIA, MTYPEA, MSTTLA, MSRSNA,               60860000
                            MCDA, MQTYA, MAMTA, MSECCA                  60870000
                            MDESCA, MDESC2A, MDESC3A, MSECRA            60880000
LRM016                      MDELA                                               
LRM016        MOVE ATT-ASKIP-DRK  TO MDELTA                                     
              IF TWA-VINITRNF-NSCC-PEND-CD = ' '                        60890000
                 SET CURSOR-ON-MNEXT TO TRUE                            60900000
                 MOVE                                                   60910000
                'ACCT INFO CHANGED WILL BE SUBMITTED, BROWSE ONLY!'     60920000
                                                  TO  TWA-RETURN-MSG    60930000
                 SET CURSOR-ON-MNEXT TO TRUE                            60940000
              END-IF                                                    60950000
01/25      END-IF.                                                      60960000
                                                                        60980000
ET0005**   IF TWA-VINITRNF-INSERTED     OR                              60990000
ET0005**      TWA-VINITRNF-UPDATED      OR                              61000000
ET0005**      TWA-VINITRNF-DELETED      OR                              61010000
ET0005**      TWA-VINITAST-INSERTED     OR                              61020000
ET0005**      TWA-VINITAST-UPDATED      OR                              61030000
ET0005**      TWA-VINITAST-DELETED      OR                              61040000
ET0005**      TWA-VTRNFR-FIRST          OR                              61050000
ET0005**      TWA-VTRNFR-LAST           OR                              61060000
ET0005**      TWA-VASSET-FIRST          OR                              61070000
ET0005**      TWA-VASSET-LAST                                           61080000
ET0005**      CONTINUE                                                  61090000
ET0005**   ELSE                                                         61100000
              IF TWA-INIT-TRANS-TYPE-CD = 'R'                           61110000
                 MOVE ATT-PROT  TO MBRA, MACA, MRRA, MNAMEA, MNAME2A,   61120000
                                   MSSN1AA, MSSN1BA, MSSN1CA,           61130000
                                   MSSN2AA, MSSN2BA, MSSN2CA            61140000
                 MOVE ATT-ASKIP TO MBAL01A, MBAL02A, MBAL05A, MSECRA,   61150000
                                   MWIA, MTYPEA, MSTTLA, MSRSNA, MCDA,  61160000
                                   MQTYA, MDESCA, MAMTA, MDESC2A, MSMAA,61170000
                                   MDESC3A, MSUBMA, MSECCA,             61180000
LRM016                             MDELA                                        
LRM016           MOVE ATT-ASKIP-DRK  TO MDELTA                                  
                 MOVE SPACES TO MCDO, MSUBMO, MSECCO                    61190000
                 IF TWA-VINITRNF-CMNT = SPACES OR LOW-VALUES            61200000
                    MOVE TWA-VINITRNF-TYPE-RJCT-CD TO TWA-MREJ, MREJO   61210000
                    SET CURSOR-ON-MREJ  TO TRUE                         61220000
                    MOVE ATT-UNPROT-BRT TO MREJA                        61230000
                    MOVE ATT-ASKIP  TO MSUBMA, MSECCA, MREJCA           61240000
LRM007              IF TWA-STTLM-TM-CD = 'L'                                    
LRM015              AND WS-TIME-HHMM > WS-CYCLE4-HHMM                           
LRM007              MOVE 'WARNING-PAST CUTOFF TIME;SUBMITTING WILL CAUSE        
LRM007-                    ' NSCC ERROR' TO SYSTEM-MSG                          
LRM007              ELSE                                                        
                    MOVE 'THIS TIF WAS FLAGGED TO BE REJECTED'          61250000
                            TO SYSTEM-MSG                               61260000
LRM007              END-IF                                                      
                 ELSE                                                   61270000
                    MOVE TWA-VINITRNF-TYPE-RJCT-CD TO TWA-MREJC, MREJCO 61280000
                    SET CURSOR-ON-MREJC   TO TRUE                       61290000
                    MOVE ATT-UNPROT-BRT TO MREJCA                       61300000
                    MOVE ATT-ASKIP TO MSUBMA, MSECCA, MREJA             61310000
LRM007              IF TWA-STTLM-TM-CD = 'L'                                    
LRM015              AND WS-TIME-HHMM > WS-CYCLE4-HHMM                           
LRM007              MOVE 'WARNING-PAST CUTOFF TIME;SUBMITTING WILL CAUSE        
LRM007-                    ' NSCC ERROR' TO SYSTEM-MSG                          
LRM007              ELSE                                                        
LRM013              IF TWA-VINITRNF-NSCC-PEND-CD = SPACE                        
LRM013               MOVE                                               61320000
LRM013               'THIS TIF WAS FLAGGED TO BE REJECTED WITH COMMENTS 61330000
LRM013-                'FOR SUBMISSION'                                         
LRM013                      TO SYSTEM-MSG                               61340000
LRM013              ELSE                                                        
                    MOVE                                                61320000
                    'THIS TIF WAS FLAGGED TO BE REJECTED WITH COMMENTS' 61330000
                            TO SYSTEM-MSG                               61340000
LRM007              END-IF END-IF                                               
                 END-IF                                                 61350000
              END-IF                                                    61400000
ET0005        .                                                         61400000
ET0005**   END-IF.                                                      61410000
                                                                        61420000
                                                                        61430000
       PENDING-MSG-AREA.                                                61440000
                                                                        61450000
      *** IF TWA-STCD IS LESS THAN 200, POSITION DATA IS FROM VINITAST  61460000
      *** IF TWA-STCD IS LESS THAN 300, POSITION DATA IS FROM VASSET,   61470000
      ***    PLUS VINITAST;                                             61480000
      *** IF TWA-STCD IS >= 300, POSITION DATA IS FROM VASSET           61490000
                                                                        61500000
LRM018* ONLY SHOW CYCLE5 CUTOFF MSG AND FORCE BROWSE MODE WHEN THE USER         
LRM018* HAS AN UPDATE SNON.  AFTER CYCLE 4, CAN ONLY PF2 TI-CHANGE ON           
LRM018* CYCLE 5.                                                                
LRM018     IF (TWA-STTLM-TM-CD = 'L'                                            
LRM018     AND WS-TIME-HHMM > WS-CYCLE5-HHMM)                                   
LRM018        IF ACAT-SIGN-ON-UPDATE                                    61540000
LRM018           SET ACAT-SIGN-ON-BROWSE TO TRUE                        10000000
LRM018           SET WS-CYCLE5-CUTOFF TO TRUE                                   
LRM018     END-IF.                                                      61720000
                                                                                
LRM018     IF (TWA-STTLM-TM-CD = 'L'                                            
LRM018     AND WS-TIME-HHMM > WS-CYCLE4-HHMM)                                   
LRM018        IF ACAT-SIGN-ON-UPDATE                                    61540000
LRM018        AND (EIBAID = DFHPF2                                      60050000
LRM018        OR TWA-TIF-ACCT-CHG)                                      60050000
LRM018           CONTINUE                                                       
LRM018        ELSE                                                              
LRM018           SET ACAT-SIGN-ON-BROWSE TO TRUE                        10000000
LRM018           SET WS-CYCLE4-CUTOFF TO TRUE                                   
LRM018     END-IF.                                                      61720000
                                                                                
LRM004     MOVE SPACES            TO CHGMSGO.                                   
01/28      IF TWA-STCD LESS THAN 200                                    61510000
LRM010        IF TWA-CVRSN-ACCT-NBR > SPACES                                    
LRM004           MOVE 'ORIG CONV ACCT ' TO CHGMSGO                              
LRM010           MOVE TWA-CVRSN-ACCT-NBR TO CHGMSGO(16 : 12)                    
LRM010        ELSE                                                              
LRM004        IF  TWA-TIF-ACCT-NEW                                      61740000
LRM004              MOVE 'ORIG ACCOUNT CHANGED ' TO CHGMSGO                     
LRM004              MOVE TWA-SV-BRANCH-CD  TO CHGMSGO(22 : 3)                   
LRM004              MOVE TWA-SV-ACCT-CD    TO CHGMSGO(25 : 5)                   
LRM010        END-IF                                                    61740000
LRM004        END-IF                                                    61740000
              IF NOT ACAT-SIGN-ON-UPDATE OR                             61540000
                 TWA-VINITRNF-NSCC-PEND-CD = 'Y' OR                     61550000
                 TWA-VINITAST-NSCC-PEND-CD = 'Y'                        61560000
                 SET CURSOR-ON-MNEXT TO TRUE                            61570000
                 MOVE ATT-UNPROT TO MMBRA, MMACA, MMRRA, MMBKRA, MMTFRA,61580000
                                 MMSTATA, MNEXTA                        61590000
                 MOVE ATT-PROT TO MBRA, MACA, MRRA, MNAMEA, MNAME2A,    61600000
                                 MCSTPA, MSSN1AA, MSSN1BA, MSSN1CA,     61610000
                                 MSSN2AA, MSSN2BA, MSSN2CA,             61620000
                                 MBAL01A, MBAL02A, MBAL05A, MSMAA,      61630000
                                 MWIA, MQTYA, MAMTA, MCDA,              61640000
                                 MSUBMA, MSECCA,                        61650000
                                 MREJA, MREJCA                          61660000
LRM016                           MDELA                                          
LRM016           MOVE ATT-ASKIP-DRK  TO MDELTA                                  
                 MOVE SPACE TO MCDO, MSUBMO, MSECCO, MREJO, MREJCO      61670000
                 MOVE LOW-VALUE TO TWA-MCD, TWA-MREJ, TWA-MREJC,        61680000
                                    TWA-MSUBM, TWA-MSECC                61690000
                 IF NOT ACAT-SIGN-ON-UPDATE                             61700000
LRM011              IF ACAT-ASCENDIS-CLIENT                                     
LRM011                 MOVE 'ASCENDIS CLIENT / BROWSE ONLY'             61710000
LRM011                                            TO  TWA-RETURN-MSG    61720000
LRM011              ELSE                                                        
                       MOVE 'BROWSE ONLY; USER SIGNON NON UPDATE'       61710000
                                                  TO  TWA-RETURN-MSG    61720000
LRM011              END-IF                                                      
                 ELSE                                                   61730000
                 IF  (TWA-TIF-ACCT-NEW   OR                             61740000
                     TWA-TIF-UPDT) AND                                  61750000
                     TWA-VINITRNF-NSCC-PEND-CD = 'Y'                    61760000
                 MOVE 'TIF ACCT INFO CHANGED/NSCC PENDING, BROWSE ONLY!'61770000
                                                  TO  TWA-RETURN-MSG    61780000
                 ELSE                                                   61790000
                     MOVE 'NSCC PENDING, BROWSE ONLY'                   61800000
                                                  TO TWA-RETURN-MSG     61810000
                 END-IF END-IF                                          61820000
              END-IF                                                    61830000
           ELSE                                                         61840000
           IF NOT ACAT-SIGN-ON-UPDATE OR                                61850000
              (TWA-VINITRNF-NSCC-PEND-CD = 'Y' OR                       61860000
              TWA-STCD NOT LESS '300')  AND                             61870000
01/25         NOT TWA-TIF-ACCT-NEW      AND                             61880000
              NOT TWA-TIF-UPDT                                          61890000
              SET CURSOR-ON-MNEXT TO TRUE                               61900000
              MOVE ATT-UNPROT TO MMBRA, MMACA, MMRRA, MMBKRA, MMTFRA,   61910000
                                 MMSTATA, MNEXTA                        61920000
              MOVE ATT-PROT  TO  MBRA, MACA, MRRA, MNAMEA, MNAME2A,     61930000
                                 MCSTPA, MSSN1AA, MSSN1BA, MSSN1CA,     61940000
                                 MSSN2AA, MSSN2BA, MSSN2CA,             61950000
                                 MBAL01A, MBAL02A, MBAL05A, MSMAA,      61960000
                                 MWIA, MQTYA, MAMTA, MCDA,              61970000
                                 MSUBMA, MSECCA, MREJA, MREJCA          61980000
LRM016                           MDELA                                          
LRM016        MOVE ATT-ASKIP-DRK  TO MDELTA                                     
              MOVE SPACE  TO MCDO, MSUBMO, MSECCO, MREJO, MREJCO        61990000
              MOVE LOW-VALUE TO  TWA-MCD, TWA-MREJ, TWA-MREJC,          62000000
                                 TWA-MSUBM, TWA-MSECC                   62010000
              IF NOT ACAT-SIGN-ON-UPDATE                                62020000
LRM011           IF ACAT-ASCENDIS-CLIENT                                        
LRM011              MOVE 'ASCENDIS CLIENT / BROWSE ONLY'                61710000
LRM011                                            TO  TWA-RETURN-MSG    61720000
LRM011           ELSE                                                           
                    MOVE 'BROWSE ONLY; USER SIGNON NON UPDATE'          62030000
                                                   TO TWA-RETURN-MSG    62040000
LRM011           END-IF                                                         
              ELSE                                                      62050000
              IF TWA-VINITRNF-NSCC-PEND-CD = 'Y'                        62060000
                 MOVE 'NSCC PENDING, BROWSE ONLY!' TO TWA-RETURN-MSG    62070000
                 SET CURSOR-ON-MNEXT TO TRUE                            62080000
              ELSE                                                      62090000
                 IF TWA-STCD NOT LESS '300'                             62100000
                    MOVE '   BROWSE ONLY!       ' TO TWA-RETURN-MSG     62110000
                    SET CURSOR-ON-MNEXT TO TRUE                         62120000
                 END-IF                                                 62130000
              END-IF END-IF                                             62140000
           END-IF.                                                      62150000
                                                                        62160000
     *****************************************************************  62170000
           IF SYSTEM-MSG = LOW-VALUES OR SPACES                         62180000
              MOVE TWA-RETURN-MSG       TO   SYSTEM-MSG                 62190000
           END-IF.                                                      62200000
                                                                        62210000
ET0003     IF  (ACAT-ACCOUNT-FREEZE-CLIENT)                                     
ET0003     AND (TWA-STCD < '200')                                               
ET0003     AND (TWA-VINITRNF-NSCC-PEND-CD NOT = 'Y')                            
ET0003     AND (TWA-VINITAST-NSCC-PEND-CD NOT = 'Y')                            
ET0003         MOVE TWA-CLIENT-NO-X   TO ACATRSIO-CLIENT-NBR                    
ET0003         MOVE TWA-BRANCH-CD     TO ACATRSIO-BRANCH                        
ET0003         MOVE TWA-ACCT-CD       TO ACATRSIO-ACCOUNT                       
ET0003         SET ACATRSIO-LOOKUP-ACCOUNT-FREEZE TO TRUE                       
ET0003         PERFORM 1510-LINK-TO-ACATRSTIO                                   
ET0003         IF ACATRSIO-FREEZE-CASH-OUT                                      
ET0003            IF ACATRSIO-FREEZE-SEC-OUT                                    
ET0003               MOVE 'F' TO TWA-ACCT-FREEZ-TYPE                            
ET0003               PERFORM 0814-ACCCT-FREEZ-PROCESS                   61900000
ET0003               MOVE WS-FULL-FREEZE-MSG  TO SYSTEM-MSG                     
ET0003            ELSE                                                          
ET0003               MOVE 'C' TO TWA-ACCT-FREEZ-TYPE                            
ET0003               PERFORM 0814-ACCCT-FREEZ-PROCESS                   61900000
ET0003               MOVE WS-CASH-FREEZE-MSG  TO SYSTEM-MSG                     
ET0003            END-IF                                                        
ET0003         ELSE                                                             
ET0003            IF ACATRSIO-FREEZE-SEC-OUT                                    
ET0003               MOVE 'S' TO TWA-ACCT-FREEZ-TYPE                            
ET0003               PERFORM 0814-ACCCT-FREEZ-PROCESS                           
ET0003               MOVE WS-SEC-FREEZE-MSG   TO SYSTEM-MSG                     
ET0003            ELSE                                                          
ET0003               MOVE SPACE TO TWA-ACCT-FREEZ-TYPE                          
ET0003            END-IF                                                        
ET0003         END-IF                                                           
ET0003     END-IF.                                                              
                                                                                
LRM018     IF WS-CYCLE4-CUTOFF                                                  
LRM018         MOVE 'PAST CYCLE 4 CUTOFF ON LAST DAY; ONLY PF2 ALLOWED' 61710000
LRM018                                            TO SYSTEM-MSG         61720000
LRM018     END-IF.                                                      61720000
                                                                                
LRM018     IF WS-CYCLE5-CUTOFF                                                  
LRM018         MOVE 'PAST CYCLE 5 CUTOFF ON LAST DAY / BROWSE ONLY'     61710000
LRM018                                            TO SYSTEM-MSG         61720000
LRM018     END-IF.                                                      61720000
                                                                                
       0810-EXIT.                                                               
           EXIT.                                                                
      /                                                                         
ET0003*                                                                         
ET0003*----------------------------------------------------------------*        
ET0003* ACCOUNT IS FROZEN                                                       
ET0003*  (1) PROTECT ALL FIELDS EXCEPT SEARCH FIELDS.                           
ET0003*  (2) SET REJCT CODE AS '03' AND CREATE REJECT RECORD IN ACTITRF.        
ET0003*  (3) UPDATE ACCT-FRZN-IND OF VTRNFR.                                    
ET0003*      ACCT-FRZN-IND = 'Y' MEANS ACCT FREEZE FOUND BY BATCH PROG          
ET0003*      ACCT-FRZN-IND = 'O' MEANS ACCT FREEZE FOUND BY ONLINE PROG         
ET0003*----------------------------------------------------------------*        
ET0003 0814-ACCCT-FREEZ-PROCESS.                                        61900000
           SET CURSOR-ON-MNEXT TO TRUE.                                 61900000
                                                                        61900000
           MOVE ATT-ASKIP    TO MBRA                                            
                                MACA                                            
                                MRRA                                            
                                MNAMEA                                          
                                MNAME2A                                         
                                MCSTPA                                          
                                MSSN1AA                                         
                                MSSN1BA                                         
                                MSSN1CA                                         
                                MSSN2AA                                         
                                MSSN2BA                                         
                                MSSN2CA                                         
                                MBAL01A                                         
                                MBAL02A                                         
                                MBAL05A                                         
                                MSMAA                                           
                                MWIA                                            
                                MQTYA                                           
                                MAMTA                                           
                                MCDA                                            
                                MSUBMA                                          
                                MSECCA                                          
                                MREJA                                           
LRM016                          MDELA                                           
                                MREJCA.                                         
                                                                                
           MOVE ATT-UNPROT   TO MMBRA                                   61910000
                                MMACA                                   61910000
                                MMRRA                                   61910000
                                MMBKRA                                  61910000
                                MMTFRA                                  61910000
                                MMSTATA                                 61920000
                                MNEXTA.                                 61920000
                                                                                
           IF TWA-INIT-TRANS-TYPE-CD = 'R'                              61110000
              CONTINUE                                                  61110000
           ELSE                                                         61110000
              MOVE '03'  TO MREJCO                                      58450000
                            TWA-MREJC                                   58450000
                            ACAT10IO-VINITRNF-TYPE-RJCT-CD              58450000
              MOVE '  '  TO MREJO                                       58450000
                            TWA-MREJ                                    58450000
                            ACAT10IO-VINITRNF-TYPE-RJCT-CD              58450000
              MOVE 'Y'                  TO ACAT10IO-ACCT-FREEZ-PROCESS          
ET0004        MOVE ACAT-SIGN-ON-ID      TO ACAT10IO-SIGN-ON-ID          43440000
ET0004        MOVE ACAT-CICS-NETNAME    TO ACAT10IO-NET-NAME            43440000
ET0004        MOVE ACAT-CICS-USER-ID    TO ACAT10IO-USER-ID             43440000
ET0004        MOVE ACAT-CICS-USER-NAME  TO ACAT10IO-USER-NAME           43440000
              MOVE LOW-VALUES  TO ACAT10IO-MBR ACAT10IO-MAC                     
              SET ACAT10IO-ISRT-VINITRNF TO TRUE                        43460000
              PERFORM 0500-CALL-ACAT10DA                                43470000
              IF ACAT10IO-DB2-ERROR                                     43480000
                 MOVE 'SELECT'             TO WS-DB2-ERROR-FUNCTION     43490000
                 MOVE 'ACAT10DA'       TO WS-DB2-ERROR-PGM              43500000
                 MOVE ACAT10IO-SQLCAID     TO WS-DB2-ERROR-TABLE        43510000
                 MOVE ACAT10IO-SQLCODE     TO WS-DB2-ERROR-ID           43520000
                 MOVE WS-DB2-ERROR-MSG     TO SYSTEM-MSG                43530000
                 SET ERROR-YES TO TRUE                                  43540000
                 SET DATA-ONLY TO TRUE                                  43550000
                 PERFORM 0800-SEND-MAP-RETURN                           43560000
              ELSE                                                      43480000
                 MOVE 'R' TO TWA-INIT-TRANS-TYPE-CD                     43560000
                             ACAT10IO-INIT-TRANS-TYPE-CD                43560000
              END-IF                                                    43570000
           END-IF.                                                      58450000
                                                                        58450000
           IF TWA-ACCT-FRZN-IND = 'Y' OR 'O'                            06670000
              CONTINUE                                                  43570000
           ELSE                                                         06670000
              SET ACAT10IO-UPDT-FRZN-IND TO TRUE                        43570000
              PERFORM 0500-CALL-ACAT10DA                                43470000
           END-IF.                                                      06670000
       EJECT                                                                    
                                                                        61900000
       0830-ERROR-RTN.                                                  62250000
           IF MNEXTI = SPACE                                            62260000
              MOVE SPACES TO ACAT-INP-SEL                               62270000
                             ACAT-NEXT                                  62280000
           END-IF.                                                      62290000
12/10      PERFORM 0810-MAP-INPUT-AREA  THRU 0810-EXIT.                 62300000
           MOVE EIBTRMID      TO TERM-ID.                               62310000
           MOVE 'ACA0'        TO TRAN-ID.                               62320000
           PERFORM 0600-DELETE-TSQ.                                     62330000
           PERFORM 0620-WRITE-TSQ.                                      62340000
           PERFORM 0800-SEND-MAP-RETURN.                                62350000
                                                                        62360000
       0840-CURSOR-POSITION.                                            62370000
                                                                        62380000
           EVALUATE WS-CURSOR                                           62390000
                WHEN 'MBR' MOVE -1 TO MBRL                              62400000
                           MOVE ATT-UNPROT-BRT  TO MBRA                 62410000
                           SET CURSOR-MAP-A TO TRUE                     62420000
                WHEN 'MAC' MOVE -1 TO MACL                              62430000
                           MOVE ATT-UNPROT-BRT  TO MACA                 62440000
                           SET CURSOR-MAP-A TO TRUE                     62450000
                WHEN 'MRR' MOVE -1 TO MRRL                              62460000
                           MOVE ATT-UNPROT-BRT  TO MRRA                 62470000
                           SET CURSOR-MAP-A TO TRUE                     62480000
                WHEN 'NM1' MOVE -1 TO MNAMEL                            62490000
                           MOVE ATT-UNPROT-BRT  TO MNAMEA               62500000
                           SET CURSOR-MAP-A TO TRUE                     62510000
                WHEN 'NM2' MOVE -1 TO MNAME2L                           62520000
                           MOVE ATT-UNPROT-BRT  TO MNAME2A              62530000
                           SET CURSOR-MAP-A TO TRUE                     62540000
                WHEN 'STP' MOVE -1 TO MCSTPL                            62550000
                           MOVE ATT-UNPROT-BRT  TO MCSTPA               62560000
                           SET CURSOR-MAP-A TO TRUE                     62570000
                WHEN 'SS1' MOVE -1 TO MSSN1AL                           62580000
                           MOVE ATT-UNPROT-BRT  TO MSSN1AA              62590000
LRM001                                             MSSN1BA MSSN1CA              
                           SET CURSOR-MAP-A TO TRUE                     62600000
                WHEN 'SS2' MOVE -1 TO MSSN2AL                           62610000
                           MOVE ATT-UNPROT-BRT  TO MSSN2AA              62620000
LRM001                                             MSSN2BA MSSN2CA              
                           SET CURSOR-MAP-A TO TRUE                     62630000
                WHEN 'B1 ' MOVE -1 TO MBAL01L                           62640000
                           MOVE ATT-UNPROT-BRT  TO MBAL01A              62650000
                           SET CURSOR-MAP-A TO TRUE                     62660000
                WHEN 'B2 ' MOVE -1 TO MBAL02L                           62670000
                           MOVE ATT-UNPROT-BRT  TO MBAL02A              62680000
                           SET CURSOR-MAP-A TO TRUE                     62690000
                WHEN 'B5 ' MOVE -1 TO MBAL05L                           62700000
                           MOVE ATT-UNPROT-BRT  TO MBAL05A              62710000
                           SET CURSOR-MAP-A TO TRUE                     62720000
                WHEN 'SM ' MOVE -1 TO MSMAL                             62730000
                           MOVE ATT-UNPROT-BRT  TO MSMAA                62740000
                           SET CURSOR-MAP-A TO TRUE                     62750000
                WHEN 'TP ' MOVE -1 TO MTYPEL                            62760000
                           MOVE ATT-UNPROT-BRT  TO MTYPEA               62770000
                           SET CURSOR-MAP-B TO TRUE                     62780000
                WHEN 'WI ' MOVE -1 TO MWIL                              62790000
                           MOVE ATT-UNPROT-BRT  TO MWIA                 62800000
                           SET CURSOR-MAP-B TO TRUE                     62810000
                WHEN 'TL ' MOVE -1 TO MSTTLL                            62820000
                           MOVE ATT-UNPROT-BRT  TO MSTTLA               62830000
                           SET CURSOR-MAP-B TO TRUE                     62840000
                WHEN 'RS ' MOVE -1 TO MSRSNL                            62850000
                           MOVE ATT-UNPROT-BRT  TO MSRSNA               62860000
                           SET CURSOR-MAP-B TO TRUE                     62870000
                WHEN 'CD ' MOVE -1 TO MCDL                              62880000
                           MOVE ATT-UNPROT-BRT  TO MCDA                 62890000
                           SET CURSOR-MAP-B TO TRUE                     62900000
                WHEN 'QT ' MOVE -1 TO MQTYL                             62910000
                           MOVE ATT-UNPROT-BRT  TO MQTYA                62920000
                           SET CURSOR-MAP-B TO TRUE                     62930000
                WHEN 'D1 ' MOVE -1 TO MDESCL                            62940000
                           MOVE ATT-UNPROT-BRT  TO MDESCA               62950000
                           SET CURSOR-MAP-B TO TRUE                     62960000
                WHEN 'D2 ' MOVE -1 TO MDESC2L                           62970000
                           MOVE ATT-UNPROT-BRT  TO MDESC2A              62980000
                           SET CURSOR-MAP-B TO TRUE                     62990000
                WHEN 'D3 ' MOVE -1 TO MDESC3L                           63000000
                           MOVE ATT-UNPROT-BRT  TO MDESC3A              63010000
                           SET CURSOR-MAP-B TO TRUE                     63020000
                WHEN 'AM ' MOVE -1 TO MAMTL                             63030000
                           MOVE ATT-UNPROT-BRT  TO MAMTA                63040000
                           SET CURSOR-MAP-B TO TRUE                     63050000
                WHEN 'NX ' MOVE -1 TO MNEXTL                            63060000
                           MOVE ATT-UNPROT-BRT  TO MNEXTA               63070000
                           SET CURSOR-MAP-B TO TRUE                     63080000
                WHEN 'SB ' MOVE -1 TO MSUBML                            63090000
                           MOVE ATT-UNPROT-BRT  TO MSUBMA               63100000
                           SET CURSOR-MAP-B TO TRUE                     63110000
                WHEN 'SC ' MOVE -1 TO MSECCL                            63120000
                           MOVE ATT-UNPROT-BRT  TO MSECCA               63130000
                           SET CURSOR-MAP-B TO TRUE                     63140000
                WHEN 'RJ ' MOVE -1 TO MREJL                             63150000
                           MOVE ATT-UNPROT-BRT  TO MREJA                63160000
                           SET CURSOR-MAP-B TO TRUE                     63170000
                WHEN 'RC ' MOVE -1 TO MREJCL                            63180000
                           MOVE ATT-UNPROT-BRT  TO MREJCA               63190000
                           SET CURSOR-MAP-B TO TRUE                     63200000
                WHEN 'BR ' MOVE -1 TO MMBRL                             63210000
                           MOVE ATT-UNPROT-BRT  TO MMBRA                63220000
                           SET CURSOR-MAP-T TO TRUE                     63230000
                WHEN 'AC ' MOVE -1 TO MMACL                             63240000
                           MOVE ATT-UNPROT-BRT  TO MMACA                63250000
                           SET CURSOR-MAP-T TO TRUE                     63260000
                WHEN 'RR ' MOVE -1 TO MMRRL                             63270000
                           MOVE ATT-UNPROT-BRT  TO MMRRA                63280000
                           SET CURSOR-MAP-T TO TRUE                     63290000
                WHEN 'TR ' MOVE -1 TO MMTFRL                            63300000
                           MOVE ATT-UNPROT-BRT  TO MMTFRA               63310000
                           SET CURSOR-MAP-T TO TRUE                     63320000
                WHEN 'BK ' MOVE -1 TO MMBKRL                            63330000
                           MOVE ATT-UNPROT-BRT  TO MMBKRA               63340000
                           SET CURSOR-MAP-T TO TRUE                     63350000
                WHEN 'ST ' MOVE -1 TO MMSTATL                           63360000
                           MOVE ATT-UNPROT-BRT  TO MMSTATA              63370000
                           SET CURSOR-MAP-T TO TRUE                     63380000
LRM016          WHEN 'DX ' MOVE -1 TO MDELL                                     
LRM016                     MOVE ATT-UNPROT-BRT  TO MDELA                        
LRM016                     SET CURSOR-MAP-B TO TRUE                             
                WHEN OTHER MOVE -1 TO MNEXTL                            63390000
                           SET CURSOR-MAP-B TO TRUE                     63400000
           END-EVALUATE.                                                63410000
                                                                        63420000
01/15  0840-EXIT.                                                       63430000
           EXIT.                                                        63440000
           EJECT                                                        63450000
       0850-SEND-MAP-DATA-ONLY.                                         63460000
                                                                        63470000
           MOVE 'ACAX'        TO  MTRANSO.                              63480000
           MOVE WSMMDDYY      TO  MDATEO.                               63490000
           MOVE WSTIME        TO  MTIMEO.                               63500000
           MOVE ACAT-CLIENT-NO  TO MCLINBO.                             63510000
                                                                        63520000
      ***  MAP HEADER                                                   63530000
           EXEC CICS SEND MAP('HDRMAP')                                 63540000
                     MAPSET('ACAT00M')                                  63550000
                     FROM (HDRMAPO)                                     63560000
                     DATAONLY                                           63570000
                     ACCUM                                              63580000
           END-EXEC.                                                    63590000
                                                                        63600000
      ***  MAP BODY                                                     63610000
                                                                        63620000
           IF ACAT-SRCH-MSG > SPACES                                    63630000
              PERFORM 0495-SRCH-CURSOR-RTN  THRU 0495-EXIT              63640000
           END-IF.                                                      63650000
           PERFORM 0840-CURSOR-POSITION  THRU 0840-EXIT.                63660000
      ****                                                              63670000
           IF CURSOR-MAP-A                                              63680000
              EXEC CICS SEND MAP('ACAT10A')                             63690000
                     MAPSET('ACAT10M')                                  63700000
                     FROM(ACAT10AO)                                     63710000
                     CURSOR                                             63720000
                     DATAONLY                                           63730000
                     ACCUM                                              63740000
              END-EXEC                                                  63750000
           ELSE                                                         63760000
              EXEC CICS SEND MAP('ACAT10A')                             63770000
                     MAPSET('ACAT10M')                                  63780000
                     FROM(ACAT10AO)                                     63790000
                     DATAONLY                                           63800000
                     ACCUM                                              63810000
              END-EXEC                                                  63820000
           END-IF.                                                      63830000
                                                                        63840000
           IF CURSOR-MAP-B                                              63850000
              EXEC CICS SEND MAP('ACAT10B')                             63860000
                     MAPSET('ACAT10M')                                  63870000
                     FROM(ACAT10BO)                                     63880000
                     CURSOR                                             63890000
                     DATAONLY                                           63900000
                     ACCUM                                              63910000
              END-EXEC                                                  63920000
           ELSE                                                         63930000
              EXEC CICS SEND MAP('ACAT10B')                             63940000
                     MAPSET('ACAT10M')                                  63950000
                     FROM(ACAT10BO)                                     63960000
                     DATAONLY                                           63970000
                     ACCUM                                              63980000
              END-EXEC                                                  63990000
           END-IF.                                                      64000000
                                                                        64010000
      ***  MAP TRAILER                                                  64020000
           MOVE TWA-MMBR        TO MMBRO.                               64030000
           MOVE TWA-MMAC        TO MMACO.                               64040000
           MOVE TWA-MMRR        TO MMRRO.                               64050000
           MOVE TWA-MTFR        TO MMTFRO.                              64060000
           MOVE TWA-MCBRKR      TO MMBKRO.                              64070000
           MOVE TWA-MSTAT       TO MMSTATO.                             64080000
           MOVE SYSTEM-MSG      TO TRLMSGO.                             64090000
           MOVE ATT-ASKIP-BRT   TO TRLMSGA.                             64100000
      ***  MAP TRAILER                                                  64110000
           IF CURSOR-MAP-T                                              64120000
              EXEC CICS SEND MAP('TRLMAP')                              64130000
                     MAPSET('ACAT00M')                                  64140000
                     FROM(TRLMAPO)                                      64150000
                     CURSOR                                             64160000
                     DATAONLY                                           64170000
                     ACCUM                                              64180000
              END-EXEC                                                  64190000
           ELSE                                                         64200000
              EXEC CICS SEND MAP('TRLMAP')                              64210000
                     MAPSET('ACAT00M')                                  64220000
                     FROM(TRLMAPO)                                      64230000
                     DATAONLY                                           64240000
                     ACCUM                                              64250000
              END-EXEC                                                  64260000
           END-IF.                                                      64270000
           EXEC CICS SEND PAGE                                          64280000
           END-EXEC.                                                    64290000
           IF EIBRCODE NOT EQUAL LOW-VALUES                             64300000
              MOVE '0850-SEND-MAP-DATA ' TO WS-CICS-DISPLAY             64310000
              MOVE EIBRCODE          TO WS-CICS-RC                      64320000
              MOVE WS-CICS-MSG       TO WS-MSG-OUT                      64330000
              PERFORM 0920-SEND-MSG-RETURN-TO-CICS                      64340000
           ELSE                                                         64350000
              MOVE 'ACAT10NT' TO ACAT-PROGRAM-NAME.                     64360000
              MOVE 'H'        TO ACAT-NEXT, ACAT-INP-SEL.               64370000
              PERFORM 0900-RETURN-TO-CICS.                              64380000
      /                                                                 64400000
       0870-SEND-MAP-ERASE.                                             64410000
                                                                        64420000
           IF ACAT-SRCH-MSG > SPACES                                    64430000
              PERFORM 0495-SRCH-CURSOR-RTN THRU 0495-EXIT               64440000
           END-IF.                                                      64450000
           PERFORM 0840-CURSOR-POSITION THRU 0840-EXIT.                 64460000
           MOVE 'ACAX'        TO  MTRANSO.                              64470000
           MOVE WSMMDDYY      TO  MDATEO.                               64480000
           MOVE WSTIME        TO  MTIMEO.                               64490000
           MOVE ACAT-CLIENT-NO  TO MCLINBO.                             64500000
           MOVE TWA-MMBR        TO MMBRO.                               64510000
           MOVE TWA-MMAC        TO MMACO.                               64520000
           MOVE TWA-MMRR        TO MMRRO.                               64530000
           MOVE TWA-MTFR        TO MMTFRO.                              64540000
           MOVE TWA-MCBRKR      TO MMBKRO.                              64550000
           MOVE TWA-MSTAT       TO MMSTATO.                             64560000
           MOVE SYSTEM-MSG     TO  TRLMSGO.                             64570000
           MOVE ATT-ASKIP-BRT  TO  TRLMSGA.                             64580000
                                                                        64590000
      ***  MAP HEADER                                                   64600000
           EXEC CICS SEND MAP('HDRMAP')                                 64610000
                     MAPSET('ACAT00M')                                  64620000
                     FROM (HDRMAPO)                                     64630000
                     ERASE                                              64640000
                     ACCUM                                              64650000
              END-EXEC.                                                 64660000
      ***  MAP BODY                                                     64670000
           IF CURSOR-MAP-A                                              64680000
              EXEC CICS SEND MAP('ACAT10A')                             64690000
                     MAPSET('ACAT10M')                                  64700000
                     FROM(ACAT10AO)                                     64710000
                     CURSOR                                             64720000
                     ACCUM                                              64730000
              END-EXEC                                                  64740000
           ELSE                                                         64750000
              EXEC CICS SEND MAP('ACAT10A')                             64760000
                     MAPSET('ACAT10M')                                  64770000
                     FROM(ACAT10AO)                                     64780000
                     ACCUM                                              64790000
              END-EXEC                                                  64800000
           END-IF.                                                      64810000
                                                                        64820000
           IF CURSOR-MAP-B                                              64830000
              EXEC CICS SEND MAP('ACAT10B')                             64840000
                     MAPSET('ACAT10M')                                  64850000
                     FROM(ACAT10BO)                                     64860000
                     CURSOR                                             64870000
                     ACCUM                                              64880000
              END-EXEC                                                  64890000
           ELSE                                                         64900000
              EXEC CICS SEND MAP('ACAT10B')                             64910000
                     MAPSET('ACAT10M')                                  64920000
                     FROM(ACAT10BO)                                     64930000
                     ACCUM                                              64940000
              END-EXEC                                                  64950000
           END-IF.                                                      64960000
                                                                        64970000
      ***  MAP TRAILER                                                  64980000
           IF CURSOR-MAP-T                                              64990000
              EXEC CICS SEND MAP('TRLMAP')                              65000000
                     MAPSET('ACAT00M')                                  65010000
                     FROM(TRLMAPO)                                      65020000
                     CURSOR                                             65030000
                     ACCUM                                              65040000
              END-EXEC                                                  65050000
           ELSE                                                         65060000
              EXEC CICS SEND MAP('TRLMAP')                              65070000
                     MAPSET('ACAT00M')                                  65080000
                     FROM(TRLMAPO)                                      65090000
                     ACCUM                                              65100000
              END-EXEC                                                  65110000
           END-IF.                                                      65120000
           EXEC CICS SEND PAGE                                          65130000
           END-EXEC.                                                    65140000
           IF EIBRCODE NOT EQUAL LOW-VALUES                             65150000
              MOVE '0870-SEND-MAP-ERASE' TO WS-CICS-DISPLAY             65160000
              MOVE EIBRCODE          TO WS-CICS-RC                      65170000
              MOVE WS-CICS-MSG       TO WS-MSG-OUT                      65180000
              PERFORM 0920-SEND-MSG-RETURN-TO-CICS                      65190000
           ELSE                                                         65200000
              MOVE 'ACAT10NT' TO ACAT-PROGRAM-NAME.                     65210000
              MOVE 'H'      TO ACAT-NEXT, ACAT-INP-SEL.                 65220000
              PERFORM 0900-RETURN-TO-CICS.                              65230000
       EJECT                                                            65240000
                                                                        65250000
       0900-RETURN-TO-CICS.                                             65260000
                                                                        65270000
           IF TWA-SRCH-VTRNFR-PND   AND                                 65280000
              ACAT-CALLING-PROG-NAME NOT = 'ACAT21PT'                   65290000
              MOVE 'ACAT21PT' TO ACAT-CALLING-PROG-NAME                 65300000
           END-IF.                                                      65310000
                                                                        65320000
           EXEC CICS RETURN                                             65330000
                     TRANSID('ACAX')                                    65340000
                     COMMAREA(ACATCOMM-COMMAREA)                        65350000
           END-EXEC.                                                    65360000
                                                                        65370000
       0910-RETURN-CONTROL-RTN.                                         65380000
           EXEC CICS SEND CONTROL                                       65390000
                            ERASE                                       65400000
                           FREEKB                                       65410000
           END-EXEC.                                                    65420000
           EXEC CICS XCTL PROGRAM ('RATT01')                            65430000
           END-EXEC.                                                    65440000
           EXEC CICS RETURN                                             65450000
           END-EXEC.                                                    65460000
                                                                        65470000
           EJECT                                                        65480000
                                                                        65490000
       0920-SEND-MSG-RETURN-TO-CICS.                                    65500000
           EXEC CICS                                                    65510000
                SEND                                                    65520000
                FROM (WS-MSG-OUT)                                       65530000
                ERASE                                                   65540000
           END-EXEC.                                                    65550000
                                                                        65560000
           EXEC CICS                                                    65570000
                RETURN                                                  65580000
           END-EXEC.                                                    65590000
                                                                        65600000
       HANG-CICS.                                                       65610000
           GOBACK.                                                      65620000
           EJECT                                                        65630000
       SCREEN-SECURITY-CHECK.                                           65640000
           IF  ACAT-SUPER-SIGN-ON-UPDATE                                65650000
               SET ACAT-SIGN-ON-UPDATE TO TRUE                          65660000
           ELSE                                                         65670000
           IF  ACAT-SUPER-SIGN-ON-BROWSE                                65680000
               MOVE SPACE  TO ACAT-SIGN-ON-SEC-FLAG                     65690000
           ELSE                                                         65700000
               MOVE ACAT-NEXT TO ACAT-SCREEN-IND                        65710000
               SET ACAT-UPDATE-MODE TO TRUE                             65720000
               MOVE SPACES    TO SECLINK-LIST                           65730000
               MOVE '2'       TO SECLINK-ACTION-CODE                    65740000
               MOVE 'SCON'    TO SECLINK-TYPE                           65750000
               MOVE ACAT-SEC-LIT TO SECLINK-ITEM                        65760000
               PERFORM CALL-SECLINK-RTN                                 65770000
               IF SECLINK-RETURN-CODE = '00' OR '20'                    65780000
                  SET ACAT-SIGN-ON-UPDATE TO TRUE                       65790000
               ELSE                                                     65800000
                  SET ACAT-BROWSE-MODE TO TRUE                          65810000
                  MOVE SPACES    TO SECLINK-LIST                        65820000
                  MOVE '2'       TO SECLINK-ACTION-CODE                 65830000
                  MOVE 'SCON'    TO SECLINK-TYPE                        65840000
                  MOVE ACAT-SEC-LIT TO SECLINK-ITEM                     65850000
                  PERFORM CALL-SECLINK-RTN                              65860000
                  IF SECLINK-RETURN-CODE = '00' OR '20'                 65870000
                     MOVE SPACE TO ACAT-SIGN-ON-SEC-FLAG                65880000
                  ELSE                                                  65890000
                     MOVE 'USER NOT AUTHORIZED TO USE NEXT SELECTION '  65900000
                       TO SYSTEM-MSG                                    65910000
                     MOVE ACAT-SCREEN-IND                               65920000
                       TO SYSTEM-MSG(44 : 1)                            65930000
                     SET CURSOR-ON-MNEXT    TO TRUE                     65940000
                     MOVE ATT-UNPROT-BRT-MDT TO MNEXTA                  65950000
                     SET ERROR-YES TO TRUE                              65960000
12/12                SET DATA-ONLY TO TRUE                              65970000
12/12                PERFORM 0800-SEND-MAP-RETURN                       65980000
                  END-IF                                                65990000
               END-IF                                                   66000000
           END-IF END-IF.                                               66010000
                                                                        66020000
      /                                                                 66030000
ET0003*                                                                         
ET0003*----------------------------------------------------------------*        
ET0003*    CALL ACCOUNT FREEZ IO MODULE                                         
ET0003*----------------------------------------------------------------*        
ET0003 1510-LINK-TO-ACATRSTIO.                                                  
ET0003     EXEC CICS LINK PROGRAM (WS-ACATRST)                                  
ET0003          COMMAREA(ACATRSTIO-CALL-AREA)                                   
ET0003          LENGTH(LENGTH OF ACATRSTIO-CALL-AREA)                           
ET0003     END-EXEC.                                                            
ET0003*                                                                         
       LINK-TO-ACATNAIO-RTN.                                            66040000
           EXEC CICS LINK PROGRAM (WS-ACATNAIO)                         66050000
                COMMAREA(ACATNAIO-CALL-AREA)                            66060000
                LENGTH(LENGTH OF ACATNAIO-CALL-AREA)                    66070000
           END-EXEC.                                                    66080000
                                                                        66090000
       CALL-SECLINK-RTN.                                                66100000
           EXEC CICS LINK PROGRAM ('SECLINK')                           66110000
                COMMAREA(SECLINK-LIST)                                  66120000
                LENGTH(LENGTH OF SECLINK-LIST)                          66130000
           END-EXEC.                                                    66140000
                                                                        66150000
      ****************************************************************  66170000
