000001* PDX    - ACAT11DB C0360817 12/15/14 13:49:01 TBLAMUR            00001000
LRM048* SSR 99150 CONTRA CUSIP SUBMIT WARNING                                   
000001* PDX    - ACAT11DB C0354742 05/27/14 08:12:55 TBCHKOP            00001000
CSG001* SSR 101121 REPLACE ILLEGAL CHARS IN MSD-DESC WITH SPACES.               
000001* PDX    - ACAT11DB C0352614 03/11/14 09:55:39 TBLAMUR            00001000
LRM033* SSR# 91504 CNS CHANGE TO NOT PASS SLOC REASON CNS OR DTC ON A           
000001*   SETTLE LOC = 05 ASSET.                                                
000001* PDX    - ACAT11DB C0346519 12/04/13 15:52:08 TBLAMUR            00001000
LRM032* SSR 96477 INCLUDE BANK DEPOSIT MONEY IN DLVY EDIT, ADD TO               
LRM032*       CMBL-MM-FUND-YEST.                                                
000001* PDX    - ACAT11DB C0332370 10/15/12 14:53:20 TBLAMUR            00001000
LRM031* SSR 86655 CHANGE UNPRICED POSITIONS .01 PER SHARE WHEN                  
LRM031*   PTR REQUEST BY AMT AND UNPRICED.                                      
000001* PDX    - ACAT11DB C0330859 09/10/12 08:22:24 TBLAMUR            00001000
LRM030* SSR 85105 USE 12 ISIN ON DATABASE FOR A FOREIGN ISIN (NON US).          
000001* PDX    - ACAT11DB C0308008 03/10/11 09:08:20 TBLAMUR            00001000
LRM029* SSR 74535 READ FOR DUPE ASSET DELIVERY.                                 
000001* PDX    - ACAT11DB C0302589 10/26/10 10:48:14 TBLAMUR            00001000
LRM028* SSR 70666 SAVE AUDIT COLS WHEN USER MANUALLY SUBMITS ASSETS.            
000001* PDX    - ACAT11DB C0289853 01/05/10 13:52:07 TBLAMUR            00001000
LRM027* SSR 59603 OPTION SYMBOLOGY CHANGES.                                     
LRM026*   REMOVE TCICSRJE AND TCICSQUA HARD CODING.                             
000001* PDX    - ACAT11DB C0286335 10/30/09 07:23:21 TBLAMUR            00001000
LRM026* SSR 59603 OPTION SYMBOLOGY CHANGES.                                     
LRM026*   TCICSRJE AND TCICSQUA HARD CODE AT THIS TIME.                         
LRM026*   CHANGE ASSET DESC FORMATTING ON ADDITIONAL MSD LINES.                 
LRM026*   USE EXPANDED STRIKE PRICE FROM MSD.                                   
LRM026*   CHANGE SYMBOL TO MSD-OCC-OPTN-SYM-ID AND IF MISSING,                  
LRM026*   CALL MSD FOR ROOT SYMBOL.                                             
000001* PDX    - ACAT11DB C0272581 12/08/08 11:56:45 TBLAMUR                    
LRM025* SSR# 66164 ALLOW INITIATION WITH FUND COMPANY PRT-TYPE = 3,             
LRM025*      AND CUST-TYPE SS ON PTF.                                           
000001* PDX    - ACAT11DB C0263391 06/23/08 08:54:55 TBLAMUR            00001000
LRM023* SSR# 55766 ASCENDIS INTERFACE. WIPE ACK_IND ON UPDATE.                  
000001* PDX    - ACAT11DB C0266453 06/19/08 11:12:23 TBLAMUR            00001000
LRM024* SSR# 56200 POPULATE WHEN-ISSUE FROM CUSHOL, NOT CONTRA RQST.            
LRM024*     MATCH REQUESTED ASSET TO CUSHOL AND SUMMARIZE WHI ASSETS.           
000001* PDX    - ACAT11DB C0241643 11/22/06 09:02:26 TBLAMUR            00001000
LRM022* SSR# 47505 DO NOT ALLOW SAME ASSET DLVY ON SAME TRANSFER                
000001* PDX    - ACAT11DB C0240732 10/23/06 10:04:26 TBLAMUR            00001000
LRM021* SSR# 49202 ADD GIFT IND ON PTD                                          
000001* PDX    - ACAT11DB C0238544 08/24/06 08:17:39 TBLAMUR            00001000
LRM019* SSR# 45145 ADD REJECT TOO LATE WARNING                                  
000001* PDX    - ACAT11DB C0231507 07/07/06 16:05:14 TBLAMUR            00001000
LRM017* SSR# 45744 BLOCK DELIVERY BASED ON ACCOUNT FREEZE                       
LRM017* CREATE ONE MEMO (OF EACH OF THE FOUR FREEZE TYPES) WHICH HAD            
LRM017* AN ELIGABLE FULFILLMENT THAT WAS BLOCKED.                               
LRM017* SSR# 40661 RETAIN USER ID OF INITIATOR.                                 
000001* PDX    - ACAT11DB C0229888 02/27/06 10:41:36 TBLAMUR            00001000
LRM016* SSR# 41120 ALLOW SCROLLING THRU PTDS ON ACTIVE TABLES.                  
000001* PDX    - ACAT11DB C0227932 12/22/05 16:17:08 TBLAMUR            00001000
LRM015* SSR# 45207 DISPLAY FULL CASH REQUEST AS "FULL" OR "FULL-"               
000001* PDX    - ACAT11DB C0225533 10/10/05 11:11:23 TBLAMUR            00001000
LRM013* SSR 0043083 SUPPORT FULL ASSET REQUEST.                                 
000001* PDX    - ACAT11DB C0223543 08/25/05 11:55:32 TBLAMUR            00001000
LRM012* SSR 0031687 CORRECT OPTION SYMBOL WHEN ADDING OPTIONS.                  
000001* PDX    - ACAT11DB C0216396 06/17/05 13:55:55 TBLAMUR            00001000
LRM009* SSR# 0039557 DISPLAY PTR WITH EXCEPTIONS ONLY FROM MEMU.                
LRM008* SSR# 0039561 PHASE II DISPLAY PTR IN BR/AC SEQUENCE.                    
LRM008* ADD COMMENT BANNER.  QUALIFY CONTROL NUMBER ON UPDATES DUE TO           
LRM008* DUPLICATE PTR REQUESTS; THESE MAY BE REJECTED OR FULFILLED.             
LRM007* ALLOW DUPLICATE PTD ENTRY.                                              
000001* PDX    - ACAT11DB C0215192 01/18/05 09:21:17 TBLAMUR            00001000
LRM007* SSR# 40042 USE NEW INITIAL TABLES / PHASE II.                           
000001* PDX    - ACAT11DB C0215952 01/18/05 08:10:26 TBLAMUR            00001000
LRM006* SSR 0039561 CORRECT MONEY BALANCE RE-DISPLAY ON PTD.                    
000001* PDX    - ACAT11DB C0213985 01/03/05 11:02:37 TBLAMUR            00001000
LRM005* SSR 0039561 PHASE-II HANDLE PERCENTAGE CASH REQUEST.                    
000001* PDX    - ACAT11DB C0211781 10/11/04 10:01:21 TBLAMUR            00001000
LRM004* PMR 2294717 MARGIN TYPE 2 FULFILLMENT AND BAL TYPE=5 CREDIT BUG         
LRM004*             DO NOT FULFILL SETTLE LOC 45 REQUESTED ASSETS               
000001* PDX    - ACAT11DB C0205792 09/08/04 07:58:41 TBLAMUR            00001000
LRM003* SSR 0038232 PF4 TO NO LONGER INITIATE PTD REPONSE; CREATE               
LRM003*        -  DLVY SIDE "ADD" ASSETS TO EXISTING PTR MEMO TIF               
LRM003*        -  AND NSCC WILL CONVERT THIS TO STTS 200 (REAL TIF).            
LRM003*        -  CREATE REJECT REQUEST ON ACTITRF.                             
LRM003*        -  MEMO MODE - SUM DUPE CASH REQUESTS FOR SCROLL PROBLEM         
LRM003*        -  DLVY / FULFILLMENT - SUM DUPE ASSETS OR CASH FOR -803         
LRM003*        -      LIMIT TO T/D BAL AND QTY                                  
LRM002* SSR 0030395 USER INPUT SETTLE LOC 50 AND SETTLE LOC RSN                 
LRM002* SSR 0024802 CORRECT OPTION CATEGORY AND BUILD ACTIOPN                   
000001* PDX    - ACAT11DB C0182233 02/14/03 11:58:08 TBLAMUR            00001000
LRM001* SSR 0029711 USE MARGIN REWRITE FILES                                    
000001* PDX    - ACAT11DB C0174072 06/04/02 14:38:55 TBLAMUR            00001000
000001* PDX    - ACAT11DB C0164523 09/26/01 09:04:24 TBLAMUR            00001000
000001* PDX    - ACAT11DB C0156118 06/04/01 12:18:21 TBDOJUN            00001000
000001* LRM    CHANGES                                                  00001000
000001* PDX    - ACAT11DB C0147438 11/03/00 12:23:30 TBLAMUR            00001000
000001* PDX    - ACAT11DB C0124874 08/24/99 10:46:18 TBLAMUR            00001000
000001* PDX    - ACAT11DB C0121428 02/11/99 10:34:10 TBLAMUR            00001000
000001* PDX    - ACAT11DB C0120327 01/25/99 19:11:20 TBLAMUR            00001000
000001* PDX    - ACAT11DB C0119861 01/14/99 15:55:58 TBLAMUR            00001000
000001* PDX    - ACAT11DB C0119769 01/06/99 10:24:40 TBLAMUR            00001000
000001* PDX    - ACAT11DB C0109165 10/08/98 08:37:58 TBLAMUR            00001000
       IDENTIFICATION DIVISION.                                         00010000
       PROGRAM-ID.    ACAT11DB.                                         00020000
       AUTHOR.        LARRY MUREY.                                      00030000
       DATE-WRITTEN.                                                    00040000
       DATE-COMPILED.                                                   00050000
      *---------------------------------------------------------------* 00060000
      *   THIS IS THE ACATS I/O MODULE FOR DB/2 DATABASE ACCESS       * 00070000
      *   FOR INITIAL PARTIAL TRANSFER (DELIVERER).                   * 00070000
      *   THIS PROGRAM WAS MODELLED FROM ACAT03DB.                    * 00070000
      ***************************************************************** 00290000
       ENVIRONMENT DIVISION.                                            00420000
                                                                        00430000
       DATA DIVISION.                                                   00440000
                                                                        00450000
       WORKING-STORAGE SECTION.                                         00460000
       COPY PDXIDCOB.                                                   00120002
       01  FILLER                          PIC X(60)                    00470000
           VALUE 'ACAT11DB WORKING STORAGE BEGINS HERE'.                00480000
       77  WS-ACATSRCH                    PIC X(08) VALUE 'ACATSRCH'.   00140002
       77  WS-CALC-PRICE                  PIC S9(9)V9(7) COMP-3.                
       77  WS-CALC-POSN-QTY               PIC S9(12)V9(5) COMP-3.       MRGIML03
       77  WS-CALC-POSN-AMT               PIC S9(15)V9(2) COMP-3.       MRGIML03
LRM003 77  WS-CASH-AMT                    PIC S9(15)V9(2) COMP-3.       MRGIML03
LRM003 77  WS-STTLM-RSN-CD                PIC X(4).                     MRGIML03
LRM003 77  WS-CMNT-TXT                    PIC X(120).                           
LRM003 77  WS-PSTN-CD                     PIC X.                                
LRM003 77  WS-NSCC-PEND-CD                PIC X.                                
LRM008 77  WS-STTS-CD                     PIC X(3) VALUE '%%%'.                 
LRM032 77  WS-MRGRLBB                     PIC X(08) VALUE 'MRGRLBB '.           
LRM032 77  WS-ACATRST                     PIC X(08) VALUE 'ACATRST '.           
                                                                        00490000
           SKIP3                                                        00540000
       01  WS-ABEND-MESSAGE.                                            00550000
           05  FILLER                      PIC X(24) VALUE                      
             'ACAT11DB DETECTED ABEND'.                                         
           05  WS-ABCODE                   PIC X(04) VALUE 'XXXX'.              
                                                                                
       01  WS-ERRL-DATA.                                                        
           05  REQUEST-TYPE                PIC X(01).                           
               88  WRITE-ERROR-TO-LOG          VALUE 'W'.                       
           05  CALLING-TRAN-ID             PIC X(04).                           
           05  CALLING-PROGRAM-ID          PIC X(08).                           
           05  SQLCA-AREA                  PIC X(136).                          
       01  WS-WORK-AREA.                                                        
           05  WS-MRGN-POSN-QTY-TYPE1   PIC S9(12)V9(5) COMP-3 VALUE +0.        
           05  WS-MRGN-POSN-QTY-TYPE2   PIC S9(12)V9(5) COMP-3 VALUE +0.        
           05  WS-MRGN-POSN-QTY-TYPE5   PIC S9(12)V9(5) COMP-3 VALUE +0.        
           05  WS-MRGN-POSN-MV-TYPE1      PIC S9(17)    COMP-3 VALUE +0.        
           05  WS-MRGN-POSN-MV-TYPE2      PIC S9(17)    COMP-3 VALUE +0.        
           05  WS-MRGN-POSN-MV-TYPE5      PIC S9(17)    COMP-3 VALUE +0.        
00314      05  UNPK-TYPE.                                               MRGIPS05
00315          10  FILLER                 PIC 9 VALUE ZERO.             MRGIPS05
00316          10  WK-PS-TYPE             PIC X VALUE ZERO.             MRGIPS05
           05  B1-CARD-OPTION             PIC X.                                
           05  REAL-CODE                  PIC 99 VALUE 0.               MRGIPS05
           05  WS-99-MEMO-SUBS-AREA.                                            
LRM            09  WS-99-MEMO-SUB OCCURS 18 TIMES PIC 99.                       
           05  WS-TIMESTAMP                PIC X(26).                           
           05  WS-BRANCH                   PIC X(3)  VALUE SPACES.              
           05  WS-EIBCALEN                 PIC S9(8) COMP.                      
           05  WS-PTR-RECORDS-INSERTED     PIC S9(9) COMP VALUE +0.             
           05  ERR-MSG.                                                         
               09  ERR-EIBDS               PIC X(8)  VALUE SPACES.              
               09  ERR-MSG2                PIC X(70) VALUE SPACES.              
           05  WS-RETRY-INSERT-ASSET-SW    PIC X     VALUE 'N'.                 
               88 RETRY-INSERT-MODE                  VALUE 'Y'.                 
               88 NO-RETRY-INSERT-MODE               VALUE 'N'.                 
LRM003     05  PTR-DLVY-ASSET-FND-SW       PIC X     VALUE 'N'.                 
LRM003         88 PTR-DLVY-ASSET-NOTFND              VALUE 'N'.                 
LRM003         88 PTR-DLVY-ASSET-FOUND               VALUE 'Y'.                 
LRM009     05  PTR-EXCEPTION-FOUND-SW      PIC X     VALUE 'N'.                 
LRM009         88 EXCEPTION-FOUND                    VALUE 'Y'.                 
LRM009         88 EXCEPTION-NOTFND                   VALUE 'N'.                 
           05  WS-MRGN-BAL-TYPE1          PIC S9(15)V99 COMP-3 VALUE +0.        
           05  WS-MRGN-BAL-TYPE2          PIC S9(15)V99 COMP-3 VALUE +0.        
           05  WS-MRGN-BAL-TYPE5          PIC S9(15)V99 COMP-3 VALUE +0.        
LRM008     05  WS-ASSET-CMNT-FND-SW        PIC X     VALUE 'N'.                 
LRM008         88  WS-ASSET-CMNT-FND                 VALUE 'Y'.                 
LRM007     05  WS-NEXT-CNTL-NBR            PIC 9(3)  VALUE  001.                
LRM007     05  WS-TRANS-RFRN-ID-CD         PIC X(20).                           
LRM007     05  SUB                         PIC S9(3) COMP-3.                    
                                                                                
LRM017     05  WS-SEC-LONG-FRZ-MEMO-CREATED      PIC X VALUE 'N'.       MRGIPS05
LRM017         88  SEC-LONG-FREEZE-MEMO-CREATED        VALUE 'Y'.       MRGIPS05
LRM017     05  WS-CREATE-SEC-LONG-FREEZE-MEMO    PIC X VALUE 'N'.       MRGIPS05
LRM017         88  CREATE-SEC-LONG-FREEZE-MEMO         VALUE 'Y'.       MRGIPS05
                                                                                
LRM017     05  WS-SEC-SHORT-FRZ-MEMO-CREATED     PIC X VALUE 'N'.       MRGIPS05
LRM017         88  SEC-SHORT-FREEZE-MEMO-CREATED       VALUE 'Y'.       MRGIPS05
LRM017     05  WS-CREATE-SEC-SHORT-FREEZ-MEMO    PIC X VALUE 'N'.       MRGIPS05
LRM017         88  CREATE-SEC-SHORT-FREEZE-MEMO        VALUE 'Y'.       MRGIPS05
                                                                                
LRM017     05  WS-CASH-CR-FRZ-MEMO-CREATED       PIC X VALUE 'N'.       MRGIPS05
LRM017         88  CASH-CR-FREEZE-MEMO-CREATED         VALUE 'Y'.       MRGIPS05
LRM017     05  WS-CREATE-CASH-CR-FREEZE-MEMO     PIC X VALUE 'N'.       MRGIPS05
LRM017         88  CREATE-CASH-CR-FREEZE-MEMO          VALUE 'Y'.       MRGIPS05
                                                                                
LRM017     05  WS-CASH-DB-FRZ-MEMO-CREATED       PIC X VALUE 'N'.       MRGIPS05
LRM017         88  CASH-DB-FREEZE-MEMO-CREATED         VALUE 'Y'.       MRGIPS05
LRM017     05  WS-CREATE-CASH-DB-FREEZE-MEMO     PIC X VALUE 'N'.       MRGIPS05
LRM017         88  CREATE-CASH-DB-FREEZE-MEMO          VALUE 'Y'.       MRGIPS05
                                                                                
LRM017     05  WS-CASH-FREEZE-CR-MSG      PIC X(30) VALUE                       
LRM017                              'ACCOUNT IS FROZEN FOR CASH OUT'.           
LRM017     05  WS-CASH-FREEZE-DB-MSG      PIC X(30) VALUE                       
LRM017                              'ACCOUNT IS FROZEN FOR CASH IN'.            
LRM017     05  WS-SEC-FREEZE-LONG-MSG     PIC X(30) VALUE                       
LRM017                              'ACCOUNT IS FROZEN FOR SEC OUT'.            
LRM017     05  WS-SEC-FREEZE-SHORT-MSG    PIC X(30) VALUE                       
LRM017                              'ACCOUNT IS FROZEN FOR SEC IN'.             
LRM029     05  WS-DUPE-CNTL-NBR            PIC X(14) VALUE SPACES.              
LRM029     05  WS-SEL-DLVR-ACCT            PIC X(20) VALUE SPACES.      09180000
LRM029     05  WS-SEL-CSH-MGN-CD           PIC X     VALUE 'C'.         09180000
LRM029     05  END-OF-ACTIVE-TRANSFERS-SW  PIC X     VALUE 'N'.                 
LRM029     05  END-OF-ACTIAST-TRANSFERS-SW PIC X     VALUE 'N'.                 
LRM029     05  WS-DUPE-RCV-NBR             PIC X(04) VALUE SPACES.      09180000
LRM029     05  WS-DUPE-DLVR-ACCT           PIC X(20) VALUE SPACES.      09180000
LRM029     05  WS-DUPE-ACCT-RCV-NBR        PIC X(20) VALUE SPACES.      09180000
LRM029     05  WS-DUPE-RCV-ACCT-TYPE-CD    PIC X(02) VALUE SPACES.      09180000
LRM029     05  WS-DUPE-TRNFR-TYPE-CD       PIC X(03) VALUE SPACES.      09180000
LRM029     05  WS-DUPE-STTLM-LCTN-CD       PIC X(02) VALUE SPACES.      09180000
CSG001*                                                                         
CSG001     05  WS-EDIT-ASSET-DESC-TXT-AREA.                                     
CSG001         10 WS-SUB1                       PIC S9(03) COMP-3.              
CSG001         10 WS-ASSET-DESC-TXT.                                            
CSG001            15 WS-ASSET-DESC1-TXT         PIC X(30) VALUE SPACES.         
CSG001            15 WS-ASSET-DESC2-TXT         PIC X(30) VALUE SPACES.         
CSG001            15 WS-ASSET-DESC3-TXT         PIC X(30) VALUE SPACES.         
CSG001            15 WS-ASSET-DESC4-TXT         PIC X(30) VALUE SPACES.         
CSG001            15 WS-ASSET-DESC5-TXT         PIC X(20) VALUE SPACES.         
CSG001         10 WS-ASSET-DESC-TMP             PIC X(30) VALUE SPACES.         
CSG001         10 WS-JUST-LEFT-FLAG             PIC X(01).                      
CSG001            88 WS-JUST-LEFT-DONE          VALUE 'Y'.                      
CSG001            88 WS-JUST-LEFT-NOT-DONE      VALUE 'N'.                      
CSG001         10 WS-EDIT-ASSET-DESC-TXT-FLAG   PIC X(01).                      
CSG001            88 WS-EDIT-ASSET-DESC-TXT-Y   VALUE 'Y'.                      
CSG001            88 WS-EDIT-ASSET-DESC-TXT-N   VALUE 'N'.                      
                                                                                
       01  WS-PTR-ORIG-RQST-AMT-MSG        PIC X(19) VALUE SPACES.              
       01  FILLER REDEFINES WS-PTR-ORIG-RQST-AMT-MSG.                           
           05  WS-PTR-ORIG-RQST-AMT        PIC $$$,$$$,$$$,$$$.99-.             
       01  FILLER REDEFINES WS-PTR-ORIG-RQST-AMT-MSG.                           
           05  WS-PTR-ORIG-RQST-QTY-LIT    PIC X(01).                           
           05  WS-PTR-ORIG-RQST-QTY        PIC ZZZZZZZZZZZ.99999-.              
       01  FILLER REDEFINES WS-PTR-ORIG-RQST-AMT-MSG.                           
           05  WS-PTR-ORIG-RQST-PCT        PIC ZZZ.99999.                       
           05  WS-PTR-ORIG-RQST-PCT-LIT    PIC X(01).                           
                                                                                
LRM002 01  WK-OPTION-FILEDS.                                                    
LRM002     05  WK-MS-CLASS.                                                     
LRM002         10  WK-MS-CLASS-1       PIC 9.                                   
LRM002         10  WK-MS-CLASS-2-5     PIC 9(4).                                
LRM002         10  WK-MS-CLASS-6-7     PIC 9(2).                                
LRM002     05  FILLER                  REDEFINES WK-MS-CLASS.                   
LRM002         10  WK-MS-CLASS-1-2-3   PIC 9(3).                                
LRM002         10  WK-MS-CLASS-4       PIC 9.                                   
LRM002         10  WK-MS-CLASS-5-7     PIC 9(3).                                
LRM002     05  FILLER                  REDEFINES WK-MS-CLASS.                   
LRM002         10  FILLER              PIC 9.                                   
LRM002         10  WK-MS-CLASS-2       PIC 9.                                   
LRM002         10  WK-MS-CLASS-3-4     PIC 9(2).                                
LRM002         10  WK-MS-CLASS-5       PIC 9.                                   
LRM002         10  WK-MS-CLASS-6       PIC 9.                                   
LRM002         10  WK-MS-CLASS-7       PIC 9.                                   
LRM002     05  FILLER                  REDEFINES WK-MS-CLASS.                   
LRM002         10  WK-MS-CLASS-1-2     PIC 9(2).                                
LRM002         10  FILLER              PIC 9(2).                                
LRM002         10  WK-MS-CLASS-5-6-7   PIC 9(3).                                
LRM002     05  FILLER                  REDEFINES WK-MS-CLASS.                   
LRM002         10  FILLER              PIC 9(3).                                
LRM002         10  WK-MS-CLASS-4-5     PIC 9(2).                                
LRM002         10  FILLER              PIC 9(2).                                
LRM002     05  WK-MS-SEC-TYPE-P        PIC 9(5)   COMP-3  VALUE 0.              
LRM002     05  FILLER                  REDEFINES WK-MS-SEC-TYPE-P.              
LRM002         10  WK-MS-SEC-TYPE-X    PIC X(2).                                
LRM002         10  FILLER              PIC 9.                                   
LRM002     05  WK-MS-SEC-TYPE-N        PIC 9(5)   VALUE 0.                      
LRM002     05  FILLER                  REDEFINES WK-MS-SEC-TYPE-N.              
LRM002         10  WK-MS-SEC-TYPE      PIC 9(4).                                
LRM002         10  FILLER              PIC 9.                                   
LRM002     05  WK-MS-ASSET-TYPE        PIC X         VALUE '0'.                 
LRM002         88  WK-MS-NON-OPT       VALUE '0'.                               
LRM002         88  WK-MS-EQUITY-OPT    VALUE '1'.                               
LRM002         88  WK-MS-NON-EQU-OPT   VALUE '2'.                               
LRM002     05  W-DATE.                                                          
LRM002         07  W-DATE-YEAR.                                                 
LRM002             09  W-DATE-CC         PIC X(2) VALUE ' '.                    
LRM002             09  W-DATE-YY         PIC X(2) VALUE ' '.                    
LRM002         07  FILLER                PIC X(1) VALUE '-'.                    
LRM002         07  W-DATE-MM             PIC X(2) VALUE ' '.                    
LRM002         07  FILLER                PIC X(1) VALUE '-'.                    
LRM002         07  W-DATE-DD             PIC X(2) VALUE ' '.                    
LRM002     05  WK-MS-DESC1                           VALUE SPACE.               
LRM002         10  WK-MS-PUT-CALL      PIC X(4).                                
LRM002         10  FILLER              PIC X(26).                               
LRM002     05  WK-MS-DESC2             PIC X(30)     VALUE SPACE.               
LRM002     05  WK-MS-DESC3             PIC X(30)     VALUE SPACE.               
LRM002     05  WK-MS-CLOSING-PRICE     PIC 9(4)V9(7) COMP-3 VALUE ZERO.         
LRM002     05  WK-POS-DESC4            PIC X(30)     VALUE SPACE.               
LRM002     05  WK-POS-DESC5.                                                    
LRM002         10  FILLER              PIC X(08) VALUE 'ADP-SEC:'.              
LRM002         10  WK-POS-DESC5-SEC    PIC X(07) VALUE ' '.                     
LRM002         10  WK-POS-DESC5-FIL    PIC X(05) VALUE ' '.                     
LRM002     05  WK-MS-EXP-DATE          PIC 9(8)      VALUE ZERO.                
LRM002     05  FILLER                  REDEFINES WK-MS-EXP-DATE.                
LRM002         10  FILLER              PIC 9(3).                                
LRM002         10  WK-MS-EXP-Y         PIC X(1).                                
LRM002         10  WK-MS-EXP-MM        PIC X(2).                                
LRM002         10  FILLER              PIC 9(2).                                
LRM026     05  FILLER REDEFINES WK-MS-EXP-DATE.                                 
LRM026         10  WK-MS-EXP-CC-NEW    PIC X(2).                                
LRM026         10  WK-MS-EXP-YY-NEW    PIC X(2).                                
LRM026         10  WK-MS-EXP-MM-NEW    PIC X(2).                                
LRM026         10  WK-MS-EXP-DD-NEW    PIC X(2).                                
LRM002     05  WK-MS-OPT-MMY                         VALUE ZERO.                
LRM002         10  WK-MS-OPT-MM        PIC X(2).                                
LRM002         10  WK-MS-OPT-Y         PIC X(1).                                
LRM002     05  WK-MS-OPT-PRICE         PIC S9(4)V9(5) VALUE ZERO.               
LRM002     05  FILLER                  REDEFINES WK-MS-OPT-PRICE.               
LRM002         10  WK-MS-OPT-PRC       PIC 9(4).                                
LRM002         10  WK-MS-OPT-FRAC      PIC 9(5).                                
LRM002     05  WK-MS-OPT-FRAC-6        PIC 9(6) VALUE ZEROS.                    
LRM002     05  FILLER REDEFINES    WK-MS-OPT-FRAC-6.                            
LRM002         10  WK-MS-OPT-FRAC-1    PIC 9.                                   
LRM002         10  FILLER              PIC 9(5).                                
LRM026     05  WK-MS-OPT-PRICE-NEW     PIC S9(5)V9(3) VALUE ZERO.               
LRM026     05  FILLER                  REDEFINES WK-MS-OPT-PRICE-NEW.           
LRM026         10  WK-MS-OPT-PRC-NEW   PIC 9(5).                                
LRM026         10  WK-MS-OPT-FRAC-NEW  PIC 9(3).                                
LRM026     05  WS-REGION-NAME          PIC X(08) VALUE SPACES.                  
LRM002     05  WK-MS-OPT-DECI-ROUNDED  PIC 9(2).                                
LRM002     05  WK-MS-OPTION-FACTOR     PIC S9(3)V9(4)  COMP-3.                  
LRM002     05  W-STPRC-INTEGER-AMT       PIC 9(05).                             
LRM002     05  W-STPRC-FRCTN.                                                   
LRM002         07  W-STPRC-FRCTN-AMT     PIC 9(02).                             
LRM002     05  W-OPT-DESC.                                                      
LRM002         07  W-OPT-BUY-SELL        PIC X(04) VALUE ' '.                   
LRM002         07  FILLER                PIC X(01) VALUE ' '.                   
LRM002         07  W-OPT-CALL-PUT        PIC X(04) VALUE ' '.                   
LRM002         07  FILLER                PIC X(01) VALUE ' '.                   
LRM002         07  W-OPT-OPEN-CLOSE      PIC X(04) VALUE ' '.                   
LRM002         07  FILLER                PIC X(01) VALUE ' '.                   
LRM002         07  W-OPT-SYMBOL          PIC X(06) VALUE ' '.                   
LRM002         07  FILLER                PIC X(01) VALUE ' '.                   
LRM002         07  W-OPT-MS-SYMBOL       PIC X(08) VALUE ' '.                   
LRM002         07  FILLER                PIC X(01) VALUE ' '.                   
LRM002         07  W-OPT-EXPTN-MM        PIC X(02) VALUE ' '.                   
LRM002         07  W-OPT-EXPTN-S1        PIC X(01) VALUE ' '.                   
LRM002         07  W-OPT-EXPTN-CC        PIC X(02) VALUE ' '.                   
LRM002         07  W-OPT-EXPTN-YY        PIC X(02) VALUE ' '.                   
LRM002         07  FILLER                PIC X(02) VALUE ' '.                   
LRM002         07  W-OPT-STRIKE-PRIC     PIC ZZZZ9.                             
LRM002         07  FILLER                PIC X(01) VALUE ' '.                   
LRM002         07  W-OPT-STRIKE-FRAC     PIC X(01) VALUE ' '.                   
LRM002         07  W-OPT-SLASH-8         PIC X(02) VALUE ' '.                   
LRM002         07  FILLER                PIC X(11) VALUE ' '.                   
LRM026     05  W-OPT-DESC-NEW REDEFINES W-OPT-DESC.                             
LRM026         07  FILLER                PIC X(22).                             
LRM026         07  W-OPT-UNDLY-SYMBOL    PIC X(06).                             
LRM026         07  FILLER                PIC X(02).                             
LRM026         07  W-OPT-EXPTN-MM-NEW    PIC X(02).                             
LRM026         07  W-OPT-EXPTN-S1-NEW    PIC X(01).                             
LRM026         07  W-OPT-EXPTN-DD-NEW    PIC X(02).                             
LRM026         07  W-OPT-EXPTN-S2-NEW    PIC X(01).                             
LRM026         07  W-OPT-EXPTN-YY-NEW    PIC X(02).                             
LRM026         07  FILLER                PIC X(01).                             
LRM026         07  W-OPT-STRIKE-PRIC-NEW PIC ZZZZ9.                             
LRM026         07  FILLER                PIC X(01).                             
LRM026         07  W-OPT-STRIKE-FRAC-NEW PIC X(03).                             
LRM026         07  FILLER                PIC X(12).                             
LRM002 01  OPT-WORK-AREA.                                                       
LRM002     05  SUB2               PIC 9(03).                                    
LRM002     05  SUB3               PIC 9(03).                                    
LRM002     05  OPT-SYMBOL         PIC X(03).                                    
LRM002     05  OPTION-SYMBOL   REDEFINES OPT-SYMBOL                             
LRM002                            PIC X(01) OCCURS 3 TIMES.                     
LRM002     05  OPTION-SYMBOL1     PIC X(01) OCCURS 3 TIMES.                     
LRM002     05  OPT-WORK1          PIC X(12).                                    
LRM002     05  OPT-WORK2   REDEFINES  OPT-WORK1.                                
LRM002       10  OPT-WORK3        PIC X(01) OCCURS 12 TIMES.                    
LRM002     05  WK-MS-SYMBOL-9                        VALUE ' '.                 
LRM002         10  WK-MS-SYMBOL        PIC X(6).                                
LRM002         10  WK-FILLER           PIC X(3).                                
                                                                                
LRM032 01  WS-BDF-SECURITY-TABLE.                                               
LRM032     03  WS-BDF-COUNT        PIC 9(02).                                   
LRM032     03  WS-BDF-SEC-ENTRY OCCURS 10 TIMES PIC X(07).                      
LRM032 01  LB-BANK-COMM-AREA.                                                   
LRM032     COPY LBBCOMM.                                                        
LRM032 01  ACATRSTIO-CALL-AREA.                                                 
LRM032     COPY ACATRSIO.                                                       
00342      EJECT                                                        MRGIPS05
LRM001*01  MRGN-COMMAREA.                                               MRGIPS05
LRM001**** COPY  IOCOMALP.                                              MRGIPS05
LRM001 01  HOLIO-COMM-AREA.                                             MRGIPS05
LRM001     COPY  CUSHOLIO REPLACING ==:IO:== BY ==IO==.                 MRGIPS05
00345      SKIP3                                                        MRGIPS05
00346 ******************************************************************MRGIPS05
00347 *           FOLLOWING THREE(3) KEYS ARE USED FOR :               *MRGIPS05
00348 *  1) PSKEY IS USED THE SAME WAY AS IF IT REDEFINED THE          *MRGIPS05
00349 *      IO-HOL-KEY, IT IS USED TO HOLD CONTENTES OF IO-HOL-KEY    *MRGIPS05
00350 *      DURRING VALIDATION.                                       *MRGIPS05
00351 *  2)  SAVEKEY IS USED TO HOLD THE CURRENT KEY THAT IS BEEING    *MRGIPS05
00352 *        LOOKED AT.                                              *MRGIPS05
00353 *  3)  TEMPKEY IS USED TO HOLD CHLD-KEY DURRING VALIDATCIO, AND  *MRGIPS05
00354 *        REFLECTS CHLD-KEY DURRING EXECUTION.                    *MRGIPS05
00355 ******************************************************************MRGIPS05
00356  01  PSKEY.                                                       MRGIPS05
00357      03  MAIN-PSKEY.                                              MRGIPS05
00358          05  MAIN-KEY.                                            MRGIPS05
00359              10  KEY-CLIENT                    PIC 9(05) COMP-3.  MRGIPS05
00360              10  KEY-BRANCH                    PIC X(03).         MRGIPS05
00361              10  KEY-ACCNT                     PIC X(05).         MRGIPS05
00362          05  KEY-CURCOD.                                          MRGIPS05
00363              10  KEY-CURR-CODE                 PIC 9(6).          MRGIPS05
00364          05  KEY-REC-TYPE                  PIC X(02).             MRGIPS05
00365      03  KEY-ACCNT-TYPE.                                          MRGIPS05
00366          05  ZERO-ACCNT                PIC 9.                     MRGIPS05
00367          05  PS-ACCNT-TYPE             PIC X.                     MRGIPS05
00368      03  KEY-ACCOUNT-TYPE-NUM REDEFINES                           MRGIPS05
00368            KEY-ACCNT-TYPE              PIC 99.                    MRGIPS05
00371      03  KEY-CUSIP-NUM                 PIC X(15).                 MRGIPS05
00372      03  KEY-WIC-KEY                   PIC X(01).                 MRGIPS05
00372      03  FILLER                        PIC X(01) VALUE SPACES.    MRGIPS05
00373      03  KEY-SEQ-KEY                   PIC 9(04).                 MRGIPS05
00374      SKIP3                                                        MRGIPS05
00375  01  SAVEKEY.                                                     MRGIPS05
00376      03  MAIN-SAVKEY.                                             MRGIPS05
00377          05  SVKEY.                                               MRGIPS05
00377              10  SAV-KEY.                                         MRGIPS05
00378                  15  SAV-CLIENT        PIC 9(05) COMP-3.          MRGIPS05
00379                  15  SAV-BRANCH        PIC X(03).                 MRGIPS05
00380                  15  SAV-ACCNT         PIC X(05).                 MRGIPS05
00381              10  SAV-CURCOD.                                      MRGIPS05
00382                  15  SAV-CURR-CODE     PIC 9(6).                  MRGIPS05
00383          05  SAV-REC-TYPE              PIC X(02).                 MRGIPS05
00384      03  SAV-ACCNT-TYPE                PIC X(02).                 MRGIPS05
00385      03  SAV-ACCOUNT-TYPE-NUM REDEFINES                           MRGIPS05
00386          SAV-ACCNT-TYPE                PIC 9(02).                 MRGIPS05
00387      03  SAV-CUSIP-NUM                 PIC X(15).                 MRGIPS05
00388      03  SAV-WIC-KEY                   PIC X(01).                 MRGIPS05
00388      03  FILLER                        PIC X(01) VALUE SPACES.    MRGIPS05
00389      03  SAV-SEQ-KEY                   PIC 9(04).                 MRGIPS05
00390  01  TEMPKEY.                                                     MRGIPS05
00391      03  MAIN-TEMPKEY.                                            MRGIPS05
00392          05  TMPKEY.                                              MRGIPS05
00392              10  TEMP-KEY.                                        MRGIPS05
00393                  15  TEMP-CLIENT        PIC 9(05) COMP-3.         MRGIPS05
00394                  15  TEMP-BRANCH        PIC X(03).                MRGIPS05
00395                  15  TEMP-ACCNT         PIC X(05).                MRGIPS05
00396              10  TEMP-CURCOD.                                     MRGIPS05
00397                  15  TEMP-CURR-CODE     PIC 9(6).                 MRGIPS05
00398          05  TEMP-REC-TYPE              PIC X(02).                MRGIPS05
00399      03  TEMP-ACCNT-TYPE                PIC X(02).                MRGIPS05
00400      03  TEMP-ACCOUNT-TYPE-NUM REDEFINES                          MRGIPS05
00401          TEMP-ACCNT-TYPE.                                         MRGIPS05
00402          05  FILLER                     PIC 9.                    MRGIPS05
00403          05  TEMP-ACC-TYPE              PIC 9.                    MRGIPS05
00404      03  TEMP-CUSIP-NUM.                                          MRGIPS05
00405          05  TEMP-SEC                   PIC X(7).                 MRGIPS05
00406          05  FILLER                     PIC X(8).                 MRGIPS05
00407      03  TEMP-WIC-KEY                   PIC X(01).                MRGIPS05
00407      03  FILLER                         PIC X(01) VALUE SPACES.   MRGIPS05
00408      03  TEMP-SEQ-KEY                   PIC 9(04).                MRGIPS05
                                                                                
LRM003 01  CUSBALIO-COMM-AREA.                                                  
LRM003     COPY  CUSBALIO REPLACING ==:IO:== BY ==IOB==.                        
LRM003 01  WS-BALNC-KEY.                                                        
LRM003     05  WS-BALNC-CLIENT                   PIC 9(5) COMP-3.               
LRM003     05  WS-BALNC-BRANCH                   PIC X(3).                      
LRM003     05  WS-BALNC-ACCOUNT                  PIC X(05).                     
LRM003     05  WS-BALNC-ID                       PIC 9(02) VALUE 28.            
LRM003     05  WS-BALNC-CURR                     PIC 9(06).                     
       EJECT                                                                    
                                                                                
       01  WS-COMMAREA.                                                         
           COPY ACAT11IO.                                               01510000
                                                                                
           EJECT                                                                
       COPY ACATSRCH.                                                   01360002
           EJECT                                                                
LRM002 COPY MSDIOCE.                                                            
           EJECT                                                                
CSG001/                                                                         
CSG001******************************************************************        
CSG001* ACATS VALID CHARACTER SET FROM "ACATS USER GUIDE (SECTION 19)" *        
CSG001******************************************************************        
CSG001 01  FILLER                        PIC X(08) VALUE 'CATVCHAR'.            
CSG001     COPY CATVCHAR.                                                       
CSG001     EJECT                                                                
CSG001/                                                                         
           EXEC SQL                                                             
           INCLUDE SQLCA                                                        
           END-EXEC                                                             
      *DCLGEN FOR INITIAL ACAT TRANSFER                                         
014700     EXEC SQL                                                     01400000
               INCLUDE ACTITRF                                          01410000
014900     END-EXEC.                                                    01420000
015000*                                                                 01430000
      *DCLGEN FOR INITIAL ACAT ASSET                                            
014700     EXEC SQL                                                     01400000
               INCLUDE ACTIAST                                          01410000
014900     END-EXEC.                                                    01420000
LRM002*DCLGEN FOR INITIAL OPTION                                                
LRM002     EXEC SQL                                                     01400000
LRM002         INCLUDE ACTIOPN                                          01410000
LRM002     END-EXEC.                                                    01420000
015000*                                                                 01430000
      *DCLGEN FOR ACTIVE ACAT TRANSFER                                          
           EXEC SQL                                                     01400000
               INCLUDE VTRNFR                                           01410000
           END-EXEC.                                                    01420000
015000*                                                                 01430000
      *DCLGEN FOR ACTIVE ACAT ASSET                                             
           EXEC SQL                                                     01400000
               INCLUDE VASSET                                           01410000
           END-EXEC.                                                    01420000
015000*                                                                 01430000
      *--------------------------------------------------------*                
      *   TFR CURSRA: FOR THE NEXT PTD /CLIENT/BRANCH/ACCOUNT  *                
      *--------------------------------------------------------*                
           EXEC SQL                                                             
              DECLARE TFRCSRA CURSOR FOR                                        
                  SELECT                                                        
                   RCV_NBR                                              09180000
                  ,ACCT_RCV_NBR                                         09180000
                  ,DLVR_NBR                                             09180000
                  ,ACCT_DLVR_NBR                                        09180000
                  ,RCV_ACCT_TYPE_CD                                             
                  ,ACAT_CONTROL_NBR                                             
                  ,TRNFR_TYPE_CD                                                
                  ,RCV_CUST_NM                                                  
                  ,RCV_SS_PRIM_NBR                                      09150000
                  ,RCV_SS_SCNDY_NBR                                             
                  ,CMNT_TXT                                                     
                  ,NSCC_PEND_CD                                                 
                  ,NSCC_ACK_IND                                                 
                  ,RR_CD                                                        
                  ,UPDT_TMSTP                                                   
LRM006            ,STTS_CD                                                      
LRM021            ,GIFT_IND                                                     
                   FROM ACTITRF                                         09170000
                  WHERE (CLIENT_NBR                                     09180000
                              = :ACAT11IO-CLIENT-NBR                    09190000
                     AND   DLVR_NBR                                     09180000
                              = :ACAT11IO-DLVR-NBR                      09190000
                     AND TRNFR_TYPE_CD                                  09180000
LRM025                        = :ACAT11IO-TRNFR-TYPE-CD                         
                     AND DSTBN_SIDE_CD = 'D'                                    
LRM008               AND STTS_CD LIKE :WS-STTS-CD                               
                     AND (ACCT_DLVR_NBR                                         
                              > :ACAT11IO-DLVR-ACCT                             
                     OR  (ACCT_DLVR_NBR                                         
                              = :ACAT11IO-DLVR-ACCT                             
                     AND RCV_NBR                                                
                              > :ACAT11IO-RCV-NBR)                              
                     OR  (ACCT_DLVR_NBR                                         
                              = :ACAT11IO-DLVR-ACCT                             
                     AND RCV_NBR                                                
                              = :ACAT11IO-RCV-NBR                               
                     AND ACCT_RCV_NBR                                           
                              > :ACAT11IO-RCV-ACCT)                             
LRM007               OR  (ACCT_DLVR_NBR                                         
LRM007                        = :ACAT11IO-DLVR-ACCT                             
LRM007               AND RCV_NBR                                                
LRM007                        = :ACAT11IO-RCV-NBR                               
LRM007               AND ACCT_RCV_NBR                                           
LRM007                        = :ACAT11IO-RCV-ACCT                              
LRM007               AND ACAT_CONTROL_NBR                                       
LRM007                        > :ACAT11IO-CONTROL-NBR)))                        
                  ORDER BY                                                      
                     ACCT_DLVR_NBR                                              
                    ,RCV_NBR                                                    
                    ,ACCT_RCV_NBR                                               
LRM007              ,ACAT_CONTROL_NBR                                           
           END-EXEC.                                                            
           EJECT                                                                
      *---------------------------------------------------------*               
      *   TFR CURSR1: FOR PREV PTD  CLIENT/BRANCH/ACCOUNT       *               
      *---------------------------------------------------------*               
           EXEC SQL                                                             
              DECLARE TFRCSR1 CURSOR FOR                                        
                  SELECT                                                        
                   RCV_NBR                                              09180000
                  ,ACCT_RCV_NBR                                         09180000
                  ,DLVR_NBR                                             09180000
                  ,ACCT_DLVR_NBR                                        09180000
                  ,RCV_ACCT_TYPE_CD                                             
                  ,ACAT_CONTROL_NBR                                             
                  ,TRNFR_TYPE_CD                                                
                  ,RCV_CUST_NM                                                  
                  ,RCV_SS_PRIM_NBR                                      09150000
                  ,RCV_SS_SCNDY_NBR                                             
                  ,CMNT_TXT                                                     
                  ,NSCC_PEND_CD                                                 
                  ,NSCC_ACK_IND                                                 
                  ,RR_CD                                                        
                  ,UPDT_TMSTP                                                   
LRM006            ,STTS_CD                                                      
LRM021            ,GIFT_IND                                                     
                   FROM ACTITRF                                         09170000
                  WHERE (CLIENT_NBR                                     09180000
                              = :ACAT11IO-CLIENT-NBR                    09190000
                     AND   DLVR_NBR                                     09180000
                              = :ACAT11IO-DLVR-NBR                      09190000
                     AND TRNFR_TYPE_CD                                  09180000
LRM025                        = :ACAT11IO-TRNFR-TYPE-CD                 09190000
                     AND DSTBN_SIDE_CD = 'D'                                    
                     AND (ACCT_DLVR_NBR                                         
                              < :ACAT11IO-DLVR-ACCT                             
                     OR  (ACCT_DLVR_NBR                                         
                              = :ACAT11IO-DLVR-ACCT                             
                     AND RCV_NBR                                                
                              < :ACAT11IO-RCV-NBR)                              
                     OR  (ACCT_DLVR_NBR                                         
                              = :ACAT11IO-DLVR-ACCT                             
                     AND RCV_NBR                                                
                              = :ACAT11IO-RCV-NBR                               
                     AND ACCT_RCV_NBR                                           
                              < :ACAT11IO-RCV-ACCT)                             
LRM007               OR  (ACCT_DLVR_NBR                                         
LRM007                        = :ACAT11IO-DLVR-ACCT                             
LRM007               AND RCV_NBR                                                
LRM007                        = :ACAT11IO-RCV-NBR                               
LRM007               AND ACCT_RCV_NBR                                           
LRM007                        = :ACAT11IO-RCV-ACCT                              
LRM007               AND ACAT_CONTROL_NBR                                       
LRM007                        < :ACAT11IO-CONTROL-NBR)))                        
                  ORDER BY                                                      
                    ACCT_DLVR_NBR   DESC                                09180000
                   ,RCV_NBR         DESC                                        
                   ,ACCT_RCV_NBR    DESC                                        
LRM007             ,ACAT_CONTROL_NBR DESC                                       
           END-EXEC.                                                            
           EJECT                                                                
      *--------------------------------------------------------*                
      *   TFR CURSRS: FOR THE NEXT INITIAL ASSET               *                
      *--------------------------------------------------------*                
           EXEC SQL                                                             
              DECLARE  TFRCSRS CURSOR FOR                                       
                  SELECT                                                        
                   ISIN_CNTRY_CD                                        09180000
                  ,ISIN_SEC_ISSUE_CD                                    09180000
                  ,ISIN_SEC_CDG_CD                                      09180000
                  ,STTLM_LCTN_CD                                        09180000
                  ,STTLM_RSN_CD                                         09180000
                  ,CSH_MGN_SHRT_CD                                      09180000
                  ,ASSET_PRC_CTGY_CD                                            
                  ,ASSET_RQST_QTY_CD                                            
                  ,AST_RQST_TRANS_CD                                            
                  ,WHI_CD                                                       
LRM048            ,WHI_STTS_CD                                                  
                  ,PSTN_CD                                                      
                  ,ASSET_DESC_TXT                                               
                  ,ASSET_AMT                                                    
                  ,ASSET_QTY                                                    
                  ,ASSET_PCT                                                    
                  ,ASSET_CMNT_TXT                                               
                  ,SECURITY_ADP_NBR                                             
LRM003            ,NSCC_PEND_CD                                                 
LRM008            ,NSCC_WTHLD_CD                                                
                   FROM ACTIAST                                         09170000
                  WHERE  CLIENT_NBR                                     09180000
                              = :ACAT11IO-CLIENT-NBR                    09190000
                     AND RCV_NBR                                        09180000
                              = :ACAT11IO-RCV-NBR                       09190000
                     AND ACCT_RCV_NBR                                   09180000
                              = :ACAT11IO-RCV-ACCT                      09190000
                     AND DLVR_NBR                                       09180000
                              = :ACAT11IO-DLVR-NBR                      09190000
                     AND ACCT_DLVR_NBR                                  09180000
                              = :ACAT11IO-DLVR-ACCT                     09190000
LRM003               AND TRNFR_TYPE_CD                                          
LRM003                        = :ACAT11IO-TRNFR-TYPE-CD                         
LRM009               AND ACAT_CONTROL_NBR                               09180000
LRM009                        = :ACAT11IO-CONTROL-NBR                           
                     AND NOT STTLM_LCTN_CD                                      
                              =  '40'                                           
                     AND NOT STTLM_RSN_CD                               09180000
                              = 'SMA '                                  09190000
                     AND (ISIN_SEC_ISSUE_CD >                           09180000
                           :ACAT11IO-CURRENT-SECR                               
                     OR (ISIN_SEC_ISSUE_CD =                            09180000
                           :ACAT11IO-CURRENT-SECR                               
                       AND STTLM_LCTN_CD   =                            09180000
                            :ACAT11IO-CURRENT-SLOC                              
                       AND CSH_MGN_SHRT_CD   >                          09180000
                            :ACAT11IO-CURRENT-TYPE)                             
                     OR (ISIN_SEC_ISSUE_CD =                            09180000
                           :ACAT11IO-CURRENT-SECR                               
                       AND STTLM_LCTN_CD   >                            09180000
                            :ACAT11IO-CURRENT-SLOC))                            
                  ORDER BY                                                      
                    ISIN_CNTRY_CD                                       09180000
SEC                ,ISIN_SEC_ISSUE_CD                                   09180000
                   ,ISIN_SEC_CDG_CD                                     09180000
SLOC               ,STTLM_LCTN_CD                                       09180000
TYPE               ,CSH_MGN_SHRT_CD                                     09180000
           END-EXEC.                                                            
      *--------------------------------------------------------*                
      *   TFR CURSRSA: FOR THE NEXT ACTIVE ASSET.              *                
      *--------------------------------------------------------*                
           EXEC SQL                                                             
              DECLARE  TFRCSRSA CURSOR FOR                                      
                  SELECT                                                        
                    ASSET_SEQ_NBR                                               
                   ,CONTROL_NBR_STS_CD                                          
                   ,DLVR_NBR_STTS_CD                                            
                   ,RCV_NBR_STTS_CD                                             
                   ,SBMTG_PRTCP_NBR                                             
                   ,SBMT_PRT_NR_STS_CD                                          
                   ,AST_SEQ_NBR_STS_CD                                          
                   ,SYS_ACT_CD                                                  
                   ,SYS_RJCT_RSN_CD                                             
                   ,TRANS_TYPE_CD                                               
                   ,TRANS_TYPE_STTS_CD                                          
                   ,PHSCL_SEQ_NBR                                               
                   ,PHSCL_SEQ_STTS_CD                                           
                   ,LGCL_SEQ_NBR                                                
                   ,LGCL_SEQ_NR_STS_CD                                          
                   ,ASSET_PRC_CTGY_CD                                           
                   ,AST_PRC_CTG_STS_CD                                          
                   ,STTLM_LCTN_CD                                               
                   ,STTLM_LCTN_STTS_CD                                          
                   ,STTLM_RSN_CD                                                
                   ,STTLM_RSN_STTS_CD                                           
                   ,ISIN_CNTRY_CD                                               
                   ,ISIN_CNTRY_STTS_CD                                          
                   ,ISIN_SEC_ISSUE_CD                                           
                   ,ISIN_SEC_IS_STS_CD                                          
                   ,ISIN_SEC_CDG_CD                                             
                   ,ISIN_SEC_CD_STS_CD                                          
                   ,ASSET_DESC_TXT                                              
                   ,ASSET_DESC_STTS_CD                                          
                   ,ASSET_RQST_QTY_CD                                           
                   ,ASSET_RQST_STS_CD                                           
                   ,AST_RQST_TRANS_CD                                           
                   ,AST_RQ_TRAN_STS_CD                                          
                   ,ASSET_QTY                                                   
                   ,ASSET_QTY_STTS_CD                                           
                   ,ASSET_PCT                                                   
                   ,ASSET_PCT_STTS_CD                                           
                   ,PSTN_CD                                                     
                   ,PSTN_CD_STTS_CD                                             
                   ,ISO_CRNCY_CD                                                
                   ,ISO_CRNCY_STTS_CD                                           
                   ,ASSET_AMT                                                   
                   ,ASSET_AMT_STTS_CD                                           
                   ,BEARER_BOND_CD                                              
                   ,BEARER_BND_STTS_CD                                          
                   ,CSH_MGN_SHRT_CD                                             
                   ,CSH_MRG_SHT_STS_CD                                          
                   ,WHI_CD                                                      
                   ,WHI_STTS_CD                                                 
                   ,TRNFR_TYPE_RSN_CD                                           
                   ,TRN_TYP_RSN_STS_CD                                          
                   ,MBS_SERIAL_NBR                                              
                   ,MBS_SERIAL_STTS_CD                                          
                   ,ASSET_CMNT_TXT                                              
                   ,ASSET_CMNT_STTS_CD                                          
                   ,NSCC_ACK_IND                                                
                   ,NSCC_PEND_CD                                                
                   ,FAIL_SENT_CAGE_IND                                          
                   ,FAIL_OPEN_CAGE_IND                                          
                   ,NSCC_NON_ADP_IND                                            
                   ,TRANS_RFRN_ID_CD                                            
                   ,TRANS_RFRN_STTS_CD                                          
                   ,OPTN_CTGY_CD                                                
                   ,OPTN_CTGY_STTS_CD                                           
                   ,RCRD_LNGTH_STTS_CD                                          
                   ,RCRD_STTS_CD                                                
                   ,ISIN_SEC_EXCPT_IND                                          
                   ,CRT_TMSTP                                                   
                   ,UPDT_TMSTP                                                  
                   ,CICS_TERM_ID_CD                                             
                   ,PRGM_NM                                                     
                   ,SECURITY_ADP_NBR                                            
                   ,RCL_SENT_NSCC_IND                                           
                   ,FRV_SENT_NSCC_IND                                           
                   ,TRNFR_TYPE_CD                                               
                   FROM VASSET                                          09170000
                  WHERE  CLIENT_NBR                                     09180000
                              = :ACAT11IO-CLIENT-NBR                    09190000
                     AND ACAT_CONTROL_NBR                               09180000
                              = :ACAT11IO-CONTROL-NBR                           
                     AND ASSET_SEQ_NBR                                          
                              > :ACAT11IO-ASSET-SEQ-NBR                         
                     AND NOT STTLM_LCTN_CD                                      
                              =  '40'                                           
                     AND NOT STTLM_RSN_CD                               09180000
                              = 'SMA '                                  09190000
                  ORDER BY                                                      
                     ASSET_SEQ_NBR                                              
           END-EXEC.                                                            
           EJECT                                                                
      *--------------------------------------------------------*                
      *   TFR VASSET_CRSR: FOR ALL ACTIVE ASSETS INCLUDING CASH                 
      *--------------------------------------------------------*                
           EXEC SQL                                                             
              DECLARE VASSET_CRSRX CURSOR FOR                                   
                  SELECT                                                        
                    ASSET_SEQ_NBR                                               
                   ,CONTROL_NBR_STS_CD                                          
                   ,DLVR_NBR_STTS_CD                                            
                   ,RCV_NBR_STTS_CD                                             
                   ,SBMTG_PRTCP_NBR                                             
                   ,SBMT_PRT_NR_STS_CD                                          
                   ,AST_SEQ_NBR_STS_CD                                          
                   ,SYS_ACT_CD                                                  
                   ,SYS_RJCT_RSN_CD                                             
                   ,TRANS_TYPE_CD                                               
                   ,TRANS_TYPE_STTS_CD                                          
                   ,PHSCL_SEQ_NBR                                               
                   ,PHSCL_SEQ_STTS_CD                                           
                   ,LGCL_SEQ_NBR                                                
                   ,LGCL_SEQ_NR_STS_CD                                          
                   ,ASSET_PRC_CTGY_CD                                           
                   ,AST_PRC_CTG_STS_CD                                          
                   ,STTLM_LCTN_CD                                               
                   ,STTLM_LCTN_STTS_CD                                          
                   ,STTLM_RSN_CD                                                
                   ,STTLM_RSN_STTS_CD                                           
                   ,ISIN_CNTRY_CD                                               
                   ,ISIN_CNTRY_STTS_CD                                          
                   ,ISIN_SEC_ISSUE_CD                                           
                   ,ISIN_SEC_IS_STS_CD                                          
                   ,ISIN_SEC_CDG_CD                                             
                   ,ISIN_SEC_CD_STS_CD                                          
                   ,ASSET_DESC_TXT                                              
                   ,ASSET_DESC_STTS_CD                                          
                   ,ASSET_RQST_QTY_CD                                           
                   ,ASSET_RQST_STS_CD                                           
                   ,AST_RQST_TRANS_CD                                           
                   ,AST_RQ_TRAN_STS_CD                                          
                   ,ASSET_QTY                                                   
                   ,ASSET_QTY_STTS_CD                                           
                   ,ASSET_PCT                                                   
                   ,ASSET_PCT_STTS_CD                                           
                   ,PSTN_CD                                                     
                   ,PSTN_CD_STTS_CD                                             
                   ,ISO_CRNCY_CD                                                
                   ,ISO_CRNCY_STTS_CD                                           
                   ,ASSET_AMT                                                   
                   ,ASSET_AMT_STTS_CD                                           
                   ,BEARER_BOND_CD                                              
                   ,BEARER_BND_STTS_CD                                          
                   ,CSH_MGN_SHRT_CD                                             
                   ,CSH_MRG_SHT_STS_CD                                          
                   ,WHI_CD                                                      
                   ,WHI_STTS_CD                                                 
                   ,TRNFR_TYPE_RSN_CD                                           
                   ,TRN_TYP_RSN_STS_CD                                          
                   ,MBS_SERIAL_NBR                                              
                   ,MBS_SERIAL_STTS_CD                                          
                   ,ASSET_CMNT_TXT                                              
                   ,ASSET_CMNT_STTS_CD                                          
                   ,NSCC_ACK_IND                                                
                   ,NSCC_PEND_CD                                                
                   ,FAIL_SENT_CAGE_IND                                          
                   ,FAIL_OPEN_CAGE_IND                                          
                   ,NSCC_NON_ADP_IND                                            
                   ,TRANS_RFRN_ID_CD                                            
                   ,TRANS_RFRN_STTS_CD                                          
                   ,OPTN_CTGY_CD                                                
                   ,OPTN_CTGY_STTS_CD                                           
                   ,RCRD_LNGTH_STTS_CD                                          
                   ,RCRD_STTS_CD                                                
                   ,ISIN_SEC_EXCPT_IND                                          
                   ,CRT_TMSTP                                                   
                   ,UPDT_TMSTP                                                  
                   ,CICS_TERM_ID_CD                                             
                   ,PRGM_NM                                                     
                   ,SECURITY_ADP_NBR                                            
                   ,RCL_SENT_NSCC_IND                                           
                   ,FRV_SENT_NSCC_IND                                           
                   ,TRNFR_TYPE_CD                                               
                   FROM VASSET                                          09170000
                  WHERE  CLIENT_NBR                                     09180000
                              = :ACAT11IO-CLIENT-NBR                    09190000
                     AND ACAT_CONTROL_NBR                               09180000
                              = :ACAT11IO-CONTROL-NBR                           
                  ORDER BY                                                      
                     ASSET_SEQ_NBR                                              
           END-EXEC.                                                            
           EJECT                                                                
      *--------------------------------------------------------*                
      *   TFR CURSR4: FOR THE PREV ASSET.                      *                
      *--------------------------------------------------------*                
           EXEC SQL                                                             
              DECLARE  TFRCSR4 CURSOR FOR                                       
                  SELECT                                                        
                   ISIN_CNTRY_CD                                        09180000
                  ,ISIN_SEC_ISSUE_CD                                    09180000
                  ,ISIN_SEC_CDG_CD                                      09180000
                  ,STTLM_LCTN_CD                                        09180000
                  ,STTLM_RSN_CD                                         09180000
                  ,CSH_MGN_SHRT_CD                                      09180000
                  ,ASSET_PRC_CTGY_CD                                            
                  ,ASSET_RQST_QTY_CD                                            
                  ,AST_RQST_TRANS_CD                                            
                  ,WHI_CD                                                       
LRM048            ,WHI_STTS_CD                                                  
                  ,PSTN_CD                                                      
                  ,ASSET_DESC_TXT                                               
                  ,ASSET_AMT                                                    
                  ,ASSET_QTY                                                    
                  ,ASSET_PCT                                                    
                  ,ASSET_CMNT_TXT                                               
                  ,SECURITY_ADP_NBR                                             
LRM003            ,NSCC_PEND_CD                                                 
LRM008            ,NSCC_WTHLD_CD                                                
                   FROM ACTIAST                                         09170000
                  WHERE  CLIENT_NBR                                     09180000
                              = :ACAT11IO-CLIENT-NBR                    09190000
                     AND RCV_NBR                                        09180000
                              = :ACAT11IO-RCV-NBR                       09190000
                     AND ACCT_RCV_NBR                                   09180000
                              = :ACAT11IO-RCV-ACCT                      09190000
                     AND DLVR_NBR                                       09180000
                              = :ACAT11IO-DLVR-NBR                      09190000
                     AND ACCT_DLVR_NBR                                  09180000
                              = :ACAT11IO-DLVR-ACCT                     09190000
LRM003               AND TRNFR_TYPE_CD                                          
LRM003                        = :ACAT11IO-TRNFR-TYPE-CD                         
LRM009               AND ACAT_CONTROL_NBR                               09180000
LRM009                        = :ACAT11IO-CONTROL-NBR                           
                     AND NOT STTLM_LCTN_CD                                      
                              =  '40'                                           
                     AND NOT STTLM_RSN_CD                               09180000
                              = 'SMA '                                  09190000
                     AND (ISIN_SEC_ISSUE_CD <                           09180000
                           :ACAT11IO-CURRENT-SECR                               
                     OR (ISIN_SEC_ISSUE_CD =                            09180000
                           :ACAT11IO-CURRENT-SECR                               
                       AND STTLM_LCTN_CD   =                            09180000
                            :ACAT11IO-CURRENT-SLOC                              
                       AND CSH_MGN_SHRT_CD   <                          09180000
                            :ACAT11IO-CURRENT-TYPE)                             
                     OR (ISIN_SEC_ISSUE_CD =                            09180000
                           :ACAT11IO-CURRENT-SECR                               
                       AND STTLM_LCTN_CD   <                            09180000
                            :ACAT11IO-CURRENT-SLOC))                            
                  ORDER BY                                                      
                    ISIN_CNTRY_CD      DESC                             09180000
SEC                ,ISIN_SEC_ISSUE_CD  DESC                             09180000
                   ,ISIN_SEC_CDG_CD    DESC                             09180000
SLOC               ,STTLM_LCTN_CD      DESC                             09180000
TYPE               ,CSH_MGN_SHRT_CD    DESC                             09180000
           END-EXEC.                                                            
      *--------------------------------------------------------*                
      *   TFR CURSR4A: FOR THE PREV ACTIVE ASSET.              *                
      *--------------------------------------------------------*                
           EXEC SQL                                                             
              DECLARE  TFRCSR4A CURSOR FOR                                      
                  SELECT                                                        
                    ASSET_SEQ_NBR                                               
                   ,CONTROL_NBR_STS_CD                                          
                   ,DLVR_NBR_STTS_CD                                            
                   ,RCV_NBR_STTS_CD                                             
                   ,SBMTG_PRTCP_NBR                                             
                   ,SBMT_PRT_NR_STS_CD                                          
                   ,AST_SEQ_NBR_STS_CD                                          
                   ,SYS_ACT_CD                                                  
                   ,SYS_RJCT_RSN_CD                                             
                   ,TRANS_TYPE_CD                                               
                   ,TRANS_TYPE_STTS_CD                                          
                   ,PHSCL_SEQ_NBR                                               
                   ,PHSCL_SEQ_STTS_CD                                           
                   ,LGCL_SEQ_NBR                                                
                   ,LGCL_SEQ_NR_STS_CD                                          
                   ,ASSET_PRC_CTGY_CD                                           
                   ,AST_PRC_CTG_STS_CD                                          
                   ,STTLM_LCTN_CD                                               
                   ,STTLM_LCTN_STTS_CD                                          
                   ,STTLM_RSN_CD                                                
                   ,STTLM_RSN_STTS_CD                                           
                   ,ISIN_CNTRY_CD                                               
                   ,ISIN_CNTRY_STTS_CD                                          
                   ,ISIN_SEC_ISSUE_CD                                           
                   ,ISIN_SEC_IS_STS_CD                                          
                   ,ISIN_SEC_CDG_CD                                             
                   ,ISIN_SEC_CD_STS_CD                                          
                   ,ASSET_DESC_TXT                                              
                   ,ASSET_DESC_STTS_CD                                          
                   ,ASSET_RQST_QTY_CD                                           
                   ,ASSET_RQST_STS_CD                                           
                   ,AST_RQST_TRANS_CD                                           
                   ,AST_RQ_TRAN_STS_CD                                          
                   ,ASSET_QTY                                                   
                   ,ASSET_QTY_STTS_CD                                           
                   ,ASSET_PCT                                                   
                   ,ASSET_PCT_STTS_CD                                           
                   ,PSTN_CD                                                     
                   ,PSTN_CD_STTS_CD                                             
                   ,ISO_CRNCY_CD                                                
                   ,ISO_CRNCY_STTS_CD                                           
                   ,ASSET_AMT                                                   
                   ,ASSET_AMT_STTS_CD                                           
                   ,BEARER_BOND_CD                                              
                   ,BEARER_BND_STTS_CD                                          
                   ,CSH_MGN_SHRT_CD                                             
                   ,CSH_MRG_SHT_STS_CD                                          
                   ,WHI_CD                                                      
                   ,WHI_STTS_CD                                                 
                   ,TRNFR_TYPE_RSN_CD                                           
                   ,TRN_TYP_RSN_STS_CD                                          
                   ,MBS_SERIAL_NBR                                              
                   ,MBS_SERIAL_STTS_CD                                          
                   ,ASSET_CMNT_TXT                                              
                   ,ASSET_CMNT_STTS_CD                                          
                   ,NSCC_ACK_IND                                                
                   ,NSCC_PEND_CD                                                
                   ,FAIL_SENT_CAGE_IND                                          
                   ,FAIL_OPEN_CAGE_IND                                          
                   ,NSCC_NON_ADP_IND                                            
                   ,TRANS_RFRN_ID_CD                                            
                   ,TRANS_RFRN_STTS_CD                                          
                   ,OPTN_CTGY_CD                                                
                   ,OPTN_CTGY_STTS_CD                                           
                   ,RCRD_LNGTH_STTS_CD                                          
                   ,RCRD_STTS_CD                                                
                   ,ISIN_SEC_EXCPT_IND                                          
                   ,CRT_TMSTP                                                   
                   ,UPDT_TMSTP                                                  
                   ,CICS_TERM_ID_CD                                             
                   ,PRGM_NM                                                     
                   ,SECURITY_ADP_NBR                                            
                   ,RCL_SENT_NSCC_IND                                           
                   ,FRV_SENT_NSCC_IND                                           
                   ,TRNFR_TYPE_CD                                               
                   FROM VASSET                                          09170000
                  WHERE  CLIENT_NBR                                     09180000
                              = :ACAT11IO-CLIENT-NBR                    09190000
                     AND ACAT_CONTROL_NBR                               09180000
                              = :ACAT11IO-CONTROL-NBR                           
                     AND ASSET_SEQ_NBR                                          
                              < :ACAT11IO-ASSET-SEQ-NBR                         
                     AND NOT STTLM_LCTN_CD                                      
                              =  '40'                                           
                     AND NOT STTLM_RSN_CD                               09180000
                              = 'SMA '                                  09190000
                  ORDER BY                                                      
                     ASSET_SEQ_NBR DESC                                         
           END-EXEC.                                                            
           EJECT                                                                
LRM003*---------------------------------------------------------------*         
LRM003*  TFR CURSOR_CASH: USED TO SUMMARIZE MULTI CASH REQUEST ON PTR           
LRM003*---------------------------------------------------------------*         
LRM003     EXEC SQL                                                     09140000
LRM003        DECLARE CURSOR_CASH CURSOR FOR                                    
LRM003            SELECT                                                        
LRM003             ASSET_AMT                                                    
LRM003            ,ASSET_CMNT_TXT                                               
LRM003            ,STTLM_RSN_CD                                                 
LRM003            ,ASSET_CMNT_TXT                                               
LRM003           FROM VASSET                                            09170000
LRM003            WHERE (CLIENT_NBR                                     09180000
LRM003                        = :ACAT11IO-CLIENT-NBR                    09190000
LRM003               AND ACAT_CONTROL_NBR                               09180000
LRM003                        = :ACAT11IO-CONTROL-NBR                           
LRM003               AND ISIN_CNTRY_CD                                  09180000
LRM003                        = '  '                                    09190000
LRM003               AND ISIN_SEC_ISSUE_CD                              09180000
LRM003                        = '         '                             09190000
LRM003               AND STTLM_LCTN_CD                                  09180000
LRM003                        = '40'                                    09190000
LRM003               AND CSH_MGN_SHRT_CD                                09180000
LRM003                        = :DCLVASSET.CSH-MGN-SHRT-CD)             09190000
LRM003      END-EXEC.                                                   09200000
           EJECT                                                                
      *--------------------------------------------------------*                
      *   TFR CURSRAA: FOR THE SPECIFIED PTD ON ACTIVE.        *                
      *--------------------------------------------------------*                
           EXEC SQL                                                             
              DECLARE TFRCSRAA CURSOR FOR                                       
                  SELECT                                                        
                   DLVR_NBR                                             09180000
                  ,ACCT_DLVR_NBR                                        09180000
                  ,RCV_ACCT_TYPE_CD                                             
                  ,ACAT_CONTROL_NBR                                             
                  ,TRNFR_TYPE_CD                                                
                  ,RCV_CUST_NM                                                  
                  ,RCV_SS_PRIM_NBR                                      09150000
                  ,RCV_SS_SCNDY_NBR                                             
                  ,CMNT_TXT                                                     
                  ,NSCC_PEND_CD                                                 
                  ,NSCC_ACK_IND                                                 
                  ,RR_CD                                                        
                  ,STTS_CD                                                      
                  ,RCV_OCC_BRKR_NBR                                             
LRM003            ,STTLM_DT                                                     
LRM017            ,ACCT_FRZN_IND                                                
LRM019            ,STTLM_TM_CD                                                  
LRM021            ,GIFT_IND                                                     
                   FROM VTRNFR                                          09170000
                  WHERE (CLIENT_NBR                                     09180000
                              = :ACAT11IO-CLIENT-NBR                    09190000
                     AND RCV_NBR                                        09180000
                              = :ACAT11IO-RCV-NBR                       09190000
                     AND ACCT_RCV_NBR                                   09180000
                              = :ACAT11IO-RCV-ACCT                      09190000
                     AND TRNFR_TYPE_CD                                  09180000
LRM025                        = :ACAT11IO-TRNFR-TYPE-CD                 09190000
                     AND DSTBN_SIDE_CD = 'D'                                    
                     AND DLVR_NBR                                       09180000
                              = :ACAT11IO-DLVR-ACCT                     09190000
                     AND ACCT_DLVR_NBR                                  09180000
                              = :ACAT11IO-DLVR-ACCT                     09190000
                     AND NOT STTS_CD = '140'                                    
                     AND NOT STTS_CD = '600')                                   
           END-EXEC.                                                            
           EJECT                                                                
LRM029*-----------------------------------------------------------*             
LRM029*   TFR CURSOR FOR DUPE FOR THE SPECIFIED ASSET ON ACTIAST  *             
LRM029*-----------------------------------------------------------*             
           EXEC SQL                                                             
              DECLARE ACTIAST_DUPE CURSOR FOR                                   
                SELECT                                                  09170000
                   RCV_NBR                                              09180000
                  ,ACCT_DLVR_NBR                                        09180000
                  ,ACCT_RCV_NBR                                         09180000
                  ,ACAT_CONTROL_NBR                                             
                  ,TRNFR_TYPE_CD                                                
                  ,STTLM_LCTN_CD                                                
                  FROM ACTIAST                                                  
                WHERE (                                                         
                   CLIENT_NBR      =   :ACAT11IO-CLIENT-NBR             09180000
               AND DLVR_NBR        =   :ACAT11IO-DLVR-NBR               09150000
               AND ACCT_DLVR_NBR LIKE  :WS-SEL-DLVR-ACCT                09180000
               AND SECURITY_ADP_NBR =  :ACAT11IO-ADP-NBR                        
               AND CSH_MGN_SHRT_CD  =  :ACAT11IO-CSH-MGN-SHRT-CD        09180000
               AND NOT STTLM_LCTN_CD = '45'                                     
                 )                                                      09150000
                  FOR READ ONLY WITH UR                                         
           END-EXEC.                                                    09200000
LRM029*-----------------------------------------------------------*             
LRM029*   TFR CURSOR FOR DUPE FOR THE SPECIFIED CASH ON ACTIAST   *             
LRM029*-----------------------------------------------------------*             
           EXEC SQL                                                             
              DECLARE ACTIASTC_DUPE CURSOR FOR                                  
                SELECT                                                  09170000
                   RCV_NBR                                              09180000
                  ,ACCT_DLVR_NBR                                        09180000
                  ,ACCT_RCV_NBR                                         09180000
                  ,ACAT_CONTROL_NBR                                             
                  ,TRNFR_TYPE_CD                                                
                  FROM ACTIAST                                                  
                WHERE (                                                         
                   CLIENT_NBR      =   :ACAT11IO-CLIENT-NBR             09180000
               AND DLVR_NBR        =   :ACAT11IO-DLVR-NBR               09150000
               AND ACCT_DLVR_NBR LIKE  :WS-SEL-DLVR-ACCT                09180000
               AND CSH_MGN_SHRT_CD  =  :WS-SEL-CSH-MGN-CD               09180000
               AND STTLM_LCTN_CD = '40'                                         
               AND NOT ACAT_CONTROL_NBR = :ACAT11IO-CONTROL-NBR                 
                 )                                                      09150000
                  FOR READ ONLY WITH UR                                         
           END-EXEC.                                                    09200000
LRM029*-----------------------------------------------------------*             
LRM029*   TFR CURSOR FOR DUPE FOR THE SPECIFIED ACCOUNT ON ACTIVE *             
LRM029*-----------------------------------------------------------*             
           EXEC SQL                                                             
              DECLARE TFRCSR_DUPE CURSOR FOR                                    
                SELECT                                                          
                   ACAT_CONTROL_NBR                                             
                  FROM VTRNFR                                           09170000
                  WHERE (CLIENT_NBR                                     09180000
                              = :ACAT11IO-CLIENT-NBR                    09190000
                     AND DSTBN_SIDE_CD = 'D'                                    
                     AND DLVR_NBR                                       09180000
                              = :ACAT11IO-DLVR-NBR                      09190000
                     AND ACCT_DLVR_NBR LIKE  :WS-SEL-DLVR-ACCT          09180000
                     AND NOT STTS_CD = '140'                                    
                     AND NOT STTS_CD = '600'                                    
                     AND NOT ACAT_CONTROL_NBR = :ACAT11IO-CONTROL-NBR           
                 )                                                      09150000
                                                                                
                  FOR READ ONLY WITH UR                                         
           END-EXEC.                                                            
           EJECT                                                                
      *--------------------------------------------------------*                
      *   TFR CURSRAR: FOR THE NEXT PTR ON ACTIVE BY BR/AC     *                
      *--------------------------------------------------------*                
           EXEC SQL                                                             
              DECLARE CSR_NXT_ACT_PTR CURSOR FOR                                
                  SELECT                                                        
                   DLVR_NBR                                             09180000
                  ,ACCT_DLVR_NBR                                        09180000
                  ,RCV_NBR                                              09180000
                  ,ACCT_RCV_NBR                                         09180000
                  ,RCV_ACCT_TYPE_CD                                             
                  ,ACAT_CONTROL_NBR                                             
                  ,TRNFR_TYPE_CD                                                
                  ,RCV_CUST_NM                                                  
                  ,RCV_SS_PRIM_NBR                                      09150000
                  ,RCV_SS_SCNDY_NBR                                             
                  ,CMNT_TXT                                                     
                  ,NSCC_PEND_CD                                                 
                  ,NSCC_ACK_IND                                                 
                  ,RR_CD                                                        
                  ,ACCT_RJCT_RSBM_IND                                           
                  ,TRNFR_TYPE_RJCT_CD                                           
                  ,STTS_CD                                                      
                  ,RCV_OCC_BRKR_NBR                                             
LRM003            ,ACCT_ACTIVITY_IND                                            
LRM003            ,ACCT_ORDERS_IND                                              
LRM003            ,ACCT_DB_BAL_T1_IND                                           
LRM003            ,ACCT_MRGN_DB_IND                                             
LRM003            ,ACCT_SHRT_PSTN_IND                                           
LRM003            ,ACCT_SEC_RSTRD_IND                                           
LRM003            ,ACCT_AST_EXCS_IND                                            
LRM003            ,ACCT_OPTN_PSTN_IND                                           
LRM003            ,ACCT_LTD_PRTNR_IND                                           
LRM003            ,ACCT_TIN_MSMTH_IND                                           
LRM003            ,ACCT_DPLCT_TRN_IND                                           
LRM003            ,ACCT_CUST_70_IND                                             
LRM003            ,ACCT_QULFD_PLN_IND                                           
LRM003            ,ACCT_MNGD_IND                                                
LRM003            ,ACCT_PRVT_RNG_IND                                            
LRM003            ,ACCT_BRKR_TIF_IND                                            
LRM003            ,NSCC_NON_ADP_IND                                             
LRM003            ,CMNT_STTS_CD                                                 
LRM003            ,TRNFR_TYPE_RJC1_CD                                           
LRM003            ,TRNFR_TYPE_RJC2_CD                                           
LRM003            ,ACCT_RB_SEC_IND                                              
LRM003            ,ACCT_CLT_RSCND_IND                                           
LRM003            ,ACCT_LGL_BLK_IND                                             
LRM003            ,STTLM_DT                                                     
LRM017            ,ACCT_FRZN_IND                                                
LRM019            ,STTLM_TM_CD                                                  
                   FROM VTRNFR                                          09170000
                  WHERE (CLIENT_NBR                                     09180000
                              = :ACAT11IO-CLIENT-NBR                    09190000
                     AND TRNFR_TYPE_CD                                  09180000
                              = 'PTR'                                   09190000
                     AND DSTBN_SIDE_CD = 'D'                                    
LRM008               AND (ACCT_DLVR_NBR                                 09180000
LRM008                        > :ACAT11IO-DLVR-ACCT                             
LRM008                OR (ACCT_DLVR_NBR                                 09180000
LRM008                        = :ACAT11IO-DLVR-ACCT                             
                     AND ACAT_CONTROL_NBR                               09180000
                              > :ACAT11IO-CONTROL-NBR))                 09190000
LRM009               AND (STTS_CD BETWEEN                                       
LRM009               :ACAT11IO-PASS-STAT-FR AND :ACAT11IO-PASS-STAT-TO))        
LRM008*********      AND NOT STTS_CD = '140'                                    
LRM008*********      AND NOT STTS_CD = '600')                                   
                  ORDER BY                                                      
LRM008             ACCT_DLVR_NBR                                        09180000
                  ,ACAT_CONTROL_NBR                                             
           END-EXEC.                                                            
      *--------------------------------------------------------*                
      *   TFR CURSRAR: FOR THE PREV PTR ON ACTIVE DB.          *                
      *--------------------------------------------------------*                
           EXEC SQL                                                             
              DECLARE CSR_PRV_ACT_PTR CURSOR FOR                                
                  SELECT                                                        
                   DLVR_NBR                                             09180000
                  ,ACCT_DLVR_NBR                                        09180000
                  ,RCV_NBR                                              09180000
                  ,ACCT_RCV_NBR                                         09180000
                  ,RCV_ACCT_TYPE_CD                                             
                  ,ACAT_CONTROL_NBR                                             
                  ,TRNFR_TYPE_CD                                                
                  ,RCV_CUST_NM                                                  
                  ,RCV_SS_PRIM_NBR                                      09150000
                  ,RCV_SS_SCNDY_NBR                                             
                  ,CMNT_TXT                                                     
                  ,NSCC_PEND_CD                                                 
                  ,NSCC_ACK_IND                                                 
                  ,RR_CD                                                        
                  ,ACCT_RJCT_RSBM_IND                                           
                  ,TRNFR_TYPE_RJCT_CD                                           
                  ,STTS_CD                                                      
                  ,RCV_OCC_BRKR_NBR                                             
LRM003            ,ACCT_ACTIVITY_IND                                            
LRM003            ,ACCT_ORDERS_IND                                              
LRM003            ,ACCT_DB_BAL_T1_IND                                           
LRM003            ,ACCT_MRGN_DB_IND                                             
LRM003            ,ACCT_SHRT_PSTN_IND                                           
LRM003            ,ACCT_SEC_RSTRD_IND                                           
LRM003            ,ACCT_AST_EXCS_IND                                            
LRM003            ,ACCT_OPTN_PSTN_IND                                           
LRM003            ,ACCT_LTD_PRTNR_IND                                           
LRM003            ,ACCT_TIN_MSMTH_IND                                           
LRM003            ,ACCT_DPLCT_TRN_IND                                           
LRM003            ,ACCT_CUST_70_IND                                             
LRM003            ,ACCT_QULFD_PLN_IND                                           
LRM003            ,ACCT_MNGD_IND                                                
LRM003            ,ACCT_PRVT_RNG_IND                                            
LRM003            ,ACCT_BRKR_TIF_IND                                            
LRM003            ,NSCC_NON_ADP_IND                                             
LRM003            ,CMNT_STTS_CD                                                 
LRM003            ,TRNFR_TYPE_RJC1_CD                                           
LRM003            ,TRNFR_TYPE_RJC2_CD                                           
LRM003            ,ACCT_RB_SEC_IND                                              
LRM003            ,ACCT_CLT_RSCND_IND                                           
LRM003            ,ACCT_LGL_BLK_IND                                             
LRM003            ,STTLM_DT                                                     
LRM017            ,ACCT_FRZN_IND                                                
LRM019            ,STTLM_TM_CD                                                  
                   FROM VTRNFR                                          09170000
                  WHERE (CLIENT_NBR                                     09180000
                              = :ACAT11IO-CLIENT-NBR                    09190000
                     AND TRNFR_TYPE_CD                                  09180000
                              = 'PTR'                                   09190000
                     AND DSTBN_SIDE_CD = 'D'                                    
LRM008               AND (ACCT_DLVR_NBR                                 09180000
LRM008                        < :ACAT11IO-DLVR-ACCT                             
LRM008                OR (ACCT_DLVR_NBR                                 09180000
LRM008                        = :ACAT11IO-DLVR-ACCT                             
                     AND ACAT_CONTROL_NBR                               09180000
                              < :ACAT11IO-CONTROL-NBR))                 09190000
LRM009               AND (STTS_CD BETWEEN                                       
LRM009               :ACAT11IO-PASS-STAT-FR AND :ACAT11IO-PASS-STAT-TO))        
LRM008*********      AND NOT STTS_CD = '140'                                    
LRM008*********      AND NOT STTS_CD = '600')                                   
                  ORDER BY                                                      
LRM008             ACCT_DLVR_NBR    DESC                                09180000
                  ,ACAT_CONTROL_NBR DESC                                        
           END-EXEC.                                                            
      *----------------------------------------------------------*              
      *   TFR CURSRAR: FOR THE NEXT PTR ON ACTIVE BY CONTROL NBR *              
      *----------------------------------------------------------*              
           EXEC SQL                                                             
              DECLARE CSR_NXT_CNTL_NBR CURSOR FOR                               
                  SELECT                                                        
                   DLVR_NBR                                             09180000
                  ,ACCT_DLVR_NBR                                        09180000
                  ,RCV_NBR                                              09180000
                  ,ACCT_RCV_NBR                                         09180000
                  ,RCV_ACCT_TYPE_CD                                             
                  ,ACAT_CONTROL_NBR                                             
                  ,TRNFR_TYPE_CD                                                
                  ,RCV_CUST_NM                                                  
                  ,RCV_SS_PRIM_NBR                                      09150000
                  ,RCV_SS_SCNDY_NBR                                             
                  ,CMNT_TXT                                                     
                  ,NSCC_PEND_CD                                                 
                  ,NSCC_ACK_IND                                                 
                  ,RR_CD                                                        
                  ,ACCT_RJCT_RSBM_IND                                           
                  ,TRNFR_TYPE_RJCT_CD                                           
                  ,STTS_CD                                                      
                  ,RCV_OCC_BRKR_NBR                                             
LRM003            ,ACCT_ACTIVITY_IND                                            
LRM003            ,ACCT_ORDERS_IND                                              
LRM003            ,ACCT_DB_BAL_T1_IND                                           
LRM003            ,ACCT_MRGN_DB_IND                                             
LRM003            ,ACCT_SHRT_PSTN_IND                                           
LRM003            ,ACCT_SEC_RSTRD_IND                                           
LRM003            ,ACCT_AST_EXCS_IND                                            
LRM003            ,ACCT_OPTN_PSTN_IND                                           
LRM003            ,ACCT_LTD_PRTNR_IND                                           
LRM003            ,ACCT_TIN_MSMTH_IND                                           
LRM003            ,ACCT_DPLCT_TRN_IND                                           
LRM003            ,ACCT_CUST_70_IND                                             
LRM003            ,ACCT_QULFD_PLN_IND                                           
LRM003            ,ACCT_MNGD_IND                                                
LRM003            ,ACCT_PRVT_RNG_IND                                            
LRM003            ,ACCT_BRKR_TIF_IND                                            
LRM003            ,NSCC_NON_ADP_IND                                             
LRM003            ,CMNT_STTS_CD                                                 
LRM003            ,TRNFR_TYPE_RJC1_CD                                           
LRM003            ,TRNFR_TYPE_RJC2_CD                                           
LRM003            ,ACCT_RB_SEC_IND                                              
LRM003            ,ACCT_CLT_RSCND_IND                                           
LRM003            ,ACCT_LGL_BLK_IND                                             
LRM003            ,STTLM_DT                                                     
LRM017            ,ACCT_FRZN_IND                                                
LRM019            ,STTLM_TM_CD                                                  
                   FROM VTRNFR                                          09170000
                  WHERE (CLIENT_NBR                                     09180000
                              = :ACAT11IO-CLIENT-NBR                    09190000
                     AND TRNFR_TYPE_CD                                  09180000
                              = 'PTR'                                   09190000
                     AND DSTBN_SIDE_CD = 'D'                                    
                     AND ACAT_CONTROL_NBR                               09180000
                              > :ACAT11IO-CONTROL-NBR)                  09190000
LRM008*****          AND NOT STTS_CD = '140'                                    
LRM008*****          AND NOT STTS_CD = '600')                                   
                  ORDER BY                                                      
                   ACAT_CONTROL_NBR                                             
           END-EXEC.                                                            
LRM007*--------------------------------------------------------*                
LRM007*  INITIAL TRANSFER CURSOR                              *                 
LRM007*  USED TO FIND GREATEST CNTL NUMBER FOR THE GIVEN KEYS *                 
LRM007*--------------------------------------------------------*                
LRM007     EXEC SQL                                                             
LRM007        DECLARE ACTITRF_LAST_CNTL CURSOR FOR                              
LRM007           SELECT                                                         
LRM007             ACAT_CONTROL_NBR                                             
LRM007           FROM ACTITRF                                                   
LRM007            WHERE (CLIENT_NBR                                             
LRM007                        = :ACAT11IO-CLIENT-NBR                            
LRM007               AND DLVR_NBR                                               
LRM007                        = :ACAT11IO-DLVR-NBR                              
LRM007               AND ACCT_DLVR_NBR                                          
LRM007                        = :ACAT11IO-DLVR-ACCT                             
LRM007               AND RCV_NBR                                                
LRM007                        = :ACAT11IO-RCV-NBR                               
LRM007               AND ACCT_RCV_NBR                                           
LRM007                        = :ACAT11IO-RCV-ACCT                              
LRM007               AND TRNFR_TYPE_CD                                          
LRM025                        = :ACAT11IO-TRNFR-TYPE-CD)                        
LRM007           ORDER BY  ACAT_CONTROL_NBR DESC                                
LRM007      END-EXEC.                                                           
           EJECT                                                                
LRM016*--------------------------------------------------------*                
LRM016*   TFR CURSRAR: FOR THE NEXT PTD ON ACTIVE BY BR/AC     *                
LRM016*--------------------------------------------------------*                
LRM016     EXEC SQL                                                             
LRM016        DECLARE CSR_NXT_ACT_PTD CURSOR FOR                                
LRM016            SELECT                                                        
LRM016             DLVR_NBR                                             09180000
LRM016            ,ACCT_DLVR_NBR                                        09180000
LRM016            ,RCV_NBR                                              09180000
LRM016            ,ACCT_RCV_NBR                                         09180000
LRM016            ,RCV_ACCT_TYPE_CD                                             
LRM016            ,ACAT_CONTROL_NBR                                             
LRM016            ,TRNFR_TYPE_CD                                                
LRM016            ,RCV_CUST_NM                                                  
LRM016            ,RCV_SS_PRIM_NBR                                      09150000
LRM016            ,RCV_SS_SCNDY_NBR                                             
LRM016            ,CMNT_TXT                                                     
LRM016            ,NSCC_PEND_CD                                                 
LRM016            ,NSCC_ACK_IND                                                 
LRM016            ,RR_CD                                                        
LRM016            ,ACCT_RJCT_RSBM_IND                                           
LRM016            ,TRNFR_TYPE_RJCT_CD                                           
LRM016            ,STTS_CD                                                      
LRM016            ,RCV_OCC_BRKR_NBR                                             
LRM016            ,ACCT_ACTIVITY_IND                                            
LRM016            ,ACCT_ORDERS_IND                                              
LRM016            ,ACCT_DB_BAL_T1_IND                                           
LRM016            ,ACCT_MRGN_DB_IND                                             
LRM016            ,ACCT_SHRT_PSTN_IND                                           
LRM016            ,ACCT_SEC_RSTRD_IND                                           
LRM016            ,ACCT_AST_EXCS_IND                                            
LRM016            ,ACCT_OPTN_PSTN_IND                                           
LRM016            ,ACCT_LTD_PRTNR_IND                                           
LRM016            ,ACCT_TIN_MSMTH_IND                                           
LRM016            ,ACCT_DPLCT_TRN_IND                                           
LRM016            ,ACCT_CUST_70_IND                                             
LRM016            ,ACCT_QULFD_PLN_IND                                           
LRM016            ,ACCT_MNGD_IND                                                
LRM016            ,ACCT_PRVT_RNG_IND                                            
LRM016            ,ACCT_BRKR_TIF_IND                                            
LRM016            ,NSCC_NON_ADP_IND                                             
LRM016            ,CMNT_STTS_CD                                                 
LRM016            ,TRNFR_TYPE_RJC1_CD                                           
LRM016            ,TRNFR_TYPE_RJC2_CD                                           
LRM016            ,ACCT_RB_SEC_IND                                              
LRM016            ,ACCT_CLT_RSCND_IND                                           
LRM016            ,ACCT_LGL_BLK_IND                                             
LRM016            ,STTLM_DT                                                     
LRM017            ,ACCT_FRZN_IND                                                
LRM019            ,STTLM_TM_CD                                                  
LRM021            ,GIFT_IND                                                     
LRM016             FROM VTRNFR                                          09170000
LRM016            WHERE (CLIENT_NBR                                     09180000
LRM016                        = :ACAT11IO-CLIENT-NBR                    09190000
LRM016               AND TRNFR_TYPE_CD                                  09180000
LRM025                        = :ACAT11IO-TRNFR-TYPE-CD                 09190000
LRM016               AND DSTBN_SIDE_CD = 'D'                                    
LRM016               AND (ACCT_DLVR_NBR                                 09180000
LRM016                        > :ACAT11IO-DLVR-ACCT                             
LRM016                OR (ACCT_DLVR_NBR                                 09180000
LRM016                        = :ACAT11IO-DLVR-ACCT                             
LRM016               AND ACAT_CONTROL_NBR                               09180000
LRM016                        > :ACAT11IO-CONTROL-NBR))                 09190000
LRM016               AND (STTS_CD BETWEEN                                       
LRM016               :ACAT11IO-PASS-STAT-FR AND :ACAT11IO-PASS-STAT-TO))        
LRM016            ORDER BY                                                      
LRM016             ACCT_DLVR_NBR                                        09180000
LRM016            ,ACAT_CONTROL_NBR                                             
LRM016     END-EXEC.                                                            
                                                                                
LRM016*--------------------------------------------------------*                
LRM016*   TFR CURSOR:  FOR THE PREV PTD ON ACTIVE BY BR/AC     *                
LRM016*--------------------------------------------------------*                
LRM016     EXEC SQL                                                             
LRM016        DECLARE CSR_PRV_ACT_PTD CURSOR FOR                                
LRM016            SELECT                                                        
LRM016             DLVR_NBR                                             09180000
LRM016            ,ACCT_DLVR_NBR                                        09180000
LRM016            ,RCV_NBR                                              09180000
LRM016            ,ACCT_RCV_NBR                                         09180000
LRM016            ,RCV_ACCT_TYPE_CD                                             
LRM016            ,ACAT_CONTROL_NBR                                             
LRM016            ,TRNFR_TYPE_CD                                                
LRM016            ,RCV_CUST_NM                                                  
LRM016            ,RCV_SS_PRIM_NBR                                      09150000
LRM016            ,RCV_SS_SCNDY_NBR                                             
LRM016            ,CMNT_TXT                                                     
LRM016            ,NSCC_PEND_CD                                                 
LRM016            ,NSCC_ACK_IND                                                 
LRM016            ,RR_CD                                                        
LRM016            ,ACCT_RJCT_RSBM_IND                                           
LRM016            ,TRNFR_TYPE_RJCT_CD                                           
LRM016            ,STTS_CD                                                      
LRM016            ,RCV_OCC_BRKR_NBR                                             
LRM016            ,ACCT_ACTIVITY_IND                                            
LRM016            ,ACCT_ORDERS_IND                                              
LRM016            ,ACCT_DB_BAL_T1_IND                                           
LRM016            ,ACCT_MRGN_DB_IND                                             
LRM016            ,ACCT_SHRT_PSTN_IND                                           
LRM016            ,ACCT_SEC_RSTRD_IND                                           
LRM016            ,ACCT_AST_EXCS_IND                                            
LRM016            ,ACCT_OPTN_PSTN_IND                                           
LRM016            ,ACCT_LTD_PRTNR_IND                                           
LRM016            ,ACCT_TIN_MSMTH_IND                                           
LRM016            ,ACCT_DPLCT_TRN_IND                                           
LRM016            ,ACCT_CUST_70_IND                                             
LRM016            ,ACCT_QULFD_PLN_IND                                           
LRM016            ,ACCT_MNGD_IND                                                
LRM016            ,ACCT_PRVT_RNG_IND                                            
LRM016            ,ACCT_BRKR_TIF_IND                                            
LRM016            ,NSCC_NON_ADP_IND                                             
LRM016            ,CMNT_STTS_CD                                                 
LRM016            ,TRNFR_TYPE_RJC1_CD                                           
LRM016            ,TRNFR_TYPE_RJC2_CD                                           
LRM016            ,ACCT_RB_SEC_IND                                              
LRM016            ,ACCT_CLT_RSCND_IND                                           
LRM016            ,ACCT_LGL_BLK_IND                                             
LRM016            ,STTLM_DT                                                     
LRM017            ,ACCT_FRZN_IND                                                
LRM019            ,STTLM_TM_CD                                                  
LRM021            ,GIFT_IND                                                     
LRM016             FROM VTRNFR                                          09170000
LRM016            WHERE (CLIENT_NBR                                     09180000
LRM016                        = :ACAT11IO-CLIENT-NBR                    09190000
LRM016               AND TRNFR_TYPE_CD                                  09180000
LRM025                        = :ACAT11IO-TRNFR-TYPE-CD                 09190000
LRM016               AND DSTBN_SIDE_CD = 'D'                                    
LRM016               AND (ACCT_DLVR_NBR                                 09180000
LRM016                        < :ACAT11IO-DLVR-ACCT                             
LRM016                OR (ACCT_DLVR_NBR                                 09180000
LRM016                        = :ACAT11IO-DLVR-ACCT                             
LRM016               AND ACAT_CONTROL_NBR                               09180000
LRM016                        < :ACAT11IO-CONTROL-NBR))                 09190000
LRM016               AND (STTS_CD BETWEEN                                       
LRM016               :ACAT11IO-PASS-STAT-FR AND :ACAT11IO-PASS-STAT-TO))        
LRM016            ORDER BY                                                      
LRM016             ACCT_DLVR_NBR     DESC                               09180000
LRM016            ,ACAT_CONTROL_NBR  DESC                                       
LRM016     END-EXEC.                                                            
           EJECT                                                                
      **********************************************************        01460000
      *****      L I N K A G E  S E C T I O N              *****        01470000
      **********************************************************        01480000
       LINKAGE SECTION.                                                 01490000
                                                                        01500000
       01  DFHCOMMAREA.                                                 01490000
           05  FILLER             PIC X(2000).                                  
           EJECT                                                        MRGIML03
LRM003     COPY  ACBALALP.                                                      
00228      EJECT                                                        MRGIML03
           COPY  HOLDAVSM.                                              MRGIPS05
00424      EJECT                                                        MRGIPS05
           COPY  OPNORVSM.                                              MRGIPS05
                                                                                
       EJECT                                                                    
      **********************************************************        01590000
      *****   P R O C E D U R E   D I V I S I O N           *****       01600000
      **********************************************************        01610000
       PROCEDURE DIVISION.                                              01620000
      *--------------------------------------------------------------*          
      * SAVE COMMAREA LENGTH SO THAT PRIOR TO RETURN, WILL PREVENT   *          
      * ALTERING STORAGE BEYOND THAT WHICH WAS SENT.                 *          
      *--------------------------------------------------------------*          
           MOVE EIBCALEN TO WS-EIBCALEN.                                        
           IF EIBCALEN > ZERO                                                   
              MOVE DFHCOMMAREA(1 : EIBCALEN) TO WS-COMMAREA                     
           ELSE                                                                 
              EXEC CICS RETURN END-EXEC                                 06220000
           END-IF.                                                              
                                                                                
           IF ACAT11IO-IT-READ                                                  
               PERFORM 0100-GET-ACTITRF                                 09130000
           ELSE                                                                 
           IF ACAT11IO-IT-READ-ASSET                                            
               PERFORM 0180-GET-ACTIAST                                 09130000
           ELSE                                                                 
LRM016     IF ACAT11IO-GET-NEXT-PTD-CN                                          
               PERFORM 0050-OPEN-CURSORA                                09130000
               PERFORM 0075-READ-NEXTA                                  09130000
               PERFORM 0080-CLOSE-TFRCSRA                                       
LRM016     ELSE                                                                 
LRM016     IF ACAT11IO-GET-NEXT-PTD-A                                           
LRM016         PERFORM 0050-OPEN-CURSOR-PTD                             09130000
LRM016         PERFORM 0075-READ-ACTIVE-PTD                             09130000
LRM016         PERFORM 0080-CLOSE-CURSOR-PTD                                    
           ELSE                                                                 
LRM016     IF ACAT11IO-GET-PREV-PTD-CN                                          
               PERFORM 0050-OPEN-CURSOR1                                09130000
               PERFORM 0075-READ-PREV1                                  09130000
               PERFORM 0080-CLOSE-TFRCSR1                                       
LRM016     ELSE                                                                 
LRM016     IF ACAT11IO-GET-PREV-PTD-A                                           
LRM016         PERFORM 0050-OPEN-CURSOR-PTD-PREV                        09130000
LRM016         PERFORM 0075-READ-ACTIVE-PTD                             09130000
LRM016         PERFORM 0080-CLOSE-CURSOR-PTD-PREV                               
           ELSE                                                                 
           IF ACAT11IO-IT-READNEXT-VINITAST                                     
               PERFORM 0050-OPEN-CURSORS                                09130000
               PERFORM 0075-READNEXT-ACTIAST                            09130000
               PERFORM 0080-CLOSE-TFRCSRS                                       
           ELSE                                                                 
           IF ACAT11IO-IT-READ-PREV4                                            
               PERFORM 0050-OPEN-CURSOR4                                09130000
               PERFORM 0075-READ-PREV4                                  09130000
               PERFORM 0080-CLOSE-TFRCSR4                                       
           ELSE                                                                 
           IF ACAT11IO-IT-READNEXT-VASSET                                       
               PERFORM 0050-OPEN-CURSORSA                               09130000
               PERFORM 0075-READNEXT-VASSET                             09130000
               PERFORM 0077-MOVE-ASSET-TO-IOAREA                                
               PERFORM 0080-CLOSE-TFRCSRSA                                      
           ELSE                                                                 
           IF ACAT11IO-IT-READ-PREV4A                                           
               PERFORM 0050-OPEN-CURSOR4A                               09130000
               PERFORM 0075-READ-PREV4A                                 09130000
               PERFORM 0077-MOVE-ASSET-TO-IOAREA                                
               PERFORM 0080-CLOSE-TFRCSR4A                                      
           ELSE                                                                 
           IF ACAT11IO-IT-GET-ACTIVE                                            
               PERFORM 0150-READ-ACTIVE-ACAT-DIRECT                             
           ELSE                                                                 
           IF ACAT11IO-GET-NEXT-PTR                                             
LRM008     OR ACAT11IO-GET-NEXT-PTR-CN                                          
               PERFORM 0050-OPEN-CURSORAR                               09130000
               PERFORM 0125-READ-NEXT-PTR                                       
           ELSE                                                                 
           IF ACAT11IO-GET-PREV-PTR                                             
               PERFORM 0050-OPEN-CURSORAP                               09130000
               PERFORM 0127-READ-PREV-PTR                                       
           ELSE                                                                 
              EXEC SQL                                                          
                  SET :WS-TIMESTAMP = CURRENT TIMESTAMP                         
              END-EXEC                                                          
              IF ACAT11IO-IT-ISRT                                               
                  PERFORM 0200-ISRT-ACTITRF                                09130
                  PERFORM 0230-INSERT-ASSET-AMOUNTS                             
              ELSE                                                              
              IF ACAT11IO-IT-ISRT-ASSET                                         
                  PERFORM 0220-ISRT-ACTIAST THRU 0220-EXIT                 09130
              ELSE                                                              
              IF ACAT11IO-IT-UPD                                                
                 PERFORM 0300-UPDATE-ACTITRF THRU 0300-EXIT                     
              ELSE                                                              
              IF ACAT11IO-IT-UPD-ASSET                                          
                 PERFORM 0370-UPDATE-ACTIAST                                    
              ELSE                                                              
              IF ACAT11IO-IT-DEL                                                
                 PERFORM 0400-DELETE-ACTITRF                                    
              ELSE                                                              
              IF ACAT11IO-IT-REJECT                                             
                 PERFORM 0400-DELETE-ACTITRF                                    
                 IF ACAT11IO-REJECT-CODE > '00'                                 
                    PERFORM 0200-ISRT-ACTITRF                              09130
                 END-IF                                                         
              ELSE                                                              
              IF ACAT11IO-IT-DEL-ASSET                                          
                 PERFORM 0420-DELETE-ACTIAST                                    
              ELSE                                                              
              IF ACAT11IO-COPY-ACTIVE-PTR                                       
                 PERFORM 0500-CREATE-PTR-DLVY-RTN                               
           END-IF.                                                              
                                                                                
           MOVE WS-COMMAREA TO DFHCOMMAREA(1 : WS-EIBCALEN).                    
           EXEC CICS RETURN END-EXEC.                                           
                                                                                
       0050-OPEN-CURSORA.                                               09130000
      *--------------------------------------------------------------*          
      *     SERACH ENGINE WITH CLIENT/BRANCH/ACCOUNT                 *          
      *--------------------------------------------------------------*          
LRM008     IF ACAT11IO-STTS-CD > '000'                                          
LRM008        MOVE ACAT11IO-STTS-CD        TO WS-STTS-CD                        
LRM008     ELSE                                                                 
LRM008        MOVE '%%%'                   TO WS-STTS-CD                        
LRM008     END-IF.                                                              
           EXEC SQL                                                             
              OPEN TFRCSRA                                                      
           END-EXEC.                                                            
           IF SQLCODE = 0                                                       
              SET ACAT11IO-GOOD-RESP TO TRUE                            09240000
           ELSE                                                                 
    *******   MOVE '** TFRCSRA OPEN ERROR **'                                   
              PERFORM 9000-WRITE-TO-CICS-LOG                                    
              PERFORM 9500-RETURN-DB2-ERROR                                     
           END-IF.                                                              
                                                                                
       0050-OPEN-CURSOR1.                                               09130000
      *--------------------------------------------------------------*          
      *     SERACH ENGINE WITH PREV CLIENT/BRANCH/ACCOUNT            *          
      *--------------------------------------------------------------*          
           EXEC SQL                                                             
              OPEN TFRCSR1                                                      
           END-EXEC.                                                            
           IF SQLCODE = 0                                                       
              SET ACAT11IO-GOOD-RESP TO TRUE                            09240000
           ELSE                                                                 
    *******   MOVE '** TFRCSR1 OPEN ERROR **'                                   
              PERFORM 9000-WRITE-TO-CICS-LOG                                    
              PERFORM 9500-RETURN-DB2-ERROR                                     
           END-IF.                                                              
                                                                                
       0050-OPEN-CURSORS.                                               09130000
      *--------------------------------------------------------------*          
      *     SERACH ENGINE FOR NEXT ASSET.                            *          
      *--------------------------------------------------------------*          
           EXEC SQL                                                             
              OPEN TFRCSRS                                                      
           END-EXEC.                                                            
           IF SQLCODE = 0                                                       
              SET ACAT11IO-GOOD-RESP TO TRUE                            09240000
           ELSE                                                                 
    *******   MOVE '** TFRCSRS OPEN ERROR **'                                   
              PERFORM 9000-WRITE-TO-CICS-LOG                                    
              PERFORM 9500-RETURN-DB2-ERROR                                     
           END-IF.                                                              
       0050-OPEN-CURSORSA.                                              09130000
      *--------------------------------------------------------------*          
      *     SERACH ENGINE FOR NEXT ASSET ON ACTIVE TABLE.            *          
      *--------------------------------------------------------------*          
           EXEC SQL                                                             
              OPEN TFRCSRSA                                                     
           END-EXEC.                                                            
           IF SQLCODE = 0                                                       
              SET ACAT11IO-GOOD-RESP TO TRUE                            09240000
           ELSE                                                                 
    *******   MOVE '** TFRCSRSA OPEN ERROR **'                                  
              PERFORM 9000-WRITE-TO-CICS-LOG                                    
              PERFORM 9500-RETURN-DB2-ERROR                                     
           END-IF.                                                              
       0050-OPEN-CURSOR4.                                               09130000
      *--------------------------------------------------------------*          
      *     SERACH ENGINE FOR PREV ASSET.                            *          
      *--------------------------------------------------------------*          
           EXEC SQL                                                             
              OPEN TFRCSR4                                                      
           END-EXEC.                                                            
           IF SQLCODE = 0                                                       
              SET ACAT11IO-GOOD-RESP TO TRUE                            09240000
           ELSE                                                                 
    *******   MOVE '** TFRCSR4 OPEN ERROR **'                                   
              PERFORM 9000-WRITE-TO-CICS-LOG                                    
              PERFORM 9500-RETURN-DB2-ERROR                                     
           END-IF.                                                              
       0050-OPEN-CURSOR4A.                                              09130000
      *--------------------------------------------------------------*          
      *     SERACH ENGINE FOR PREV ACTIVE ASSET.                     *          
      *--------------------------------------------------------------*          
           EXEC SQL                                                             
              OPEN TFRCSR4A                                                     
           END-EXEC.                                                            
           IF SQLCODE = 0                                                       
              SET ACAT11IO-GOOD-RESP TO TRUE                            09240000
           ELSE                                                                 
    *******   MOVE '** TFRCSR4 OPEN ERROR **'                                   
              PERFORM 9000-WRITE-TO-CICS-LOG                                    
              PERFORM 9500-RETURN-DB2-ERROR                                     
           END-IF.                                                              
       0050-OPEN-CURSORAA.                                              09130000
      *--------------------------------------------------------------*          
      *     SERACH ENGINE FOR PTD ON ACTIVE FILE.                    *          
      *--------------------------------------------------------------*          
           EXEC SQL                                                             
              OPEN TFRCSRAA                                                     
           END-EXEC.                                                            
           IF SQLCODE = 0                                                       
              SET ACAT11IO-GOOD-RESP TO TRUE                            09240000
           ELSE                                                                 
    *******   MOVE '** TFRCSRA OPEN ERROR **'                                   
              PERFORM 9000-WRITE-TO-CICS-LOG                                    
              PERFORM 9500-RETURN-DB2-ERROR                                     
           END-IF.                                                              
       0050-OPEN-CURSORAR.                                              09130000
      *--------------------------------------------------------------*          
      *     SERACH ENGINE FOR NEXT PTR ON ACTIVE FILE.               *          
      *--------------------------------------------------------------*          
LRM008     IF ACAT11IO-GET-NEXT-PTR-CN                                          
LRM008       EXEC SQL                                                           
LRM008          OPEN CSR_NXT_CNTL_NBR                                           
LRM008       END-EXEC                                                           
LRM008     ELSE                                                                 
           EXEC SQL                                                             
              OPEN CSR_NXT_ACT_PTR                                              
           END-EXEC.                                                            
           IF SQLCODE = 0                                                       
              SET ACAT11IO-GOOD-RESP TO TRUE                            09240000
           ELSE                                                                 
    *******   MOVE '** TFRCSRA OPEN ERROR **'                                   
              PERFORM 9000-WRITE-TO-CICS-LOG                                    
              PERFORM 9500-RETURN-DB2-ERROR                                     
           END-IF.                                                              
       0050-OPEN-CURSORAP.                                              09130000
      *--------------------------------------------------------------*          
      *     SERACH ENGINE FOR PREV PTR ON ACTIVE FILE.               *          
      *--------------------------------------------------------------*          
           EXEC SQL                                                             
              OPEN CSR_PRV_ACT_PTR                                              
           END-EXEC.                                                            
           IF SQLCODE = 0                                                       
              SET ACAT11IO-GOOD-RESP TO TRUE                            09240000
           ELSE                                                                 
    *******   MOVE '** CSR_PRV_ACT_PTR OPEN ERROR **'                           
              PERFORM 9000-WRITE-TO-CICS-LOG                                    
              PERFORM 9500-RETURN-DB2-ERROR                                     
           END-IF.                                                              
       0050-OPEN-VASSET-CRSRX.                                          09130000
      *--------------------------------------------------------------*          
      *     SERACH ENGINE FOR ALL ACTIVE ASSETS.                     *          
      *--------------------------------------------------------------*          
           EXEC SQL                                                             
              OPEN VASSET_CRSRX                                                 
           END-EXEC.                                                            
           IF SQLCODE = 0                                                       
              SET ACAT11IO-GOOD-RESP TO TRUE                            09240000
           ELSE                                                                 
    *******   MOVE '** VASSET_CRSRX OPEN ERROR **'                              
              PERFORM 9000-WRITE-TO-CICS-LOG                                    
              PERFORM 9500-RETURN-DB2-ERROR                                     
           END-IF.                                                              
                                                                                
LRM016 0050-OPEN-CURSOR-PTD.                                                    
LRM016*--------------------------------------------------------------*          
LRM016*     SERACH ENGINE FOR NEXT ACTIVE PTD.                       *          
LRM016*--------------------------------------------------------------*          
LRM016     EXEC SQL                                                             
LRM016        OPEN CSR_NXT_ACT_PTD                                              
LRM016     END-EXEC.                                                            
LRM016     IF SQLCODE = 0                                                       
LRM016        SET ACAT11IO-GOOD-RESP TO TRUE                            09240000
LRM016     ELSE                                                                 
LRM016        PERFORM 9000-WRITE-TO-CICS-LOG                                    
LRM016        PERFORM 9500-RETURN-DB2-ERROR                                     
LRM016     END-IF.                                                              
                                                                                
LRM016 0050-OPEN-CURSOR-PTD-PREV.                                               
LRM016*--------------------------------------------------------------*          
LRM016*     SERACH ENGINE FOR PREV ACTIVE PTD.                       *          
LRM016*--------------------------------------------------------------*          
LRM016     EXEC SQL                                                             
LRM016        OPEN CSR_PRV_ACT_PTD                                              
LRM016     END-EXEC.                                                            
LRM016     IF SQLCODE = 0                                                       
LRM016        SET ACAT11IO-GOOD-RESP TO TRUE                            09240000
LRM016     ELSE                                                                 
LRM016        PERFORM 9000-WRITE-TO-CICS-LOG                                    
LRM016        PERFORM 9500-RETURN-DB2-ERROR                                     
LRM016     END-IF.                                                              
                                                                                
       EJECT                                                                    
                                                                                
       0075-READ-NEXTA.                                                 09130000
           EXEC SQL                                                             
              FETCH                                                             
                  TFRCSRA                                                       
                   INTO                                                 09160000
                    :ACAT11IO-RCV-NBR                                   09190000
                   ,:ACAT11IO-RCV-ACCT                                  09190000
                   ,:ACAT11IO-DLVR-NBR                                  09190000
                   ,:ACAT11IO-DLVR-ACCT                                 09190000
                   ,:ACAT11IO-RCV-ACCT-TYPE-CD                                  
                   ,:ACAT11IO-CONTROL-NBR                                       
                   ,:ACAT11IO-TRNFR-TYPE-CD                                     
                   ,:ACAT11IO-RCV-CUST-NM                                       
                   ,:ACAT11IO-RCV-SS-PRIM-NBR                                   
                   ,:ACAT11IO-RCV-SS-SCNDY-NBR                                  
                   ,:ACAT11IO-CMNT-TXT                                          
                   ,:ACAT11IO-NSCC-PEND-CD                                      
                   ,:ACAT11IO-NSCC-ACK-IND                                      
                   ,:ACAT11IO-RR-CD                                             
                   ,:ACAT11IO-UPDT-TMSTP                                        
LRM006             ,:ACAT11IO-STTS-CD                                           
LRM021             ,:ACAT11IO-GIFT-IND                                          
           END-EXEC.                                                            
           IF SQLCODE = 0                                                       
              MOVE ACAT11IO-RR-CD TO SRCH-INP-RR                                
              MOVE ACAT11IO-DLVR-ACCT(1 : 3) TO SRCH-INP-BRANCH                 
              PERFORM 0075-SIGNON-SECR-CHECK-RTN                                
              IF SRCH-SIGNON-SECR-CHECK-FAIL                                    
                 GO TO 0075-READ-NEXTA                                  09130000
              END-IF                                                            
              SET ACAT11IO-FOUND TO TRUE                                        
              PERFORM 0110-GET-ACTIAST-DOLLAR-AMTS                      09130000
           ELSE                                                                 
           IF SQLCODE = +100                                                    
              SET ACAT11IO-NOT-FOUND TO TRUE                                    
           ELSE                                                                 
    ******    MOVE '** ACAT11DB - TFRCSRA FETCH ERR  **     '                   
              PERFORM 9000-WRITE-TO-CICS-LOG                                    
              PERFORM 9500-RETURN-DB2-ERROR                                     
           END-IF.                                                              
                                                                                
       SKIP3                                                                    
       0075-READ-PREV1.                                                 09130000
           EXEC SQL                                                             
              FETCH                                                             
                  TFRCSR1                                                       
                   INTO                                                 09160000
                    :ACAT11IO-RCV-NBR                                   09190000
                   ,:ACAT11IO-RCV-ACCT                                  09190000
                   ,:ACAT11IO-DLVR-NBR                                  09190000
                   ,:ACAT11IO-DLVR-ACCT                                 09190000
                   ,:ACAT11IO-RCV-ACCT-TYPE-CD                                  
                   ,:ACAT11IO-CONTROL-NBR                                       
                   ,:ACAT11IO-TRNFR-TYPE-CD                                     
                   ,:ACAT11IO-RCV-CUST-NM                                       
                   ,:ACAT11IO-RCV-SS-PRIM-NBR                                   
                   ,:ACAT11IO-RCV-SS-SCNDY-NBR                                  
                   ,:ACAT11IO-CMNT-TXT                                          
                   ,:ACAT11IO-NSCC-PEND-CD                                      
                   ,:ACAT11IO-NSCC-ACK-IND                                      
                   ,:ACAT11IO-RR-CD                                             
                   ,:ACAT11IO-UPDT-TMSTP                                        
LRM006             ,:ACAT11IO-STTS-CD                                           
LRM021             ,:ACAT11IO-GIFT-IND                                          
           END-EXEC.                                                            
           IF SQLCODE = 0                                                       
              MOVE ACAT11IO-RR-CD TO SRCH-INP-RR                                
              MOVE ACAT11IO-DLVR-ACCT(1 : 3) TO SRCH-INP-BRANCH                 
              PERFORM 0075-SIGNON-SECR-CHECK-RTN                                
              IF SRCH-SIGNON-SECR-CHECK-FAIL                                    
                 GO TO 0075-READ-PREV1                                  09130000
              END-IF                                                            
              SET ACAT11IO-FOUND TO TRUE                                        
              PERFORM 0110-GET-ACTIAST-DOLLAR-AMTS                      09130000
           ELSE                                                                 
           IF SQLCODE = +100                                                    
              SET ACAT11IO-NOT-FOUND TO TRUE                                    
           ELSE                                                                 
    ******    MOVE '** ACAT11DB - TFRCSR1 FETCH ERR  **     '                   
              PERFORM 9000-WRITE-TO-CICS-LOG                                    
              PERFORM 9500-RETURN-DB2-ERROR                                     
           END-IF.                                                              
                                                                                
       SKIP3                                                                    
       0075-READNEXT-ACTIAST.                                           09130000
           EXEC SQL                                                             
              FETCH                                                             
                  TFRCSRS                                                       
                   INTO                                                 09160000
                   :ACAT11IO-ISIN-CNTRY-CD                                      
                  ,:ACAT11IO-ISIN-SEC-ISSUE-CD                                  
                  ,:ACAT11IO-ISIN-SEC-CDG-CD                                    
                  ,:ACAT11IO-STTLM-LCTN-CD                                      
                  ,:ACAT11IO-SLOC-RSN                                           
                  ,:ACAT11IO-CSH-MGN-SHRT-CD                                    
                  ,:ACAT11IO-ASSET-PRC-CTGY-CD                                  
                  ,:ACAT11IO-ASSET-RQST-QTY-CD                                  
                  ,:ACAT11IO-AST-RQST-TRANS-CD                                  
                  ,:ACAT11IO-WHI-CD                                             
LRM048            ,:ACAT11IO-WHI-STTS-CD                                        
                  ,:ACAT11IO-PSTN-CD                                            
                  ,:ACAT11IO-DESC-TXT                                           
                  ,:ACAT11IO-ASSET-AMT                                          
                  ,:ACAT11IO-ASSET-QTY                                          
                  ,:ACAT11IO-ASSET-PCT                                          
                  ,:ACAT11IO-ASSET-CMNT-TXT                                     
                  ,:ACAT11IO-ADP-NBR                                            
LRM003            ,:WS-NSCC-PEND-CD                                             
LRM008            ,:ACAT11IO-NSCC-WTHLD-CD                                      
           END-EXEC.                                                            
           IF SQLCODE = 0                                                       
              SET ACAT11IO-ASSET-FOUND TO TRUE                                  
              PERFORM SET-MEMO-CD-RETURNED-RTN                                  
           ELSE                                                                 
           IF SQLCODE = +100                                                    
              SET ACAT11IO-ASSET-NOT-FOUND TO TRUE                              
           ELSE                                                                 
    ******    MOVE '** ACAT11DB - TFRCSRS FETCH ERR  **     '                   
              PERFORM 9000-WRITE-TO-CICS-LOG                                    
              PERFORM 9500-RETURN-DB2-ERROR                                     
           END-IF.                                                              
                                                                                
       SKIP3                                                                    
       0075-READNEXT-VASSET.                                            09130000
           EXEC SQL                                                             
              FETCH                                                             
                  TFRCSRSA                                                      
                   INTO                                                 09160000
                  :DCLVASSET.ASSET-SEQ-NBR                                      
                 ,:DCLVASSET.CONTROL-NBR-STS-CD                                 
                 ,:DCLVASSET.DLVR-NBR-STTS-CD                                   
                 ,:DCLVASSET.RCV-NBR-STTS-CD                                    
                 ,:DCLVASSET.SBMTG-PRTCP-NBR                                    
                 ,:DCLVASSET.SBMT-PRT-NR-STS-CD                                 
                 ,:DCLVASSET.AST-SEQ-NBR-STS-CD                                 
                 ,:DCLVASSET.SYS-ACT-CD                                         
                 ,:DCLVASSET.SYS-RJCT-RSN-CD                                    
                 ,:DCLVASSET.TRANS-TYPE-CD                                      
                 ,:DCLVASSET.TRANS-TYPE-STTS-CD                                 
                 ,:DCLVASSET.PHSCL-SEQ-NBR                                      
                 ,:DCLVASSET.PHSCL-SEQ-STTS-CD                                  
                 ,:DCLVASSET.LGCL-SEQ-NBR                                       
                 ,:DCLVASSET.LGCL-SEQ-NR-STS-CD                                 
                 ,:DCLVASSET.ASSET-PRC-CTGY-CD                                  
                 ,:DCLVASSET.AST-PRC-CTG-STS-CD                                 
                 ,:DCLVASSET.STTLM-LCTN-CD                                      
                 ,:DCLVASSET.STTLM-LCTN-STTS-CD                                 
                 ,:DCLVASSET.STTLM-RSN-CD                                       
                 ,:DCLVASSET.STTLM-RSN-STTS-CD                                  
                 ,:DCLVASSET.ISIN-CNTRY-CD                                      
                 ,:DCLVASSET.ISIN-CNTRY-STTS-CD                                 
                 ,:DCLVASSET.ISIN-SEC-ISSUE-CD                                  
                 ,:DCLVASSET.ISIN-SEC-IS-STS-CD                                 
                 ,:DCLVASSET.ISIN-SEC-CDG-CD                                    
                 ,:DCLVASSET.ISIN-SEC-CD-STS-CD                                 
                 ,:DCLVASSET.ASSET-DESC-TXT                                     
                 ,:DCLVASSET.ASSET-DESC-STTS-CD                                 
                 ,:DCLVASSET.ASSET-RQST-QTY-CD                                  
                 ,:DCLVASSET.ASSET-RQST-STS-CD                                  
                 ,:DCLVASSET.AST-RQST-TRANS-CD                                  
                 ,:DCLVASSET.AST-RQ-TRAN-STS-CD                                 
                 ,:DCLVASSET.ASSET-QTY                                          
                 ,:DCLVASSET.ASSET-QTY-STTS-CD                                  
                 ,:DCLVASSET.ASSET-PCT                                          
                 ,:DCLVASSET.ASSET-PCT-STTS-CD                                  
                 ,:DCLVASSET.PSTN-CD                                            
                 ,:DCLVASSET.PSTN-CD-STTS-CD                                    
                 ,:DCLVASSET.ISO-CRNCY-CD                                       
                 ,:DCLVASSET.ISO-CRNCY-STTS-CD                                  
                 ,:DCLVASSET.ASSET-AMT                                          
                 ,:DCLVASSET.ASSET-AMT-STTS-CD                                  
                 ,:DCLVASSET.BEARER-BOND-CD                                     
                 ,:DCLVASSET.BEARER-BND-STTS-CD                                 
                 ,:DCLVASSET.CSH-MGN-SHRT-CD                                    
                 ,:DCLVASSET.CSH-MRG-SHT-STS-CD                                 
                 ,:DCLVASSET.WHI-CD                                             
                 ,:DCLVASSET.WHI-STTS-CD                                        
                 ,:DCLVASSET.TRNFR-TYPE-RSN-CD                                  
                 ,:DCLVASSET.TRN-TYP-RSN-STS-CD                                 
                 ,:DCLVASSET.MBS-SERIAL-NBR                                     
                 ,:DCLVASSET.MBS-SERIAL-STTS-CD                                 
                 ,:DCLVASSET.ASSET-CMNT-TXT                                     
                 ,:DCLVASSET.ASSET-CMNT-STTS-CD                                 
                 ,:DCLVASSET.NSCC-ACK-IND                                       
                 ,:DCLVASSET.NSCC-PEND-CD                                       
                 ,:DCLVASSET.FAIL-SENT-CAGE-IND                                 
                 ,:DCLVASSET.FAIL-OPEN-CAGE-IND                                 
                 ,:DCLVASSET.NSCC-NON-ADP-IND                                   
                 ,:DCLVASSET.TRANS-RFRN-ID-CD                                   
                 ,:DCLVASSET.TRANS-RFRN-STTS-CD                                 
                 ,:DCLVASSET.OPTN-CTGY-CD                                       
                 ,:DCLVASSET.OPTN-CTGY-STTS-CD                                  
                 ,:DCLVASSET.RCRD-LNGTH-STTS-CD                                 
                 ,:DCLVASSET.RCRD-STTS-CD                                       
                 ,:DCLVASSET.ISIN-SEC-EXCPT-IND                                 
                 ,:DCLVASSET.CRT-TMSTP                                          
                 ,:DCLVASSET.UPDT-TMSTP                                         
                 ,:DCLVASSET.CICS-TERM-ID-CD                                    
                 ,:DCLVASSET.PRGM-NM                                            
                 ,:DCLVASSET.SECURITY-ADP-NBR                                   
                 ,:DCLVASSET.RCL-SENT-NSCC-IND                                  
                 ,:DCLVASSET.FRV-SENT-NSCC-IND                                  
                 ,:DCLVASSET.TRNFR-TYPE-CD                                      
           END-EXEC.                                                            
           IF SQLCODE = 0                                                       
              SET ACAT11IO-ASSET-FOUND TO TRUE                                  
           ELSE                                                                 
           IF SQLCODE = +100                                                    
              SET ACAT11IO-ASSET-NOT-FOUND TO TRUE                              
           ELSE                                                                 
    ******    MOVE '** ACAT11DB - TFRCSRSA FETCH ERR  **     '                  
              PERFORM 9000-WRITE-TO-CICS-LOG                                    
              PERFORM 9500-RETURN-DB2-ERROR                                     
           END-IF.                                                              
                                                                                
       SKIP3                                                                    
       0075-READ-NEXTX.                                                 09130000
           EXEC SQL                                                             
              FETCH                                                             
                  VASSET_CRSRX                                                  
                   INTO                                                 09160000
                  :DCLVASSET.ASSET-SEQ-NBR                                      
                 ,:DCLVASSET.CONTROL-NBR-STS-CD                                 
                 ,:DCLVASSET.DLVR-NBR-STTS-CD                                   
                 ,:DCLVASSET.RCV-NBR-STTS-CD                                    
                 ,:DCLVASSET.SBMTG-PRTCP-NBR                                    
                 ,:DCLVASSET.SBMT-PRT-NR-STS-CD                                 
                 ,:DCLVASSET.AST-SEQ-NBR-STS-CD                                 
                 ,:DCLVASSET.SYS-ACT-CD                                         
                 ,:DCLVASSET.SYS-RJCT-RSN-CD                                    
                 ,:DCLVASSET.TRANS-TYPE-CD                                      
                 ,:DCLVASSET.TRANS-TYPE-STTS-CD                                 
                 ,:DCLVASSET.PHSCL-SEQ-NBR                                      
                 ,:DCLVASSET.PHSCL-SEQ-STTS-CD                                  
                 ,:DCLVASSET.LGCL-SEQ-NBR                                       
                 ,:DCLVASSET.LGCL-SEQ-NR-STS-CD                                 
                 ,:DCLVASSET.ASSET-PRC-CTGY-CD                                  
                 ,:DCLVASSET.AST-PRC-CTG-STS-CD                                 
                 ,:DCLVASSET.STTLM-LCTN-CD                                      
                 ,:DCLVASSET.STTLM-LCTN-STTS-CD                                 
                 ,:DCLVASSET.STTLM-RSN-CD                                       
                 ,:DCLVASSET.STTLM-RSN-STTS-CD                                  
                 ,:DCLVASSET.ISIN-CNTRY-CD                                      
                 ,:DCLVASSET.ISIN-CNTRY-STTS-CD                                 
                 ,:DCLVASSET.ISIN-SEC-ISSUE-CD                                  
                 ,:DCLVASSET.ISIN-SEC-IS-STS-CD                                 
                 ,:DCLVASSET.ISIN-SEC-CDG-CD                                    
                 ,:DCLVASSET.ISIN-SEC-CD-STS-CD                                 
                 ,:DCLVASSET.ASSET-DESC-TXT                                     
                 ,:DCLVASSET.ASSET-DESC-STTS-CD                                 
                 ,:DCLVASSET.ASSET-RQST-QTY-CD                                  
                 ,:DCLVASSET.ASSET-RQST-STS-CD                                  
                 ,:DCLVASSET.AST-RQST-TRANS-CD                                  
                 ,:DCLVASSET.AST-RQ-TRAN-STS-CD                                 
                 ,:DCLVASSET.ASSET-QTY                                          
                 ,:DCLVASSET.ASSET-QTY-STTS-CD                                  
                 ,:DCLVASSET.ASSET-PCT                                          
                 ,:DCLVASSET.ASSET-PCT-STTS-CD                                  
                 ,:DCLVASSET.PSTN-CD                                            
                 ,:DCLVASSET.PSTN-CD-STTS-CD                                    
                 ,:DCLVASSET.ISO-CRNCY-CD                                       
                 ,:DCLVASSET.ISO-CRNCY-STTS-CD                                  
                 ,:DCLVASSET.ASSET-AMT                                          
                 ,:DCLVASSET.ASSET-AMT-STTS-CD                                  
                 ,:DCLVASSET.BEARER-BOND-CD                                     
                 ,:DCLVASSET.BEARER-BND-STTS-CD                                 
                 ,:DCLVASSET.CSH-MGN-SHRT-CD                                    
                 ,:DCLVASSET.CSH-MRG-SHT-STS-CD                                 
                 ,:DCLVASSET.WHI-CD                                             
                 ,:DCLVASSET.WHI-STTS-CD                                        
                 ,:DCLVASSET.TRNFR-TYPE-RSN-CD                                  
                 ,:DCLVASSET.TRN-TYP-RSN-STS-CD                                 
                 ,:DCLVASSET.MBS-SERIAL-NBR                                     
                 ,:DCLVASSET.MBS-SERIAL-STTS-CD                                 
                 ,:DCLVASSET.ASSET-CMNT-TXT                                     
                 ,:DCLVASSET.ASSET-CMNT-STTS-CD                                 
                 ,:DCLVASSET.NSCC-ACK-IND                                       
                 ,:DCLVASSET.NSCC-PEND-CD                                       
                 ,:DCLVASSET.FAIL-SENT-CAGE-IND                                 
                 ,:DCLVASSET.FAIL-OPEN-CAGE-IND                                 
                 ,:DCLVASSET.NSCC-NON-ADP-IND                                   
                 ,:DCLVASSET.TRANS-RFRN-ID-CD                                   
                 ,:DCLVASSET.TRANS-RFRN-STTS-CD                                 
                 ,:DCLVASSET.OPTN-CTGY-CD                                       
                 ,:DCLVASSET.OPTN-CTGY-STTS-CD                                  
                 ,:DCLVASSET.RCRD-LNGTH-STTS-CD                                 
                 ,:DCLVASSET.RCRD-STTS-CD                                       
                 ,:DCLVASSET.ISIN-SEC-EXCPT-IND                                 
                 ,:DCLVASSET.CRT-TMSTP                                          
                 ,:DCLVASSET.UPDT-TMSTP                                         
                 ,:DCLVASSET.CICS-TERM-ID-CD                                    
                 ,:DCLVASSET.PRGM-NM                                            
                 ,:DCLVASSET.SECURITY-ADP-NBR                                   
                 ,:DCLVASSET.RCL-SENT-NSCC-IND                                  
                 ,:DCLVASSET.FRV-SENT-NSCC-IND                                  
                 ,:DCLVASSET.TRNFR-TYPE-CD                                      
           END-EXEC.                                                            
           IF SQLCODE = 0                                                       
              SET ACAT11IO-ASSET-FOUND TO TRUE                                  
           ELSE                                                                 
           IF SQLCODE = +100                                                    
              SET ACAT11IO-ASSET-NOT-FOUND TO TRUE                              
           ELSE                                                                 
    ******    MOVE '** ACAT11DB - TFRCSRSA FETCH ERR  **     '                  
              PERFORM 9000-WRITE-TO-CICS-LOG                                    
              PERFORM 9500-RETURN-DB2-ERROR                                     
           END-IF.                                                              
                                                                                
       SKIP3                                                                    
       0075-READ-PREV4.                                                 09130000
           EXEC SQL                                                             
              FETCH                                                             
                  TFRCSR4                                                       
                   INTO                                                 09160000
                   :ACAT11IO-ISIN-CNTRY-CD                                      
                  ,:ACAT11IO-ISIN-SEC-ISSUE-CD                                  
                  ,:ACAT11IO-ISIN-SEC-CDG-CD                                    
                  ,:ACAT11IO-STTLM-LCTN-CD                                      
                  ,:ACAT11IO-SLOC-RSN                                           
                  ,:ACAT11IO-CSH-MGN-SHRT-CD                                    
                  ,:ACAT11IO-ASSET-PRC-CTGY-CD                                  
                  ,:ACAT11IO-ASSET-RQST-QTY-CD                                  
                  ,:ACAT11IO-AST-RQST-TRANS-CD                                  
                  ,:ACAT11IO-WHI-CD                                             
LRM048            ,:ACAT11IO-WHI-STTS-CD                                        
                  ,:ACAT11IO-PSTN-CD                                            
                  ,:ACAT11IO-DESC-TXT                                           
                  ,:ACAT11IO-ASSET-AMT                                          
                  ,:ACAT11IO-ASSET-QTY                                          
                  ,:ACAT11IO-ASSET-PCT                                          
                  ,:ACAT11IO-ASSET-CMNT-TXT                                     
                  ,:ACAT11IO-ADP-NBR                                            
LRM003            ,:WS-NSCC-PEND-CD                                             
LRM008            ,:ACAT11IO-NSCC-WTHLD-CD                                      
           END-EXEC.                                                            
           IF SQLCODE = 0                                                       
              SET ACAT11IO-ASSET-FOUND TO TRUE                                  
              PERFORM SET-MEMO-CD-RETURNED-RTN                                  
           ELSE                                                                 
           IF SQLCODE = +100                                                    
              SET ACAT11IO-ASSET-NOT-FOUND TO TRUE                              
           ELSE                                                                 
    ******    MOVE '** ACAT11DB - TFRCSR4 FETCH ERR  **     '                   
              PERFORM 9000-WRITE-TO-CICS-LOG                                    
              PERFORM 9500-RETURN-DB2-ERROR                                     
           END-IF.                                                              
                                                                                
       SKIP3                                                                    
       0075-READ-PREV4A.                                                09130000
           EXEC SQL                                                             
              FETCH                                                             
                  TFRCSR4A                                                      
                   INTO                                                 09160000
                  :DCLVASSET.ASSET-SEQ-NBR                                      
                 ,:DCLVASSET.CONTROL-NBR-STS-CD                                 
                 ,:DCLVASSET.DLVR-NBR-STTS-CD                                   
                 ,:DCLVASSET.RCV-NBR-STTS-CD                                    
                 ,:DCLVASSET.SBMTG-PRTCP-NBR                                    
                 ,:DCLVASSET.SBMT-PRT-NR-STS-CD                                 
                 ,:DCLVASSET.AST-SEQ-NBR-STS-CD                                 
                 ,:DCLVASSET.SYS-ACT-CD                                         
                 ,:DCLVASSET.SYS-RJCT-RSN-CD                                    
                 ,:DCLVASSET.TRANS-TYPE-CD                                      
                 ,:DCLVASSET.TRANS-TYPE-STTS-CD                                 
                 ,:DCLVASSET.PHSCL-SEQ-NBR                                      
                 ,:DCLVASSET.PHSCL-SEQ-STTS-CD                                  
                 ,:DCLVASSET.LGCL-SEQ-NBR                                       
                 ,:DCLVASSET.LGCL-SEQ-NR-STS-CD                                 
                 ,:DCLVASSET.ASSET-PRC-CTGY-CD                                  
                 ,:DCLVASSET.AST-PRC-CTG-STS-CD                                 
                 ,:DCLVASSET.STTLM-LCTN-CD                                      
                 ,:DCLVASSET.STTLM-LCTN-STTS-CD                                 
                 ,:DCLVASSET.STTLM-RSN-CD                                       
                 ,:DCLVASSET.STTLM-RSN-STTS-CD                                  
                 ,:DCLVASSET.ISIN-CNTRY-CD                                      
                 ,:DCLVASSET.ISIN-CNTRY-STTS-CD                                 
                 ,:DCLVASSET.ISIN-SEC-ISSUE-CD                                  
                 ,:DCLVASSET.ISIN-SEC-IS-STS-CD                                 
                 ,:DCLVASSET.ISIN-SEC-CDG-CD                                    
                 ,:DCLVASSET.ISIN-SEC-CD-STS-CD                                 
                 ,:DCLVASSET.ASSET-DESC-TXT                                     
                 ,:DCLVASSET.ASSET-DESC-STTS-CD                                 
                 ,:DCLVASSET.ASSET-RQST-QTY-CD                                  
                 ,:DCLVASSET.ASSET-RQST-STS-CD                                  
                 ,:DCLVASSET.AST-RQST-TRANS-CD                                  
                 ,:DCLVASSET.AST-RQ-TRAN-STS-CD                                 
                 ,:DCLVASSET.ASSET-QTY                                          
                 ,:DCLVASSET.ASSET-QTY-STTS-CD                                  
                 ,:DCLVASSET.ASSET-PCT                                          
                 ,:DCLVASSET.ASSET-PCT-STTS-CD                                  
                 ,:DCLVASSET.PSTN-CD                                            
                 ,:DCLVASSET.PSTN-CD-STTS-CD                                    
                 ,:DCLVASSET.ISO-CRNCY-CD                                       
                 ,:DCLVASSET.ISO-CRNCY-STTS-CD                                  
                 ,:DCLVASSET.ASSET-AMT                                          
                 ,:DCLVASSET.ASSET-AMT-STTS-CD                                  
                 ,:DCLVASSET.BEARER-BOND-CD                                     
                 ,:DCLVASSET.BEARER-BND-STTS-CD                                 
                 ,:DCLVASSET.CSH-MGN-SHRT-CD                                    
                 ,:DCLVASSET.CSH-MRG-SHT-STS-CD                                 
                 ,:DCLVASSET.WHI-CD                                             
                 ,:DCLVASSET.WHI-STTS-CD                                        
                 ,:DCLVASSET.TRNFR-TYPE-RSN-CD                                  
                 ,:DCLVASSET.TRN-TYP-RSN-STS-CD                                 
                 ,:DCLVASSET.MBS-SERIAL-NBR                                     
                 ,:DCLVASSET.MBS-SERIAL-STTS-CD                                 
                 ,:DCLVASSET.ASSET-CMNT-TXT                                     
                 ,:DCLVASSET.ASSET-CMNT-STTS-CD                                 
                 ,:DCLVASSET.NSCC-ACK-IND                                       
                 ,:DCLVASSET.NSCC-PEND-CD                                       
                 ,:DCLVASSET.FAIL-SENT-CAGE-IND                                 
                 ,:DCLVASSET.FAIL-OPEN-CAGE-IND                                 
                 ,:DCLVASSET.NSCC-NON-ADP-IND                                   
                 ,:DCLVASSET.TRANS-RFRN-ID-CD                                   
                 ,:DCLVASSET.TRANS-RFRN-STTS-CD                                 
                 ,:DCLVASSET.OPTN-CTGY-CD                                       
                 ,:DCLVASSET.OPTN-CTGY-STTS-CD                                  
                 ,:DCLVASSET.RCRD-LNGTH-STTS-CD                                 
                 ,:DCLVASSET.RCRD-STTS-CD                                       
                 ,:DCLVASSET.ISIN-SEC-EXCPT-IND                                 
                 ,:DCLVASSET.CRT-TMSTP                                          
                 ,:DCLVASSET.UPDT-TMSTP                                         
                 ,:DCLVASSET.CICS-TERM-ID-CD                                    
                 ,:DCLVASSET.PRGM-NM                                            
                 ,:DCLVASSET.SECURITY-ADP-NBR                                   
                 ,:DCLVASSET.RCL-SENT-NSCC-IND                                  
                 ,:DCLVASSET.FRV-SENT-NSCC-IND                                  
                 ,:DCLVASSET.TRNFR-TYPE-CD                                      
           END-EXEC.                                                            
           IF SQLCODE = 0                                                       
              SET ACAT11IO-ASSET-FOUND TO TRUE                                  
              PERFORM SET-MEMO-CD-RETURNED-RTN                                  
           ELSE                                                                 
           IF SQLCODE = +100                                                    
              SET ACAT11IO-ASSET-NOT-FOUND TO TRUE                              
           ELSE                                                                 
    ******    MOVE '** ACAT11DB - TFRCSR4A FETCH ERR  **     '                  
              PERFORM 9000-WRITE-TO-CICS-LOG                                    
              PERFORM 9500-RETURN-DB2-ERROR                                     
           END-IF.                                                              
                                                                                
LRM016 0075-READ-ACTIVE-PTD.                                            09130000
LRM016     IF ACAT11IO-GET-NEXT-PTD-A                                           
LRM016       EXEC SQL                                                           
LRM016        FETCH                                                             
LRM016            CSR_NXT_ACT_PTD                                               
LRM016             INTO                                                 09160000
LRM016              :ACAT11IO-DLVR-NBR                                  09190000
LRM016             ,:ACAT11IO-DLVR-ACCT                                 09190000
LRM016             ,:ACAT11IO-RCV-NBR                                   09190000
LRM016             ,:ACAT11IO-RCV-ACCT                                  09190000
LRM016             ,:ACAT11IO-RCV-ACCT-TYPE-CD                                  
LRM016             ,:ACAT11IO-CONTROL-NBR                                       
LRM016             ,:ACAT11IO-TRNFR-TYPE-CD                                     
LRM016             ,:ACAT11IO-RCV-CUST-NM                                       
LRM016             ,:ACAT11IO-RCV-SS-PRIM-NBR                                   
LRM016             ,:ACAT11IO-RCV-SS-SCNDY-NBR                                  
LRM016             ,:ACAT11IO-CMNT-TXT                                          
LRM016             ,:ACAT11IO-NSCC-PEND-CD                                      
LRM016             ,:ACAT11IO-NSCC-ACK-IND                                      
LRM016             ,:ACAT11IO-RR-CD                                             
LRM016             ,:ACAT11IO-ACCT-RJCT-RSBM-IND                        09170000
LRM016             ,:ACAT11IO-TRNFR-TYPE-RJCT-CD                        09170000
LRM016             ,:ACAT11IO-STTS-CD                                           
LRM016             ,:ACAT11IO-RCV-OCC-BRKR-NBR                                  
LRM016             ,:ACAT11IO-ACCT-ACTIVITY-IND                                 
LRM016             ,:ACAT11IO-ACCT-ORDERS-IND                                   
LRM016             ,:ACAT11IO-ACCT-DB-BAL-T1-IND                                
LRM016             ,:ACAT11IO-ACCT-MRGN-DB-IND                                  
LRM016             ,:ACAT11IO-ACCT-SHRT-PSTN-IND                                
LRM016             ,:ACAT11IO-ACCT-SEC-RSTRD-IND                                
LRM016             ,:ACAT11IO-ACCT-AST-EXCS-IND                                 
LRM016             ,:ACAT11IO-ACCT-OPTN-PSTN-IND                                
LRM016             ,:ACAT11IO-ACCT-LTD-PRTNR-IND                                
LRM016             ,:ACAT11IO-ACCT-TIN-MSMTH-IND                                
LRM016             ,:ACAT11IO-ACCT-DPLCT-TRN-IND                                
LRM016             ,:ACAT11IO-ACCT-CUST-70-IND                                  
LRM016             ,:ACAT11IO-ACCT-QULFD-PLN-IND                                
LRM016             ,:ACAT11IO-ACCT-MNGD-IND                                     
LRM016             ,:ACAT11IO-ACCT-PRVT-RNG-IND                                 
LRM016             ,:ACAT11IO-ACCT-BRKR-TIF-IND                                 
LRM016             ,:ACAT11IO-NSCC-NON-ADP-IND                                  
LRM016             ,:ACAT11IO-COMMENTS-IND                                      
LRM016             ,:ACAT11IO-TRNFR-RJC1-CD                                     
LRM016             ,:ACAT11IO-TRNFR-RJC2-CD                                     
LRM016             ,:ACAT11IO-ACCT-RB-SEC-IND                                   
LRM016             ,:ACAT11IO-ACCT-CLT-RSCND-IND                                
LRM016             ,:ACAT11IO-ACCT-LGL-BLK-IND                                  
LRM016             ,:ACAT11IO-SETTLE-DATE                                       
LRM017             ,:ACAT11IO-VTRNFR-FREEZE-IND                                 
LRM019             ,:ACAT11IO-STTLM-TM-CD                                       
LRM021             ,:ACAT11IO-GIFT-IND                                          
LRM016       END-EXEC                                                           
LRM016     ELSE                                                                 
LRM016       EXEC SQL                                                           
LRM016        FETCH                                                             
LRM016            CSR_PRV_ACT_PTD                                               
LRM016             INTO                                                 09160000
LRM016              :ACAT11IO-DLVR-NBR                                  09190000
LRM016             ,:ACAT11IO-DLVR-ACCT                                 09190000
LRM016             ,:ACAT11IO-RCV-NBR                                   09190000
LRM016             ,:ACAT11IO-RCV-ACCT                                  09190000
LRM016             ,:ACAT11IO-RCV-ACCT-TYPE-CD                                  
LRM016             ,:ACAT11IO-CONTROL-NBR                                       
LRM016             ,:ACAT11IO-TRNFR-TYPE-CD                                     
LRM016             ,:ACAT11IO-RCV-CUST-NM                                       
LRM016             ,:ACAT11IO-RCV-SS-PRIM-NBR                                   
LRM016             ,:ACAT11IO-RCV-SS-SCNDY-NBR                                  
LRM016             ,:ACAT11IO-CMNT-TXT                                          
LRM016             ,:ACAT11IO-NSCC-PEND-CD                                      
LRM016             ,:ACAT11IO-NSCC-ACK-IND                                      
LRM016             ,:ACAT11IO-RR-CD                                             
LRM016             ,:ACAT11IO-ACCT-RJCT-RSBM-IND                        09170000
LRM016             ,:ACAT11IO-TRNFR-TYPE-RJCT-CD                        09170000
LRM016             ,:ACAT11IO-STTS-CD                                           
LRM016             ,:ACAT11IO-RCV-OCC-BRKR-NBR                                  
LRM016             ,:ACAT11IO-ACCT-ACTIVITY-IND                                 
LRM016             ,:ACAT11IO-ACCT-ORDERS-IND                                   
LRM016             ,:ACAT11IO-ACCT-DB-BAL-T1-IND                                
LRM016             ,:ACAT11IO-ACCT-MRGN-DB-IND                                  
LRM016             ,:ACAT11IO-ACCT-SHRT-PSTN-IND                                
LRM016             ,:ACAT11IO-ACCT-SEC-RSTRD-IND                                
LRM016             ,:ACAT11IO-ACCT-AST-EXCS-IND                                 
LRM016             ,:ACAT11IO-ACCT-OPTN-PSTN-IND                                
LRM016             ,:ACAT11IO-ACCT-LTD-PRTNR-IND                                
LRM016             ,:ACAT11IO-ACCT-TIN-MSMTH-IND                                
LRM016             ,:ACAT11IO-ACCT-DPLCT-TRN-IND                                
LRM016             ,:ACAT11IO-ACCT-CUST-70-IND                                  
LRM016             ,:ACAT11IO-ACCT-QULFD-PLN-IND                                
LRM016             ,:ACAT11IO-ACCT-MNGD-IND                                     
LRM016             ,:ACAT11IO-ACCT-PRVT-RNG-IND                                 
LRM016             ,:ACAT11IO-ACCT-BRKR-TIF-IND                                 
LRM016             ,:ACAT11IO-NSCC-NON-ADP-IND                                  
LRM016             ,:ACAT11IO-COMMENTS-IND                                      
LRM016             ,:ACAT11IO-TRNFR-RJC1-CD                                     
LRM016             ,:ACAT11IO-TRNFR-RJC2-CD                                     
LRM016             ,:ACAT11IO-ACCT-RB-SEC-IND                                   
LRM016             ,:ACAT11IO-ACCT-CLT-RSCND-IND                                
LRM016             ,:ACAT11IO-ACCT-LGL-BLK-IND                                  
LRM016             ,:ACAT11IO-SETTLE-DATE                                       
LRM017             ,:ACAT11IO-VTRNFR-FREEZE-IND                                 
LRM019             ,:ACAT11IO-STTLM-TM-CD                                       
LRM021             ,:ACAT11IO-GIFT-IND                                          
LRM016        END-EXEC                                                          
LRM016     END-IF.                                                              
LRM016     IF SQLCODE = 0                                                       
LRM016        MOVE ACAT11IO-RR-CD TO SRCH-INP-RR                                
LRM016        MOVE ACAT11IO-DLVR-ACCT(1 : 3) TO SRCH-INP-BRANCH                 
LRM016        PERFORM 0075-SIGNON-SECR-CHECK-RTN                                
LRM016        IF SRCH-SIGNON-SECR-CHECK-FAIL                                    
LRM016          GO TO 0075-READ-ACTIVE-PTD                                      
LRM016        END-IF                                                            
LRM016        SET ACAT11IO-FOUND TO TRUE                                        
NG*********   PERFORM 0128-GET-PTR-ASSET  INITIAL TBL                           
NG******      SET PTR-DLVY-ASSET-NOTFND TO TRUE                                 
LRM016        PERFORM 0130-GET-VASSET-DOLLAR-AMTS                       09130000
LRM016        PERFORM 0152-SET-COMMENT-IND                                      
LRM016     ELSE                                                                 
LRM016     IF SQLCODE = +100                                                    
LRM016        SET ACAT11IO-NOT-FOUND TO TRUE                                    
LRM016     ELSE                                                                 
LRM016        PERFORM 9000-WRITE-TO-CICS-LOG                                    
LRM016        PERFORM 9500-RETURN-DB2-ERROR                                     
LRM016     END-IF.                                                              
       0077-MOVE-ASSET-TO-IOAREA.                                               
           MOVE ASSET-SEQ-NBR      OF DCLVASSET TO                              
                  ACAT11IO-ASSET-SEQ-NBR                                        
           MOVE ASSET-PRC-CTGY-CD  OF DCLVASSET TO                              
                  ACAT11IO-ASSET-PRC-CTGY-CD                                    
           MOVE STTLM-LCTN-CD      OF DCLVASSET TO                              
                  ACAT11IO-STTLM-LCTN-CD                                        
           IF STTLM-RSN-CD OF DCLVASSET   = 'SFK '                              
              MOVE 'SK' TO ACAT11IO-MEMO-CD                                     
           ELSE                                                                 
              MOVE '  ' TO ACAT11IO-MEMO-CD                                     
           END-IF.                                                              
           MOVE STTLM-RSN-CD OF DCLVASSET TO                                    
                  ACAT11IO-SLOC-RSN                                             
           MOVE ISIN-CNTRY-CD      OF DCLVASSET TO                              
                  ACAT11IO-ISIN-CNTRY-CD                                        
           MOVE ISIN-SEC-ISSUE-CD  OF DCLVASSET TO                              
                  ACAT11IO-ISIN-SEC-ISSUE-CD                                    
           MOVE ISIN-SEC-CDG-CD    OF DCLVASSET TO                              
                  ACAT11IO-ISIN-SEC-CDG-CD                                      
           MOVE ASSET-DESC-TXT     OF DCLVASSET TO                              
                  ACAT11IO-DESC-TXT                                             
           MOVE ASSET-RQST-QTY-CD  OF DCLVASSET TO                              
                  ACAT11IO-ASSET-RQST-QTY-CD                                    
           IF TRNFR-TYPE-CD OF DCLVASSET = 'PTR'                                
              MOVE AST-RQST-TRANS-CD  OF DCLVASSET TO                           
                  ACAT11IO-AST-RQST-TRANS-CD                                    
           ELSE                                                                 
               SET ACAT11IO-RQST-ASSET-QTY TO TRUE.                             
           MOVE ASSET-QTY          OF DCLVASSET TO                              
                  ACAT11IO-ASSET-QTY                                            
           MOVE ASSET-PCT          OF DCLVASSET TO                              
                  ACAT11IO-ASSET-PCT                                            
           MOVE PSTN-CD            OF DCLVASSET TO                              
                  ACAT11IO-PSTN-CD                                              
           MOVE ASSET-AMT          OF DCLVASSET TO                              
                  ACAT11IO-ASSET-AMT                                            
           MOVE CSH-MGN-SHRT-CD    OF DCLVASSET TO                              
                  ACAT11IO-CSH-MGN-SHRT-CD                                      
           MOVE WHI-CD             OF DCLVASSET TO                              
                  ACAT11IO-WHI-CD                                               
           MOVE ASSET-CMNT-TXT     OF DCLVASSET TO                              
                  ACAT11IO-ASSET-CMNT-TXT                                       
           MOVE SECURITY-ADP-NBR   OF DCLVASSET TO                              
                  ACAT11IO-ADP-NBR.                                             
                                                                                
       0075-SIGNON-SECR-CHECK-RTN.                                              
           IF ACAT11IO-SUPER-SIGN-ON                                            
              SET SRCH-SIGNON-SECR-CHECK-PASS TO TRUE                           
           ELSE                                                                 
              SET SECURITY-LOOKUP TO TRUE                                       
              EXEC CICS LINK PROGRAM (WS-ACATSRCH)                      02890002
                  COMMAREA(ACAT-SRCH-COMM-AREA)                         02900002
                  LENGTH(LENGTH OF ACAT-SRCH-COMM-AREA)                 02910002
              END-EXEC                                                  02920002
           END-IF.                                                              
       SKIP3                                                                    
       0080-CLOSE-TFRCSRA.                                                      
           EXEC SQL                                                             
              CLOSE TFRCSRA                                                     
           END-EXEC.                                                            
       0080-CLOSE-CSR-PRV-ACT-PTR.                                              
           EXEC SQL                                                             
              CLOSE CSR_PRV_ACT_PTR                                             
           END-EXEC.                                                            
       0080-CLOSE-CSR-NXT-ACT-PTR.                                              
           EXEC SQL                                                             
              CLOSE CSR_NXT_ACT_PTR                                             
           END-EXEC.                                                            
       0080-CLOSE-TFRCSR1.                                                      
           EXEC SQL                                                             
              CLOSE TFRCSR1                                                     
           END-EXEC.                                                            
       0080-CLOSE-TFRCSRS.                                                      
           EXEC SQL                                                             
              CLOSE TFRCSRS                                                     
           END-EXEC.                                                            
       0080-CLOSE-TFRCSRSA.                                                     
           EXEC SQL                                                             
              CLOSE TFRCSRSA                                                    
           END-EXEC.                                                            
       0080-CLOSE-TFRCSR4.                                                      
           EXEC SQL                                                             
              CLOSE TFRCSR4                                                     
           END-EXEC.                                                            
       0080-CLOSE-TFRCSR4A.                                                     
           EXEC SQL                                                             
              CLOSE TFRCSR4A                                                    
           END-EXEC.                                                            
       0080-CLOSE-TFRCSRAA.                                                     
           EXEC SQL                                                             
              CLOSE TFRCSRAA                                                    
           END-EXEC.                                                            
       0080-CLOSE-VASSET-CRSRX.                                                 
           EXEC SQL                                                             
              CLOSE VASSET_CRSRX                                                
           END-EXEC.                                                            
LRM016 0080-CLOSE-CURSOR-PTD.                                                   
LRM016     EXEC SQL                                                             
LRM016        CLOSE CSR_NXT_ACT_PTD                                             
LRM016     END-EXEC.                                                            
                                                                                
LRM016 0080-CLOSE-CURSOR-PTD-PREV.                                              
LRM016     EXEC SQL                                                             
LRM016        CLOSE CSR_PRV_ACT_PTD                                             
LRM016     END-EXEC.                                                            
       EJECT                                                                    
       0100-GET-ACTITRF.                                                09130000
           EXEC SQL SELECT                                              09140000
                   RCV_ACCT_TYPE_CD                                             
                  ,ACAT_CONTROL_NBR                                             
                  ,TRNFR_TYPE_CD                                                
                  ,RCV_CUST_NM                                                  
                  ,RCV_SS_PRIM_NBR                                      09150000
                  ,RCV_SS_SCNDY_NBR                                             
                  ,CMNT_TXT                                                     
                  ,TRNFR_TYPE_RJCT_CD                                           
                  ,NSCC_PEND_CD                                                 
                  ,NSCC_ACK_IND                                                 
                  ,STTS_CD                                                      
                  ,RR_CD                                                        
                  ,UPDT_TMSTP                                                   
                 INTO                                                   09160000
                   :ACAT11IO-RCV-ACCT-TYPE-CD                                   
                  ,:ACAT11IO-CONTROL-NBR                                        
                  ,:ACAT11IO-TRNFR-TYPE-CD                                      
                  ,:ACAT11IO-RCV-CUST-NM                                        
                  ,:ACAT11IO-RCV-SS-PRIM-NBR                                    
                  ,:ACAT11IO-RCV-SS-SCNDY-NBR                                   
                  ,:ACAT11IO-CMNT-TXT                                           
                  ,:ACAT11IO-REJECT-CODE                                09170000
                  ,:ACAT11IO-NSCC-PEND-CD                                       
                  ,:ACAT11IO-NSCC-ACK-IND                                       
                  ,:ACAT11IO-STTS-CD                                            
                  ,:ACAT11IO-RR-CD                                              
                  ,:ACAT11IO-UPDT-TMSTP                                         
                 FROM ACTITRF                                           09170000
                  WHERE (CLIENT_NBR                                     09180000
                              = :ACAT11IO-CLIENT-NBR                    09190000
                     AND DLVR_NBR                                       09180000
                              = :ACAT11IO-DLVR-NBR                      09190000
                     AND ACCT_DLVR_NBR                                  09180000
                              = :ACAT11IO-DLVR-ACCT                     09190000
                     AND RCV_NBR                                        09180000
                              = :ACAT11IO-RCV-NBR                       09190000
                     AND ACCT_RCV_NBR                                   09180000
                              = :ACAT11IO-RCV-ACCT                      09190000
                     AND TRNFR_TYPE_CD                                  09180000
LRM025                        = :ACAT11IO-TRNFR-TYPE-CD)                09190000
093200      END-EXEC.                                                   09200000
093300*                                                                 09210000
093400      EVALUATE SQLCODE                                            09220000
093800          WHEN +0                                                 09260000
LRM007          WHEN -811                                                       
                     SET ACAT11IO-FOUND TO TRUE                                 
                     PERFORM 0110-GET-ACTIAST-DOLLAR-AMTS               09130000
093800          WHEN +100                                               09260000
LRM008               CONTINUE                                                   
LRM008               SET ACAT11IO-NOT-FOUND TO TRUE                             
LRM008***************PERFORM 0120-READ-ACTIVE-ACAT                              
094000          WHEN OTHER                                              09280000
                     PERFORM 9000-WRITE-TO-CICS-LOG                             
                     PERFORM 9500-RETURN-DB2-ERROR                              
094200      END-EVALUATE.                                               09300000
                                                                                
094300*                                                                 09310000
094400 0100-EXIT.                                                       09320000
094500     EXIT.                                                        09330000
                                                                                
           EJECT                                                                
       0110-GET-ACTIAST-DOLLAR-AMTS.                                    09130000
LRM006     MOVE ZEROS TO ACAT11IO-PCT-01                                        
LRM006                   ACAT11IO-PCT-02                                        
LRM006                   ACAT11IO-PCT-05                                        
LRM006                   ACAT11IO-PCT-SMA.                                      
LRM015     MOVE SPACES TO ACAT11IO-AMT-01-RQST-CD                               
LRM015                    ACAT11IO-AMT-02-RQST-CD                               
LRM015                    ACAT11IO-AMT-05-RQST-CD.                              
      *** READ FOR TYPE 01 CASH                                                 
LRM008***  MOVE SPACES TO ACAT11IO-DLVR-ACCT(9 : 12).                           
           EXEC SQL SELECT                                              09140000
                   ASSET_AMT                                                    
                  ,ASSET_CMNT_TXT                                               
                  ,STTLM_RSN_CD                                                 
LRM003            ,NSCC_PEND_CD                                                 
                 INTO                                                   09160000
                   :DCLACTIAST.ASSET-AMT                                        
                  ,:ACAT11IO-ASSET-CMNT1-TXT                                    
                  ,:DCLACTIAST.STTLM-RSN-CD                                     
LRM003            ,:WS-NSCC-PEND-CD                                             
                 FROM ACTIAST                                           09170000
                  WHERE (CLIENT_NBR                                     09180000
                              = :ACAT11IO-CLIENT-NBR                    09190000
                     AND DLVR_NBR                                       09180000
                              = :ACAT11IO-DLVR-NBR                      09190000
                     AND ACCT_DLVR_NBR                                  09180000
                              = :ACAT11IO-DLVR-ACCT                     09190000
                     AND RCV_NBR                                        09180000
                              = :ACAT11IO-RCV-NBR                       09190000
                     AND ACCT_RCV_NBR                                   09180000
                              = :ACAT11IO-RCV-ACCT                      09190000
LRM003               AND TRNFR_TYPE_CD                                          
LRM003                        = :ACAT11IO-TRNFR-TYPE-CD                         
LRM009               AND ACAT_CONTROL_NBR                               09180000
LRM009                        = :ACAT11IO-CONTROL-NBR                           
                     AND ISIN_CNTRY_CD                                  09180000
                              = '  '                                    09190000
                     AND ISIN_SEC_ISSUE_CD                              09180000
                              = '         '                             09190000
                     AND STTLM_LCTN_CD                                  09180000
                              = '40'                                    09190000
                     AND CSH_MGN_SHRT_CD                                09180000
                              = 'C')                                    09190000
093200      END-EXEC.                                                   09200000
093300*                                                                 09210000
093400      EVALUATE SQLCODE                                            09220000
093800          WHEN +0                                                 09260000
LRM003               SET PTR-DLVY-ASSET-FOUND TO TRUE                           
                     MOVE ASSET-AMT OF DCLACTIAST TO ACAT11IO-AMT-01            
                     IF STTLM-RSN-CD OF DCLACTIAST = 'CRED'                     
                        SET ACAT11IO-AMT-01-CREDIT TO TRUE                      
                     ELSE                                                       
                        MOVE SPACES TO ACAT11IO-AMT-01-CREDIT-IND               
                     END-IF                                                     
LRM003               IF ACAT11IO-TRNFR-TYPE-CD = 'PTR'                          
LRM003                  MOVE WS-NSCC-PEND-CD TO ACAT11IO-NSCC-PEND-CD           
LRM003               END-IF                                                     
093800          WHEN +100                                               09260000
                     MOVE ZEROS TO ACAT11IO-AMT-01                              
                     MOVE SPACES TO ACAT11IO-ASSET-CMNT1-TXT                    
094000          WHEN OTHER                                              09280000
                     PERFORM 9000-WRITE-TO-CICS-LOG                             
                     PERFORM 9500-RETURN-DB2-ERROR                              
094200      END-EVALUATE.                                               09300000
094300*                                                                 09310000
      *** READ FOR TYPE 02 MARGIN                                               
           EXEC SQL SELECT                                              09140000
                   ASSET_AMT                                                    
                  ,ASSET_CMNT_TXT                                               
                  ,STTLM_RSN_CD                                                 
LRM003            ,NSCC_PEND_CD                                                 
                 INTO                                                   09160000
                   :DCLACTIAST.ASSET-AMT                                        
                  ,:ACAT11IO-ASSET-CMNT2-TXT                                    
                  ,:DCLACTIAST.STTLM-RSN-CD                                     
LRM003            ,:WS-NSCC-PEND-CD                                             
                 FROM ACTIAST                                           09170000
                  WHERE (CLIENT_NBR                                     09180000
                              = :ACAT11IO-CLIENT-NBR                    09190000
                     AND DLVR_NBR                                       09180000
                              = :ACAT11IO-DLVR-NBR                      09190000
                     AND ACCT_DLVR_NBR                                  09180000
                              = :ACAT11IO-DLVR-ACCT                     09190000
                     AND RCV_NBR                                        09180000
                              = :ACAT11IO-RCV-NBR                       09190000
                     AND ACCT_RCV_NBR                                   09180000
                              = :ACAT11IO-RCV-ACCT                      09190000
LRM003               AND TRNFR_TYPE_CD                                          
LRM003                        = :ACAT11IO-TRNFR-TYPE-CD                         
LRM009               AND ACAT_CONTROL_NBR                               09180000
LRM009                        = :ACAT11IO-CONTROL-NBR                           
                     AND ISIN_CNTRY_CD                                  09180000
                              = '  '                                    09190000
                     AND ISIN_SEC_ISSUE_CD                              09180000
                              = '         '                             09190000
                     AND STTLM_LCTN_CD                                  09180000
                              = '40'                                    09190000
                     AND CSH_MGN_SHRT_CD                                09180000
                              = 'M')                                    09190000
093200      END-EXEC.                                                   09200000
093300*                                                                 09210000
093400      EVALUATE SQLCODE                                            09220000
093800          WHEN +0                                                 09260000
LRM003               SET PTR-DLVY-ASSET-FOUND TO TRUE                           
                     MOVE ASSET-AMT OF DCLACTIAST TO ACAT11IO-AMT-02            
                     IF STTLM-RSN-CD OF DCLACTIAST = 'CRED'                     
                        SET ACAT11IO-AMT-02-CREDIT TO TRUE                      
                     ELSE                                                       
                        MOVE SPACES TO ACAT11IO-AMT-02-CREDIT-IND               
                     END-IF                                                     
LRM003               IF ACAT11IO-TRNFR-TYPE-CD = 'PTR'                          
LRM003                  MOVE WS-NSCC-PEND-CD TO ACAT11IO-NSCC-PEND-CD           
LRM003               END-IF                                                     
093800          WHEN +100                                               09260000
                     MOVE ZEROS TO ACAT11IO-AMT-02                              
                     MOVE SPACES TO ACAT11IO-ASSET-CMNT2-TXT                    
094000          WHEN OTHER                                              09280000
                     PERFORM 9000-WRITE-TO-CICS-LOG                             
                     PERFORM 9500-RETURN-DB2-ERROR                              
094200      END-EVALUATE.                                               09300000
                                                                                
      *** READ FOR TYPE 05 SHORT                                                
           EXEC SQL SELECT                                              09140000
                   ASSET_AMT                                                    
                  ,ASSET_CMNT_TXT                                               
                  ,STTLM_RSN_CD                                                 
LRM003            ,NSCC_PEND_CD                                                 
                 INTO                                                   09160000
                   :DCLACTIAST.ASSET-AMT                                        
                  ,:ACAT11IO-ASSET-CMNT5-TXT                                    
                  ,:DCLACTIAST.STTLM-RSN-CD                                     
LRM003            ,:WS-NSCC-PEND-CD                                             
                 FROM ACTIAST                                           09170000
                  WHERE (CLIENT_NBR                                     09180000
                              = :ACAT11IO-CLIENT-NBR                    09190000
                     AND DLVR_NBR                                       09180000
                              = :ACAT11IO-DLVR-NBR                      09190000
                     AND ACCT_DLVR_NBR                                  09180000
                              = :ACAT11IO-DLVR-ACCT                     09190000
                     AND RCV_NBR                                        09180000
                              = :ACAT11IO-RCV-NBR                       09190000
                     AND ACCT_RCV_NBR                                   09180000
                              = :ACAT11IO-RCV-ACCT                      09190000
LRM003               AND TRNFR_TYPE_CD                                          
LRM003                        = :ACAT11IO-TRNFR-TYPE-CD                         
LRM009               AND ACAT_CONTROL_NBR                               09180000
LRM009                        = :ACAT11IO-CONTROL-NBR                           
                     AND ISIN_CNTRY_CD                                  09180000
                              = '  '                                    09190000
                     AND ISIN_SEC_ISSUE_CD                              09180000
                              = '         '                             09190000
                     AND STTLM_LCTN_CD                                  09180000
                              = '40'                                    09190000
                     AND CSH_MGN_SHRT_CD                                09180000
                              = 'S')                                    09190000
093200      END-EXEC.                                                   09200000
093300*                                                                 09210000
093400      EVALUATE SQLCODE                                            09220000
093800          WHEN +0                                                 09260000
LRM003               SET PTR-DLVY-ASSET-FOUND TO TRUE                           
                     MOVE ASSET-AMT OF DCLACTIAST TO ACAT11IO-AMT-05            
                     IF STTLM-RSN-CD OF DCLACTIAST = 'CRED'                     
                        SET ACAT11IO-AMT-05-CREDIT TO TRUE                      
                     ELSE                                                       
                        MOVE SPACES TO ACAT11IO-AMT-05-CREDIT-IND               
                     END-IF                                                     
LRM003               IF ACAT11IO-TRNFR-TYPE-CD = 'PTR'                          
LRM003                  MOVE WS-NSCC-PEND-CD TO ACAT11IO-NSCC-PEND-CD           
LRM003               END-IF                                                     
093800          WHEN +100                                               09260000
                     MOVE ZEROS TO ACAT11IO-AMT-05                              
                     MOVE SPACES TO ACAT11IO-ASSET-CMNT5-TXT                    
094000          WHEN OTHER                                              09280000
                     PERFORM 9000-WRITE-TO-CICS-LOG                             
                     PERFORM 9500-RETURN-DB2-ERROR                              
094200      END-EVALUATE.                                               09300000
                                                                                
      *** READ FOR SMA AMOUNT                                                   
           EXEC SQL SELECT                                              09140000
                   ASSET_AMT                                                    
                  ,ASSET_CMNT_TXT                                               
                  ,STTLM_RSN_CD                                                 
LRM003            ,NSCC_PEND_CD                                                 
                 INTO                                                   09160000
                   :DCLACTIAST.ASSET-AMT                                        
                  ,:ACAT11IO-ASSET-CMNTM-TXT                                    
                  ,:DCLACTIAST.STTLM-RSN-CD                                     
LRM003            ,:WS-NSCC-PEND-CD                                             
                 FROM ACTIAST                                           09170000
                  WHERE (CLIENT_NBR                                     09180000
                              = :ACAT11IO-CLIENT-NBR                    09190000
                     AND DLVR_NBR                                       09180000
                              = :ACAT11IO-DLVR-NBR                      09190000
                     AND ACCT_DLVR_NBR                                  09180000
                              = :ACAT11IO-DLVR-ACCT                     09190000
                     AND RCV_NBR                                        09180000
                              = :ACAT11IO-RCV-NBR                       09190000
                     AND ACCT_RCV_NBR                                   09180000
                              = :ACAT11IO-RCV-ACCT                      09190000
LRM003               AND TRNFR_TYPE_CD                                          
LRM003                        = :ACAT11IO-TRNFR-TYPE-CD                         
LRM009               AND ACAT_CONTROL_NBR                               09180000
LRM009                        = :ACAT11IO-CONTROL-NBR                           
                     AND ISIN_CNTRY_CD                                  09180000
                              = '  '                                    09190000
                     AND ISIN_SEC_ISSUE_CD                              09180000
                              = '         '                             09190000
                     AND STTLM_LCTN_CD                                  09180000
                              = '45'                                    09190000
                     AND STTLM_RSN_CD                                   09180000
                              = 'SMA ')                                 09190000
093200      END-EXEC.                                                   09200000
093300*                                                                 09210000
093400      EVALUATE SQLCODE                                            09220000
093800          WHEN +0                                                 09260000
LRM003               SET PTR-DLVY-ASSET-FOUND TO TRUE                           
                     MOVE ASSET-AMT OF DCLACTIAST TO ACAT11IO-AMT-SMA           
LRM003               IF ACAT11IO-TRNFR-TYPE-CD = 'PTR'                          
LRM003                  MOVE WS-NSCC-PEND-CD TO ACAT11IO-NSCC-PEND-CD           
LRM003               END-IF                                                     
093800          WHEN +100                                               09260000
                     MOVE ZEROS TO ACAT11IO-AMT-SMA                             
                     MOVE SPACES TO ACAT11IO-ASSET-CMNTM-TXT                    
094000          WHEN OTHER                                              09280000
                     PERFORM 9000-WRITE-TO-CICS-LOG                             
                     PERFORM 9500-RETURN-DB2-ERROR                              
094200      END-EVALUATE.                                               09300000
094300*                                                                 09310000
           EJECT                                                                
       0120-READ-ACTIVE-ACAT.                                                   
LRM****** NOT SURE IF THERE CAN BE MULTIPLE HITS ON ACTIVE TABLE BELOW          
LRM****** FOR GIVEN PTD, RCV, RCV-ACCT, DLVR, DLVR-ACCT FIELDS.                 
            EXEC SQL SELECT                                             09140000
                   ACAT_CONTROL_NBR                                     09180000
                  ,ACCT_RCV_NBR                                         09180000
                  ,DLVR_NBR                                             09180000
                  ,ACCT_DLVR_NBR                                        09180000
                  ,RCV_ACCT_TYPE_CD                                             
                  ,RCV_CUST_NM                                                  
                  ,RCV_SS_PRIM_NBR                                      09150000
                  ,RCV_SS_SCNDY_NBR                                             
                  ,CMNT_TXT                                                     
                  ,STTS_CD                                                      
                  ,RR_CD                                                        
                  ,RCV_OCC_BRKR_NBR                                             
LRM003            ,STTLM_DT                                                     
                   INTO                                                 09160000
                    :ACAT11IO-CONTROL-NBR                                       
                   ,:ACAT11IO-RCV-ACCT                                  09190000
                   ,:ACAT11IO-DLVR-NBR                                  09190000
                   ,:ACAT11IO-DLVR-ACCT                                 09190000
                   ,:ACAT11IO-RCV-ACCT-TYPE-CD                                  
                   ,:ACAT11IO-RCV-CUST-NM                                       
                   ,:ACAT11IO-RCV-SS-PRIM-NBR                                   
                   ,:ACAT11IO-RCV-SS-SCNDY-NBR                                  
                   ,:ACAT11IO-CMNT-TXT                                          
                   ,:ACAT11IO-STTS-CD                                           
                   ,:ACAT11IO-RR-CD                                             
                   ,:ACAT11IO-RCV-OCC-BRKR-NBR                                  
LRM003             ,:ACAT11IO-SETTLE-DATE                                       
                   FROM VTRNFR                                          09170000
                  WHERE (CLIENT_NBR                                     09180000
                              = :ACAT11IO-CLIENT-NBR                    09190000
                     AND DLVR_NBR                                       09180000
                              = :ACAT11IO-DLVR-NBR                      09190000
                     AND ACCT_DLVR_NBR                                  09180000
                              = :ACAT11IO-DLVR-ACCT                     09190000
                     AND RCV_NBR                                        09180000
                              = :ACAT11IO-RCV-NBR                       09190000
                     AND ACCT_RCV_NBR                                   09180000
                              = :ACAT11IO-RCV-ACCT                      09190000
                     AND TRNFR_TYPE_CD                                  09180000
                              = 'PTD')                                  09190000
            END-EXEC                                                            
093400      EVALUATE SQLCODE                                            09220000
093800          WHEN +0                                                 09260000
                     SET ACAT11IO-ACTIVE-FOUND TO TRUE                          
                     PERFORM 0130-GET-VASSET-DOLLAR-AMTS                09130000
093800          WHEN +100                                               09260000
                     SET ACAT11IO-NOT-FOUND TO TRUE                             
094000          WHEN OTHER                                              09280000
                     PERFORM 9000-WRITE-TO-CICS-LOG                             
                     PERFORM 9500-RETURN-DB2-ERROR                              
094200      END-EVALUATE.                                               09300000
094300*                                                                 09310000
       0125-READ-NEXT-PTR.                                                      
LRM008     IF ACAT11IO-GET-NEXT-PTR-CN                                          
             EXEC SQL                                                           
              FETCH                                                             
                  CSR_NXT_CNTL_NBR                                              
                   INTO                                                 09160000
                    :ACAT11IO-DLVR-NBR                                  09190000
                   ,:ACAT11IO-DLVR-ACCT                                 09190000
                   ,:ACAT11IO-RCV-NBR                                   09190000
                   ,:ACAT11IO-RCV-ACCT                                  09190000
                   ,:ACAT11IO-RCV-ACCT-TYPE-CD                                  
                   ,:ACAT11IO-CONTROL-NBR                                       
                   ,:ACAT11IO-TRNFR-TYPE-CD                                     
                   ,:ACAT11IO-RCV-CUST-NM                                       
                   ,:ACAT11IO-RCV-SS-PRIM-NBR                                   
                   ,:ACAT11IO-RCV-SS-SCNDY-NBR                                  
                   ,:ACAT11IO-CMNT-TXT                                          
                   ,:ACAT11IO-NSCC-PEND-CD                                      
                   ,:ACAT11IO-NSCC-ACK-IND                                      
                   ,:ACAT11IO-RR-CD                                             
                   ,:ACAT11IO-ACCT-RJCT-RSBM-IND                        09170000
LRM003             ,:ACAT11IO-TRNFR-TYPE-RJCT-CD                        09170000
                   ,:ACAT11IO-STTS-CD                                           
                   ,:ACAT11IO-RCV-OCC-BRKR-NBR                                  
LRM003             ,:ACAT11IO-ACCT-ACTIVITY-IND                                 
LRM003             ,:ACAT11IO-ACCT-ORDERS-IND                                   
LRM003             ,:ACAT11IO-ACCT-DB-BAL-T1-IND                                
LRM003             ,:ACAT11IO-ACCT-MRGN-DB-IND                                  
LRM003             ,:ACAT11IO-ACCT-SHRT-PSTN-IND                                
LRM003             ,:ACAT11IO-ACCT-SEC-RSTRD-IND                                
LRM003             ,:ACAT11IO-ACCT-AST-EXCS-IND                                 
LRM003             ,:ACAT11IO-ACCT-OPTN-PSTN-IND                                
LRM003             ,:ACAT11IO-ACCT-LTD-PRTNR-IND                                
LRM003             ,:ACAT11IO-ACCT-TIN-MSMTH-IND                                
LRM003             ,:ACAT11IO-ACCT-DPLCT-TRN-IND                                
LRM003             ,:ACAT11IO-ACCT-CUST-70-IND                                  
LRM003             ,:ACAT11IO-ACCT-QULFD-PLN-IND                                
LRM003             ,:ACAT11IO-ACCT-MNGD-IND                                     
LRM003             ,:ACAT11IO-ACCT-PRVT-RNG-IND                                 
LRM003             ,:ACAT11IO-ACCT-BRKR-TIF-IND                                 
LRM003             ,:ACAT11IO-NSCC-NON-ADP-IND                                  
LRM003             ,:ACAT11IO-COMMENTS-IND                                      
LRM003             ,:ACAT11IO-TRNFR-RJC1-CD                                     
LRM003             ,:ACAT11IO-TRNFR-RJC2-CD                                     
LRM003             ,:ACAT11IO-ACCT-RB-SEC-IND                                   
LRM003             ,:ACAT11IO-ACCT-CLT-RSCND-IND                                
LRM003             ,:ACAT11IO-ACCT-LGL-BLK-IND                                  
LRM003             ,:ACAT11IO-SETTLE-DATE                                       
LRM017             ,:ACAT11IO-VTRNFR-FREEZE-IND                                 
LRM019             ,:ACAT11IO-STTLM-TM-CD                                       
             END-EXEC                                                           
           ELSE                                                                 
             EXEC SQL                                                           
              FETCH                                                             
                  CSR_NXT_ACT_PTR                                               
                   INTO                                                 09160000
                    :ACAT11IO-DLVR-NBR                                  09190000
                   ,:ACAT11IO-DLVR-ACCT                                 09190000
                   ,:ACAT11IO-RCV-NBR                                   09190000
                   ,:ACAT11IO-RCV-ACCT                                  09190000
                   ,:ACAT11IO-RCV-ACCT-TYPE-CD                                  
                   ,:ACAT11IO-CONTROL-NBR                                       
                   ,:ACAT11IO-TRNFR-TYPE-CD                                     
                   ,:ACAT11IO-RCV-CUST-NM                                       
                   ,:ACAT11IO-RCV-SS-PRIM-NBR                                   
                   ,:ACAT11IO-RCV-SS-SCNDY-NBR                                  
                   ,:ACAT11IO-CMNT-TXT                                          
                   ,:ACAT11IO-NSCC-PEND-CD                                      
                   ,:ACAT11IO-NSCC-ACK-IND                                      
                   ,:ACAT11IO-RR-CD                                             
                   ,:ACAT11IO-ACCT-RJCT-RSBM-IND                        09170000
LRM003             ,:ACAT11IO-TRNFR-TYPE-RJCT-CD                        09170000
                   ,:ACAT11IO-STTS-CD                                           
                   ,:ACAT11IO-RCV-OCC-BRKR-NBR                                  
LRM003             ,:ACAT11IO-ACCT-ACTIVITY-IND                                 
LRM003             ,:ACAT11IO-ACCT-ORDERS-IND                                   
LRM003             ,:ACAT11IO-ACCT-DB-BAL-T1-IND                                
LRM003             ,:ACAT11IO-ACCT-MRGN-DB-IND                                  
LRM003             ,:ACAT11IO-ACCT-SHRT-PSTN-IND                                
LRM003             ,:ACAT11IO-ACCT-SEC-RSTRD-IND                                
LRM003             ,:ACAT11IO-ACCT-AST-EXCS-IND                                 
LRM003             ,:ACAT11IO-ACCT-OPTN-PSTN-IND                                
LRM003             ,:ACAT11IO-ACCT-LTD-PRTNR-IND                                
LRM003             ,:ACAT11IO-ACCT-TIN-MSMTH-IND                                
LRM003             ,:ACAT11IO-ACCT-DPLCT-TRN-IND                                
LRM003             ,:ACAT11IO-ACCT-CUST-70-IND                                  
LRM003             ,:ACAT11IO-ACCT-QULFD-PLN-IND                                
LRM003             ,:ACAT11IO-ACCT-MNGD-IND                                     
LRM003             ,:ACAT11IO-ACCT-PRVT-RNG-IND                                 
LRM003             ,:ACAT11IO-ACCT-BRKR-TIF-IND                                 
LRM003             ,:ACAT11IO-NSCC-NON-ADP-IND                                  
LRM003             ,:ACAT11IO-COMMENTS-IND                                      
LRM003             ,:ACAT11IO-TRNFR-RJC1-CD                                     
LRM003             ,:ACAT11IO-TRNFR-RJC2-CD                                     
LRM003             ,:ACAT11IO-ACCT-RB-SEC-IND                                   
LRM003             ,:ACAT11IO-ACCT-CLT-RSCND-IND                                
LRM003             ,:ACAT11IO-ACCT-LGL-BLK-IND                                  
LRM003             ,:ACAT11IO-SETTLE-DATE                                       
LRM017             ,:ACAT11IO-VTRNFR-FREEZE-IND                                 
LRM019             ,:ACAT11IO-STTLM-TM-CD                                       
           END-EXEC.                                                            
           IF SQLCODE = 0                                                       
              MOVE ACAT11IO-RR-CD TO SRCH-INP-RR                                
LRM008        MOVE ACAT11IO-DLVR-ACCT(1 : 3) TO SRCH-INP-BRANCH                 
LRM008********MOVE ACAT11IO-RCV-ACCT(1 : 3) TO SRCH-INP-BRANCH                  
              PERFORM 0075-SIGNON-SECR-CHECK-RTN                                
              IF SRCH-SIGNON-SECR-CHECK-FAIL                                    
                GO TO 0125-READ-NEXT-PTR                                        
              END-IF                                                            
LRM009        IF ACAT11IO-EXCEPTION-ONLY = 'Y'                                  
LRM009           PERFORM CHECK-FOR-EXCEPTION-RTN                                
LRM009           IF EXCEPTION-NOTFND                                            
LRM009              GO TO 0125-READ-NEXT-PTR                            09130000
LRM009           END-IF                                                         
LRM009        END-IF                                                            
              PERFORM 0080-CLOSE-CSR-NXT-ACT-PTR                                
              SET ACAT11IO-FOUND TO TRUE                                        
LRM003        SET PTR-DLVY-ASSET-NOTFND TO TRUE                                 
LRM003        PERFORM 0110-GET-ACTIAST-DOLLAR-AMTS                      09130000
LRM003        IF PTR-DLVY-ASSET-FOUND                                           
LRM003           MOVE 'S' TO ACAT11IO-ACCT-RJCT-RSBM-IND                        
LRM003        ELSE                                                              
LRM003           PERFORM 0128-GET-PTR-ASSET                                     
LRM003           IF PTR-DLVY-ASSET-FOUND                                        
LRM003              MOVE 'S' TO ACAT11IO-ACCT-RJCT-RSBM-IND                     
LRM003           ELSE                                                           
LRM003              MOVE ' ' TO ACAT11IO-ACCT-RJCT-RSBM-IND                     
                    PERFORM 0130-GET-VASSET-DOLLAR-AMTS                 09130000
LRM003           END-IF                                                         
LRM003        END-IF                                                            
LRM008        PERFORM 0152-SET-COMMENT-IND                                      
              PERFORM 0126-GET-ACTITRF-PTR                                      
           ELSE                                                                 
           IF SQLCODE = +100                                                    
              SET ACAT11IO-NOT-FOUND TO TRUE                                    
           ELSE                                                                 
    ******    MOVE '** ACAT11DB - CSR_NXT_ACT_PTR FETCH ERR **'                 
              PERFORM 9000-WRITE-TO-CICS-LOG                                    
              PERFORM 9500-RETURN-DB2-ERROR                                     
           END-IF.                                                              
                                                                                
LRM009 CHECK-FOR-EXCEPTION-RTN.                                                 
LRM009     IF ACAT11IO-TRNFR-TYPE-RJCT-CD > '00'                        09170000
LRM009     OR ACAT11IO-ACCT-ACTIVITY-IND  = 'Y'                                 
LRM009     OR ACAT11IO-ACCT-ORDERS-IND    = 'Y'                                 
LRM009     OR ACAT11IO-ACCT-DB-BAL-T1-IND = 'Y'                                 
LRM009     OR ACAT11IO-ACCT-MRGN-DB-IND   = 'Y'                                 
LRM009     OR ACAT11IO-ACCT-SHRT-PSTN-IND = 'Y'                                 
LRM009     OR ACAT11IO-ACCT-SEC-RSTRD-IND = 'Y'                                 
LRM009     OR ACAT11IO-ACCT-AST-EXCS-IND  = 'Y'                                 
LRM009     OR ACAT11IO-ACCT-OPTN-PSTN-IND = 'X'                                 
LRM009     OR ACAT11IO-ACCT-LTD-PRTNR-IND = 'Y'                                 
LRM009     OR ACAT11IO-ACCT-TIN-MSMTH-IND = 'Y'                                 
LRM009     OR ACAT11IO-ACCT-DPLCT-TRN-IND = 'Y'                                 
LRM009     OR ACAT11IO-ACCT-CUST-70-IND   = 'Y'                                 
LRM009     OR ACAT11IO-ACCT-QULFD-PLN-IND = 'Y'                                 
LRM009     OR ACAT11IO-ACCT-MNGD-IND      = 'Y'                                 
LRM009     OR ACAT11IO-ACCT-PRVT-RNG-IND  = 'Y'                                 
LRM009     OR ACAT11IO-ACCT-BRKR-TIF-IND  = 'Y'                                 
LRM009     OR ACAT11IO-NSCC-NON-ADP-IND   = 'Y'                                 
LRM009     OR ACAT11IO-COMMENTS-IND       = 'Y'                                 
LRM009     OR ACAT11IO-TRNFR-RJC1-CD      > '00'                                
LRM009     OR ACAT11IO-TRNFR-RJC2-CD      > ' '                                 
LRM009     OR ACAT11IO-ACCT-RB-SEC-IND    = 'Y'                                 
LRM009     OR ACAT11IO-ACCT-CLT-RSCND-IND = 'Y'                                 
LRM009     OR ACAT11IO-ACCT-LGL-BLK-IND   = 'Y'                                 
LRM009        SET EXCEPTION-FOUND TO TRUE                                       
LRM009     ELSE                                                                 
LRM009        SET EXCEPTION-NOTFND TO TRUE                                      
LRM009     END-IF.                                                              
                                                                                
       0126-GET-ACTITRF-PTR.                                            09130000
           EXEC SQL SELECT                                              09140000
                   TRNFR_TYPE_RJCT_CD                                           
                  ,NSCC_PEND_CD                                                 
                  ,CMNT_TXT                                                     
                 INTO                                                   09160000
                   :ACAT11IO-REJECT-CODE                                09170000
                  ,:ACAT11IO-NSCC-PEND-CD                                       
                  ,:ACAT11IO-PTR-CMNT-TXT                                       
                 FROM ACTITRF                                           09170000
                  WHERE (CLIENT_NBR                                     09180000
                              = :ACAT11IO-CLIENT-NBR                    09190000
LRM007               AND ACAT_CONTROL_NBR                                       
LRM007                        = :ACAT11IO-CONTROL-NBR                           
                     AND DLVR_NBR                                       09180000
                              = :ACAT11IO-DLVR-NBR                      09190000
                     AND ACCT_DLVR_NBR                                  09180000
                              = :ACAT11IO-DLVR-ACCT                     09190000
                     AND RCV_NBR                                        09180000
                              = :ACAT11IO-RCV-NBR                       09190000
                     AND ACCT_RCV_NBR                                   09180000
                              = :ACAT11IO-RCV-ACCT                      09190000
                     AND TRNFR_TYPE_CD                                  09180000
                              = 'PTR')                                  09190000
            END-EXEC.                                                   09200000
                                                                                
            EVALUATE SQLCODE                                            09220000
                WHEN +0                                                 09260000
                     CONTINUE                                                   
                WHEN +100                                               09260000
                    MOVE SPACES TO ACAT11IO-REJECT-CODE                 09170000
                WHEN OTHER                                              09280000
                     PERFORM 9000-WRITE-TO-CICS-LOG                             
                     PERFORM 9500-RETURN-DB2-ERROR                              
            END-EVALUATE.                                               09300000
                                                                                
       0127-READ-PREV-PTR.                                                      
           EXEC SQL                                                             
              FETCH                                                             
                  CSR_PRV_ACT_PTR                                               
                   INTO                                                 09160000
                    :ACAT11IO-DLVR-NBR                                  09190000
                   ,:ACAT11IO-DLVR-ACCT                                 09190000
                   ,:ACAT11IO-RCV-NBR                                   09190000
                   ,:ACAT11IO-RCV-ACCT                                  09190000
                   ,:ACAT11IO-RCV-ACCT-TYPE-CD                                  
                   ,:ACAT11IO-CONTROL-NBR                                       
                   ,:ACAT11IO-TRNFR-TYPE-CD                                     
                   ,:ACAT11IO-RCV-CUST-NM                                       
                   ,:ACAT11IO-RCV-SS-PRIM-NBR                                   
                   ,:ACAT11IO-RCV-SS-SCNDY-NBR                                  
                   ,:ACAT11IO-CMNT-TXT                                          
                   ,:ACAT11IO-NSCC-PEND-CD                                      
                   ,:ACAT11IO-NSCC-ACK-IND                                      
                   ,:ACAT11IO-RR-CD                                             
                   ,:ACAT11IO-ACCT-RJCT-RSBM-IND                        09170000
LRM003             ,:ACAT11IO-TRNFR-TYPE-RJCT-CD                        09170000
                   ,:ACAT11IO-STTS-CD                                           
                   ,:ACAT11IO-RCV-OCC-BRKR-NBR                                  
LRM003             ,:ACAT11IO-ACCT-ACTIVITY-IND                                 
LRM003             ,:ACAT11IO-ACCT-ORDERS-IND                                   
LRM003             ,:ACAT11IO-ACCT-DB-BAL-T1-IND                                
LRM003             ,:ACAT11IO-ACCT-MRGN-DB-IND                                  
LRM003             ,:ACAT11IO-ACCT-SHRT-PSTN-IND                                
LRM003             ,:ACAT11IO-ACCT-SEC-RSTRD-IND                                
LRM003             ,:ACAT11IO-ACCT-AST-EXCS-IND                                 
LRM003             ,:ACAT11IO-ACCT-OPTN-PSTN-IND                                
LRM003             ,:ACAT11IO-ACCT-LTD-PRTNR-IND                                
LRM003             ,:ACAT11IO-ACCT-TIN-MSMTH-IND                                
LRM003             ,:ACAT11IO-ACCT-DPLCT-TRN-IND                                
LRM003             ,:ACAT11IO-ACCT-CUST-70-IND                                  
LRM003             ,:ACAT11IO-ACCT-QULFD-PLN-IND                                
LRM003             ,:ACAT11IO-ACCT-MNGD-IND                                     
LRM003             ,:ACAT11IO-ACCT-PRVT-RNG-IND                                 
LRM003             ,:ACAT11IO-ACCT-BRKR-TIF-IND                                 
LRM003             ,:ACAT11IO-NSCC-NON-ADP-IND                                  
LRM003             ,:ACAT11IO-COMMENTS-IND                                      
LRM003             ,:ACAT11IO-TRNFR-RJC1-CD                                     
LRM003             ,:ACAT11IO-TRNFR-RJC2-CD                                     
LRM003             ,:ACAT11IO-ACCT-RB-SEC-IND                                   
LRM003             ,:ACAT11IO-ACCT-CLT-RSCND-IND                                
LRM003             ,:ACAT11IO-ACCT-LGL-BLK-IND                                  
LRM003             ,:ACAT11IO-SETTLE-DATE                                       
LRM017             ,:ACAT11IO-VTRNFR-FREEZE-IND                                 
LRM019             ,:ACAT11IO-STTLM-TM-CD                                       
           END-EXEC.                                                            
           IF SQLCODE = 0                                                       
              MOVE ACAT11IO-RR-CD TO SRCH-INP-RR                                
LRM008        MOVE ACAT11IO-DLVR-ACCT(1 : 3) TO SRCH-INP-BRANCH                 
LRM008********MOVE ACAT11IO-RCV-ACCT(1 : 3) TO SRCH-INP-BRANCH                  
              PERFORM 0075-SIGNON-SECR-CHECK-RTN                                
              IF SRCH-SIGNON-SECR-CHECK-FAIL                                    
                GO TO 0127-READ-PREV-PTR                                        
              END-IF                                                            
LRM009        IF ACAT11IO-EXCEPTION-ONLY = 'Y'                                  
LRM009           PERFORM CHECK-FOR-EXCEPTION-RTN                                
LRM009           IF EXCEPTION-NOTFND                                            
LRM009              GO TO 0127-READ-PREV-PTR                            09130000
LRM009           END-IF                                                         
LRM009        END-IF                                                            
              PERFORM 0080-CLOSE-CSR-PRV-ACT-PTR                                
              SET ACAT11IO-FOUND TO TRUE                                        
LRM003        SET PTR-DLVY-ASSET-NOTFND TO TRUE                                 
LRM003        PERFORM 0110-GET-ACTIAST-DOLLAR-AMTS                      09130000
LRM003        IF PTR-DLVY-ASSET-FOUND                                           
LRM003           MOVE 'S' TO ACAT11IO-ACCT-RJCT-RSBM-IND                        
LRM003        ELSE                                                              
LRM003           PERFORM 0128-GET-PTR-ASSET                                     
LRM003           IF PTR-DLVY-ASSET-FOUND                                        
LRM003              MOVE 'S' TO ACAT11IO-ACCT-RJCT-RSBM-IND                     
LRM003           ELSE                                                           
LRM003              MOVE ' ' TO ACAT11IO-ACCT-RJCT-RSBM-IND                     
                    PERFORM 0130-GET-VASSET-DOLLAR-AMTS                 09130000
LRM003           END-IF                                                         
LRM003        END-IF                                                            
LRM008        PERFORM 0152-SET-COMMENT-IND                                      
              PERFORM 0126-GET-ACTITRF-PTR                                      
           ELSE                                                                 
           IF SQLCODE = +100                                                    
              SET ACAT11IO-NOT-FOUND TO TRUE                                    
           ELSE                                                                 
    ******    MOVE '** ACAT11DB - CSR_PRV_ACT_PTR FETCH ERR  **'                
              PERFORM 9000-WRITE-TO-CICS-LOG                                    
              PERFORM 9500-RETURN-DB2-ERROR                                     
           END-IF.                                                              
                                                                                
LRM003 0128-GET-PTR-ASSET.                                                      
LRM008***  MOVE SPACES TO ACAT11IO-DLVR-ACCT(9 : 12).                           
LRM003     EXEC SQL SELECT                                              09140000
LRM003             NSCC_PEND_CD                                                 
LRM003           INTO                                                   09160000
LRM003             :WS-NSCC-PEND-CD                                             
LRM003           FROM ACTIAST                                           09170000
LRM003            WHERE (CLIENT_NBR                                     09180000
LRM003                        = :ACAT11IO-CLIENT-NBR                    09190000
LRM008               AND ACAT_CONTROL_NBR                               09180000
LRM008                        = :ACAT11IO-CONTROL-NBR                           
LRM003               AND DLVR_NBR                                       09180000
LRM003                        = :ACAT11IO-DLVR-NBR                      09190000
LRM003               AND ACCT_DLVR_NBR                                  09180000
LRM003                        = :ACAT11IO-DLVR-ACCT                     09190000
LRM003               AND RCV_NBR                                        09180000
LRM003                        = :ACAT11IO-RCV-NBR                       09190000
LRM003               AND ACCT_RCV_NBR                                   09180000
LRM003                        = :ACAT11IO-RCV-ACCT                      09190000
LRM003               AND TRNFR_TYPE_CD                                          
LRM003                        = :ACAT11IO-TRNFR-TYPE-CD)                        
LRM003      END-EXEC.                                                   09200000
LRM003*                                                                 09210000
LRM003      EVALUATE SQLCODE                                            09220000
LRM003          WHEN +0                                                 09260000
LRM003            SET PTR-DLVY-ASSET-FOUND TO TRUE                              
LRM003            IF ACAT11IO-TRNFR-TYPE-CD = 'PTR'                             
LRM003               MOVE WS-NSCC-PEND-CD TO ACAT11IO-NSCC-PEND-CD              
LRM003            END-IF                                                        
LRM003          WHEN -811                                                       
LRM003            SET PTR-DLVY-ASSET-FOUND TO TRUE                              
LRM003            IF ACAT11IO-TRNFR-TYPE-CD = 'PTR'                             
LRM003               MOVE WS-NSCC-PEND-CD TO ACAT11IO-NSCC-PEND-CD              
LRM003            END-IF                                                        
LRM003      END-EVALUATE.                                                       
094300*                                                                 09310000
       0130-GET-VASSET-DOLLAR-AMTS.                                     09130000
      *** READ FOR TYPE 01 CASH                                                 
           EXEC SQL SELECT                                              09140000
                   ASSET_AMT                                                    
LRM005            ,ASSET_PCT                                                    
                  ,ASSET_CMNT_TXT                                               
                  ,STTLM_RSN_CD                                                 
LRM015            ,ASSET_RQST_QTY_CD                                            
                 INTO                                                   09160000
                   :DCLVASSET.ASSET-AMT                                         
LRM005            ,:DCLVASSET.ASSET-PCT                                         
                  ,:ACAT11IO-ASSET-CMNT1-TXT                                    
                  ,:DCLACTIAST.STTLM-RSN-CD                                     
LRM015            ,:ACAT11IO-AMT-01-RQST-CD                                     
                 FROM VASSET                                            09170000
                  WHERE (CLIENT_NBR                                     09180000
                              = :ACAT11IO-CLIENT-NBR                    09190000
                     AND ACAT_CONTROL_NBR                               09180000
                              = :ACAT11IO-CONTROL-NBR                           
                     AND ISIN_CNTRY_CD                                  09180000
                              = '  '                                    09190000
                     AND ISIN_SEC_ISSUE_CD                              09180000
                              = '         '                             09190000
                     AND STTLM_LCTN_CD                                  09180000
                              = '40'                                    09190000
                     AND CSH_MGN_SHRT_CD                                09180000
                              = 'C')                                    09190000
093200      END-EXEC.                                                   09200000
093300*                                                                 09210000
093400      EVALUATE SQLCODE                                            09220000
093800          WHEN +0                                                 09260000
                     MOVE ASSET-AMT OF DCLVASSET TO ACAT11IO-AMT-01             
LRM005               MOVE ASSET-PCT OF DCLVASSET TO ACAT11IO-PCT-01             
                     IF STTLM-RSN-CD OF DCLACTIAST = 'CRED'                     
                        SET ACAT11IO-AMT-01-CREDIT TO TRUE                      
                     ELSE                                                       
                        MOVE SPACES TO ACAT11IO-AMT-01-CREDIT-IND               
                     END-IF                                                     
LRM003          WHEN -811                                               09260000
LRM003               MOVE 'C' TO CSH-MGN-SHRT-CD OF DCLVASSET           09190000
LRM003               PERFORM 0140-SUMMARIZE-DOLLAR-AMT-RTN              09260000
LRM003                  THRU 0140-EXIT                                  09260000
093800          WHEN +100                                               09260000
                     MOVE ZEROS TO ACAT11IO-AMT-01                              
                     MOVE SPACES TO ACAT11IO-ASSET-CMNT1-TXT                    
094000          WHEN OTHER                                              09280000
                     PERFORM 9000-WRITE-TO-CICS-LOG                             
                     PERFORM 9500-RETURN-DB2-ERROR                              
094200      END-EVALUATE.                                               09300000
094300*                                                                 09310000
      *** READ FOR TYPE 02 MARGIN                                               
           EXEC SQL SELECT                                              09140000
                   ASSET_AMT                                                    
LRM005            ,ASSET_PCT                                                    
                  ,ASSET_CMNT_TXT                                               
                  ,STTLM_RSN_CD                                                 
LRM015            ,ASSET_RQST_QTY_CD                                            
                 INTO                                                   09160000
                   :DCLVASSET.ASSET-AMT                                         
LRM005            ,:DCLVASSET.ASSET-PCT                                         
                  ,:ACAT11IO-ASSET-CMNT2-TXT                                    
                  ,:DCLACTIAST.STTLM-RSN-CD                                     
LRM015            ,:ACAT11IO-AMT-02-RQST-CD                                     
                 FROM VASSET                                            09170000
                  WHERE (CLIENT_NBR                                     09180000
                              = :ACAT11IO-CLIENT-NBR                    09190000
                     AND ACAT_CONTROL_NBR                               09180000
                              = :ACAT11IO-CONTROL-NBR                           
                     AND ISIN_CNTRY_CD                                  09180000
                              = '  '                                    09190000
                     AND ISIN_SEC_ISSUE_CD                              09180000
                              = '         '                             09190000
                     AND STTLM_LCTN_CD                                  09180000
                              = '40'                                    09190000
                     AND CSH_MGN_SHRT_CD                                09180000
                              = 'M')                                    09190000
093200      END-EXEC.                                                   09200000
093300*                                                                 09210000
093400      EVALUATE SQLCODE                                            09220000
093800          WHEN +0                                                 09260000
                     MOVE ASSET-AMT OF DCLVASSET TO ACAT11IO-AMT-02             
LRM005               MOVE ASSET-PCT OF DCLVASSET TO ACAT11IO-PCT-02             
                     IF STTLM-RSN-CD OF DCLACTIAST = 'CRED'                     
                        SET ACAT11IO-AMT-02-CREDIT TO TRUE                      
                     ELSE                                                       
                        MOVE SPACES TO ACAT11IO-AMT-02-CREDIT-IND               
                     END-IF                                                     
LRM003          WHEN -811                                               09260000
LRM003               MOVE 'M' TO CSH-MGN-SHRT-CD OF DCLVASSET           09190000
LRM003               PERFORM 0140-SUMMARIZE-DOLLAR-AMT-RTN              09260000
LRM003                  THRU 0140-EXIT                                  09260000
093800          WHEN +100                                               09260000
                     MOVE ZEROS TO ACAT11IO-AMT-02                              
                     MOVE SPACES TO ACAT11IO-ASSET-CMNT2-TXT                    
094000          WHEN OTHER                                              09280000
                     PERFORM 9000-WRITE-TO-CICS-LOG                             
                     PERFORM 9500-RETURN-DB2-ERROR                              
094200      END-EVALUATE.                                               09300000
                                                                                
      *** READ FOR TYPE 05 SHORT                                                
           EXEC SQL SELECT                                              09140000
                   ASSET_AMT                                                    
LRM005            ,ASSET_PCT                                                    
                  ,ASSET_CMNT_TXT                                               
                  ,STTLM_RSN_CD                                                 
LRM015            ,ASSET_RQST_QTY_CD                                            
                 INTO                                                   09160000
                   :DCLVASSET.ASSET-AMT                                         
LRM005            ,:DCLVASSET.ASSET-PCT                                         
                  ,:ACAT11IO-ASSET-CMNT5-TXT                                    
                  ,:DCLACTIAST.STTLM-RSN-CD                                     
LRM015            ,:ACAT11IO-AMT-05-RQST-CD                                     
                 FROM VASSET                                            09170000
                  WHERE (CLIENT_NBR                                     09180000
                              = :ACAT11IO-CLIENT-NBR                    09190000
                     AND ACAT_CONTROL_NBR                               09180000
                              = :ACAT11IO-CONTROL-NBR                           
                     AND ISIN_CNTRY_CD                                  09180000
                              = '  '                                    09190000
                     AND ISIN_SEC_ISSUE_CD                              09180000
                              = '         '                             09190000
                     AND STTLM_LCTN_CD                                  09180000
                              = '40'                                    09190000
                     AND CSH_MGN_SHRT_CD                                09180000
                              = 'S')                                    09190000
093200      END-EXEC.                                                   09200000
093300*                                                                 09210000
093400      EVALUATE SQLCODE                                            09220000
093800          WHEN +0                                                 09260000
                     MOVE ASSET-AMT OF DCLVASSET TO ACAT11IO-AMT-05             
LRM005               MOVE ASSET-PCT OF DCLVASSET TO ACAT11IO-PCT-05             
                     IF STTLM-RSN-CD OF DCLACTIAST = 'CRED'                     
                        SET ACAT11IO-AMT-05-CREDIT TO TRUE                      
                     ELSE                                                       
                        MOVE SPACES TO ACAT11IO-AMT-05-CREDIT-IND               
                     END-IF                                                     
LRM003          WHEN -811                                               09260000
LRM003               MOVE 'S' TO CSH-MGN-SHRT-CD OF DCLVASSET           09190000
LRM003               PERFORM 0140-SUMMARIZE-DOLLAR-AMT-RTN              09260000
LRM003                  THRU 0140-EXIT                                  09260000
093800          WHEN +100                                               09260000
                     MOVE ZEROS TO ACAT11IO-AMT-05                              
                     MOVE SPACES TO ACAT11IO-ASSET-CMNT5-TXT                    
094000          WHEN OTHER                                              09280000
                     PERFORM 9000-WRITE-TO-CICS-LOG                             
                     PERFORM 9500-RETURN-DB2-ERROR                              
094200      END-EVALUATE.                                               09300000
                                                                                
LRM003 0140-SUMMARIZE-DOLLAR-AMT-RTN.                                   09260000
           EXEC SQL                                                             
              OPEN CURSOR_CASH                                                  
           END-EXEC.                                                            
           IF SQLCODE = 0                                                       
              CONTINUE                                                  09240000
           ELSE                                                                 
              PERFORM 9000-WRITE-TO-CICS-LOG                                    
              PERFORM 9500-RETURN-DB2-ERROR                                     
           END-IF.                                                              
           MOVE ZERO TO WS-CASH-AMT.                                            
           MOVE SPACES TO WS-CMNT-TXT.                                          
           PERFORM UNTIL SQLCODE NOT = 0                                        
              EXEC SQL                                                          
                 FETCH                                                          
                    CURSOR_CASH                                                 
                   INTO                                                 09160000
                   :DCLVASSET.ASSET-AMT                                         
                  ,:DCLVASSET.ASSET-CMNT-TXT                                    
                  ,:DCLVASSET.STTLM-RSN-CD                                      
                  ,:DCLVASSET.ASSET-CMNT-TXT                                    
              END-EXEC                                                          
              IF SQLCODE = 0                                                    
                 IF STTLM-RSN-CD OF DCLVASSET = 'CRED'                          
                    SUBTRACT ASSET-AMT OF DCLVASSET FROM WS-CASH-AMT            
                 ELSE                                                           
                    ADD      ASSET-AMT OF DCLVASSET TO   WS-CASH-AMT            
                 END-IF                                                         
                 IF ASSET-CMNT-TXT OF DCLVASSET NOT = SPACES                    
                    MOVE ASSET-CMNT-TXT OF DCLVASSET                            
                           TO WS-CMNT-TXT                                       
                 END-IF                                                         
              ELSE                                                              
              IF SQLCODE NOT = +100                                             
                 PERFORM 9000-WRITE-TO-CICS-LOG                                 
                 PERFORM 9500-RETURN-DB2-ERROR                                  
              END-IF END-IF                                                     
           END-PERFORM.                                                         
           IF CSH-MGN-SHRT-CD OF DCLVASSET = 'C'                        09190000
              MOVE WS-CMNT-TXT TO ACAT11IO-ASSET-CMNT1-TXT                      
              IF WS-CASH-AMT < ZERO                                             
                 MULTIPLY WS-CASH-AMT BY -1  GIVING ACAT11IO-AMT-01             
                 SET ACAT11IO-AMT-01-CREDIT TO TRUE                             
              ELSE                                                              
                 MOVE WS-CASH-AMT                TO ACAT11IO-AMT-01             
                 MOVE SPACES TO ACAT11IO-AMT-01-CREDIT-IND                      
              END-IF                                                            
              MOVE WS-CMNT-TXT TO ACAT11IO-ASSET-CMNT1-TXT                      
           ELSE                                                                 
           IF CSH-MGN-SHRT-CD OF DCLVASSET = 'M'                        09190000
              MOVE WS-CMNT-TXT TO ACAT11IO-ASSET-CMNT2-TXT                      
              IF WS-CASH-AMT < ZERO                                             
                 MULTIPLY WS-CASH-AMT BY -1  GIVING ACAT11IO-AMT-02             
                 SET ACAT11IO-AMT-02-CREDIT TO TRUE                             
              ELSE                                                              
                 MOVE WS-CASH-AMT                TO ACAT11IO-AMT-02             
                 MOVE SPACES TO ACAT11IO-AMT-02-CREDIT-IND                      
              END-IF                                                            
              MOVE WS-CMNT-TXT TO ACAT11IO-ASSET-CMNT2-TXT                      
           ELSE                                                                 
           IF CSH-MGN-SHRT-CD OF DCLVASSET = 'S'                        09190000
              MOVE WS-CMNT-TXT TO ACAT11IO-ASSET-CMNT5-TXT                      
              IF WS-CASH-AMT < ZERO                                             
                 MULTIPLY WS-CASH-AMT BY -1  GIVING ACAT11IO-AMT-05             
                 SET ACAT11IO-AMT-05-CREDIT TO TRUE                             
              ELSE                                                              
                 MOVE WS-CASH-AMT                TO ACAT11IO-AMT-05             
                 MOVE SPACES TO ACAT11IO-AMT-05-CREDIT-IND                      
              END-IF                                                            
              MOVE WS-CMNT-TXT TO ACAT11IO-ASSET-CMNT5-TXT                      
           END-IF.                                                              
           EXEC SQL                                                             
              CLOSE CURSOR_CASH                                                 
           END-EXEC.                                                            
LRM003 0140-EXIT. EXIT.                                                 09260000
           EJECT                                                                
       0150-READ-ACTIVE-ACAT-DIRECT.                                            
            EXEC SQL SELECT                                             09140000
                   RCV_NBR                                              09180000
                  ,ACCT_RCV_NBR                                         09180000
                  ,DLVR_NBR                                             09180000
                  ,ACCT_DLVR_NBR                                        09180000
                  ,RCV_ACCT_TYPE_CD                                             
                  ,TRNFR_TYPE_CD                                        09180000
                  ,RCV_CUST_NM                                                  
                  ,RCV_SS_PRIM_NBR                                      09150000
                  ,RCV_SS_SCNDY_NBR                                             
                  ,CMNT_TXT                                                     
                  ,STTS_CD                                                      
                  ,RR_CD                                                        
                  ,RCV_OCC_BRKR_NBR                                             
                  ,ACCT_RJCT_RSBM_IND                                           
LRM003            ,STTLM_DT                                                     
LRM003            ,TRNFR_TYPE_RJCT_CD                                           
LRM019            ,STTLM_TM_CD                                                  
LRM021            ,GIFT_IND                                                     
                   INTO                                                 09160000
                    :ACAT11IO-RCV-NBR                                   09190000
                   ,:ACAT11IO-RCV-ACCT                                  09190000
                   ,:ACAT11IO-DLVR-NBR                                  09190000
                   ,:ACAT11IO-DLVR-ACCT                                 09190000
                   ,:ACAT11IO-RCV-ACCT-TYPE-CD                                  
                   ,:ACAT11IO-TRNFR-TYPE-CD                                     
                   ,:ACAT11IO-RCV-CUST-NM                                       
                   ,:ACAT11IO-RCV-SS-PRIM-NBR                                   
                   ,:ACAT11IO-RCV-SS-SCNDY-NBR                                  
                   ,:ACAT11IO-CMNT-TXT                                          
                   ,:ACAT11IO-STTS-CD                                           
                   ,:ACAT11IO-RR-CD                                             
                   ,:ACAT11IO-RCV-OCC-BRKR-NBR                                  
                   ,:ACAT11IO-ACCT-RJCT-RSBM-IND                        09170000
LRM003             ,:ACAT11IO-SETTLE-DATE                                       
LRM003             ,:ACAT11IO-REJECT-CODE                               09170000
LRM019             ,:ACAT11IO-STTLM-TM-CD                                       
LRM021             ,:ACAT11IO-GIFT-IND                                          
                   FROM VTRNFR                                          09170000
                  WHERE (CLIENT_NBR                                     09180000
                              = :ACAT11IO-CLIENT-NBR                    09190000
                     AND TRNFR_TYPE_CD                                  09180000
                              = :ACAT11IO-TRNFR-TYPE-CD                         
                     AND ACAT_CONTROL_NBR                               09180000
                              = :ACAT11IO-CONTROL-NBR)                          
            END-EXEC                                                            
093400      EVALUATE SQLCODE                                            09220000
093800          WHEN +0                                                 09260000
                     SET ACAT11IO-FOUND TO TRUE                                 
                     MOVE 'H' TO ACAT11IO-NSCC-PEND-CD                          
                     PERFORM 0155-READ-ACTIVE-DOLLAR-AMTS                       
                     PERFORM 0156-CHECK-FOR-DUPE-PTD-RTN                        
                        THRU 0156-EXIT                                          
                     MOVE ZEROS TO ACAT11IO-ASSET-SEQ-NBR                       
                     PERFORM 0050-OPEN-CURSORSA                         09130000
                     PERFORM 0075-READNEXT-VASSET                       09130000
LRM008               IF ACAT11IO-ASSET-FOUND                                    
                        PERFORM 0077-MOVE-ASSET-TO-IOAREA                       
LRM008               END-IF                                                     
                     PERFORM 0080-CLOSE-TFRCSRSA                                
                     SET ACAT11IO-ACTIVE-FOUND TO TRUE                          
                     MOVE 'Y' TO ACAT11IO-ACTIVE-DB                             
LRM008               PERFORM 0152-SET-COMMENT-IND                               
093800          WHEN +100                                               09260000
                     PERFORM 0160-READ-INITIAL-PTD-DIRECT                       
094000          WHEN OTHER                                              09280000
                     PERFORM 9000-WRITE-TO-CICS-LOG                             
                     PERFORM 9500-RETURN-DB2-ERROR                              
094200      END-EVALUATE.                                               09300000
094300                                                                  09310000
LRM008 0152-SET-COMMENT-IND.                                                    
LRM008     MOVE SPACES TO ACAT11IO-CONTRA-CMNTM-FND                             
LRM008     IF ACAT11IO-CMNT-TXT (1 : 10) NOT = SPACES                           
LRM008        SET ACAT11IO-CONTRA-TIF-CMNTM TO TRUE                             
LRM008     END-IF.                                                              
LRM008     IF ACAT11IO-ASSET-CMNT1-TXT  (1 : 10) NOT = SPACES                   
LRM008     OR ACAT11IO-ASSET-CMNT2-TXT  (1 : 10) NOT = SPACES                   
LRM008     OR ACAT11IO-ASSET-CMNT5-TXT  (1 : 10) NOT = SPACES                   
LRM008     OR ACAT11IO-ASSET-CMNTM-TXT  (1 : 10) NOT = SPACES                   
LRM008        SET WS-ASSET-CMNT-FND TO TRUE                                     
LRM008     ELSE                                                                 
LRM008        PERFORM 0153-READ-ASSET-CMNT-RTN                                  
LRM008     END-IF.                                                              
LRM008     IF WS-ASSET-CMNT-FND                                                 
LRM008        IF ACAT11IO-CONTRA-TIF-CMNTM                                      
LRM008           SET ACAT11IO-CONTRA-BOTH-CMNTM TO TRUE                         
LRM008        ELSE                                                              
LRM008           SET ACAT11IO-CONTRA-AST-CMNTM TO TRUE                          
LRM008        END-IF                                                            
LRM008     END-IF.                                                              
LRM008                                                                          
LRM008 0153-READ-ASSET-CMNT-RTN.                                                
LRM008     EXEC SQL SELECT                                              09140000
LRM008             ASSET_CMNT_TXT                                               
LRM008           INTO                                                   09160000
LRM008             :DCLVASSET.ASSET-CMNT-TXT                                    
LRM008           FROM VASSET                                            09170000
LRM008            WHERE (CLIENT_NBR                                     09180000
LRM008                        = :ACAT11IO-CLIENT-NBR                    09190000
LRM008               AND ACAT_CONTROL_NBR                               09180000
LRM008                        = :ACAT11IO-CONTROL-NBR                           
LRM008               AND NOT ASSET_CMNT_TXT                             09180000
LRM008                        = ' ')                                    09190000
LRM008           WITH UR                                                09190000
LRM008      END-EXEC.                                                   09200000
LRM008      IF SQLCODE = +0                                             09220000
LRM008        SET WS-ASSET-CMNT-FND TO TRUE                                     
LRM008      END-IF.                                                     09200000
                                                                                
       0155-READ-ACTIVE-DOLLAR-AMTS.                                            
      *** READ FOR TYPE 01 CASH                                                 
           EXEC SQL SELECT                                              09140000
                   ASSET_AMT                                                    
LRM005            ,ASSET_PCT                                                    
                  ,ASSET_CMNT_TXT                                               
                  ,STTLM_RSN_CD                                                 
                 INTO                                                   09160000
                   :DCLVASSET.ASSET-AMT                                         
LRM005            ,:DCLVASSET.ASSET-PCT                                         
                  ,:ACAT11IO-ASSET-CMNT1-TXT                                    
                  ,:DCLVASSET.STTLM-RSN-CD                                      
                 FROM VASSET                                            09170000
                  WHERE (CLIENT_NBR                                     09180000
                              = :ACAT11IO-CLIENT-NBR                    09190000
                     AND ACAT_CONTROL_NBR                               09180000
                              = :ACAT11IO-CONTROL-NBR                           
                     AND ISIN_CNTRY_CD                                  09180000
                              = '  '                                    09190000
                     AND ISIN_SEC_ISSUE_CD                              09180000
                              = '         '                             09190000
                     AND STTLM_LCTN_CD                                  09180000
                              = '40'                                    09190000
                     AND CSH_MGN_SHRT_CD                                09180000
                              = 'C')                                    09190000
093200      END-EXEC.                                                   09200000
093300*                                                                 09210000
093400      EVALUATE SQLCODE                                            09220000
093800          WHEN +0                                                 09260000
                     MOVE ASSET-AMT OF DCLVASSET TO ACAT11IO-AMT-01             
LRM005               MOVE ASSET-PCT OF DCLVASSET TO ACAT11IO-PCT-01             
                     IF STTLM-RSN-CD OF DCLVASSET = 'CRED'                      
                        SET ACAT11IO-AMT-01-CREDIT TO TRUE                      
                     ELSE                                                       
                        MOVE SPACES TO ACAT11IO-AMT-01-CREDIT-IND               
                     END-IF                                                     
093800          WHEN +100                                               09260000
                     MOVE ZEROS TO ACAT11IO-AMT-01                              
LRM005                             ACAT11IO-PCT-01                              
                     MOVE SPACES TO ACAT11IO-ASSET-CMNT1-TXT                    
094000          WHEN OTHER                                              09280000
                     PERFORM 9000-WRITE-TO-CICS-LOG                             
                     PERFORM 9500-RETURN-DB2-ERROR                              
094200      END-EVALUATE.                                               09300000
094300*                                                                 09310000
      *** READ FOR TYPE 02 MARGIN                                               
           EXEC SQL SELECT                                              09140000
                   ASSET_AMT                                                    
LRM005            ,ASSET_PCT                                                    
                  ,ASSET_CMNT_TXT                                               
                  ,STTLM_RSN_CD                                                 
                 INTO                                                   09160000
                   :DCLVASSET.ASSET-AMT                                         
LRM005            ,:DCLVASSET.ASSET-PCT                                         
                  ,:ACAT11IO-ASSET-CMNT2-TXT                                    
                  ,:DCLVASSET.STTLM-RSN-CD                                      
                 FROM VASSET                                            09170000
                  WHERE (CLIENT_NBR                                     09180000
                              = :ACAT11IO-CLIENT-NBR                    09190000
                     AND ACAT_CONTROL_NBR                               09180000
                              = :ACAT11IO-CONTROL-NBR                           
                     AND ISIN_CNTRY_CD                                  09180000
                              = '  '                                    09190000
                     AND ISIN_SEC_ISSUE_CD                              09180000
                              = '         '                             09190000
                     AND STTLM_LCTN_CD                                  09180000
                              = '40'                                    09190000
                     AND CSH_MGN_SHRT_CD                                09180000
                              = 'M')                                    09190000
093200      END-EXEC.                                                   09200000
093300*                                                                 09210000
093400      EVALUATE SQLCODE                                            09220000
093800          WHEN +0                                                 09260000
                     MOVE ASSET-AMT OF DCLVASSET TO ACAT11IO-AMT-02             
LRM005               MOVE ASSET-PCT OF DCLVASSET TO ACAT11IO-PCT-02             
                     IF STTLM-RSN-CD OF DCLVASSET = 'CRED'                      
                        SET ACAT11IO-AMT-02-CREDIT TO TRUE                      
                     ELSE                                                       
                        MOVE SPACES TO ACAT11IO-AMT-02-CREDIT-IND               
                     END-IF                                                     
093800          WHEN +100                                               09260000
                     MOVE ZEROS TO ACAT11IO-AMT-02                              
LRM005                             ACAT11IO-PCT-02                              
                     MOVE SPACES TO ACAT11IO-ASSET-CMNT2-TXT                    
094000          WHEN OTHER                                              09280000
                     PERFORM 9000-WRITE-TO-CICS-LOG                             
                     PERFORM 9500-RETURN-DB2-ERROR                              
094200      END-EVALUATE.                                               09300000
                                                                                
      *** READ FOR TYPE 05 SHORT                                                
           EXEC SQL SELECT                                              09140000
                   ASSET_AMT                                                    
LRM005            ,ASSET_PCT                                                    
                  ,ASSET_CMNT_TXT                                               
                  ,STTLM_RSN_CD                                                 
                 INTO                                                   09160000
                   :DCLVASSET.ASSET-AMT                                         
LRM005            ,:DCLVASSET.ASSET-PCT                                         
                  ,:ACAT11IO-ASSET-CMNT5-TXT                                    
                  ,:DCLVASSET.STTLM-RSN-CD                                      
                 FROM VASSET                                            09170000
                  WHERE (CLIENT_NBR                                     09180000
                              = :ACAT11IO-CLIENT-NBR                    09190000
                     AND ACAT_CONTROL_NBR                               09180000
                              = :ACAT11IO-CONTROL-NBR                           
                     AND ISIN_CNTRY_CD                                  09180000
                              = '  '                                    09190000
                     AND ISIN_SEC_ISSUE_CD                              09180000
                              = '         '                             09190000
                     AND STTLM_LCTN_CD                                  09180000
                              = '40'                                    09190000
                     AND CSH_MGN_SHRT_CD                                09180000
                              = 'S')                                    09190000
093200      END-EXEC.                                                   09200000
093300*                                                                 09210000
093400      EVALUATE SQLCODE                                            09220000
093800          WHEN +0                                                 09260000
                     MOVE ASSET-AMT OF DCLVASSET TO ACAT11IO-AMT-05             
LRM005               MOVE ASSET-PCT OF DCLVASSET TO ACAT11IO-PCT-05             
                     IF STTLM-RSN-CD OF DCLVASSET = 'CRED'                      
                        SET ACAT11IO-AMT-05-CREDIT TO TRUE                      
                     ELSE                                                       
                        MOVE SPACES TO ACAT11IO-AMT-05-CREDIT-IND               
                     END-IF                                                     
093800          WHEN +100                                               09260000
                     MOVE ZEROS TO ACAT11IO-AMT-05                              
LRM005                             ACAT11IO-PCT-05                              
                     MOVE SPACES TO ACAT11IO-ASSET-CMNT5-TXT                    
094000          WHEN OTHER                                              09280000
                     PERFORM 9000-WRITE-TO-CICS-LOG                             
                     PERFORM 9500-RETURN-DB2-ERROR                              
094200      END-EVALUATE.                                               09300000
                                                                                
      *** READ FOR SMA AMOUNT                                                   
           EXEC SQL SELECT                                              09140000
                   ASSET_AMT                                                    
LRM005            ,ASSET_PCT                                                    
                  ,ASSET_CMNT_TXT                                               
                 INTO                                                   09160000
                   :DCLVASSET.ASSET-AMT                                         
LRM005            ,:DCLVASSET.ASSET-PCT                                         
                  ,:ACAT11IO-ASSET-CMNTM-TXT                                    
                 FROM VASSET                                            09170000
                  WHERE (CLIENT_NBR                                     09180000
                              = :ACAT11IO-CLIENT-NBR                    09190000
                     AND ACAT_CONTROL_NBR                               09180000
                              = :ACAT11IO-CONTROL-NBR                           
                     AND ISIN_CNTRY_CD                                  09180000
                              = '  '                                    09190000
                     AND ISIN_SEC_ISSUE_CD                              09180000
                              = '         '                             09190000
                     AND STTLM_LCTN_CD                                  09180000
                              = '45'                                    09190000
                     AND STTLM_RSN_CD                                   09180000
                              = 'SMA ')                                 09190000
093200      END-EXEC.                                                   09200000
093300*                                                                 09210000
093400      EVALUATE SQLCODE                                            09220000
093800          WHEN +0                                                 09260000
                     MOVE ASSET-AMT OF DCLVASSET TO ACAT11IO-AMT-SMA            
LRM005               MOVE ASSET-PCT OF DCLVASSET TO ACAT11IO-PCT-SMA            
093800          WHEN +100                                               09260000
                     MOVE ZEROS TO ACAT11IO-AMT-SMA                             
LRM005                             ACAT11IO-PCT-SMA                             
                     MOVE SPACES TO ACAT11IO-ASSET-CMNTM-TXT                    
094000          WHEN OTHER                                              09280000
                     PERFORM 9000-WRITE-TO-CICS-LOG                             
                     PERFORM 9500-RETURN-DB2-ERROR                              
094200      END-EVALUATE.                                               09300000
094300*                                                                 09310000
       0156-CHECK-FOR-DUPE-PTD-RTN.                                             
    ****** FIRST SEE IF PTD EXISTS ON ACTIVE FILE WITH THESE KEYS:              
           PERFORM 0050-OPEN-CURSORAA.                                  09130000
           EXEC SQL                                                             
              FETCH                                                             
                  TFRCSRAA                                                      
                   INTO                                                 09160000
                    :ACAT11IO-DLVR-NBR                                  09190000
                   ,:ACAT11IO-DLVR-ACCT                                 09190000
                   ,:ACAT11IO-RCV-ACCT-TYPE-CD                                  
                   ,:ACAT11IO-CONTROL-NBR                                       
                   ,:ACAT11IO-TRNFR-TYPE-CD                                     
                   ,:ACAT11IO-RCV-CUST-NM                                       
                   ,:ACAT11IO-RCV-SS-PRIM-NBR                                   
                   ,:ACAT11IO-RCV-SS-SCNDY-NBR                                  
                   ,:ACAT11IO-CMNT-TXT                                          
                   ,:ACAT11IO-NSCC-PEND-CD                                      
                   ,:ACAT11IO-NSCC-ACK-IND                                      
                   ,:ACAT11IO-RR-CD                                             
                   ,:ACAT11IO-STTS-CD                                           
                   ,:ACAT11IO-RCV-OCC-BRKR-NBR                                  
LRM003             ,:ACAT11IO-SETTLE-DATE                                       
LRM017             ,:ACAT11IO-VTRNFR-FREEZE-IND                                 
LRM019             ,:ACAT11IO-STTLM-TM-CD                                       
LRM021             ,:ACAT11IO-GIFT-IND                                          
           END-EXEC.                                                            
           IF SQLCODE = 0                                                       
              SET ACAT11IO-PTD-ACTIVE-FOUND TO TRUE                             
              GO TO 0156-EXIT                                                   
           ELSE                                                                 
           IF SQLCODE = +100                                                    
              CONTINUE                                                          
           ELSE                                                                 
    ******    MOVE '** ACAT11DB - TFRCSRAA FETCH ERR  **     '                  
              PERFORM 9000-WRITE-TO-CICS-LOG                                    
              PERFORM 9500-RETURN-DB2-ERROR                                     
           END-IF.                                                              
           PERFORM 0080-CLOSE-TFRCSRAA.                                         
                                                                                
    ****** NOW SEE IF PTD EXISTS ON INITIAL FILE WITH THESE KEYS:               
           EXEC SQL SELECT                                              09140000
LRM016             ACAT_CONTROL_NBR                                             
                 INTO                                                   09160000
                   :ACAT11IO-CONTROL-NBR                                        
                 FROM ACTITRF                                           09170000
                  WHERE (CLIENT_NBR                                     09180000
                              = :ACAT11IO-CLIENT-NBR                    09190000
                     AND DLVR_NBR                                       09180000
                              = :ACAT11IO-DLVR-NBR                      09190000
                     AND ACCT_DLVR_NBR                                  09180000
                              = :ACAT11IO-DLVR-ACCT                     09190000
                     AND RCV_NBR                                        09180000
                              = :ACAT11IO-RCV-NBR                       09190000
                     AND ACCT_RCV_NBR                                   09180000
                              = :ACAT11IO-RCV-ACCT                      09190000
                     AND TRNFR_TYPE_CD                                  09180000
                              = 'PTD')                                  09190000
093200      END-EXEC.                                                   09200000
093300*                                                                 09210000
093400      EVALUATE SQLCODE                                            09220000
093800          WHEN +0                                                 09260000
LRM016          WHEN -811                                               09260000
                     SET ACAT11IO-PTD-INITIAL-FOUND TO TRUE                     
                     PERFORM 0110-GET-ACTIAST-DOLLAR-AMTS               09130000
                WHEN +100                                               09260000
                     CONTINUE                                                   
                WHEN OTHER                                              09280000
                     PERFORM 9000-WRITE-TO-CICS-LOG                             
                     PERFORM 9500-RETURN-DB2-ERROR                              
            END-EVALUATE.                                               09300000
                                                                                
       0156-EXIT. EXIT.                                                         
                                                                                
       0160-READ-INITIAL-PTD-DIRECT.                                            
            EXEC SQL SELECT                                             09140000
                   RCV_NBR                                              09180000
                  ,ACCT_RCV_NBR                                         09180000
                  ,DLVR_NBR                                             09180000
                  ,ACCT_DLVR_NBR                                        09180000
                  ,RCV_ACCT_TYPE_CD                                             
                  ,TRNFR_TYPE_CD                                        09180000
                  ,RCV_CUST_NM                                                  
                  ,RCV_SS_PRIM_NBR                                      09150000
                  ,RCV_SS_SCNDY_NBR                                             
                  ,CMNT_TXT                                                     
                  ,STTS_CD                                                      
                  ,RR_CD                                                        
                  ,RCV_OCC_BRKR_NBR                                             
                  ,UPDT_TMSTP                                                   
                   INTO                                                 09160000
                    :ACAT11IO-RCV-NBR                                   09190000
                   ,:ACAT11IO-RCV-ACCT                                  09190000
                   ,:ACAT11IO-DLVR-NBR                                  09190000
                   ,:ACAT11IO-DLVR-ACCT                                 09190000
                   ,:ACAT11IO-RCV-ACCT-TYPE-CD                                  
                   ,:ACAT11IO-TRNFR-TYPE-CD                                     
                   ,:ACAT11IO-RCV-CUST-NM                                       
                   ,:ACAT11IO-RCV-SS-PRIM-NBR                                   
                   ,:ACAT11IO-RCV-SS-SCNDY-NBR                                  
                   ,:ACAT11IO-CMNT-TXT                                          
                   ,:ACAT11IO-STTS-CD                                           
                   ,:ACAT11IO-RR-CD                                             
                   ,:ACAT11IO-RCV-OCC-BRKR-NBR                                  
                   ,:ACAT11IO-UPDT-TMSTP                                        
                   FROM ACTITRF                                         09170000
                  WHERE (CLIENT_NBR                                     09180000
                              = :ACAT11IO-CLIENT-NBR                    09190000
                     AND TRNFR_TYPE_CD                                  09180000
                              = :ACAT11IO-TRNFR-TYPE-CD                         
                     AND ACAT_CONTROL_NBR                               09180000
                              = :ACAT11IO-CONTROL-NBR)                          
            END-EXEC                                                            
093400      EVALUATE SQLCODE                                            09220000
093800          WHEN +0                                                 09260000
                     SET ACAT11IO-FOUND TO TRUE                                 
                     MOVE 'PTD' TO ACAT11IO-TRNFR-TYPE-CD                       
                     MOVE 'H' TO ACAT11IO-NSCC-PEND-CD                          
                     PERFORM 0110-GET-ACTIAST-DOLLAR-AMTS               09130000
               PERFORM 0050-OPEN-CURSORS                                09130000
               PERFORM 0075-READNEXT-ACTIAST                            09130000
               PERFORM 0080-CLOSE-TFRCSRS                                       
                     SET ACAT11IO-ACTIVE-FOUND TO TRUE                          
093800          WHEN +100                                               09260000
                     SET ACAT11IO-NOT-FOUND TO TRUE                             
094000          WHEN OTHER                                              09280000
                     PERFORM 9000-WRITE-TO-CICS-LOG                             
                     PERFORM 9500-RETURN-DB2-ERROR                              
094200      END-EVALUATE.                                               09300000
094300                                                                  09310000
           EJECT                                                                
       0180-GET-ACTIAST.                                                09130000
      *----------------------------------------------------------------*        
      * DIRECT READ ON ASSET WITH FULL KEY.                                     
      *----------------------------------------------------------------*        
           EXEC SQL SELECT                                              09140000
                   ISIN_CNTRY_CD                                        09180000
                  ,ISIN_SEC_ISSUE_CD                                    09180000
                  ,ISIN_SEC_CDG_CD                                      09180000
                  ,STTLM_LCTN_CD                                        09180000
                  ,STTLM_RSN_CD                                         09180000
                  ,CSH_MGN_SHRT_CD                                      09180000
                  ,ASSET_PRC_CTGY_CD                                            
                  ,ASSET_RQST_QTY_CD                                            
                  ,AST_RQST_TRANS_CD                                            
                  ,WHI_CD                                                       
LRM048            ,WHI_STTS_CD                                                  
                  ,PSTN_CD                                                      
                  ,ASSET_DESC_TXT                                               
                  ,ASSET_AMT                                                    
                  ,ASSET_QTY                                                    
                  ,ASSET_PCT                                                    
                  ,ASSET_CMNT_TXT                                               
                  ,SECURITY_ADP_NBR                                             
                 INTO                                                   09160000
                   :ACAT11IO-ISIN-CNTRY-CD                                      
                  ,:ACAT11IO-ISIN-SEC-ISSUE-CD                                  
                  ,:ACAT11IO-ISIN-SEC-CDG-CD                                    
                  ,:ACAT11IO-STTLM-LCTN-CD                                      
                  ,:ACAT11IO-SLOC-RSN                                           
                  ,:ACAT11IO-CSH-MGN-SHRT-CD                                    
                  ,:ACAT11IO-ASSET-PRC-CTGY-CD                                  
                  ,:ACAT11IO-ASSET-RQST-QTY-CD                                  
                  ,:ACAT11IO-AST-RQST-TRANS-CD                                  
                  ,:ACAT11IO-WHI-CD                                             
LRM048            ,:ACAT11IO-WHI-STTS-CD                                        
                  ,:ACAT11IO-PSTN-CD                                            
                  ,:ACAT11IO-DESC-TXT                                           
                  ,:ACAT11IO-ASSET-AMT                                          
                  ,:ACAT11IO-ASSET-QTY                                          
                  ,:ACAT11IO-ASSET-PCT                                          
                  ,:ACAT11IO-ASSET-CMNT-TXT                                     
                  ,:ACAT11IO-ADP-NBR                                            
                 FROM ACTIAST                                           09170000
                  WHERE (CLIENT_NBR                                     09180000
                              = :ACAT11IO-CLIENT-NBR                    09190000
LRM016               AND ACAT_CONTROL_NBR                                       
LRM016                        = :ACAT11IO-CONTROL-NBR                           
                     AND DLVR_NBR                                       09180000
                              = :ACAT11IO-DLVR-NBR                      09190000
                     AND ACCT_DLVR_NBR                                  09180000
                              = :ACAT11IO-DLVR-ACCT                     09190000
                     AND RCV_NBR                                        09180000
                              = :ACAT11IO-RCV-NBR                       09190000
                     AND ACCT_RCV_NBR                                   09180000
                              = :ACAT11IO-RCV-ACCT                      09190000
                     AND ISIN_CNTRY_CD                                  09180000
LRM030                        = :ACAT11IO-ISIN-CNTRY-CD                 09190000
                     AND ISIN_SEC_ISSUE_CD                              09180000
                              = :ACAT11IO-ISIN-SEC-ISSUE-CD                     
                     AND STTLM_LCTN_CD                                  09180000
                              = :ACAT11IO-STTLM-LCTN-CD                         
                     AND CSH_MGN_SHRT_CD                                09180000
                              = :ACAT11IO-CSH-MGN-SHRT-CD)                      
            END-EXEC.                                                   09200000
                                                                                
093400      EVALUATE SQLCODE                                            09220000
093800          WHEN +0                                                 09260000
                     SET ACAT11IO-FOUND TO TRUE                                 
                     PERFORM SET-MEMO-CD-RETURNED-RTN                           
093800          WHEN +100                                               09260000
                     SET ACAT11IO-NOT-FOUND TO TRUE                             
                WHEN OTHER                                              09280000
                     PERFORM 9000-WRITE-TO-CICS-LOG                             
                     PERFORM 9500-RETURN-DB2-ERROR                              
094200      END-EVALUATE.                                               09300000
                                                                                
       SET-MEMO-CD-RETURNED-RTN.                                                
            IF STTLM-RSN-CD OF DCLACTIAST = 'SFK '                              
               MOVE 'SK' TO ACAT11IO-MEMO-CD                                    
            ELSE                                                                
               MOVE '  ' TO ACAT11IO-MEMO-CD                                    
            END-IF.                                                             
LRM003      IF ACAT11IO-TRNFR-TYPE-CD = 'PTR'                                   
LRM003         MOVE WS-NSCC-PEND-CD TO ACAT11IO-NSCC-PEND-CD                    
LRM003      END-IF.                                                             
           EJECT                                                                
       0200-ISRT-ACTITRF.                                               09130000
LRM007     IF ACAT11IO-DUPE-FOUND = 'Y'                                         
LRM007        PERFORM 0205-FIND-NEXT-DUMMY-CNTL-RTN                             
LRM007           THRU 0205-EXIT                                                 
LRM007     END-IF.                                                              
           INITIALIZE DCLACTITRF.                                               
           MOVE WS-TIMESTAMP TO  UPDT-TMSTP OF DCLACTITRF                       
                                  CRT-TMSTP OF DCLACTITRF                       
                                  ACAT11IO-UPDT-TMSTP.                          
           MOVE WS-TIMESTAMP(1 : 10) TO PRCS-DT OF DCLACTITRF.                  
           MOVE '0001-01-01' TO  STTLM-ASCTD-DT OF DCLACTITRF.                  
           MOVE ZEROS TO PHSCL-SEQ-NBR OF DCLACTITRF                            
                         LGCL-SEQ-NBR  OF DCLACTITRF.                           
           MOVE 'D' TO DSTBN-SIDE-CD OF DCLACTITRF.                             
           IF ACAT11IO-IT-REJECT                                                
              MOVE ACAT11IO-CONTROL-NBR TO                                      
                              ACAT-CONTROL-NBR OF DCLACTITRF                    
              MOVE 'R' TO TRANS-TYPE-CD OF DCLACTITRF                           
LRM003        MOVE ACAT11IO-PTR-CMNT-TXT TO WS-CMNT-TXT                         
           ELSE                                                                 
              MOVE 'A' TO TRANS-TYPE-CD OF DCLACTITRF                           
LRM003        MOVE ACAT11IO-CMNT-TXT TO WS-CMNT-TXT.                            
           MOVE EIBTRMID TO CICS-TERM-ID-CD OF DCLACTITRF.                      
LRM007     MOVE ACAT11IO-DLVR-ACCT TO TRANS-RFRN-ID-CD OF DCLACTITRF            
LRM007                             WS-TRANS-RFRN-ID-CD                          
LRM007     IF ACAT11IO-CONTROL-NBR (1 : 2) = 'XX'                               
LRM007        PERFORM 0202-FORMAT-TRANS-RFRN-RTN                                
LRM007        MOVE WS-TRANS-RFRN-ID-CD                                          
LRM007                  TO TRANS-RFRN-ID-CD OF DCLACTITRF                       
LRM007     END-IF.                                                              
LRM007     MOVE ACAT11IO-CONTROL-NBR TO ACAT-CONTROL-NBR                        
LRM007                                  OF DCLACTITRF.                          
                                                                                
LRM003***  IF ACAT11IO-COPY-ACTIVE-PTR                                          
LRM003***      MOVE ACAT11IO-CONTROL-NBR TO                                     
LRM003***                     ACAT-CNTL-ASTD-NBR OF DCLACTITRF                  
LRM003***      MOVE WS-TIMESTAMP(1 : 10) TO                                     
LRM003***                        STTLM-ASCTD-DT OF DCLACTITRF                   
LRM003***  END-IF.                                                              
                                                                                
           EXEC SQL                                                     09140000
               INSERT INTO ACTITRF                                      09170000
                 (                                                      09150000
                   CLIENT_NBR                                           09180000
                  ,DLVR_NBR                                             09150000
                  ,ACCT_DLVR_NBR                                        09180000
                  ,RCV_NBR                                              09180000
                  ,ACCT_RCV_NBR                                         09180000
                  ,TRNFR_TYPE_CD                                        09180000
                  ,RCV_NBR_STTS_CD                                              
                  ,DLVR_NBR_STTS_CD                                             
                  ,ACCT_RCV_STTS_CD                                             
                  ,ACCT_DLVR_STTS_CD                                            
                  ,SBMTG_PRTCP_NBR                                              
                  ,SBMT_PRT_NR_STS_CD                                           
                  ,ACAT_CONTROL_NBR                                             
                  ,CONTROL_NBR_STS_CD                                           
                  ,TRNFR_TYPE_STTS_CD                                           
                  ,TRANS_TYPE_CD                                                
                  ,TRANS_TYPE_STTS_CD                                           
                  ,RCV_CUST_NM                                                  
                  ,RCV_CUST_NM_STS_CD                                           
                  ,RCV_SS_PRIM_NBR                                              
                  ,RCV_SS_PRIM_STS_CD                                           
                  ,RCV_SS_SCNDY_NBR                                             
                  ,RCV_SS_SCDY_STS_CD                                           
                  ,RCV_ACCT_TYPE_CD                                             
                  ,RCV_ACT_TYP_STS_CD                                           
                  ,RCV_OCC_BRKR_NBR                                             
                  ,RCV_OCC_STTS_CD                                              
                  ,RCV_CRSPN_NBR                                                
                  ,RCV_CRSPN_STTS_CD                                            
                  ,ACAT_CNTL_ASTD_NBR                                           
                  ,CNTL_ASTD_STTS_CD                                            
                  ,CMNT_TXT                                                     
                  ,CMNT_STTS_CD                                                 
                  ,PRCS_DT                                                      
                  ,STTS_CD                                                      
                  ,DSTBN_SIDE_CD                                                
                  ,SYS_ACT_CD                                                   
                  ,SYS_RJCT_RSN_CD                                              
                  ,TRNFR_TYPE_RJCT_CD                                           
                  ,TRNFR_TYPE_RJC1_CD                                           
                  ,TRNFR_TYPE_RJC2_CD                                           
                  ,TRN_TYP_RJC_STS_CD                                           
                  ,PHSCL_SEQ_NBR                                                
                  ,PHSCL_SEQ_STTS_CD                                            
                  ,LGCL_SEQ_NBR                                                 
                  ,LGCL_SEQ_NR_STS_CD                                           
                  ,PRTCP_CONTRA_CD                                              
                  ,CYCLE_CD                                                     
                  ,DAYS_STTS_QTY                                                
                  ,TRANS_RFRN_ID_CD                                             
                  ,TRANS_RFRN_STTS_CD                                           
                  ,DB_CR_CD                                                     
                  ,STTLM_ASCTD_DT                                               
                  ,STTLM_ASCTD_STS_CD                                           
                  ,RCRD_LNGTH_STTS_CD                                           
                  ,RCRD_STTS_CD                                                 
                  ,NSCC_PEND_CD                                                 
                  ,NSCC_ACK_IND                                                 
                  ,UPDT_TMSTP                                                   
                  ,CRT_TMSTP                                                    
                  ,CICS_TERM_ID_CD                                              
                  ,PRGM_NM                                                      
                  ,RR_CD                                                        
                  ,CICS_SGNON_ID                                                
LRM017            ,CICS_NET_NM                                                  
LRM017            ,TPSCRT_USR_ID                                                
LRM017            ,TPSCRT_USR_NM                                                
LRM021            ,GIFT_IND                                                     
                 )                                                      09150000
                 VALUES                                                         
                 (                                                      09150000
                    :ACAT11IO-CLIENT-NBR                                09190000
                   ,:ACAT11IO-DLVR-NBR                                  09190000
                   ,:ACAT11IO-DLVR-ACCT                                 09190000
                   ,:ACAT11IO-RCV-NBR                                   09190000
                   ,:ACAT11IO-RCV-ACCT                                  09190000
                   ,:ACAT11IO-TRNFR-TYPE-CD                                     
                   ,:DCLACTITRF.RCV-NBR-STTS-CD                                 
                   ,:DCLACTITRF.DLVR-NBR-STTS-CD                                
                   ,:DCLACTITRF.ACCT-RCV-STTS-CD                                
                   ,:DCLACTITRF.ACCT-DLVR-STTS-CD                               
                   ,:ACAT11IO-DLVR-NBR                                          
                   ,:DCLACTITRF.SBMT-PRT-NR-STS-CD                              
                   ,:DCLACTITRF.ACAT-CONTROL-NBR                                
                   ,:DCLACTITRF.CONTROL-NBR-STS-CD                              
                   ,:DCLACTITRF.TRNFR-TYPE-STTS-CD                              
                   ,:DCLACTITRF.TRANS-TYPE-CD                                   
                   ,:DCLACTITRF.TRANS-TYPE-STTS-CD                              
                   ,:ACAT11IO-RCV-CUST-NM                                       
                   ,:DCLACTITRF.RCV-CUST-NM-STS-CD                              
                   ,:ACAT11IO-RCV-SS-PRIM-NBR                                   
                   ,:DCLACTITRF.RCV-SS-PRIM-STS-CD                              
                   ,:ACAT11IO-RCV-SS-SCNDY-NBR                                  
                   ,:DCLACTITRF.RCV-SS-SCDY-STS-CD                              
                   ,:ACAT11IO-RCV-ACCT-TYPE-CD                                  
                   ,:DCLACTITRF.RCV-ACT-TYP-STS-CD                              
                   ,:ACAT11IO-RCV-OCC-BRKR-NBR                                  
                   ,:DCLACTITRF.RCV-OCC-STTS-CD                                 
                   ,:DCLACTITRF.RCV-CRSPN-NBR                                   
                   ,:DCLACTITRF.RCV-CRSPN-STTS-CD                               
                   ,:DCLACTITRF.ACAT-CNTL-ASTD-NBR                              
                   ,:DCLACTITRF.CNTL-ASTD-STTS-CD                               
LRM003             ,:WS-CMNT-TXT                                                
                   ,:DCLACTITRF.CMNT-STTS-CD                                    
                   ,:DCLACTITRF.PRCS-DT                                         
                   ,:DCLACTITRF.STTS-CD                                         
                   ,:DCLACTITRF.DSTBN-SIDE-CD                                   
                   ,:DCLACTITRF.SYS-ACT-CD                                      
                   ,:DCLACTITRF.SYS-RJCT-RSN-CD                                 
                   ,:ACAT11IO-REJECT-CODE                                       
                   ,:DCLACTITRF.TRNFR-TYPE-RJC1-CD                              
                   ,:DCLACTITRF.TRNFR-TYPE-RJC2-CD                              
                   ,:DCLACTITRF.TRN-TYP-RJC-STS-CD                              
                   ,:DCLACTITRF.PHSCL-SEQ-NBR                                   
                   ,:DCLACTITRF.PHSCL-SEQ-STTS-CD                               
                   ,:DCLACTITRF.LGCL-SEQ-NBR                                    
                   ,:DCLACTITRF.LGCL-SEQ-NR-STS-CD                              
                   ,:DCLACTITRF.PRTCP-CONTRA-CD                                 
                   ,:DCLACTITRF.CYCLE-CD                                        
                   ,:DCLACTITRF.DAYS-STTS-QTY                                   
LRM007             ,:DCLACTITRF.TRANS-RFRN-ID-CD                                
                   ,:DCLACTITRF.TRANS-RFRN-STTS-CD                              
                   ,:DCLACTITRF.DB-CR-CD                                        
                   ,:DCLACTITRF.STTLM-ASCTD-DT                                  
                   ,:DCLACTITRF.STTLM-ASCTD-STS-CD                              
                   ,:DCLACTITRF.RCRD-LNGTH-STTS-CD                              
                   ,:DCLACTITRF.RCRD-STTS-CD                                    
                   ,:ACAT11IO-NSCC-PEND-CD                                      
                   ,:DCLACTITRF.NSCC-ACK-IND                                    
                   ,:DCLACTITRF.UPDT-TMSTP                                      
                   ,:DCLACTITRF.CRT-TMSTP                                       
                   ,:DCLACTITRF.CICS-TERM-ID-CD                                 
                   ,'ACAT11DB'                                                  
                   ,:ACAT11IO-RR-CD                                             
                   ,:ACAT11IO-SIGN-ON-ID                                        
LRM017             ,:ACAT11IO-NETNAME                                           
LRM017             ,:ACAT11IO-USER-ID                                           
LRM017             ,:ACAT11IO-USER-NAME                                         
LRM021             ,:ACAT11IO-GIFT-IND                                          
                 )                                                      09150000
093200     END-EXEC.                                                    09200000
                                                                                
           IF SQLCODE = -803                                                    
           AND ACAT11IO-COPY-ACTIVE-PTR                                         
              MOVE SQLCODE TO ACAT11IO-SQLCODE                                  
           ELSE                                                                 
093400     EVALUATE SQLCODE                                             09220000
093500          WHEN +0                                                 09230000
093600               SET ACAT11IO-GOOD-RESP TO TRUE                     09240000
LRM017               IF ACAT11IO-IT-REJECT                                      
LRM017               AND ACAT11IO-VTRNFR-FREEZE-IND NOT = 'Y' AND 'O'           
LRM017               AND (ACAT11IO-CURR-FREEZE-CASH-CR = 'Y'                    
LRM017                 OR ACAT11IO-CURR-FREEZE-CASH-DB = 'Y'                    
LRM017                 OR ACAT11IO-CURR-FREEZE-SEC-LONG = 'Y'                   
LRM017                 OR ACAT11IO-CURR-FREEZE-SEC-SHORT = 'Y')                 
LRM017                   PERFORM 0450-UPDATE-FRZN-IND                           
LRM017               END-IF                                                     
094000          WHEN OTHER                                              09280000
                     SET ACAT11IO-DB2-ERROR TO TRUE                             
                     PERFORM 9000-WRITE-TO-CICS-LOG                             
                     PERFORM 9500-RETURN-DB2-ERROR                              
094200     END-EVALUATE.                                                09300000
                                                                                
           IF ACAT11IO-DESC-TXT(1 : 10) > SPACES                                
           AND NOT ACAT11IO-IT-REJECT                                           
              PERFORM 0220-ISRT-ACTIAST THRU 0220-EXIT.                    09130
                                                                                
LRM007 0202-FORMAT-TRANS-RFRN-RTN.                                              
LRM007     PERFORM VARYING SUB FROM 20 BY -1                                    
LRM007         UNTIL SUB < 1  OR WS-TRANS-RFRN-ID-CD (SUB : 1) > ' '            
LRM007     END-PERFORM.                                                         
LRM007     IF SUB > 16                                                          
LRM007        MOVE 16 TO SUB2                                                   
LRM007     ELSE                                                                 
LRM007        ADD 1 TO SUB GIVING SUB2                                          
LRM007     END-IF.                                                              
LRM007     MOVE ACAT11IO-CONTROL-NBR (1 : 5) TO                                 
LRM007             WS-TRANS-RFRN-ID-CD (SUB2 : 5).                              
           EJECT                                                                
LRM007 0205-FIND-NEXT-DUMMY-CNTL-RTN.                                           
LRM007     MOVE 'XX' TO ACAT11IO-CONTROL-NBR                                    
LRM007*** READ THE INIT TABLE FOR THE GREATEST ARTIFICIAL CNTL NBR              
LRM007*** FOR THIS SET OF KEYS... NONE FOUND USE XX0000                         
LRM007*** - NEED  SYNTAX FOR FIRST ONE                                          
   ******        FIRST 1 ROW ONLY                                               
           EXEC SQL OPEN                                                        
              ACTITRF_LAST_CNTL                                                 
           END-EXEC.                                                            
           IF SQLCODE = +0                                                      
              EXEC SQL FETCH                                                    
                 ACTITRF_LAST_CNTL                                              
                 INTO                                                           
                   :DCLACTITRF.ACAT-CONTROL-NBR                                 
               END-EXEC                                                         
            END-IF.                                                             
      *                                                                         
            EVALUATE SQLCODE                                                    
                WHEN +0                                                         
                     IF ACAT-CONTROL-NBR OF DCLACTITRF (1 : 2) = 'XX'           
                     AND ACAT-CONTROL-NBR OF DCLACTITRF (3 : 3) NUMERIC         
                       MOVE ACAT-CONTROL-NBR OF DCLACTITRF (3 : 3)              
                                 TO WS-NEXT-CNTL-NBR                            
                       ADD 1 TO WS-NEXT-CNTL-NBR                                
                       MOVE WS-NEXT-CNTL-NBR TO                                 
                               ACAT11IO-CONTROL-NBR(3 : 3)                      
                     ELSE                                                       
                        MOVE '001' TO ACAT11IO-CONTROL-NBR(3 : 3)               
                     END-IF                                                     
                WHEN +100                                                       
                     MOVE '001' TO ACAT11IO-CONTROL-NBR(3 : 3)                  
                WHEN OTHER                                                      
                     PERFORM 9000-WRITE-TO-CICS-LOG                             
                     PERFORM 9500-RETURN-DB2-ERROR                              
            END-EVALUATE.                                                       
      *                                                                         
LRM007 0205-EXIT. EXIT.                                                         
           EJECT                                                                
       0220-ISRT-ACTIAST.                                                  09130
           INITIALIZE DCLACTIAST.                                               
           MOVE WS-TIMESTAMP TO  UPDT-TMSTP OF DCLACTIAST                       
                                  CRT-TMSTP OF DCLACTIAST.                      
           MOVE ZEROS TO ASSET-SEQ-NBR OF DCLACTIAST                            
                         PHSCL-SEQ-NBR OF DCLACTIAST                            
                          LGCL-SEQ-NBR OF DCLACTIAST.                           
           IF ACAT11IO-MEMO-CD = 'SK'                                           
              MOVE 'SFK ' TO STTLM-RSN-CD OF DCLACTIAST                         
           ELSE                                                                 
              IF ACAT11IO-SLOC-RSN > SPACES                                     
                 MOVE ACAT11IO-SLOC-RSN TO STTLM-RSN-CD OF DCLACTIAST           
              ELSE                                                              
                 MOVE '    '            TO STTLM-RSN-CD OF DCLACTIAST           
           END-IF.                                                              
           MOVE 'A' TO TRANS-TYPE-CD OF DCLACTIAST.                             
LRM017     IF CREATE-SEC-LONG-FREEZE-MEMO                               MRGIPS05
LRM017         SET SEC-LONG-FREEZE-MEMO-CREATED TO TRUE                 MRGIPS05
LRM017         MOVE '45'   TO ACAT11IO-STTLM-LCTN-CD                            
LRM017         MOVE 'COMT' TO ACAT11IO-SLOC-RSN                                 
LRM017         MOVE ZEROS  TO ACAT11IO-ASSET-QTY                                
LRM017                        ACAT11IO-ASSET-AMT                                
LRM017         MOVE WS-SEC-FREEZE-SHORT-MSG TO ACAT11IO-ASSET-CMNT-TXT          
LRM017     ELSE                                                                 
LRM017     IF CREATE-SEC-SHORT-FREEZE-MEMO                              MRGIPS05
LRM017         SET SEC-SHORT-FREEZE-MEMO-CREATED TO TRUE                MRGIPS05
LRM017         MOVE '45'   TO ACAT11IO-STTLM-LCTN-CD                            
LRM017         MOVE 'COMT' TO ACAT11IO-SLOC-RSN                                 
LRM017         MOVE ZEROS  TO ACAT11IO-ASSET-QTY                                
LRM017                        ACAT11IO-ASSET-AMT                                
LRM017         MOVE WS-SEC-FREEZE-LONG-MSG TO ACAT11IO-ASSET-CMNT-TXT           
LRM017     ELSE                                                                 
LRM017     IF CREATE-CASH-DB-FREEZE-MEMO                                MRGIPS05
LRM017         SET CASH-DB-FREEZE-MEMO-CREATED TO TRUE                  MRGIPS05
LRM017         MOVE '45'   TO ACAT11IO-STTLM-LCTN-CD                            
LRM017         MOVE 'COMT' TO ACAT11IO-SLOC-RSN                                 
LRM017         MOVE ZEROS  TO ACAT11IO-ASSET-QTY                                
LRM017                        ACAT11IO-ASSET-AMT                                
LRM017         IF ACAT11IO-CSH-MGN-SHRT-CD = 'C'                                
LRM017            MOVE ZEROS  TO ACAT11IO-AMT-01                                
LRM017                           ACAT11IO-PCT-01                                
LRM017            MOVE LOW-VALUES TO ACAT11IO-AMT-01-CREDIT-IND                 
LRM017                               ACAT11IO-AMT-01-RQST-CD                    
LRM017         ELSE                                                             
LRM017         IF ACAT11IO-CSH-MGN-SHRT-CD = 'M'                                
LRM017            MOVE ZEROS  TO ACAT11IO-AMT-02                                
LRM017                           ACAT11IO-PCT-02                                
LRM017            MOVE LOW-VALUES TO ACAT11IO-AMT-02-CREDIT-IND                 
LRM017                               ACAT11IO-AMT-02-RQST-CD                    
LRM017         ELSE                                                             
LRM017            MOVE ZEROS  TO ACAT11IO-AMT-05                                
LRM017                           ACAT11IO-PCT-05                                
LRM017            MOVE LOW-VALUES TO ACAT11IO-AMT-05-CREDIT-IND                 
LRM017                               ACAT11IO-AMT-05-RQST-CD                    
LRM017         END-IF END-IF                                                    
LRM017         MOVE 'XXCASH' TO ACAT11IO-ISIN-SEC-ISSUE-CD                      
LRM017         MOVE 'CASH BALANCE' TO ACAT11IO-DESC-TXT                         
LRM017         MOVE WS-CASH-FREEZE-DB-MSG  TO ACAT11IO-ASSET-CMNT-TXT           
LRM017     ELSE                                                                 
LRM017     IF CREATE-CASH-CR-FREEZE-MEMO                                MRGIPS05
LRM017         SET CASH-CR-FREEZE-MEMO-CREATED TO TRUE                  MRGIPS05
LRM017         MOVE '45'   TO ACAT11IO-STTLM-LCTN-CD                            
LRM017         MOVE 'COMT' TO ACAT11IO-SLOC-RSN                                 
LRM017         MOVE ZEROS  TO ACAT11IO-ASSET-QTY                                
LRM017                        ACAT11IO-ASSET-AMT                                
LRM017         IF ACAT11IO-CSH-MGN-SHRT-CD = 'C'                                
LRM017            MOVE ZEROS  TO ACAT11IO-AMT-01                                
LRM017                           ACAT11IO-PCT-01                                
LRM017            MOVE LOW-VALUES TO ACAT11IO-AMT-01-CREDIT-IND                 
LRM017                               ACAT11IO-AMT-01-RQST-CD                    
LRM017         ELSE                                                             
LRM017         IF ACAT11IO-CSH-MGN-SHRT-CD = 'M'                                
LRM017            MOVE ZEROS  TO ACAT11IO-AMT-02                                
LRM017                           ACAT11IO-PCT-02                                
LRM017            MOVE LOW-VALUES TO ACAT11IO-AMT-02-CREDIT-IND                 
LRM017                               ACAT11IO-AMT-02-RQST-CD                    
LRM017         ELSE                                                             
LRM017            MOVE ZEROS  TO ACAT11IO-AMT-05                                
LRM017                           ACAT11IO-PCT-05                                
LRM017            MOVE LOW-VALUES TO ACAT11IO-AMT-05-CREDIT-IND                 
LRM017                               ACAT11IO-AMT-05-RQST-CD                    
LRM017         END-IF END-IF                                                    
LRM017         MOVE 'XXCASH' TO ACAT11IO-ISIN-SEC-ISSUE-CD                      
LRM017         MOVE 'CASH BALANCE' TO ACAT11IO-DESC-TXT                         
LRM017         MOVE WS-CASH-FREEZE-CR-MSG  TO ACAT11IO-ASSET-CMNT-TXT           
LRM017     END-IF.                                                              
                                                                                
LRM002     SET WK-MS-NON-OPT TO TRUE.                                           
LRM002     IF ACAT11IO-STTLM-LCTN-CD = '35'                                     
LRM002        PERFORM 0225-GETMSD-OPTIONS-RTN                                   
LRM002     END-IF.                                                              
LRM002     IF  WK-MS-NON-OPT                                                    
LRM002         MOVE '00'           TO OPTN-CTGY-CD       OF DCLACTIAST          
LRM002     ELSE                                                                 
LRM002       IF  WK-MS-EQUITY-OPT                                               
LRM002           MOVE '01'         TO OPTN-CTGY-CD       OF DCLACTIAST          
LRM002       ELSE                                                               
LRM002         IF  WK-MS-NON-EQU-OPT                                            
LRM002             MOVE '02'       TO OPTN-CTGY-CD       OF DCLACTIAST          
LRM002         ELSE                                                             
LRM002             MOVE '03'       TO OPTN-CTGY-CD       OF DCLACTIAST          
LRM002         END-IF                                                           
LRM002       END-IF                                                             
LRM002     END-IF.                                                              
           MOVE ACAT11IO-DLVR-ACCT TO TRANS-RFRN-ID-CD OF DCLACTIAST.           
           MOVE EIBTRMID TO CICS-TERM-ID-CD OF DCLACTIAST.                      
LRM008     IF  ACAT11IO-NSCC-WTHLD-CD = 'W'                                     
LRM008     OR ACAT11IO-NSCC-PEND-CD = 'H'                                       
LRM008        MOVE 'H' TO NSCC-PEND-CD OF DCLACTIAST                            
LRM008     ELSE                                                                 
LRM008        MOVE ' ' TO NSCC-PEND-CD OF DCLACTIAST                            
LRM008     END-IF.                                                              
                                                                                
LRM007     MOVE ACAT11IO-CONTROL-NBR TO ACAT-CONTROL-NBR OF DCLACTIAST.         
LRM007     MOVE ACAT11IO-DLVR-ACCT TO TRANS-RFRN-ID-CD OF DCLACTIAST            
LRM007                             WS-TRANS-RFRN-ID-CD                          
LRM007     IF ACAT11IO-CONTROL-NBR (1 : 2) = 'XX'                               
LRM007        PERFORM 0202-FORMAT-TRANS-RFRN-RTN                                
LRM007        MOVE WS-TRANS-RFRN-ID-CD                                          
LRM007                  TO TRANS-RFRN-ID-CD OF DCLACTIAST                       
LRM007     END-IF.                                                              
LRM012     IF ACAT11IO-STTLM-LCTN-CD = '35'                                     
LRM012        PERFORM 0227-BUILD-ACTIOPN                                        
LRM012     END-IF.                                                              
                                                                                
LRM022     IF ACAT11IO-IT-ISRT-ASSET                                            
LRM022     AND ACAT11IO-ISIN-SEC-ISSUE-CD > SPACES                              
LRM022        PERFORM 0387-READ-ACTIAST-BY-SECID                                
LRM022        IF SQLCODE = 0 OR -811                                    09220000
LRM022           PERFORM 0222-RETURN-ACTIAST-VALUES                     09220000
LRM022           MOVE STTLM-LCTN-CD OF DCLACTIAST TO                            
LRM022                                ACAT11IO-STTLM-LCTN-CD                    
LRM022           MOVE STTLM-RSN-CD  OF DCLACTIAST TO                            
LRM022                                ACAT11IO-SLOC-RSN                         
LRM022           SET ACAT11IO-DUPE-ASSET-RETURN TO TRUE                 09240000
LRM022           GO TO 0220-EXIT                                                
LRM022     END-IF.                                                              
CSG001* IN SOME CASES MSD DESCRIPTIONS CONTAIN SPECIAL CHARACTERS.              
CSG001* CORRECT THEM BY REPLACING SPECIAL CHARACTERS WITH SPACES.               
CSG001     MOVE ACAT11IO-DESC-TXT         TO WS-ASSET-DESC-TXT                  
CSG001     PERFORM 0231-EDIT-ASSET-DESC-TXT                                     
CSG001     MOVE WS-ASSET-DESC-TXT          TO ACAT11IO-DESC-TXT                 
                                                                                
           EXEC SQL                                                     09140000
               INSERT INTO ACTIAST                                      09170000
                 (                                                      09150000
                   CLIENT_NBR                                           09180000
                  ,DLVR_NBR                                             09150000
                  ,ACCT_DLVR_NBR                                        09180000
                  ,RCV_NBR                                              09180000
                  ,ACCT_RCV_NBR                                         09180000
                  ,ISIN_CNTRY_CD                                                
                  ,ISIN_SEC_ISSUE_CD                                            
                  ,ISIN_SEC_CDG_CD                                              
                  ,STTLM_LCTN_CD                                                
                  ,CSH_MGN_SHRT_CD                                              
                  ,CSH_MRG_SHT_STS_CD                                           
                  ,STTLM_LCTN_STTS_CD                                           
                  ,ISIN_CNTRY_STTS_CD                                           
                  ,SBMTG_PRTCP_NBR                                              
                  ,SBMT_PRT_NR_STS_CD                                           
                  ,ACAT_CONTROL_NBR                                             
                  ,CONTROL_NBR_STS_CD                                           
                  ,ASSET_SEQ_NBR                                                
                  ,AST_SEQ_NBR_STS_CD                                           
                  ,TRANS_TYPE_CD                                                
                  ,TRANS_TYPE_STTS_CD                                           
                  ,PHSCL_SEQ_NBR                                                
                  ,PHSCL_SEQ_STTS_CD                                            
                  ,LGCL_SEQ_NBR                                                 
                  ,LGCL_SEQ_NR_STS_CD                                           
                  ,ASSET_PRC_CTGY_CD                                            
                  ,AST_PRC_CTG_STS_CD                                           
                  ,STTLM_RSN_CD                                                 
                  ,STTLM_RSN_STTS_CD                                            
                  ,ASSET_DESC_TXT                                               
                  ,ASSET_DESC_STTS_CD                                           
                  ,ASSET_RQST_QTY_CD                                            
                  ,ASSET_RQST_STS_CD                                            
                  ,AST_RQST_TRANS_CD                                            
                  ,AST_RQ_TRAN_STS_CD                                           
                  ,ASSET_QTY                                                    
                  ,ASSET_QTY_STTS_CD                                            
                  ,ASSET_PCT                                                    
                  ,ASSET_PCT_STTS_CD                                            
                  ,PSTN_CD                                                      
                  ,PSTN_CD_STTS_CD                                              
                  ,ISO_CRNCY_CD                                                 
                  ,ISO_CRNCY_STTS_CD                                            
                  ,ASSET_AMT                                                    
                  ,ASSET_AMT_STTS_CD                                            
                  ,BEARER_BOND_CD                                               
                  ,BEARER_BND_STTS_CD                                           
                  ,WHI_CD                                                       
                  ,WHI_STTS_CD                                                  
                  ,TRNFR_TYPE_RSN_CD                                            
                  ,TRN_TYP_RSN_STS_CD                                           
                  ,MBS_SERIAL_NBR                                               
                  ,MBS_SERIAL_STTS_CD                                           
                  ,ASSET_CMNT_TXT                                               
                  ,ASSET_CMNT_STTS_CD                                           
                  ,NSCC_WTHLD_CD                                                
                  ,TRANS_RFRN_ID_CD                                             
                  ,TRANS_RFRN_STTS_CD                                           
                  ,ISIN_SEC_IS_STS_CD                                           
                  ,ISIN_SEC_CD_STS_CD                                           
                  ,OPTN_CTGY_CD                                                 
                  ,OPTN_CTGY_STTS_CD                                            
                  ,RCRD_LNGTH_STTS_CD                                           
                  ,RCRD_STTS_CD                                                 
                  ,NSCC_PEND_CD                                                 
                  ,NSCC_ACK_IND                                                 
                  ,PRGM_NM                                                      
                  ,CICS_TERM_ID_CD                                              
                  ,UPDT_TMSTP                                                   
                  ,CRT_TMSTP                                                    
                  ,SECURITY_ADP_NBR                                             
                  ,TRNFR_TYPE_CD                                                
                  ,TRNFR_TYPE_STTS_CD                                           
                  ,RCV_NBR_STTS_CD                                              
                  ,DLVR_NBR_STTS_CD                                             
                  ,CICS_SGNON_ID                                                
                 )                                                      09150000
                 VALUES                                                         
                 (                                                      09150000
                    :ACAT11IO-CLIENT-NBR                                09190000
                   ,:ACAT11IO-DLVR-NBR                                  09190000
                   ,:ACAT11IO-DLVR-ACCT                                 09190000
                   ,:ACAT11IO-RCV-NBR                                   09190000
                   ,:ACAT11IO-RCV-ACCT                                  09190000
                   ,:ACAT11IO-ISIN-CNTRY-CD                                     
                   ,:ACAT11IO-ISIN-SEC-ISSUE-CD                                 
                   ,:ACAT11IO-ISIN-SEC-CDG-CD                                   
                   ,:ACAT11IO-STTLM-LCTN-CD                                     
                   ,:ACAT11IO-CSH-MGN-SHRT-CD                                   
                   ,:DCLACTIAST.CSH-MRG-SHT-STS-CD                              
                   ,:DCLACTIAST.STTLM-LCTN-STTS-CD                              
                   ,:DCLACTIAST.ISIN-CNTRY-STTS-CD                              
                   ,:ACAT11IO-DLVR-NBR                                  09190000
                   ,:DCLACTIAST.SBMT-PRT-NR-STS-CD                              
LRM003             ,:ACAT11IO-CONTROL-NBR                                       
                   ,:DCLACTIAST.CONTROL-NBR-STS-CD                              
                   ,:DCLACTIAST.ASSET-SEQ-NBR                                   
                   ,:DCLACTIAST.AST-SEQ-NBR-STS-CD                              
                   ,:DCLACTIAST.TRANS-TYPE-CD                                   
                   ,:DCLACTIAST.TRANS-TYPE-STTS-CD                              
                   ,:DCLACTIAST.PHSCL-SEQ-NBR                                   
                   ,:DCLACTIAST.PHSCL-SEQ-STTS-CD                               
                   ,:DCLACTIAST.LGCL-SEQ-NBR                                    
                   ,:DCLACTIAST.LGCL-SEQ-NR-STS-CD                              
                   ,:ACAT11IO-ASSET-PRC-CTGY-CD                                 
                   ,:DCLACTIAST.AST-PRC-CTG-STS-CD                              
LRM003             ,:ACAT11IO-SLOC-RSN                                          
                   ,:DCLACTIAST.STTLM-RSN-STTS-CD                               
                   ,:ACAT11IO-DESC-TXT                                          
                   ,:DCLACTIAST.ASSET-DESC-STTS-CD                              
                   ,:ACAT11IO-ASSET-RQST-QTY-CD                                 
                   ,:DCLACTIAST.ASSET-RQST-STS-CD                               
                   ,:ACAT11IO-AST-RQST-TRANS-CD                                 
                   ,:DCLACTIAST.AST-RQ-TRAN-STS-CD                              
                   ,:ACAT11IO-ASSET-QTY                                         
                   ,:DCLACTIAST.ASSET-QTY-STTS-CD                               
                   ,:ACAT11IO-ASSET-PCT                                         
                   ,:DCLACTIAST.ASSET-PCT-STTS-CD                               
                   ,:ACAT11IO-PSTN-CD                                           
                   ,:DCLACTIAST.PSTN-CD-STTS-CD                                 
                   ,:DCLACTIAST.ISO-CRNCY-CD                                    
                   ,:DCLACTIAST.ISO-CRNCY-STTS-CD                               
                   ,:ACAT11IO-ASSET-AMT                                         
                   ,:DCLACTIAST.ASSET-AMT-STTS-CD                               
                   ,:ACAT11IO-BEARER-BOND-CD                                    
                   ,:DCLACTIAST.BEARER-BND-STTS-CD                              
                   ,:ACAT11IO-WHI-CD                                            
                   ,:DCLACTIAST.WHI-STTS-CD                                     
                   ,:DCLACTIAST.TRNFR-TYPE-RSN-CD                               
                   ,:DCLACTIAST.TRN-TYP-RSN-STS-CD                              
                   ,:DCLACTIAST.MBS-SERIAL-NBR                                  
                   ,:DCLACTIAST.MBS-SERIAL-STTS-CD                              
                   ,:ACAT11IO-ASSET-CMNT-TXT                                    
                   ,:DCLACTIAST.ASSET-CMNT-STTS-CD                              
LRM008             ,:ACAT11IO-NSCC-WTHLD-CD                                     
                   ,:DCLACTIAST.TRANS-RFRN-ID-CD                                
                   ,:DCLACTIAST.TRANS-RFRN-STTS-CD                              
                   ,:DCLACTIAST.ISIN-SEC-IS-STS-CD                              
                   ,:DCLACTIAST.ISIN-SEC-CD-STS-CD                              
                   ,:DCLACTIAST.OPTN-CTGY-CD                                    
                   ,:DCLACTIAST.OPTN-CTGY-STTS-CD                               
                   ,:DCLACTIAST.RCRD-LNGTH-STTS-CD                              
                   ,:DCLACTIAST.RCRD-STTS-CD                                    
                   ,:DCLACTIAST.NSCC-PEND-CD                                    
                   ,:DCLACTIAST.NSCC-ACK-IND                                    
                   ,'ACAT11DB'                                                  
                   ,:DCLACTIAST.CICS-TERM-ID-CD                                 
                   ,:DCLACTIAST.UPDT-TMSTP                                      
                   ,:DCLACTIAST.CRT-TMSTP                                       
                   ,:ACAT11IO-ADP-NBR                                           
LRM003             ,:ACAT11IO-TRNFR-TYPE-CD                                     
                   ,:DCLACTIAST.TRNFR-TYPE-STTS-CD                              
                   ,:DCLACTIAST.RCV-NBR-STTS-CD                                 
                   ,:DCLACTIAST.DLVR-NBR-STTS-CD                                
                   ,:ACAT11IO-SIGN-ON-ID                                        
                 )                                                      09150000
093200     END-EXEC.                                                    09200000
LRM003     IF SQLCODE = -803                                            09220000
LRM003     AND ACAT11IO-COPY-ACTIVE-PTR                                         
LRM003        PERFORM 0380-SUMMARIZE-PTR-DLVY-RTN                               
LRM003           THRU 0380-EXIT                                                 
LRM003        SET ACAT11IO-GOOD-RESP TO TRUE                            09240000
LRM003        IF RETRY-INSERT-MODE                                              
LRM003           GO TO 0220-ISRT-ACTIAST                                   09130
LRM003        END-IF                                                            
LRM003     ELSE                                                                 
LRM003     IF SQLCODE = -803                                            09220000
LRM003     AND ACAT11IO-IT-ISRT-ASSET                                           
LRM003        PERFORM 0385-READ-ACTIAST                                         
LRM003        IF SQLCODE = 0                                            09220000
LRM003           PERFORM 0222-RETURN-ACTIAST-VALUES                     09220000
LRM003           SET ACAT11IO-DUPE-ASSET-RETURN TO TRUE                 09240000
LRM003        ELSE                                                              
LRM003           SET ACAT11IO-DB2-ERROR TO TRUE                                 
LRM003           PERFORM 9000-WRITE-TO-CICS-LOG                                 
LRM003           PERFORM 9500-RETURN-DB2-ERROR                                  
LRM003     ELSE                                                                 
093400     EVALUATE SQLCODE                                             09220000
093500          WHEN +0                                                 09230000
093600               SET ACAT11IO-GOOD-RESP TO TRUE                     09240000
LRM002               IF ACAT11IO-STTLM-LCTN-CD = '35'                           
LRM002               AND MSDIO-RETURN-CODE = SPACE                              
LRM002                  PERFORM 0227-INSERT-ACTIOPN                             
LRM002               END-IF                                                     
LRM003               IF ACAT11IO-TRNFR-TYPE-CD = 'PTR'                          
LRM003                  PERFORM 0510-UPDATE-PTR-TIF                             
LRM003               END-IF                                                     
LRM029               IF ACAT11IO-DUPE-DLVY-ASSSET-IND NOT > ' '                 
LRM029                  IF ACAT11IO-STTLM-LCTN-CD = '40'                        
LRM029                     PERFORM 0330-CHECK-DUPE-DLVY-CSH-RTN                 
LRM029                        THRU 0330-EXIT                                    
LRM029                  ELSE                                                    
LRM029                     IF ACAT11IO-STTLM-LCTN-CD NOT = '40'                 
LRM029                        PERFORM 0320-CHECK-DUPE-DLVY-RTN                  
LRM029                           THRU 0320-EXIT                                 
LRM029                     END-IF                                               
LRM029                  END-IF                                                  
LRM029               END-IF                                                     
094000          WHEN OTHER                                              09280000
                     SET ACAT11IO-DB2-ERROR TO TRUE                             
                     PERFORM 9000-WRITE-TO-CICS-LOG                             
                     PERFORM 9500-RETURN-DB2-ERROR                              
094200     END-EVALUATE.                                                09300000
LRM022 0220-EXIT. EXIT.                                                         
                                                                                
LRM003 0222-RETURN-ACTIAST-VALUES.                                      09220000
           MOVE    ASSET-PRC-CTGY-CD  OF DCLACTIAST TO                          
                    ACAT11IO-ASSET-PRC-CTGY-CD                                  
           MOVE    WHI-CD             OF DCLACTIAST TO                          
                    ACAT11IO-WHI-CD                                             
LRM048     MOVE    WHI-STTS-CD        OF DCLACTIAST TO                          
LRM048              ACAT11IO-WHI-STTS-CD                                        
           MOVE    PSTN-CD            OF DCLACTIAST TO                          
                    ACAT11IO-PSTN-CD                                            
           MOVE    ASSET-DESC-TXT     OF DCLACTIAST TO                          
                    ACAT11IO-DESC-TXT                                           
           MOVE    ASSET-AMT          OF DCLACTIAST TO                          
                    ACAT11IO-ASSET-AMT                                          
           MOVE    ASSET-QTY          OF DCLACTIAST TO                          
                    ACAT11IO-ASSET-QTY                                          
           MOVE    ASSET-CMNT-TXT     OF DCLACTIAST TO                          
                    ACAT11IO-ASSET-CMNT-TXT                                     
           MOVE    UPDT-TMSTP         OF DCLACTIAST TO                          
                    ACAT11IO-UPDT-TMSTP.                                        
LRM002 0225-GETMSD-OPTIONS-RTN.                                                 
LRM026     EXEC CICS ASSIGN APPLID                                              
LRM026             (WS-REGION-NAME)                                             
LRM026     END-EXEC.                                                            
                                                                                
LRM002* LINK TO MSDIO TO OBTAIN NEEDED FIELDS                                   
           MOVE 'E'                  TO MSDIO-ACCESS.                           
           MOVE ' '                  TO MSDIO-ACTION.                           
           MOVE ACAT11IO-ADP-NBR     TO MSDIO-SEARCH-KEY.                       
           IF  ACAT11IO-WHI-CD = 'W'                                            
               MOVE '1'              TO MSDIO-WHEN-ISSUE                        
           ELSE                                                                 
               MOVE ZERO             TO MSDIO-WHEN-ISSUE                        
           END-IF.                                                              
           MOVE SPACE                TO MSDIO-RETURN-CODE.                      
                                                                                
           EXEC CICS LINK PROGRAM ('MSDIO')                                     
                          COMMAREA (MSDIO-CALLING-AREA)                         
                          LENGTH (LENGTH OF MSDIO-CALLING-AREA)                 
           END-EXEC.                                                            
           IF MSDIO-RETURN-CODE = SPACE                                         
              MOVE MS-FORMAT-IND            TO WK-MS-CLASS-1                    
              MOVE MS-SECURITY-TYPE         TO WK-MS-SEC-TYPE-X                 
              MOVE WK-MS-SEC-TYPE-P         TO WK-MS-SEC-TYPE-N                 
              MOVE WK-MS-SEC-TYPE           TO WK-MS-CLASS-2-5                  
              MOVE MS-SECURITY-TYPE-2       TO WK-MS-CLASS-6-7                  
              MOVE MS-SYMBOL-AREA       TO WK-MS-SYMBOL-9                       
              EVALUATE TRUE                                                     
                  WHEN WK-MS-CLASS-5 = 5                                        
                      MOVE '3'              TO WK-MS-ASSET-TYPE                 
                  WHEN (WK-MS-CLASS-6 = 0 OR 4)                                 
                      MOVE '1'              TO WK-MS-ASSET-TYPE                 
                  WHEN OTHER                                                    
                      MOVE '2'              TO WK-MS-ASSET-TYPE                 
              END-EVALUATE                                                      
           END-IF.                                                              
                                                                                
       0227-BUILD-ACTIOPN.                                                      
           MOVE ' ' TO DCLACTIOPN.                                              
           MOVE ACAT11IO-CLIENT-NBR    TO CLIENT-NBR OF DCLACTIOPN              
           MOVE ACAT11IO-DLVR-NBR      TO DLVR-NBR   OF DCLACTIOPN              
           MOVE ACAT11IO-RCV-NBR       TO RCV-NBR    OF DCLACTIOPN              
           MOVE ACAT11IO-DLVR-ACCT     TO ACCT-DLVR-NBR OF DCLACTIOPN           
           MOVE ACAT11IO-RCV-ACCT      TO ACCT-RCV-NBR OF DCLACTIOPN            
           MOVE ACAT11IO-ISIN-CNTRY-CD TO ISIN-CNTRY-CD OF DCLACTIOPN           
           MOVE ACAT11IO-ISIN-SEC-ISSUE-CD                                      
                                   TO ISIN-SEC-ISSUE-CD OF DCLACTIOPN           
           MOVE ACAT11IO-ISIN-SEC-CDG-CD                                        
                                     TO ISIN-SEC-CDG-CD OF DCLACTIOPN           
           MOVE ACAT11IO-STTLM-LCTN-CD                                          
                                   TO STTLM-LCTN-CD OF DCLACTIOPN               
           MOVE ACAT11IO-CSH-MGN-SHRT-CD                                        
                                 TO CSH-MGN-SHRT-CD OF DCLACTIOPN               
           MOVE ACAT11IO-ADP-NBR                                                
                                TO SECURITY-ADP-NBR OF DCLACTIOPN               
LRM007     MOVE ACAT11IO-CONTROL-NBR                                            
LRM007                          TO ACAT-CONTROL-NBR OF DCLACTIOPN               
LRM007     MOVE ZEROS           TO ASSET-SEQ-NBR    OF DCLACTIOPN               
LRM007     MOVE ACAT11IO-TRNFR-TYPE-CD                                          
LRM007                          TO TRNFR-TYPE-CD    OF DCLACTIOPN               
           MOVE EIBTRMID        TO CICS-TERM-ID-CD  OF DCLACTIOPN               
           MOVE MS-DESC1                 TO WK-MS-DESC1                         
           MOVE MS-DESC2                 TO WK-MS-DESC2                         
           IF  MS-DESC2 > ' '                                                   
               MOVE MS-DESC2             TO WK-MS-DESC2                         
           END-IF                                                               
           IF  MS-DESC3 > ' '                                                   
               MOVE MS-DESC3             TO WK-MS-DESC3                         
           END-IF                                                               
           INITIALIZE                W-OPT-DESC                                 
           MOVE MS-OPTION-EXP-DATE       TO WK-MS-EXP-DATE                      
LRM027**** IF (WS-REGION-NAME = 'TCICSRJE' OR 'TCICSQUA')                       
LRM026        MOVE WK-MS-EXP-MM-NEW          TO W-OPT-EXPTN-MM-NEW              
LRM026        MOVE '/'                       TO W-OPT-EXPTN-S1-NEW              
LRM026                                          W-OPT-EXPTN-S2-NEW              
LRM026        MOVE WK-MS-EXP-DD-NEW          TO W-OPT-EXPTN-DD-NEW              
LRM026        MOVE WK-MS-EXP-YY-NEW          TO W-OPT-EXPTN-YY-NEW              
LRM026        IF MS-EXP-OPT-STRIKE-PRC NOT = ZEROS                              
LRM026           MOVE MS-EXP-OPT-STRIKE-PRC TO WK-MS-OPT-PRICE-NEW              
LRM026        ELSE                                                              
LRM026           MOVE MS-EXP-OPTION-STRIKE-PRICE TO WK-MS-OPT-PRICE-NEW         
LRM026        END-IF                                                            
LRM026        MOVE WK-MS-OPT-PRC-NEW         TO W-OPT-STRIKE-PRIC-NEW           
LRM026        IF WK-MS-OPT-FRAC-NEW = ZEROS                                     
LRM026           MOVE SPACES                 TO W-OPT-STRIKE-FRAC-NEW           
LRM026        ELSE                                                              
LRM026           MOVE WK-MS-OPT-FRAC-NEW     TO W-OPT-STRIKE-FRAC-NEW           
LRM026        END-IF.                                                           
LRM026**** ELSE                                                                 
      ****    MOVE WK-MS-EXP-MM             TO WK-MS-OPT-MM                     
      ****    MOVE WK-MS-EXP-Y              TO WK-MS-OPT-Y                      
      ****    MOVE MS-EXP-OPTION-STRIKE-PRICE TO WK-MS-OPT-PRICE                
      ****    MOVE MS-OPTION-FACTOR           TO WK-MS-OPTION-FACTOR            
      ****                                                                      
      ****    IF  WK-MS-OPT-FRAC = ZERO                                         
      ****       MOVE ZERO                 TO WK-MS-OPT-FRAC-1                  
      ****                                  WK-MS-OPT-DECI-ROUNDED              
      ****    ELSE                                                              
      ****       IF MSD-FRACTION-DECIMAL-IND = 'D'                              
      ****        COMPUTE WK-MS-OPT-DECI-ROUNDED = WK-MS-OPT-FRAC / 1000        
      ****        END-COMPUTE                                                   
      ****       ELSE                                                           
      ****        COMPUTE WK-MS-OPT-FRAC-6 = WK-MS-OPT-FRAC * 8                 
      ****        END-COMPUTE                                                   
      **** END-IF.                                                              
           MOVE WK-MS-EXP-DATE(1:4) TO W-DATE-YEAR                              
           MOVE WK-MS-EXP-DATE(5:2) TO W-DATE-MM                                
           MOVE WK-MS-EXP-DATE(7:2) TO W-DATE-DD                                
           IF W-DATE-MM < '01' OR > '12'                                        
              MOVE '12' TO W-DATE-MM                                            
           END-IF.                                                              
           IF W-DATE-DD < '01' OR > '31'                                        
              MOVE '31' TO W-DATE-DD                                            
           END-IF.                                                              
           IF W-DATE-YEAR NOT NUMERIC                                           
           OR W-DATE-YEAR = '0000'                                              
              MOVE '9999' TO W-DATE-YEAR                                        
           END-IF.                                                              
           MOVE W-DATE              TO EXPTN-DT          OF DCLACTIOPN          
                                                                                
      ****REVERSE THE BUY/SELL SIGN FOR OCC                                     
           IF ACAT11IO-PSTN-CD = 'S'                                            
               MOVE 'B'             TO BS-CD             OF DCLACTIOPN          
           ELSE                                                                 
               MOVE 'S'             TO BS-CD             OF DCLACTIOPN          
           END-IF                                                               
           MOVE WK-MS-PUT-CALL      TO PTCL-CD           OF DCLACTIOPN          
      ****OPEN/CLOSE IS ALWAYS CLOSE                                            
           MOVE 'C'                 TO OPTN-OPN-CLSD-CD  OF DCLACTIOPN          
                                                                                
LRM027**** IF (WS-REGION-NAME = 'TCICSRJE' OR 'TCICSQUA')                       
LRM026       MOVE WK-MS-OPT-PRC-NEW  TO STPRC-INTEGER-AMT OF DCLACTIOPN         
LRM026       MOVE WK-MS-OPT-FRAC-NEW TO STPRC-FRCTN-AMT   OF DCLACTIOPN.        
LRM026**** ELSE                                                                 
      ****    MOVE WK-MS-OPT-PRC    TO STPRC-INTEGER-AMT OF DCLACTIOPN          
      ****    IF MSD-FRACTION-DECIMAL-IND = 'D'                                 
      ****       MOVE WK-MS-OPT-DECI-ROUNDED                                    
      ****                          TO STPRC-FRCTN-AMT   OF DCLACTIOPN          
      ****    ELSE                                                              
      ****      MOVE WK-MS-OPT-FRAC-1 TO STPRC-FRCTN-AMT OF DCLACTIOPN          
      ****    END-IF                                                            
LRM026**** END-IF.                                                              
           MOVE ' '                 TO DLVR-OCC-NBR      OF DCLACTIOPN          
           MOVE 'C'                 TO OPTN-ACCT-TYPE-CD OF DCLACTIOPN          
           MOVE ' '                 TO ACCT-SUB-CD       OF DCLACTIOPN          
           MOVE WK-MS-DESC1         TO OPTN-CMNT-TXT     OF DCLACTIOPN          
                                                                                
           MOVE 'ACAT11DB'          TO PRGM-NM           OF DCLACTIOPN          
           MOVE WS-TIMESTAMP        TO CRT-TMSTP         OF DCLACTIOPN          
                                       UPDT-TMSTP        OF DCLACTIOPN          
           MOVE 'N'                 TO NSCC-ACK-IND      OF DCLACTIOPN          
           MOVE 'H'                 TO NSCC-PEND-CD      OF DCLACTIOPN          
                                                                                
           IF  OPTN-OPN-CLSD-CD OF DCLACTIOPN = 'O'                             
                  MOVE 'OPEN'         TO W-OPT-OPEN-CLOSE                       
           ELSE                                                                 
                  MOVE 'CLOS'         TO W-OPT-OPEN-CLOSE                       
           END-IF                                                               
           IF  PTCL-CD OF DCLACTIOPN = 'C'                                      
                  MOVE 'CALL'         TO W-OPT-CALL-PUT                         
           ELSE                                                                 
                  MOVE 'PUT '         TO W-OPT-CALL-PUT                         
           END-IF                                                               
                                                                                
LRM026*-------------------------------------------------------------*           
LRM026* USE ADP NBR OF UNDERLYING SEC TO GET THE UNDERLYING SYMBOL.             
LRM026*-------------------------------------------------------------*           
LRM027**** IF (WS-REGION-NAME = 'TCICSRJE' OR 'TCICSQUA')                       
LRM026        IF MSD-OCC-OPTN-SYM-ID > SPACES                                   
LRM026           MOVE MSD-OCC-OPTN-SYM-ID TO SYM-CD      OF DCLACTIOPN          
LRM026        ELSE                                                              
LRM026        MOVE 'E'                  TO MSDIO-ACCESS                         
LRM026        MOVE ' '                  TO MSDIO-ACTION                         
LRM026        MOVE MS-XREF-NO           TO MSDIO-SEARCH-KEY                     
LRM026        IF  ACAT11IO-WHI-CD = 'W'                                         
LRM026            MOVE '1'              TO MSDIO-WHEN-ISSUE                     
LRM026        ELSE                                                              
LRM026            MOVE ZERO             TO MSDIO-WHEN-ISSUE                     
LRM026        END-IF                                                            
LRM026        MOVE SPACE                TO MSDIO-RETURN-CODE                    
LRM026                                                                          
LRM026        EXEC CICS LINK PROGRAM ('MSDIO')                                  
LRM026                       COMMAREA (MSDIO-CALLING-AREA)                      
LRM026                       LENGTH (LENGTH OF MSDIO-CALLING-AREA)              
LRM026        END-EXEC                                                          
LRM026        IF MSDIO-RETURN-CODE = SPACE                                      
LRM026           MOVE MS-SYMBOL-AREA    TO SYM-CD      OF DCLACTIOPN            
LRM026        END-IF.                                                           
LRM026**** ELSE                                                                 
      ****    MOVE MS-SYMBOL                      TO W-OPT-MS-SYMBOL            
      ****    PERFORM 0228-GETMSD-OPTION-SYMBOL                                 
      ****    MOVE WK-MS-SYMBOL                   TO W-OPT-SYMBOL               
      ****    MOVE WK-MS-SYMBOL        TO SYM-CD       OF DCLACTIOPN            
LRM026**** END-IF.                                                              
           IF (ACAT11IO-DESC-TXT (1:60) = ' ')                                  
                 MOVE W-OPT-DESC TO ACAT11IO-DESC-TXT (1:60)                    
           ELSE                                                                 
            IF (ACAT11IO-DESC-TXT (31:60) = ' ')                                
                 MOVE W-OPT-DESC TO ACAT11IO-DESC-TXT (31:60)                   
            ELSE                                                                
             IF (ACAT11IO-DESC-TXT (61:60) = ' ')                               
                 MOVE W-OPT-DESC TO ACAT11IO-DESC-TXT (61:60)                   
             ELSE                                                               
              IF (ACAT11IO-DESC-TXT (91:30) = ' ')                              
                 MOVE W-OPT-DESC TO ACAT11IO-DESC-TXT (91:30)                   
              END-IF                                                            
             END-IF                                                             
            END-IF                                                              
           END-IF.                                                              
                                                                                
                                                                                
       0227-INSERT-ACTIOPN.                                                     
           EXEC SQL                                                             
               INSERT INTO ACTIOPN                                              
                 (                                                              
                   CLIENT_NBR                                                   
                  ,RCV_NBR                                                      
                  ,DLVR_NBR                                                     
                  ,ISIN_CNTRY_CD                                                
                  ,ISIN_SEC_ISSUE_CD                                            
                  ,ISIN_SEC_CDG_CD                                              
                  ,STTLM_LCTN_CD                                                
                  ,CSH_MGN_SHRT_CD                                              
                  ,BS_STTS_CD                                                   
                  ,PTCL_STTS_CD                                                 
                  ,OPT_OPN_CLS_TST_CD                                           
                  ,SYM_STTS_CD                                                  
                  ,OPTN_EXPTN_DT_CD                                             
                  ,STPRC_INTR_STTS_CD                                           
                  ,STPRC_FRCT_STTS_CD                                           
                  ,OPT_OCC_DLV_STS_CD                                           
                  ,OPT_ACT_TYP_STS_CD                                           
                  ,ACCT_SUB_STTS_CD                                             
                  ,OPTN_CMNT_CD                                                 
                  ,BS_CD                                                        
                  ,PTCL_CD                                                      
                  ,OPTN_OPN_CLSD_CD                                             
                  ,SYM_CD                                                       
                  ,EXPTN_DT                                                     
                  ,STPRC_INTEGER_AMT                                            
                  ,STPRC_FRCTN_AMT                                              
                  ,DLVR_OCC_NBR                                                 
                  ,OPTN_ACCT_TYPE_CD                                            
                  ,ACCT_SUB_CD                                                  
                  ,OPTN_CMNT_TXT                                                
                  ,PRGM_NM                                                      
                  ,CICS_TERM_ID_CD                                              
                  ,CRT_TMSTP                                                    
                  ,UPDT_TMSTP                                                   
                  ,ACCT_DLVR_NBR                                                
                  ,ACCT_RCV_NBR                                                 
                  ,SECURITY_ADP_NBR                                             
                  ,NSCC_ACK_IND                                                 
                  ,NSCC_PEND_CD                                                 
LRM007            ,ACAT_CONTROL_NBR                                             
LRM007            ,ASSET_SEQ_NBR                                                
LRM007            ,TRNFR_TYPE_CD                                                
                 )                                                              
                 VALUES                                                         
                 (                                                              
                   :DCLACTIOPN.CLIENT-NBR                                       
                  ,:DCLACTIOPN.RCV-NBR                                          
                  ,:DCLACTIOPN.DLVR-NBR                                         
                  ,:DCLACTIOPN.ISIN-CNTRY-CD                                    
                  ,:DCLACTIOPN.ISIN-SEC-ISSUE-CD                                
                  ,:DCLACTIOPN.ISIN-SEC-CDG-CD                                  
                  ,:DCLACTIOPN.STTLM-LCTN-CD                                    
                  ,:DCLACTIOPN.CSH-MGN-SHRT-CD                                  
                  ,:DCLACTIOPN.BS-STTS-CD                                       
                  ,:DCLACTIOPN.PTCL-STTS-CD                                     
                  ,:DCLACTIOPN.OPT-OPN-CLS-TST-CD                               
                  ,:DCLACTIOPN.SYM-STTS-CD                                      
                  ,:DCLACTIOPN.OPTN-EXPTN-DT-CD                                 
                  ,:DCLACTIOPN.STPRC-INTR-STTS-CD                               
                  ,:DCLACTIOPN.STPRC-FRCT-STTS-CD                               
                  ,:DCLACTIOPN.OPT-OCC-DLV-STS-CD                               
                  ,:DCLACTIOPN.OPT-ACT-TYP-STS-CD                               
                  ,:DCLACTIOPN.ACCT-SUB-STTS-CD                                 
                  ,:DCLACTIOPN.OPTN-CMNT-CD                                     
                  ,:DCLACTIOPN.BS-CD                                            
                  ,:DCLACTIOPN.PTCL-CD                                          
                  ,:DCLACTIOPN.OPTN-OPN-CLSD-CD                                 
                  ,:DCLACTIOPN.SYM-CD                                           
                  ,:DCLACTIOPN.EXPTN-DT                                         
                  ,:DCLACTIOPN.STPRC-INTEGER-AMT                                
                  ,:DCLACTIOPN.STPRC-FRCTN-AMT                                  
                  ,:DCLACTIOPN.DLVR-OCC-NBR                                     
                  ,:DCLACTIOPN.OPTN-ACCT-TYPE-CD                                
                  ,:DCLACTIOPN.ACCT-SUB-CD                                      
                  ,:DCLACTIOPN.OPTN-CMNT-TXT                                    
                  ,:DCLACTIOPN.PRGM-NM                                          
                  ,:DCLACTIOPN.CICS-TERM-ID-CD                                  
                  ,:DCLACTIOPN.CRT-TMSTP                                        
                  ,:DCLACTIOPN.UPDT-TMSTP                                       
                  ,:DCLACTIOPN.ACCT-DLVR-NBR                                    
                  ,:DCLACTIOPN.ACCT-RCV-NBR                                     
                  ,:DCLACTIOPN.SECURITY-ADP-NBR                                 
                  ,:DCLACTIOPN.NSCC-ACK-IND                                     
                  ,:DCLACTIOPN.NSCC-PEND-CD                                     
LRM007            ,:DCLACTIOPN.ACAT-CONTROL-NBR                                 
LRM007            ,:DCLACTIOPN.ASSET-SEQ-NBR                                    
LRM007            ,:DCLACTIOPN.TRNFR-TYPE-CD                                    
                 )                                                              
           END-EXEC.                                                            
LRM002 0228-GETMSD-OPTION-SYMBOL.                                               
           IF MSDIO-RETURN-CODE = SPACE                                         
           AND WK-MS-SYMBOL-9 > SPACES                                          
LRM012        PERFORM 0229-SCAN-FOR-OPT-SYM THRU 0229-EXIT                      
           END-IF.                                                              
LRM012 0229-SCAN-FOR-OPT-SYM.                                                   
LRM012                                                                          
LRM012     MOVE WK-MS-SYMBOL-9           TO OPT-WORK1                           
LRM012     MOVE    12                    TO SUB2                                
LRM012     PERFORM UNTIL NOT (OPT-WORK3 (SUB2) = SPACES)                        
LRM012         SUBTRACT 1              FROM SUB2                                
LRM012     END-PERFORM                                                          
LRM012                                                                          
LRM012     IF  OPT-WORK3 (SUB2) IS NUMERIC                                      
LRM012         SUBTRACT 1 FROM SUB2                                             
LRM012         PERFORM UNTIL NOT (OPT-WORK3 (SUB2) IS NUMERIC)                  
LRM012                 SUBTRACT 1 FROM SUB2                                     
LRM012         END-PERFORM                                                      
LRM012         SUBTRACT 1 FROM SUB2                                             
LRM012     ELSE                                                                 
LRM012         SUBTRACT 2              FROM SUB2                                
LRM012     END-IF                                                               
LRM012                                                                          
LRM012     MOVE SPACES                   TO OPTION-SYMBOL1 (1)                  
LRM012                                      OPTION-SYMBOL1 (2)                  
LRM012                                      OPTION-SYMBOL1 (3)                  
LRM012                                                                          
LRM012     MOVE 3                        TO SUB3                                
LRM012     PERFORM UNTIL SUB2 = 1                                               
LRM012         MOVE  OPT-WORK3 (SUB2)    TO OPTION-SYMBOL1 (SUB3)               
LRM012         SUBTRACT 1              FROM SUB2                                
LRM012                                      SUB3                                
LRM012         END-SUBTRACT                                                     
LRM012     END-PERFORM                                                          
LRM012                                                                          
LRM012     MOVE 1                        TO SUB2                                
LRM012                                      SUB3                                
LRM012     MOVE SPACES                   TO OPT-SYMBOL                          
LRM012     PERFORM UNTIL SUB3 > 3                                               
LRM012         IF  OPTION-SYMBOL1 (SUB3) = SPACES                               
LRM012             ADD  1                TO SUB3                                
LRM012         ELSE                                                             
LRM012             MOVE  OPTION-SYMBOL1 (SUB3) TO                               
LRM012                   OPTION-SYMBOL  (SUB2)                                  
LRM012             ADD  1                TO SUB3                                
LRM012                                      SUB2                                
LRM012             END-ADD                                                      
LRM012         END-IF                                                           
LRM012     END-PERFORM                                                          
LRM012                                                                          
LRM012     MOVE OPT-SYMBOL               TO WK-MS-SYMBOL-9.                     
LRM012                                                                          
LRM012 0229-EXIT. EXIT.                                                         
                                                                                
       0230-INSERT-ASSET-AMOUNTS.                                               
                                                                                
           INITIALIZE DCLACTIAST.                                               
           MOVE WS-TIMESTAMP TO  UPDT-TMSTP OF DCLACTIAST                       
                                  CRT-TMSTP OF DCLACTIAST.                      
           MOVE ZEROS TO ASSET-SEQ-NBR OF DCLACTIAST                            
                         PHSCL-SEQ-NBR OF DCLACTIAST                            
                          LGCL-SEQ-NBR OF DCLACTIAST.                           
           MOVE 'A' TO TRANS-TYPE-CD OF DCLACTIAST.                             
           MOVE 'N' TO BEARER-BOND-CD OF DCLACTIAST.                            
           MOVE '00' TO OPTN-CTGY-CD OF DCLACTIAST.                             
           MOVE ACAT11IO-DLVR-ACCT TO TRANS-RFRN-ID-CD OF DCLACTIAST.           
           MOVE EIBTRMID TO CICS-TERM-ID-CD OF DCLACTIAST.                      
LRM007     MOVE ACAT11IO-CONTROL-NBR TO ACAT-CONTROL-NBR OF DCLACTIAST.         
LRM007     MOVE ACAT11IO-DLVR-ACCT TO TRANS-RFRN-ID-CD OF DCLACTIAST            
LRM007                                WS-TRANS-RFRN-ID-CD                       
LRM007     IF ACAT11IO-CONTROL-NBR (1 : 2) = 'XX'                               
LRM007        PERFORM 0202-FORMAT-TRANS-RFRN-RTN                                
LRM007        MOVE WS-TRANS-RFRN-ID-CD                                          
LRM007                  TO TRANS-RFRN-ID-CD OF DCLACTIAST                       
LRM007     END-IF.                                                              
CSG001                                                                          
CSG001* IN SOME CASES MSD DESCRIPTIONS CONTAIN SPECIAL CHARACTERS.              
CSG001* CORRECT THEM BY REPLACING SPECIAL CHARACTERS WITH SPACES.               
CSG001     MOVE ASSET-DESC-TXT OF DCLACTIAST TO WS-ASSET-DESC-TXT               
CSG001     PERFORM 0231-EDIT-ASSET-DESC-TXT                                     
CSG001     MOVE WS-ASSET-DESC-TXT  TO ASSET-DESC-TXT OF DCLACTIAST              
                                                                                
      *** INSERT CASH                                                           
           IF ACAT11IO-AMT-01-CREDIT                                            
              MOVE 'CRED' TO STTLM-RSN-CD OF DCLACTIAST                         
              MOVE 'L'    TO PSTN-CD      OF DCLACTIAST                         
           ELSE                                                                 
              MOVE 'DEB ' TO STTLM-RSN-CD OF DCLACTIAST                         
              MOVE 'S'    TO PSTN-CD      OF DCLACTIAST                         
           END-IF.                                                              
           IF ACAT11IO-AMT-01 NOT = ZEROS                                       
              EXEC SQL                                                  09140000
               INSERT INTO ACTIAST                                      09170000
                 (                                                      09150000
                   CLIENT_NBR                                           09180000
                  ,DLVR_NBR                                             09150000
                  ,ACCT_DLVR_NBR                                        09180000
                  ,RCV_NBR                                              09180000
                  ,ACCT_RCV_NBR                                         09180000
                  ,ISIN_CNTRY_CD                                                
                  ,ISIN_SEC_ISSUE_CD                                            
                  ,ISIN_SEC_CDG_CD                                              
                  ,STTLM_LCTN_CD                                                
                  ,CSH_MGN_SHRT_CD                                              
                  ,CSH_MRG_SHT_STS_CD                                           
                  ,STTLM_LCTN_STTS_CD                                           
                  ,ISIN_CNTRY_STTS_CD                                           
                  ,SBMTG_PRTCP_NBR                                              
                  ,SBMT_PRT_NR_STS_CD                                           
                  ,ACAT_CONTROL_NBR                                             
                  ,CONTROL_NBR_STS_CD                                           
                  ,ASSET_SEQ_NBR                                                
                  ,AST_SEQ_NBR_STS_CD                                           
                  ,TRANS_TYPE_CD                                                
                  ,TRANS_TYPE_STTS_CD                                           
                  ,PHSCL_SEQ_NBR                                                
                  ,PHSCL_SEQ_STTS_CD                                            
                  ,LGCL_SEQ_NBR                                                 
                  ,LGCL_SEQ_NR_STS_CD                                           
                  ,ASSET_PRC_CTGY_CD                                            
                  ,AST_PRC_CTG_STS_CD                                           
                  ,STTLM_RSN_CD                                                 
                  ,STTLM_RSN_STTS_CD                                            
                  ,ASSET_DESC_TXT                                               
                  ,ASSET_DESC_STTS_CD                                           
                  ,ASSET_RQST_QTY_CD                                            
                  ,ASSET_RQST_STS_CD                                            
                  ,AST_RQST_TRANS_CD                                            
                  ,AST_RQ_TRAN_STS_CD                                           
                  ,ASSET_QTY                                                    
                  ,ASSET_QTY_STTS_CD                                            
                  ,ASSET_PCT                                                    
                  ,ASSET_PCT_STTS_CD                                            
                  ,PSTN_CD                                                      
                  ,PSTN_CD_STTS_CD                                              
                  ,ISO_CRNCY_CD                                                 
                  ,ISO_CRNCY_STTS_CD                                            
                  ,ASSET_AMT                                                    
                  ,ASSET_AMT_STTS_CD                                            
                  ,BEARER_BOND_CD                                               
                  ,BEARER_BND_STTS_CD                                           
                  ,WHI_CD                                                       
                  ,WHI_STTS_CD                                                  
                  ,TRNFR_TYPE_RSN_CD                                            
                  ,TRN_TYP_RSN_STS_CD                                           
                  ,MBS_SERIAL_NBR                                               
                  ,MBS_SERIAL_STTS_CD                                           
                  ,ASSET_CMNT_TXT                                               
                  ,ASSET_CMNT_STTS_CD                                           
                  ,NSCC_WTHLD_CD                                                
                  ,TRANS_RFRN_ID_CD                                             
                  ,TRANS_RFRN_STTS_CD                                           
                  ,ISIN_SEC_IS_STS_CD                                           
                  ,ISIN_SEC_CD_STS_CD                                           
                  ,OPTN_CTGY_CD                                                 
                  ,OPTN_CTGY_STTS_CD                                            
                  ,RCRD_LNGTH_STTS_CD                                           
                  ,RCRD_STTS_CD                                                 
                  ,NSCC_PEND_CD                                                 
                  ,NSCC_ACK_IND                                                 
                  ,PRGM_NM                                                      
                  ,CICS_TERM_ID_CD                                              
                  ,UPDT_TMSTP                                                   
                  ,CRT_TMSTP                                                    
                  ,SECURITY_ADP_NBR                                             
                  ,TRNFR_TYPE_CD                                                
                  ,TRNFR_TYPE_STTS_CD                                           
                  ,RCV_NBR_STTS_CD                                              
                  ,DLVR_NBR_STTS_CD                                             
                  ,CICS_SGNON_ID                                                
                 )                                                      09150000
                 VALUES                                                         
                 (                                                      09150000
                    :ACAT11IO-CLIENT-NBR                                09190000
                   ,:ACAT11IO-DLVR-NBR                                  09190000
                   ,:ACAT11IO-DLVR-ACCT                                 09190000
                   ,:ACAT11IO-RCV-NBR                                   09190000
                   ,:ACAT11IO-RCV-ACCT                                  09190000
                   ,:DCLACTIAST.ISIN-CNTRY-CD                                   
                   ,:DCLACTIAST.ISIN-SEC-ISSUE-CD                               
                   ,:DCLACTIAST.ISIN-SEC-CDG-CD                                 
                   ,'40'                                                        
                   ,'C'                                                         
                   ,:DCLACTIAST.CSH-MRG-SHT-STS-CD                              
                   ,:DCLACTIAST.STTLM-LCTN-STTS-CD                              
                   ,:DCLACTIAST.ISIN-CNTRY-STTS-CD                              
                   ,:ACAT11IO-DLVR-NBR                                  09190000
                   ,:DCLACTIAST.SBMT-PRT-NR-STS-CD                              
LRM003             ,:ACAT11IO-CONTROL-NBR                                       
                   ,:DCLACTIAST.CONTROL-NBR-STS-CD                              
                   ,:DCLACTIAST.ASSET-SEQ-NBR                                   
                   ,:DCLACTIAST.AST-SEQ-NBR-STS-CD                              
                   ,:DCLACTIAST.TRANS-TYPE-CD                                   
                   ,:DCLACTIAST.TRANS-TYPE-STTS-CD                              
                   ,:DCLACTIAST.PHSCL-SEQ-NBR                                   
                   ,:DCLACTIAST.PHSCL-SEQ-STTS-CD                               
                   ,:DCLACTIAST.LGCL-SEQ-NBR                                    
                   ,:DCLACTIAST.LGCL-SEQ-NR-STS-CD                              
                   ,:DCLACTIAST.ASSET-PRC-CTGY-CD                               
                   ,:DCLACTIAST.AST-PRC-CTG-STS-CD                              
                   ,:DCLACTIAST.STTLM-RSN-CD                                    
                   ,:DCLACTIAST.STTLM-RSN-STTS-CD                               
                   ,:DCLACTIAST.ASSET-DESC-TXT                                  
                   ,:DCLACTIAST.ASSET-DESC-STTS-CD                              
                   ,' '                                                         
                   ,:DCLACTIAST.ASSET-RQST-STS-CD                               
                   ,'3'                                                         
                   ,:DCLACTIAST.AST-RQ-TRAN-STS-CD                              
                   ,:DCLACTIAST.ASSET-QTY                                       
                   ,:DCLACTIAST.ASSET-QTY-STTS-CD                               
                   ,:DCLACTIAST.ASSET-PCT                                       
                   ,:DCLACTIAST.ASSET-PCT-STTS-CD                               
                   ,:DCLACTIAST.PSTN-CD                                         
                   ,:DCLACTIAST.PSTN-CD-STTS-CD                                 
                   ,:DCLACTIAST.ISO-CRNCY-CD                                    
                   ,:DCLACTIAST.ISO-CRNCY-STTS-CD                               
                   ,:ACAT11IO-AMT-01                                            
                   ,:DCLACTIAST.ASSET-AMT-STTS-CD                               
                   ,:DCLACTIAST.BEARER-BOND-CD                                  
                   ,:DCLACTIAST.BEARER-BND-STTS-CD                              
                   ,' '                                                         
                   ,:DCLACTIAST.WHI-STTS-CD                                     
                   ,:DCLACTIAST.TRNFR-TYPE-RSN-CD                               
                   ,:DCLACTIAST.TRN-TYP-RSN-STS-CD                              
                   ,:DCLACTIAST.MBS-SERIAL-NBR                                  
                   ,:DCLACTIAST.MBS-SERIAL-STTS-CD                              
                   ,:ACAT11IO-ASSET-CMNT1-TXT                                   
                   ,:DCLACTIAST.ASSET-CMNT-STTS-CD                              
                   ,:DCLACTIAST.NSCC-WTHLD-CD                                   
                   ,:DCLACTIAST.TRANS-RFRN-ID-CD                                
                   ,:DCLACTIAST.TRANS-RFRN-STTS-CD                              
                   ,:DCLACTIAST.ISIN-SEC-IS-STS-CD                              
                   ,:DCLACTIAST.ISIN-SEC-CD-STS-CD                              
                   ,:DCLACTIAST.OPTN-CTGY-CD                                    
                   ,:DCLACTIAST.OPTN-CTGY-STTS-CD                               
                   ,:DCLACTIAST.RCRD-LNGTH-STTS-CD                              
                   ,:DCLACTIAST.RCRD-STTS-CD                                    
                   ,:ACAT11IO-NSCC-PEND-CD                                      
                   ,:DCLACTIAST.NSCC-ACK-IND                                    
                   ,'ACAT11DB'                                                  
                   ,:DCLACTIAST.CICS-TERM-ID-CD                                 
                   ,:DCLACTIAST.UPDT-TMSTP                                      
                   ,:DCLACTIAST.CRT-TMSTP                                       
LRM003             ,:DCLACTIAST.SECURITY-ADP-NBR                                
LRM003             ,:ACAT11IO-TRNFR-TYPE-CD                                     
                   ,:DCLACTIAST.TRNFR-TYPE-STTS-CD                              
                   ,:DCLACTIAST.RCV-NBR-STTS-CD                                 
                   ,:DCLACTIAST.DLVR-NBR-STTS-CD                                
                   ,:ACAT11IO-SIGN-ON-ID                                        
                 )                                                      09150000
              END-EXEC                                                  09200000
093400        EVALUATE SQLCODE                                          09220000
093500          WHEN +0                                                 09230000
LRM003               IF ACAT11IO-TRNFR-TYPE-CD = 'PTR'                          
LRM003                  PERFORM 0510-UPDATE-PTR-TIF                             
LRM003               END-IF                                                     
LRM029               IF ACAT11IO-DUPE-DLVY-ASSSET-IND NOT > ' '                 
LRM029                  MOVE 'C' TO WS-SEL-CSH-MGN-CD                           
LRM029                  PERFORM 0330-CHECK-DUPE-DLVY-CSH-RTN                    
LRM029                     THRU 0330-EXIT                                       
LRM029               END-IF                                                     
094000          WHEN OTHER                                              09280000
                     SET ACAT11IO-DB2-ERROR TO TRUE                             
                     PERFORM 9000-WRITE-TO-CICS-LOG                             
                     PERFORM 9500-RETURN-DB2-ERROR                              
094200        END-EVALUATE                                              09300000
           END-IF.                                                              
                                                                                
      *** INSERT MARGIN                                                         
           IF ACAT11IO-AMT-02-CREDIT                                            
              MOVE 'CRED' TO STTLM-RSN-CD OF DCLACTIAST                         
              MOVE 'L'    TO PSTN-CD      OF DCLACTIAST                         
           ELSE                                                                 
              MOVE 'DEB ' TO STTLM-RSN-CD OF DCLACTIAST                         
              MOVE 'S'    TO PSTN-CD      OF DCLACTIAST                         
           END-IF.                                                              
           IF ACAT11IO-AMT-02 NOT = ZEROS                                       
              EXEC SQL                                                  09140000
               INSERT INTO ACTIAST                                      09170000
                 (                                                      09150000
                   CLIENT_NBR                                           09180000
                  ,DLVR_NBR                                             09150000
                  ,ACCT_DLVR_NBR                                        09180000
                  ,RCV_NBR                                              09180000
                  ,ACCT_RCV_NBR                                         09180000
                  ,ISIN_CNTRY_CD                                                
                  ,ISIN_SEC_ISSUE_CD                                            
                  ,ISIN_SEC_CDG_CD                                              
                  ,STTLM_LCTN_CD                                                
                  ,CSH_MGN_SHRT_CD                                              
                  ,CSH_MRG_SHT_STS_CD                                           
                  ,STTLM_LCTN_STTS_CD                                           
                  ,ISIN_CNTRY_STTS_CD                                           
                  ,SBMTG_PRTCP_NBR                                              
                  ,SBMT_PRT_NR_STS_CD                                           
                  ,ACAT_CONTROL_NBR                                             
                  ,CONTROL_NBR_STS_CD                                           
                  ,ASSET_SEQ_NBR                                                
                  ,AST_SEQ_NBR_STS_CD                                           
                  ,TRANS_TYPE_CD                                                
                  ,TRANS_TYPE_STTS_CD                                           
                  ,PHSCL_SEQ_NBR                                                
                  ,PHSCL_SEQ_STTS_CD                                            
                  ,LGCL_SEQ_NBR                                                 
                  ,LGCL_SEQ_NR_STS_CD                                           
                  ,ASSET_PRC_CTGY_CD                                            
                  ,AST_PRC_CTG_STS_CD                                           
                  ,STTLM_RSN_CD                                                 
                  ,STTLM_RSN_STTS_CD                                            
                  ,ASSET_DESC_TXT                                               
                  ,ASSET_DESC_STTS_CD                                           
                  ,ASSET_RQST_QTY_CD                                            
                  ,ASSET_RQST_STS_CD                                            
                  ,AST_RQST_TRANS_CD                                            
                  ,AST_RQ_TRAN_STS_CD                                           
                  ,ASSET_QTY                                                    
                  ,ASSET_QTY_STTS_CD                                            
                  ,ASSET_PCT                                                    
                  ,ASSET_PCT_STTS_CD                                            
                  ,PSTN_CD                                                      
                  ,PSTN_CD_STTS_CD                                              
                  ,ISO_CRNCY_CD                                                 
                  ,ISO_CRNCY_STTS_CD                                            
                  ,ASSET_AMT                                                    
                  ,ASSET_AMT_STTS_CD                                            
                  ,BEARER_BOND_CD                                               
                  ,BEARER_BND_STTS_CD                                           
                  ,WHI_CD                                                       
                  ,WHI_STTS_CD                                                  
                  ,TRNFR_TYPE_RSN_CD                                            
                  ,TRN_TYP_RSN_STS_CD                                           
                  ,MBS_SERIAL_NBR                                               
                  ,MBS_SERIAL_STTS_CD                                           
                  ,ASSET_CMNT_TXT                                               
                  ,ASSET_CMNT_STTS_CD                                           
                  ,NSCC_WTHLD_CD                                                
                  ,TRANS_RFRN_ID_CD                                             
                  ,TRANS_RFRN_STTS_CD                                           
                  ,ISIN_SEC_IS_STS_CD                                           
                  ,ISIN_SEC_CD_STS_CD                                           
                  ,OPTN_CTGY_CD                                                 
                  ,OPTN_CTGY_STTS_CD                                            
                  ,RCRD_LNGTH_STTS_CD                                           
                  ,RCRD_STTS_CD                                                 
                  ,NSCC_PEND_CD                                                 
                  ,NSCC_ACK_IND                                                 
                  ,PRGM_NM                                                      
                  ,CICS_TERM_ID_CD                                              
                  ,UPDT_TMSTP                                                   
                  ,CRT_TMSTP                                                    
                  ,SECURITY_ADP_NBR                                             
                  ,TRNFR_TYPE_CD                                                
                  ,TRNFR_TYPE_STTS_CD                                           
                  ,RCV_NBR_STTS_CD                                              
                  ,DLVR_NBR_STTS_CD                                             
                  ,CICS_SGNON_ID                                                
                 )                                                      09150000
                 VALUES                                                         
                 (                                                      09150000
                    :ACAT11IO-CLIENT-NBR                                09190000
                   ,:ACAT11IO-DLVR-NBR                                  09190000
                   ,:ACAT11IO-DLVR-ACCT                                 09190000
                   ,:ACAT11IO-RCV-NBR                                   09190000
                   ,:ACAT11IO-RCV-ACCT                                  09190000
                   ,:DCLACTIAST.ISIN-CNTRY-CD                                   
                   ,:DCLACTIAST.ISIN-SEC-ISSUE-CD                               
                   ,:DCLACTIAST.ISIN-SEC-CDG-CD                                 
                   ,'40'                                                        
                   ,'M'                                                         
                   ,:DCLACTIAST.CSH-MRG-SHT-STS-CD                              
                   ,:DCLACTIAST.STTLM-LCTN-STTS-CD                              
                   ,:DCLACTIAST.ISIN-CNTRY-STTS-CD                              
                   ,:ACAT11IO-DLVR-NBR                                  09190000
                   ,:DCLACTIAST.SBMT-PRT-NR-STS-CD                              
LRM003             ,:ACAT11IO-CONTROL-NBR                                       
                   ,:DCLACTIAST.CONTROL-NBR-STS-CD                              
                   ,:DCLACTIAST.ASSET-SEQ-NBR                                   
                   ,:DCLACTIAST.AST-SEQ-NBR-STS-CD                              
                   ,:DCLACTIAST.TRANS-TYPE-CD                                   
                   ,:DCLACTIAST.TRANS-TYPE-STTS-CD                              
                   ,:DCLACTIAST.PHSCL-SEQ-NBR                                   
                   ,:DCLACTIAST.PHSCL-SEQ-STTS-CD                               
                   ,:DCLACTIAST.LGCL-SEQ-NBR                                    
                   ,:DCLACTIAST.LGCL-SEQ-NR-STS-CD                              
                   ,:DCLACTIAST.ASSET-PRC-CTGY-CD                               
                   ,:DCLACTIAST.AST-PRC-CTG-STS-CD                              
                   ,:DCLACTIAST.STTLM-RSN-CD                                    
                   ,:DCLACTIAST.STTLM-RSN-STTS-CD                               
                   ,:DCLACTIAST.ASSET-DESC-TXT                                  
                   ,:DCLACTIAST.ASSET-DESC-STTS-CD                              
                   ,' '                                                         
                   ,:DCLACTIAST.ASSET-RQST-STS-CD                               
                   ,'3'                                                         
                   ,:DCLACTIAST.AST-RQ-TRAN-STS-CD                              
                   ,:DCLACTIAST.ASSET-QTY                                       
                   ,:DCLACTIAST.ASSET-QTY-STTS-CD                               
                   ,:DCLACTIAST.ASSET-PCT                                       
                   ,:DCLACTIAST.ASSET-PCT-STTS-CD                               
                   ,:DCLACTIAST.PSTN-CD                                         
                   ,:DCLACTIAST.PSTN-CD-STTS-CD                                 
                   ,:DCLACTIAST.ISO-CRNCY-CD                                    
                   ,:DCLACTIAST.ISO-CRNCY-STTS-CD                               
                   ,:ACAT11IO-AMT-02                                            
                   ,:DCLACTIAST.ASSET-AMT-STTS-CD                               
                   ,:DCLACTIAST.BEARER-BOND-CD                                  
                   ,:DCLACTIAST.BEARER-BND-STTS-CD                              
                   ,' '                                                         
                   ,:DCLACTIAST.WHI-STTS-CD                                     
                   ,:DCLACTIAST.TRNFR-TYPE-RSN-CD                               
                   ,:DCLACTIAST.TRN-TYP-RSN-STS-CD                              
                   ,:DCLACTIAST.MBS-SERIAL-NBR                                  
                   ,:DCLACTIAST.MBS-SERIAL-STTS-CD                              
                   ,:ACAT11IO-ASSET-CMNT2-TXT                                   
                   ,:DCLACTIAST.ASSET-CMNT-STTS-CD                              
                   ,:DCLACTIAST.NSCC-WTHLD-CD                                   
                   ,:DCLACTIAST.TRANS-RFRN-ID-CD                                
                   ,:DCLACTIAST.TRANS-RFRN-STTS-CD                              
                   ,:DCLACTIAST.ISIN-SEC-IS-STS-CD                              
                   ,:DCLACTIAST.ISIN-SEC-CD-STS-CD                              
                   ,:DCLACTIAST.OPTN-CTGY-CD                                    
                   ,:DCLACTIAST.OPTN-CTGY-STTS-CD                               
                   ,:DCLACTIAST.RCRD-LNGTH-STTS-CD                              
                   ,:DCLACTIAST.RCRD-STTS-CD                                    
                   ,:ACAT11IO-NSCC-PEND-CD                                      
                   ,:DCLACTIAST.NSCC-ACK-IND                                    
                   ,'ACAT11DB'                                                  
                   ,:DCLACTIAST.CICS-TERM-ID-CD                                 
                   ,:DCLACTIAST.UPDT-TMSTP                                      
                   ,:DCLACTIAST.CRT-TMSTP                                       
LRM003             ,:DCLACTIAST.SECURITY-ADP-NBR                                
LRM003             ,:ACAT11IO-TRNFR-TYPE-CD                                     
                   ,:DCLACTIAST.TRNFR-TYPE-STTS-CD                              
                   ,:DCLACTIAST.RCV-NBR-STTS-CD                                 
                   ,:DCLACTIAST.DLVR-NBR-STTS-CD                                
                   ,:ACAT11IO-SIGN-ON-ID                                        
                 )                                                      09150000
              END-EXEC                                                  09200000
093400        EVALUATE SQLCODE                                          09220000
093500          WHEN +0                                                 09230000
LRM003               IF ACAT11IO-TRNFR-TYPE-CD = 'PTR'                          
LRM003                  PERFORM 0510-UPDATE-PTR-TIF                             
LRM003               END-IF                                                     
LRM029               IF ACAT11IO-DUPE-DLVY-ASSSET-IND NOT > ' '                 
LRM029                  MOVE 'M' TO WS-SEL-CSH-MGN-CD                           
LRM029                  PERFORM 0330-CHECK-DUPE-DLVY-CSH-RTN                    
LRM029                     THRU 0330-EXIT                                       
LRM029               END-IF                                                     
094000          WHEN OTHER                                              09280000
                     SET ACAT11IO-DB2-ERROR TO TRUE                             
                     PERFORM 9000-WRITE-TO-CICS-LOG                             
                     PERFORM 9500-RETURN-DB2-ERROR                              
094200        END-EVALUATE                                              09300000
           END-IF.                                                              
                                                                                
      *** INSERT SHORT AMT                                                      
           IF ACAT11IO-AMT-05-CREDIT                                            
              MOVE 'CRED' TO STTLM-RSN-CD OF DCLACTIAST                         
              MOVE 'L'    TO PSTN-CD      OF DCLACTIAST                         
           ELSE                                                                 
              MOVE 'DEB ' TO STTLM-RSN-CD OF DCLACTIAST                         
              MOVE 'S'    TO PSTN-CD      OF DCLACTIAST                         
           END-IF.                                                              
           IF ACAT11IO-AMT-05 NOT = ZEROS                                       
              EXEC SQL                                                  09140000
               INSERT INTO ACTIAST                                      09170000
                 (                                                      09150000
                   CLIENT_NBR                                           09180000
                  ,DLVR_NBR                                             09150000
                  ,ACCT_DLVR_NBR                                        09180000
                  ,RCV_NBR                                              09180000
                  ,ACCT_RCV_NBR                                         09180000
                  ,ISIN_CNTRY_CD                                                
                  ,ISIN_SEC_ISSUE_CD                                            
                  ,ISIN_SEC_CDG_CD                                              
                  ,STTLM_LCTN_CD                                                
                  ,CSH_MGN_SHRT_CD                                              
                  ,CSH_MRG_SHT_STS_CD                                           
                  ,STTLM_LCTN_STTS_CD                                           
                  ,ISIN_CNTRY_STTS_CD                                           
                  ,SBMTG_PRTCP_NBR                                              
                  ,SBMT_PRT_NR_STS_CD                                           
                  ,ACAT_CONTROL_NBR                                             
                  ,CONTROL_NBR_STS_CD                                           
                  ,ASSET_SEQ_NBR                                                
                  ,AST_SEQ_NBR_STS_CD                                           
                  ,TRANS_TYPE_CD                                                
                  ,TRANS_TYPE_STTS_CD                                           
                  ,PHSCL_SEQ_NBR                                                
                  ,PHSCL_SEQ_STTS_CD                                            
                  ,LGCL_SEQ_NBR                                                 
                  ,LGCL_SEQ_NR_STS_CD                                           
                  ,ASSET_PRC_CTGY_CD                                            
                  ,AST_PRC_CTG_STS_CD                                           
                  ,STTLM_RSN_CD                                                 
                  ,STTLM_RSN_STTS_CD                                            
                  ,ASSET_DESC_TXT                                               
                  ,ASSET_DESC_STTS_CD                                           
                  ,ASSET_RQST_QTY_CD                                            
                  ,ASSET_RQST_STS_CD                                            
                  ,AST_RQST_TRANS_CD                                            
                  ,AST_RQ_TRAN_STS_CD                                           
                  ,ASSET_QTY                                                    
                  ,ASSET_QTY_STTS_CD                                            
                  ,ASSET_PCT                                                    
                  ,ASSET_PCT_STTS_CD                                            
                  ,PSTN_CD                                                      
                  ,PSTN_CD_STTS_CD                                              
                  ,ISO_CRNCY_CD                                                 
                  ,ISO_CRNCY_STTS_CD                                            
                  ,ASSET_AMT                                                    
                  ,ASSET_AMT_STTS_CD                                            
                  ,BEARER_BOND_CD                                               
                  ,BEARER_BND_STTS_CD                                           
                  ,WHI_CD                                                       
                  ,WHI_STTS_CD                                                  
                  ,TRNFR_TYPE_RSN_CD                                            
                  ,TRN_TYP_RSN_STS_CD                                           
                  ,MBS_SERIAL_NBR                                               
                  ,MBS_SERIAL_STTS_CD                                           
                  ,ASSET_CMNT_TXT                                               
                  ,ASSET_CMNT_STTS_CD                                           
                  ,NSCC_WTHLD_CD                                                
                  ,TRANS_RFRN_ID_CD                                             
                  ,TRANS_RFRN_STTS_CD                                           
                  ,ISIN_SEC_IS_STS_CD                                           
                  ,ISIN_SEC_CD_STS_CD                                           
                  ,OPTN_CTGY_CD                                                 
                  ,OPTN_CTGY_STTS_CD                                            
                  ,RCRD_LNGTH_STTS_CD                                           
                  ,RCRD_STTS_CD                                                 
                  ,NSCC_PEND_CD                                                 
                  ,NSCC_ACK_IND                                                 
                  ,PRGM_NM                                                      
                  ,CICS_TERM_ID_CD                                              
                  ,UPDT_TMSTP                                                   
                  ,CRT_TMSTP                                                    
                  ,SECURITY_ADP_NBR                                             
                  ,TRNFR_TYPE_CD                                                
                  ,TRNFR_TYPE_STTS_CD                                           
                  ,RCV_NBR_STTS_CD                                              
                  ,DLVR_NBR_STTS_CD                                             
                  ,CICS_SGNON_ID                                                
                 )                                                      09150000
                 VALUES                                                         
                 (                                                      09150000
                    :ACAT11IO-CLIENT-NBR                                09190000
                   ,:ACAT11IO-DLVR-NBR                                  09190000
                   ,:ACAT11IO-DLVR-ACCT                                 09190000
                   ,:ACAT11IO-RCV-NBR                                   09190000
                   ,:ACAT11IO-RCV-ACCT                                  09190000
                   ,:DCLACTIAST.ISIN-CNTRY-CD                                   
                   ,:DCLACTIAST.ISIN-SEC-ISSUE-CD                               
                   ,:DCLACTIAST.ISIN-SEC-CDG-CD                                 
                   ,'40'                                                        
                   ,'S'                                                         
                   ,:DCLACTIAST.CSH-MRG-SHT-STS-CD                              
                   ,:DCLACTIAST.STTLM-LCTN-STTS-CD                              
                   ,:DCLACTIAST.ISIN-CNTRY-STTS-CD                              
                   ,:ACAT11IO-DLVR-NBR                                  09190000
                   ,:DCLACTIAST.SBMT-PRT-NR-STS-CD                              
LRM003             ,:ACAT11IO-CONTROL-NBR                                       
                   ,:DCLACTIAST.CONTROL-NBR-STS-CD                              
                   ,:DCLACTIAST.ASSET-SEQ-NBR                                   
                   ,:DCLACTIAST.AST-SEQ-NBR-STS-CD                              
                   ,:DCLACTIAST.TRANS-TYPE-CD                                   
                   ,:DCLACTIAST.TRANS-TYPE-STTS-CD                              
                   ,:DCLACTIAST.PHSCL-SEQ-NBR                                   
                   ,:DCLACTIAST.PHSCL-SEQ-STTS-CD                               
                   ,:DCLACTIAST.LGCL-SEQ-NBR                                    
                   ,:DCLACTIAST.LGCL-SEQ-NR-STS-CD                              
                   ,:DCLACTIAST.ASSET-PRC-CTGY-CD                               
                   ,:DCLACTIAST.AST-PRC-CTG-STS-CD                              
                   ,:DCLACTIAST.STTLM-RSN-CD                                    
                   ,:DCLACTIAST.STTLM-RSN-STTS-CD                               
                   ,:DCLACTIAST.ASSET-DESC-TXT                                  
                   ,:DCLACTIAST.ASSET-DESC-STTS-CD                              
                   ,' '                                                         
                   ,:DCLACTIAST.ASSET-RQST-STS-CD                               
                   ,'3'                                                         
                   ,:DCLACTIAST.AST-RQ-TRAN-STS-CD                              
                   ,:DCLACTIAST.ASSET-QTY                                       
                   ,:DCLACTIAST.ASSET-QTY-STTS-CD                               
                   ,:DCLACTIAST.ASSET-PCT                                       
                   ,:DCLACTIAST.ASSET-PCT-STTS-CD                               
                   ,:DCLACTIAST.PSTN-CD                                         
                   ,:DCLACTIAST.PSTN-CD-STTS-CD                                 
                   ,:DCLACTIAST.ISO-CRNCY-CD                                    
                   ,:DCLACTIAST.ISO-CRNCY-STTS-CD                               
                   ,:ACAT11IO-AMT-05                                            
                   ,:DCLACTIAST.ASSET-AMT-STTS-CD                               
                   ,:DCLACTIAST.BEARER-BOND-CD                                  
                   ,:DCLACTIAST.BEARER-BND-STTS-CD                              
                   ,' '                                                         
                   ,:DCLACTIAST.WHI-STTS-CD                                     
                   ,:DCLACTIAST.TRNFR-TYPE-RSN-CD                               
                   ,:DCLACTIAST.TRN-TYP-RSN-STS-CD                              
                   ,:DCLACTIAST.MBS-SERIAL-NBR                                  
                   ,:DCLACTIAST.MBS-SERIAL-STTS-CD                              
                   ,:ACAT11IO-ASSET-CMNT5-TXT                                   
                   ,:DCLACTIAST.ASSET-CMNT-STTS-CD                              
                   ,:DCLACTIAST.NSCC-WTHLD-CD                                   
                   ,:DCLACTIAST.TRANS-RFRN-ID-CD                                
                   ,:DCLACTIAST.TRANS-RFRN-STTS-CD                              
                   ,:DCLACTIAST.ISIN-SEC-IS-STS-CD                              
                   ,:DCLACTIAST.ISIN-SEC-CD-STS-CD                              
                   ,:DCLACTIAST.OPTN-CTGY-CD                                    
                   ,:DCLACTIAST.OPTN-CTGY-STTS-CD                               
                   ,:DCLACTIAST.RCRD-LNGTH-STTS-CD                              
                   ,:DCLACTIAST.RCRD-STTS-CD                                    
                   ,:ACAT11IO-NSCC-PEND-CD                                      
                   ,:DCLACTIAST.NSCC-ACK-IND                                    
                   ,'ACAT11DB'                                                  
                   ,:DCLACTIAST.CICS-TERM-ID-CD                                 
                   ,:DCLACTIAST.UPDT-TMSTP                                      
                   ,:DCLACTIAST.CRT-TMSTP                                       
LRM003             ,:DCLACTIAST.SECURITY-ADP-NBR                                
LRM003             ,:ACAT11IO-TRNFR-TYPE-CD                                     
                   ,:DCLACTIAST.TRNFR-TYPE-STTS-CD                              
                   ,:DCLACTIAST.RCV-NBR-STTS-CD                                 
                   ,:DCLACTIAST.DLVR-NBR-STTS-CD                                
                   ,:ACAT11IO-SIGN-ON-ID                                        
                 )                                                      09150000
              END-EXEC                                                  09200000
093400        EVALUATE SQLCODE                                          09220000
093500          WHEN +0                                                 09230000
LRM003               IF ACAT11IO-TRNFR-TYPE-CD = 'PTR'                          
LRM003                  PERFORM 0510-UPDATE-PTR-TIF                             
LRM003               END-IF                                                     
LRM029               IF ACAT11IO-DUPE-DLVY-ASSSET-IND NOT > ' '                 
LRM029                  MOVE 'S' TO WS-SEL-CSH-MGN-CD                           
LRM029                  PERFORM 0330-CHECK-DUPE-DLVY-CSH-RTN                    
LRM029                     THRU 0330-EXIT                                       
LRM029               END-IF                                                     
094000          WHEN OTHER                                              09280000
                     SET ACAT11IO-DB2-ERROR TO TRUE                             
                     PERFORM 9000-WRITE-TO-CICS-LOG                             
                     PERFORM 9500-RETURN-DB2-ERROR                              
094200        END-EVALUATE                                              09300000
           END-IF.                                                              
                                                                                
                                                                                
           EJECT                                                                
CSG001 0231-EDIT-ASSET-DESC-TXT.                                                
CSG001* MOVE SPACES FOR THE SPECIAL CHARACTERS FOUND IN ASSET-DESC-TXT.         
CSG001* AND LEFT JUSTIFY THE FIRST DESCRIPTION IF FIRST CHAR IS SPACE           
CSG001* AFTER EDITED.                                                           
CSG001     MOVE SPACES                 TO WS-EDIT-ASSET-DESC-TXT-FLAG           
CSG001     PERFORM                                                              
CSG001         VARYING WS-SUB1 FROM 1 BY 1                                      
CSG001           UNTIL WS-SUB1 > 140                                            
CSG001         MOVE WS-ASSET-DESC-TXT(WS-SUB1:1)   TO W-EDIT-CHAR-AREA2         
CSG001         IF NOT W-VALID-CHARACTER2                                        
CSG001            MOVE SPACES         TO WS-ASSET-DESC-TXT(WS-SUB1:1)           
CSG001            SET WS-EDIT-ASSET-DESC-TXT-Y     TO TRUE                      
CSG001         END-IF                                                           
CSG001     END-PERFORM                                                          
CSG001*                                                                         
CSG001     IF WS-EDIT-ASSET-DESC-TXT-Y AND                                      
CSG001        WS-ASSET-DESC1-TXT(1:1) = SPACES                                  
CSG001        SET WS-JUST-LEFT-NOT-DONE       TO TRUE                           
CSG001        PERFORM                                                           
CSG001          VARYING WS-SUB1 FROM 2 BY 1                                     
CSG001            UNTIL WS-SUB1 > 30 OR WS-JUST-LEFT-DONE                       
CSG001          IF WS-ASSET-DESC1-TXT(WS-SUB1 : 1) NOT = SPACES         03760002
CSG001             MOVE SPACES                TO WS-ASSET-DESC-TMP      03760002
CSG001             MOVE WS-ASSET-DESC1-TXT(WS-SUB1 : )                  03760002
CSG001                                        TO WS-ASSET-DESC-TMP      03760002
CSG001             MOVE WS-ASSET-DESC-TMP     TO WS-ASSET-DESC1-TXT             
CSG001             SET WS-JUST-LEFT-DONE      TO TRUE                   03760002
CSG001          END-IF                                                  03760002
CSG001        END-PERFORM                                               03760002
CSG001     END-IF                                                       03760002
CSG001           .                                                      03760002
CSG001 0231-EXIT. EXIT.                                                         
       0300-UPDATE-ACTITRF.                                                     
LRM003     IF ACAT11IO-TRNFR-TYPE-CD = 'PTR'                            09190000
LRM003        PERFORM 0305-CHECK-TMSTP-PTR-NSCC-RTN                             
LRM003     ELSE                                                                 
              PERFORM 0310-CHECK-TMSTP-AND-NSCC-RTN.                            
           IF ACAT11IO-UPDT-TMSTP-NG                                            
           OR ACAT11IO-NSCC-PEND-NG                                             
           OR ACAT11IO-NOT-FOUND                                                
              GO TO 0300-EXIT.                                                  
                                                                                
           MOVE WS-TIMESTAMP TO  UPDT-TMSTP OF DCLACTITRF                       
                                 ACAT11IO-UPDT-TMSTP.                           
           MOVE EIBTRMID TO CICS-TERM-ID-CD OF DCLACTITRF.                      
   ******* PRIMARY KEY CHANGE / INSERT AND DELETE...                            
           IF ACAT11IO-ORIG-RCV-NBR  NOT = ACAT11IO-RCV-NBR             09190000
           OR ACAT11IO-ORIG-RCV-ACCT NOT = ACAT11IO-RCV-ACCT            09190000
               PERFORM 0350-KEY-CHANGE-RTN                                      
           ELSE                                                                 
           EXEC SQL                                                     09140000
               UPDATE ACTITRF                                           09170000
                 SET                                                            
                   RCV_SS_PRIM_NBR   =                                          
                    :ACAT11IO-RCV-SS-PRIM-NBR                                   
                  ,RCV_SS_SCNDY_NBR  =                                          
                    :ACAT11IO-RCV-SS-SCNDY-NBR                                  
                  ,RCV_ACCT_TYPE_CD  =                                          
                    :ACAT11IO-RCV-ACCT-TYPE-CD                                  
                  ,RCV_OCC_BRKR_NBR  =                                          
                    :ACAT11IO-RCV-OCC-BRKR-NBR                                  
                  ,RCV_CUST_NM       =                                          
                    :ACAT11IO-RCV-CUST-NM                                       
C KEY?            ,TRNFR_TYPE_CD     =                                          
                    :ACAT11IO-TRNFR-TYPE-CD                                     
                  ,CMNT_TXT          =                                          
                    :ACAT11IO-CMNT-TXT                                          
                  ,NSCC_PEND_CD      =                                          
                    :ACAT11IO-NSCC-PEND-CD                                      
                  ,UPDT_TMSTP        =                                          
                    :DCLACTITRF.UPDT-TMSTP                                      
                  ,CICS_TERM_ID_CD   =                                          
                    :DCLACTITRF.CICS-TERM-ID-CD                                 
                  ,PRGM_NM           =                                          
                    'ACAT11DB'                                                  
                  ,RR_CD             =                                          
                    :ACAT11IO-RR-CD                                             
                  ,CICS_SGNON_ID     =                                          
                    :ACAT11IO-SIGN-ON-ID                                        
LRM021            ,GIFT_IND          =                                          
LRM021              :ACAT11IO-GIFT-IND                                          
LRM023            ,NSCC_ACK_IND      =  ' '                                     
              WHERE                                                             
                  (CLIENT_NBR    =                                      09180000
                    :ACAT11IO-CLIENT-NBR   AND                          09190000
LRM007             ACAT_CONTROL_NBR =                                           
LRM007              :ACAT11IO-CONTROL-NBR   AND                                 
                   DLVR_NBR      =                                      09150000
                    :ACAT11IO-DLVR-NBR     AND                          09190000
                   ACCT_DLVR_NBR =                                      09180000
                    :ACAT11IO-DLVR-ACCT    AND                          09190000
                   RCV_NBR       =                                      09180000
                    :ACAT11IO-RCV-NBR      AND                          09190000
                   ACCT_RCV_NBR  =                                      09180000
                    :ACAT11IO-RCV-ACCT     AND                          09190000
                   TRNFR_TYPE_CD =                                      09180000
                    :ACAT11IO-TRNFR-TYPE-CD                                     
                 )                                                      09150000
093200     END-EXEC.                                                    09200000
                                                                                
LRM008     IF SQLCODE NOT = 0                                           09230000
LRM003     AND ACAT11IO-TRNFR-TYPE-CD = 'PTR'                                   
LRM003       SET ACAT11IO-GOOD-RESP TO TRUE                             09240000
LRM003     ELSE                                                                 
           EVALUATE SQLCODE                                             09220000
               WHEN +0                                                  09230000
                  SET ACAT11IO-GOOD-RESP TO TRUE                        09240000
               WHEN OTHER                                               09280000
                  SET ACAT11IO-DB2-ERROR TO TRUE                                
                  PERFORM 9000-WRITE-TO-CICS-LOG                                
                  PERFORM 9500-RETURN-DB2-ERROR                                 
           END-EVALUATE.                                                09300000
                                                                                
                                                                                
LRM003**** MOVE WS-TIMESTAMP TO  UPDT-TMSTP OF DCLVTRNFR.                       
LRM003**** MOVE EIBTRMID TO CICS-TERM-ID-CD OF DCLVTRNFR.                       
LRM003**** IF ACAT11IO-CONTROL-NBR > SPACES                                     
LRM003****    EXEC SQL                                                  09140000
LRM003****     UPDATE VTRNFR                                            09170000
LRM003****       SET                                                            
LRM003****         ACCT_RJCT_RSBM_IND =                                         
LRM003****          :ACAT11IO-ACCT-RJCT-RSBM-IND                        09170000
LRM003****        ,UPDT_TMSTP        =                                          
LRM003****          :DCLVTRNFR.UPDT-TMSTP                                       
LRM003****        ,CICS_TERM_ID_CD   =                                          
LRM003****          :DCLVTRNFR.CICS-TERM-ID-CD                                  
LRM003****        ,PRGM_NM           =                                          
LRM003****          'ACAT11DB'                                                  
LRM003****        WHERE (CLIENT_NBR                                     09180000
LRM003****                    = :ACAT11IO-CLIENT-NBR                    09190000
LRM003****           AND ACAT_CONTROL_NBR                               09180000
LRM003****                    = :ACAT11IO-CONTROL-NBR)                          
LRM003****    END-EXEC                                                  09200000
LRM003****    EVALUATE SQLCODE                                          09220000
LRM003****        WHEN +0                                               09230000
LRM003****           SET ACAT11IO-GOOD-RESP TO TRUE                     09240000
LRM003****        WHEN OTHER                                            09280000
LRM003****           SET ACAT11IO-DB2-ERROR TO TRUE                             
LRM003****           PERFORM 9000-WRITE-TO-CICS-LOG                             
LRM003****           PERFORM 9500-RETURN-DB2-ERROR                              
LRM003****    END-EVALUATE.                                             09300000
                                                                                
           PERFORM 0430-DELETE-ALL-ASSETS-AMOUNTS.                              
           PERFORM 0230-INSERT-ASSET-AMOUNTS.                                   
                                                                                
******** REPLACE NSCC_PEND_CD ON ALL ASSETS ON THIS TIF.                        
LRM008** EXCEPT FOR WITHHELD                                                    
           EXEC SQL                                                     09140000
               UPDATE ACTIAST                                           09170000
                 SET                                                            
                   NSCC_PEND_CD      =                                          
                    :ACAT11IO-NSCC-PEND-CD                                      
                  ,UPDT_TMSTP        =                                          
                    :DCLACTITRF.UPDT-TMSTP                                      
                  ,CICS_TERM_ID_CD   =                                          
                    :DCLACTITRF.CICS-TERM-ID-CD                                 
                  ,PRGM_NM           =                                          
                    'ACAT11DB'                                                  
                  ,CICS_SGNON_ID     =                                          
                    :ACAT11IO-SIGN-ON-ID                                        
LRM028            ,CICS_NET_NM       =                                          
LRM028              :ACAT11IO-NETNAME                                           
LRM028            ,TPSCRT_USR_ID     =                                          
LRM028              :ACAT11IO-USER-ID                                           
LRM028            ,TPSCRT_USR_NM     =                                          
LRM028              :ACAT11IO-USER-NAME                                         
              WHERE                                                             
                  (CLIENT_NBR    =                                      09180000
                    :ACAT11IO-CLIENT-NBR   AND                          09190000
                   DLVR_NBR      =                                      09150000
                    :ACAT11IO-DLVR-NBR     AND                          09190000
                   ACCT_DLVR_NBR =                                      09180000
                    :ACAT11IO-DLVR-ACCT    AND                          09190000
                   RCV_NBR       =                                      09180000
                    :ACAT11IO-RCV-NBR      AND                          09190000
                   ACCT_RCV_NBR  =                                      09180000
                    :ACAT11IO-RCV-ACCT     AND                          09190000
LRM008             NOT NSCC_WTHLD_CD                                            
LRM008                        = 'W'        AND                                  
LRM008             ACAT_CONTROL_NBR                                     09180000
LRM008                        = :ACAT11IO-CONTROL-NBR AND                       
                   TRNFR_TYPE_CD =                                      09180000
                    :ACAT11IO-TRNFR-TYPE-CD                                     
                 )                                                      09150000
093200     END-EXEC.                                                    09200000
                                                                                
           EVALUATE SQLCODE                                             09220000
               WHEN +0                                                  09230000
                  SET ACAT11IO-GOOD-RESP TO TRUE                        09240000
               WHEN +100                                                09230000
                  SET ACAT11IO-GOOD-RESP TO TRUE                        09240000
               WHEN OTHER                                               09280000
                  SET ACAT11IO-DB2-ERROR TO TRUE                                
                  PERFORM 9000-WRITE-TO-CICS-LOG                                
                  PERFORM 9500-RETURN-DB2-ERROR                                 
           END-EVALUATE.                                                09300000
                                                                                
LRM008     EXEC SQL                                                     09140000
LRM008         UPDATE ACTIAST                                           09170000
LRM008           SET                                                            
LRM008             NSCC_PEND_CD      = 'H'                                      
LRM008            ,UPDT_TMSTP        =                                          
LRM008              :DCLACTITRF.UPDT-TMSTP                                      
LRM008            ,CICS_TERM_ID_CD   =                                          
LRM008              :DCLACTITRF.CICS-TERM-ID-CD                                 
LRM008            ,PRGM_NM           =                                          
LRM008              'ACAT11DB'                                                  
                  ,CICS_SGNON_ID     =                                          
                    :ACAT11IO-SIGN-ON-ID                                        
LRM008        WHERE                                                             
LRM008            (CLIENT_NBR    =                                      09180000
LRM008              :ACAT11IO-CLIENT-NBR   AND                          09190000
LRM008             DLVR_NBR      =                                      09150000
LRM008              :ACAT11IO-DLVR-NBR     AND                          09190000
LRM008             ACCT_DLVR_NBR =                                      09180000
LRM008              :ACAT11IO-DLVR-ACCT    AND                          09190000
LRM008             RCV_NBR       =                                      09180000
LRM008              :ACAT11IO-RCV-NBR      AND                          09190000
LRM008             ACCT_RCV_NBR  =                                      09180000
LRM008              :ACAT11IO-RCV-ACCT     AND                          09190000
LRM008             NSCC_WTHLD_CD                                                
LRM008                        = 'W'        AND                                  
LRM008             ACAT_CONTROL_NBR                                     09180000
LRM008                        = :ACAT11IO-CONTROL-NBR AND                       
LRM008             TRNFR_TYPE_CD =                                      09180000
LRM008              :ACAT11IO-TRNFR-TYPE-CD                                     
LRM008           )                                                      09150000
LRM008     END-EXEC.                                                    09200000
       0300-EXIT. EXIT.                                                         
                                                                                
LRM003 0305-CHECK-TMSTP-PTR-NSCC-RTN.                                           
      *---------------------------------------------------------------          
      *  READ THE EXISTING ASSET TO OBTAIN NSCC-PEND-IND AND UPDATE             
      *  TIMESTAMP TO SEE IF SOMEONE ELSE CAUSED AN UPDATE WHILE THIS           
      *  USER WAS LOOKING AT THIS RECORD ON THIER SCREEN.                       
      *---------------------------------------------------------------          
           EXEC SQL SELECT                                              09140000
                   NSCC_PEND_CD                                                 
                  ,UPDT_TMSTP                                                   
                 INTO                                                   09160000
                   :DCLACTIAST.NSCC-PEND-CD                                     
                  ,:DCLACTIAST.UPDT-TMSTP                                       
                 FROM ACTIAST                                           09170000
                  WHERE (CLIENT_NBR                                     09180000
                              = :ACAT11IO-CLIENT-NBR                    09190000
LRM007               AND ACAT_CONTROL_NBR                                       
LRM007                        = :ACAT11IO-CONTROL-NBR                           
                     AND DLVR_NBR                                       09180000
                              = :ACAT11IO-DLVR-NBR                      09190000
                     AND ACCT_DLVR_NBR                                  09180000
                              = :ACAT11IO-DLVR-ACCT                     09190000
                     AND RCV_NBR                                        09180000
                              = :ACAT11IO-RCV-NBR                       09190000
                     AND ACCT_RCV_NBR                                   09180000
                              = :ACAT11IO-RCV-ACCT                      09190000
                     AND TRNFR_TYPE_CD                                  09180000
                              = :ACAT11IO-TRNFR-TYPE-CD)                09190000
093200      END-EXEC.                                                   09200000
093300* WHEN/WHEN MEANS OR...                                           09210000
093400      EVALUATE SQLCODE                                            09220000
093800          WHEN +0                                                 09260000
093800          WHEN -811                                               09260000
                     SET ACAT11IO-FOUND TO TRUE                                 
                     IF NSCC-PEND-CD OF DCLACTIAST = 'Y'                        
                        SET ACAT11IO-NSCC-PEND-NG TO TRUE                       
                     END-IF                                                     
093800          WHEN +100                                               09260000
LRM003               SET ACAT11IO-FOUND TO TRUE                                 
094000          WHEN OTHER                                              09280000
                     PERFORM 9000-WRITE-TO-CICS-LOG                             
                     PERFORM 9500-RETURN-DB2-ERROR                              
094200      END-EVALUATE.                                               09300000
                                                                                
       0310-CHECK-TMSTP-AND-NSCC-RTN.                                           
      *---------------------------------------------------------------          
      *  READ THE EXISTING TIF TO OBTAIN NSCC-PEND-IND AND UPDATE               
      *  TIMESTAMP TO SEE IF SOMEONE ELSE CAUSED AN UPDATE WHILE THIS           
      *  USER WAS LOOKING AT THIS RECORD ON THIER SCREEN.                       
      *---------------------------------------------------------------          
           EXEC SQL SELECT                                              09140000
                   NSCC_PEND_CD                                                 
                  ,UPDT_TMSTP                                                   
                 INTO                                                   09160000
                   :DCLACTITRF.NSCC-PEND-CD                                     
                  ,:DCLACTITRF.UPDT-TMSTP                                       
                 FROM ACTITRF                                           09170000
                  WHERE (CLIENT_NBR                                     09180000
                              = :ACAT11IO-CLIENT-NBR                    09190000
LRM007               AND ACAT_CONTROL_NBR                                       
LRM007                        = :ACAT11IO-CONTROL-NBR                           
                     AND DLVR_NBR                                       09180000
                              = :ACAT11IO-DLVR-NBR                      09190000
                     AND ACCT_DLVR_NBR                                  09180000
                              = :ACAT11IO-DLVR-ACCT                     09190000
                     AND RCV_NBR                                        09180000
                              = :ACAT11IO-RCV-NBR                       09190000
                     AND ACCT_RCV_NBR                                   09180000
                              = :ACAT11IO-RCV-ACCT                      09190000
                     AND TRNFR_TYPE_CD                                  09180000
LRM003                        = :ACAT11IO-TRNFR-TYPE-CD)                09190000
093200      END-EXEC.                                                   09200000
093300*                                                                 09210000
093400      EVALUATE SQLCODE                                            09220000
093800          WHEN +0                                                 09260000
                     SET ACAT11IO-FOUND TO TRUE                                 
                     IF NSCC-PEND-CD OF DCLACTITRF = 'Y'                        
                        SET ACAT11IO-NSCC-PEND-NG TO TRUE                       
                     ELSE                                                       
                     IF UPDT-TMSTP OF DCLACTITRF NOT =                          
                                 ACAT11IO-UPDT-TMSTP                            
                        SET ACAT11IO-UPDT-TMSTP-NG TO TRUE                      
                     END-IF END-IF                                              
093800          WHEN +100                                               09260000
                     SET ACAT11IO-NOT-FOUND TO TRUE                             
094000          WHEN OTHER                                              09280000
                     PERFORM 9000-WRITE-TO-CICS-LOG                             
                     PERFORM 9500-RETURN-DB2-ERROR                              
094200      END-EVALUATE.                                               09300000
                                                                                
LRM029 0320-CHECK-DUPE-DLVY-RTN.                                                
      * LOOK IN INITIAL TABLE FOR SAME ADP NUMBR ON A DIFFERENT DLVY            
           MOVE ACAT11IO-DLVR-ACCT(1:8)                                         
LRM029              TO WS-SEL-DLVR-ACCT                                 09180000
LRM029     MOVE '%' TO WS-SEL-DLVR-ACCT(9:1).                           09180000
           EXEC SQL                                                             
              OPEN ACTIAST_DUPE                                                 
           END-EXEC.                                                            
           IF SQLCODE = 0                                                       
              CONTINUE                                                  09240000
           ELSE                                                                 
    *******   MOVE '** TFRCSRA OPEN ERROR **'                                   
              PERFORM 9000-WRITE-TO-CICS-LOG                                    
              GO TO 0320-EXIT                                                   
           END-IF.                                                              
           MOVE 'N' TO END-OF-ACTIAST-TRANSFERS-SW                              
           PERFORM 0322-FETCH-ACTIAST-RTN                                       
              UNTIL ACAT11IO-DUPE-DLVY-ASSSET-IND  > ' '                        
                OR END-OF-ACTIAST-TRANSFERS-SW = 'Y'.                           
           EXEC SQL                                                             
              CLOSE ACTIAST_DUPE                                                
           END-EXEC.                                                            
                                                                                
           IF ACAT11IO-DUPE-DLVY-ASSSET-IND  > ' '                              
              GO TO 0320-EXIT                                                   
           END-IF.                                                              
                                                                                
      * LOOK IN ACTIVE TABLE FOR SAME ADP NUMBER ON DIFFERENT TRANSFER          
           EXEC SQL                                                             
              OPEN TFRCSR_DUPE                                                  
           END-EXEC.                                                            
           IF SQLCODE = 0                                                       
              CONTINUE                                                  09240000
           ELSE                                                                 
    *******   MOVE '** TFRCSRA OPEN ERROR **'                                   
              PERFORM 9000-WRITE-TO-CICS-LOG                                    
              GO TO 0320-EXIT                                                   
           END-IF.                                                              
           MOVE 'N' TO END-OF-ACTIVE-TRANSFERS-SW                               
           PERFORM 0325-FETCH-ACTIVE-RTN                                        
              UNTIL ACAT11IO-DUPE-DLVY-ASSSET-IND  > ' '                        
                OR END-OF-ACTIVE-TRANSFERS-SW = 'Y'.                            
           EXEC SQL                                                             
              CLOSE TFRCSR_DUPE                                                 
           END-EXEC.                                                            
LRM029 0320-EXIT. EXIT.                                                         
                                                                                
LRM029 0322-FETCH-ACTIAST-RTN.                                                  
           EXEC SQL                                                             
              FETCH                                                             
                  ACTIAST_DUPE                                                  
                   INTO                                                 09160000
                  :WS-DUPE-RCV-NBR                                      09180000
                 ,:WS-DUPE-DLVR-ACCT                                    09180000
                 ,:WS-DUPE-ACCT-RCV-NBR                                         
                 ,:WS-DUPE-CNTL-NBR                                             
                 ,:WS-DUPE-TRNFR-TYPE-CD                                        
                 ,:WS-DUPE-STTLM-LCTN-CD                                        
           END-EXEC.                                                            
           IF SQLCODE = 0                                                       
              IF WS-DUPE-RCV-NBR           = ACAT11IO-RCV-NBR           09180000
              AND WS-DUPE-DLVR-ACCT        = ACAT11IO-DLVR-ACCT         09180000
              AND WS-DUPE-ACCT-RCV-NBR     = ACAT11IO-RCV-ACCT                  
              AND WS-DUPE-CNTL-NBR         = ACAT11IO-CONTROL-NBR               
              AND WS-DUPE-TRNFR-TYPE-CD    = ACAT11IO-TRNFR-TYPE-CD             
              AND WS-DUPE-STTLM-LCTN-CD    = ACAT11IO-STTLM-LCTN-CD             
                 CONTINUE                                                       
              ELSE                                                              
                 MOVE 'P' TO ACAT11IO-DUPE-DLVY-ASSSET-IND                      
           ELSE                                                                 
              MOVE 'Y' TO END-OF-ACTIAST-TRANSFERS-SW                           
           END-IF.                                                              
                                                                                
LRM029 0325-FETCH-ACTIVE-RTN.                                                   
           EXEC SQL                                                             
              FETCH                                                             
                  TFRCSR_DUPE                                                   
                   INTO                                                 09160000
                  :WS-DUPE-CNTL-NBR                                             
           END-EXEC.                                                            
           IF SQLCODE NOT = 0                                                   
              MOVE 'Y' TO END-OF-ACTIVE-TRANSFERS-SW                            
           ELSE                                                                 
              EXEC SQL                                                          
                SELECT                                                  09170000
                   ACAT_CONTROL_NBR                                     09180000
                 INTO                                                           
                  :WS-DUPE-CNTL-NBR                                             
                FROM VASSET                                                     
                 WHERE (                                                        
                      CLIENT_NBR      =   :ACAT11IO-CLIENT-NBR          09180000
                  AND ACAT_CONTROL_NBR = :WS-DUPE-CNTL-NBR              09180000
                  AND SECURITY_ADP_NBR =  :ACAT11IO-ADP-NBR                     
               AND CSH_MGN_SHRT_CD  =  :ACAT11IO-CSH-MGN-SHRT-CD        09180000
                  AND NOT STTLM_LCTN_CD = '45'                                  
                 )                                                      09150000
              END-EXEC                                                  09200000
              IF SQLCODE = +0 OR -811                                           
                 MOVE 'P' TO ACAT11IO-DUPE-DLVY-ASSSET-IND                      
           END-IF.                                                              
                                                                                
LRM029 0330-CHECK-DUPE-DLVY-CSH-RTN.                                            
      * LOOK IN INITIAL TABLE FOR SAME CASH TYPE ON A DIFFERENT DLVY            
           MOVE ACAT11IO-DLVR-ACCT(1:8)                                         
LRM029              TO WS-SEL-DLVR-ACCT                                 09180000
LRM029     MOVE '%' TO WS-SEL-DLVR-ACCT(9:1).                           09180000
           EXEC SQL                                                             
              OPEN ACTIASTC_DUPE                                                
           END-EXEC.                                                            
           IF SQLCODE = 0                                                       
              CONTINUE                                                  09240000
           ELSE                                                                 
    *******   MOVE '** TFRCSRA OPEN ERROR **'                                   
              PERFORM 9000-WRITE-TO-CICS-LOG                                    
              GO TO 0330-EXIT                                                   
           END-IF.                                                              
           MOVE 'N' TO END-OF-ACTIAST-TRANSFERS-SW                              
           PERFORM 0332-FETCH-ACTIAST-CSH-RTN                                   
              UNTIL ACAT11IO-DUPE-DLVY-ASSSET-IND  > ' '                        
                OR END-OF-ACTIAST-TRANSFERS-SW = 'Y'.                           
           EXEC SQL                                                             
              CLOSE ACTIASTC_DUPE                                               
           END-EXEC.                                                            
                                                                                
           IF ACAT11IO-DUPE-DLVY-ASSSET-IND  > ' '                              
              GO TO 0330-EXIT                                                   
           END-IF.                                                              
                                                                                
      * LOOK IN ACTIVE TABLE FOR SAME CASH TYPE ON DIFFERENT TRANSFER           
           EXEC SQL                                                             
              OPEN TFRCSR_DUPE                                                  
           END-EXEC.                                                            
           IF SQLCODE = 0                                                       
              CONTINUE                                                  09240000
           ELSE                                                                 
    *******   MOVE '** TFRCSRA OPEN ERROR **'                                   
              PERFORM 9000-WRITE-TO-CICS-LOG                                    
              GO TO 0330-EXIT                                                   
           END-IF.                                                              
           MOVE 'N' TO END-OF-ACTIVE-TRANSFERS-SW                               
           PERFORM 0335-FETCH-ACTIVE-CSH-RTN                                    
              UNTIL ACAT11IO-DUPE-DLVY-ASSSET-IND  > ' '                        
                OR END-OF-ACTIVE-TRANSFERS-SW = 'Y'.                            
           EXEC SQL                                                             
              CLOSE TFRCSR_DUPE                                                 
           END-EXEC.                                                            
LRM029 0330-EXIT. EXIT.                                                         
                                                                                
LRM029 0332-FETCH-ACTIAST-CSH-RTN.                                              
           EXEC SQL                                                             
              FETCH                                                             
                  ACTIASTC_DUPE                                                 
                   INTO                                                 09160000
                  :WS-DUPE-RCV-NBR                                      09180000
                 ,:WS-DUPE-DLVR-ACCT                                    09180000
                 ,:WS-DUPE-ACCT-RCV-NBR                                         
                 ,:WS-DUPE-CNTL-NBR                                             
                 ,:WS-DUPE-TRNFR-TYPE-CD                                        
           END-EXEC.                                                            
           IF SQLCODE = 0                                                       
              IF WS-DUPE-RCV-NBR           = ACAT11IO-RCV-NBR           09180000
              AND WS-DUPE-DLVR-ACCT        = ACAT11IO-DLVR-ACCT         09180000
              AND WS-DUPE-ACCT-RCV-NBR     = ACAT11IO-RCV-ACCT                  
              AND WS-DUPE-CNTL-NBR         = ACAT11IO-CONTROL-NBR               
              AND WS-DUPE-TRNFR-TYPE-CD    = ACAT11IO-TRNFR-TYPE-CD             
                 CONTINUE                                                       
              ELSE                                                              
                 MOVE 'C' TO ACAT11IO-DUPE-DLVY-ASSSET-IND                      
           ELSE                                                                 
              MOVE 'Y' TO END-OF-ACTIAST-TRANSFERS-SW                           
           END-IF.                                                              
                                                                                
LRM029 0335-FETCH-ACTIVE-CSH-RTN.                                               
           EXEC SQL                                                             
              FETCH                                                             
                  TFRCSR_DUPE                                                   
                   INTO                                                 09160000
                  :WS-DUPE-CNTL-NBR                                             
           END-EXEC.                                                            
           IF SQLCODE NOT = 0                                                   
              MOVE 'Y' TO END-OF-ACTIVE-TRANSFERS-SW                            
           ELSE                                                                 
              EXEC SQL                                                          
                SELECT                                                  09170000
                   ACAT_CONTROL_NBR                                     09180000
                 INTO                                                           
                  :WS-DUPE-CNTL-NBR                                             
                FROM VASSET                                                     
                 WHERE (                                                        
                      CLIENT_NBR      =   :ACAT11IO-CLIENT-NBR          09180000
                  AND ACAT_CONTROL_NBR =  :WS-DUPE-CNTL-NBR             09180000
                  AND CSH_MGN_SHRT_CD  =  :WS-SEL-CSH-MGN-CD            09180000
                  AND STTLM_LCTN_CD = '40'                                      
                 )                                                      09150000
              END-EXEC                                                  09200000
              IF SQLCODE = +0 OR -811                                           
                 MOVE 'C' TO ACAT11IO-DUPE-DLVY-ASSSET-IND                      
           END-IF.                                                              
                                                                                
       0350-KEY-CHANGE-RTN.                                                     
NG ******* MUST INSERT NEW HEADER AND COPY ACROSS ASSETS IF ALLOWED...          
NG ******* THIS NEEDS REASEARCH.                                                
           PERFORM 0200-ISRT-ACTITRF.                                   09130000
                                                                                
           IF SQLCODE NOT = 0                                                   
              PERFORM 9000-WRITE-TO-CICS-LOG                                    
              PERFORM 9500-RETURN-DB2-ERROR                                     
           END-IF.                                                              
                                                                                
           PERFORM 0400-DELETE-ACTITRF.                                         
                                                                                
       0370-UPDATE-ACTIAST.                                                     
           MOVE WS-TIMESTAMP TO  UPDT-TMSTP OF DCLACTIAST.                      
           MOVE EIBTRMID TO CICS-TERM-ID-CD OF DCLACTIAST.                      
           IF ACAT11IO-MEMO-CD = 'SK'                                           
              MOVE 'SFK ' TO STTLM-RSN-CD OF DCLACTIAST                         
           ELSE                                                                 
              IF ACAT11IO-SLOC-RSN > SPACES                                     
                 MOVE ACAT11IO-SLOC-RSN TO STTLM-RSN-CD OF DCLACTIAST           
              ELSE                                                              
                 MOVE '    '            TO STTLM-RSN-CD OF DCLACTIAST           
           END-IF.                                                              
LRM008     IF  ACAT11IO-NSCC-WTHLD-CD = 'W'                                     
LRM008     OR ACAT11IO-NSCC-PEND-CD = 'H'                                       
LRM008        MOVE 'H' TO NSCC-PEND-CD OF DCLACTIAST                            
LRM008     ELSE                                                                 
LRM008        MOVE ' ' TO NSCC-PEND-CD OF DCLACTIAST                            
LRM008     END-IF.                                                              
CSG001* IN SOME CASES MSD DESCRIPTIONS CONTAIN SPECIAL CHARACTERS.              
CSG001* CORRECT THEM BY REPLACING SPECIAL CHARACTERS WITH SPACES.               
CSG001     MOVE ACAT11IO-DESC-TXT       TO WS-ASSET-DESC-TXT                    
CSG001     PERFORM 0231-EDIT-ASSET-DESC-TXT                                     
CSG001     MOVE WS-ASSET-DESC-TXT        TO ACAT11IO-DESC-TXT                   
LRM016*****IF ACAT11IO-STTLM-LCTN-CD = '35'                                     
LRM016********PERFORM 0225-GETMSD-OPTIONS-RTN                                   
LRM016********PERFORM 0227-BUILD-ACTIOPN                                        
LRM016*****END-IF.                                                              
LRM030*****IF  ACAT11IO-CURRENT-SECR = ACAT11IO-ISIN-SEC-ISSUE-CD               
LRM030     IF ACAT11IO-KEY-FIELDS NOT = ACAT11IO-CURRENT-ASSET-KEY              
           AND ACAT11IO-CURRENT-SLOC = ACAT11IO-STTLM-LCTN-CD                   
           AND ACAT11IO-CURRENT-TYPE = ACAT11IO-CSH-MGN-SHRT-CD                 
              EXEC SQL                                                  09140000
                UPDATE ACTIAST                                          09170000
                  SET                                                           
                   ASSET_PRC_CTGY_CD  =                                         
                   :ACAT11IO-ASSET-PRC-CTGY-CD                                  
                  ,ASSET_RQST_QTY_CD  =                                         
                   :ACAT11IO-ASSET-RQST-QTY-CD                                  
                  ,AST_RQST_TRANS_CD  =                                         
                   :ACAT11IO-AST-RQST-TRANS-CD                                  
                  ,WHI_CD             =                                         
                   :ACAT11IO-WHI-CD                                             
                  ,STTLM_RSN_CD       =                                 09180000
                   :ACAT11IO-SLOC-RSN                                           
                  ,PSTN_CD            =                                         
                   :ACAT11IO-PSTN-CD                                            
                  ,ASSET_DESC_TXT     =                                         
                   :ACAT11IO-DESC-TXT                                           
                  ,ASSET_AMT          =                                         
                   :ACAT11IO-ASSET-AMT                                          
                  ,ASSET_QTY          =                                         
                   :ACAT11IO-ASSET-QTY                                          
                  ,ASSET_PCT          =                                         
                   :ACAT11IO-ASSET-PCT                                          
                  ,ASSET_CMNT_TXT     =                                         
                   :ACAT11IO-ASSET-CMNT-TXT                                     
                  ,SECURITY_ADP_NBR   =                                         
                   :ACAT11IO-ADP-NBR                                            
                  ,CICS_TERM_ID_CD   =                                          
                    :DCLACTIAST.CICS-TERM-ID-CD                                 
                  ,UPDT_TMSTP        =                                          
                    :WS-TIMESTAMP                                               
LRM008            ,NSCC_PEND_CD     =                                           
LRM008              :DCLACTIAST.NSCC-PEND-CD                                    
LRM008            ,NSCC_WTHLD_CD     =                                          
LRM008              :ACAT11IO-NSCC-WTHLD-CD                                     
                  ,CICS_SGNON_ID     =                                          
                    :ACAT11IO-SIGN-ON-ID                                        
LRM028            ,CICS_NET_NM       =                                          
LRM028              :ACAT11IO-NETNAME                                           
LRM028            ,TPSCRT_USR_ID     =                                          
LRM028              :ACAT11IO-USER-ID                                           
LRM028            ,TPSCRT_USR_NM     =                                          
LRM028              :ACAT11IO-USER-NAME                                         
               WHERE                                                            
                  (CLIENT_NBR    =                                      09180000
                    :ACAT11IO-CLIENT-NBR   AND                          09190000
LRM016             ACAT_CONTROL_NBR =                                   09180000
LRM016              :ACAT11IO-CONTROL-NBR  AND                                  
                   DLVR_NBR      =                                      09150000
                    :ACAT11IO-DLVR-NBR          AND                     09190000
                   ACCT_DLVR_NBR =                                      09180000
                    :ACAT11IO-DLVR-ACCT         AND                     09190000
                   RCV_NBR       =                                      09180000
                    :ACAT11IO-RCV-NBR           AND                     09190000
                   ACCT_RCV_NBR  =                                      09180000
                    :ACAT11IO-RCV-ACCT          AND                     09190000
                   ISIN_SEC_ISSUE_CD =                                  09180000
                    :ACAT11IO-ISIN-SEC-ISSUE-CD AND                             
                   ISIN_SEC_CDG_CD   =                                  09180000
                    :ACAT11IO-ISIN-SEC-CDG-CD   AND                             
                   STTLM_LCTN_CD     =                                  09180000
                    :ACAT11IO-STTLM-LCTN-CD     AND                             
                   CSH_MGN_SHRT_CD   =                                  09180000
                    :ACAT11IO-CSH-MGN-SHRT-CD                                   
                 )                                                      09150000
093200         END-EXEC                                                 09200000
LRM016*************ISIN_CNTRY_CD  =                                     09180000
LRM016**************:ACAT11IO-ISIN-CNTRY-CD     AND                             
                                                                                
093400        EVALUATE SQLCODE                                          09220000
093500             WHEN +0                                              09230000
093600               SET ACAT11IO-GOOD-RESP TO TRUE                     09240000
094000          WHEN OTHER                                              09280000
                     SET ACAT11IO-DB2-ERROR TO TRUE                             
                     PERFORM 9000-WRITE-TO-CICS-LOG                             
                     PERFORM 9500-RETURN-DB2-ERROR                              
094200        END-EVALUATE                                              09300000
           ELSE                                                                 
              PERFORM 0420-DELETE-ACTIAST                                       
              PERFORM 0220-ISRT-ACTIAST THRU 0220-EXIT                     09130
           END-IF.                                                              
LRM003 0380-SUMMARIZE-PTR-DLVY-RTN.                                             
LRM003*---------------------------------------------------------------*         
LRM003* AT THIS POINT, WE TRIED TO INSERT A DLVY ASSET AND ALREADY    *         
LRM003* HAVE ONE WITH THIS KEY PRESENT.  VERIFY TIMESTAMP CURRENT,    *         
LRM003* (WOULD BE FROM THIS TASK), IF SO, SUM AMTS AND REDUCE TO NOT  *         
LRM003* EXCEED B212.  TIMESTAMP NOT =, DELETE AND INSERT NEW ASSET.   *         
LRM003*---------------------------------------------------------------*         
           PERFORM 0385-READ-ACTIAST.                                           
LRM003*    IF SQLCODE = +0                                              09220000
LRM003*    AND UPDT-TMSTP OF DCLACTIAST NOT = WS-TIMESTAMP                      
LRM003*       MOVE ACAT11IO-STTLM-LCTN-CD TO ACAT11IO-CURRENT-SLOC              
LRM003*       MOVE ACAT11IO-CSH-MGN-SHRT-CD TO ACAT11IO-CURRENT-TYPE            
LRM003*       MOVE SPACES TO ACAT11IO-CURRENT-SECR                              
LRM003*       PERFORM 0420-DELETE-ACTIAST                                       
LRM003*       SET RETRY-INSERT-MODE TO TRUE                                     
LRM003*       SUBTRACT 1 FROM WS-PTR-RECORDS-INSERTED                           
LRM003*       GO TO 0380-EXIT                                                   
LRM003*    END-IF.                                                              
                                                                                
           SET NO-RETRY-INSERT-MODE TO TRUE.                                    
           IF SQLCODE NOT = +0                                          09220000
              GO TO 0380-EXIT                                                   
           END-IF.                                                              
LRM003*** SUM THESE TOGETHER, NO CONCERN ABOUT B212 IN MEMO MODE                
      *** CASH ASSETS                                                           
           MOVE ZEROS TO WS-CASH-AMT.                                           
           IF ACAT11IO-STTLM-LCTN-CD = '40'                                     
              IF ACAT11IO-CSH-MGN-SHRT-CD = 'C'                                 
                 IF STTLM-RSN-CD OF DCLACTIAST = 'CRED'                         
                    SUBTRACT ASSET-AMT OF DCLACTIAST FROM WS-CASH-AMT           
                 ELSE                                                           
                    ADD      ASSET-AMT OF DCLACTIAST TO    WS-CASH-AMT          
                 END-IF                                                         
                 IF ACAT11IO-AMT-01-CREDIT                                      
                    SUBTRACT ACAT11IO-AMT-01          FROM WS-CASH-AMT          
                 ELSE                                                           
                    ADD      ACAT11IO-AMT-01          TO   WS-CASH-AMT          
                 END-IF                                                         
LRM003*          IF WS-MRGN-BAL-TYPE1 = ZERO                                    
LRM003*             MOVE WS-MRGN-BAL-TYPE1 TO WS-CASH-AMT                       
LRM003*          ELSE                                                           
LRM003*             IF WS-CASH-AMT < ZERO                                       
LRM003*             AND WS-CASH-AMT < WS-MRGN-BAL-TYPE1                         
LRM003*               IF WS-MRGN-BAL-TYPE1 < ZERO                               
LRM003*                  MOVE WS-MRGN-BAL-TYPE1 TO WS-CASH-AMT                  
LRM003*               ELSE                                                      
LRM003*                  MOVE ZERO              TO WS-CASH-AMT                  
LRM003*               END-IF                                                    
LRM003*             ELSE                                                        
LRM003*                IF WS-CASH-AMT > ZERO                                    
LRM003*                AND WS-CASH-AMT > WS-MRGN-BAL-TYPE1                      
LRM003*                 IF WS-MRGN-BAL-TYPE1 > ZERO                             
LRM003*                   MOVE WS-MRGN-BAL-TYPE1 TO WS-CASH-AMT                 
LRM003*                 ELSE                                                    
LRM003*                   MOVE ZERO              TO WS-CASH-AMT                 
LRM003*                END-IF                                                   
LRM003*          END-IF END-IF END-IF                                           
                 IF WS-CASH-AMT < ZERO                                          
                    MULTIPLY WS-CASH-AMT BY -1  GIVING ACAT11IO-AMT-01          
                    SET ACAT11IO-AMT-01-CREDIT TO TRUE                          
                 ELSE                                                           
                    MOVE WS-CASH-AMT                TO ACAT11IO-AMT-01          
                    MOVE SPACES TO ACAT11IO-AMT-01-CREDIT-IND                   
                 END-IF                                                         
                 MOVE ACAT11IO-AMT-01-CREDIT-IND TO WS-STTLM-RSN-CD             
              ELSE                                                              
              IF ACAT11IO-CSH-MGN-SHRT-CD = 'M'                                 
                 IF STTLM-RSN-CD OF DCLACTIAST = 'CRED'                         
                    SUBTRACT ASSET-AMT OF DCLACTIAST FROM WS-CASH-AMT           
                 ELSE                                                           
                    ADD      ASSET-AMT OF DCLACTIAST TO    WS-CASH-AMT          
                 END-IF                                                         
                 IF ACAT11IO-AMT-02-CREDIT                                      
                    SUBTRACT ACAT11IO-AMT-02          FROM WS-CASH-AMT          
                 ELSE                                                           
                    ADD      ACAT11IO-AMT-02          TO   WS-CASH-AMT          
                 END-IF                                                         
LRM003*          IF WS-MRGN-BAL-TYPE2 = ZERO                                    
LRM003*             MOVE WS-MRGN-BAL-TYPE2 TO WS-CASH-AMT                       
LRM003*          ELSE                                                           
LRM003*             IF WS-CASH-AMT < ZERO                                       
LRM003*             AND WS-CASH-AMT < WS-MRGN-BAL-TYPE2                         
LRM003*               IF WS-MRGN-BAL-TYPE2 < ZERO                               
LRM003*                 MOVE WS-MRGN-BAL-TYPE2 TO WS-CASH-AMT                   
LRM003*               ELSE                                                      
LRM003*                 MOVE ZERO              TO WS-CASH-AMT                   
LRM003*               END-IF                                                    
LRM003*             ELSE                                                        
LRM003*                IF WS-CASH-AMT > ZERO                                    
LRM003*                AND WS-CASH-AMT > WS-MRGN-BAL-TYPE2                      
LRM003*                 IF WS-MRGN-BAL-TYPE2 > ZERO                             
LRM003*                   MOVE WS-MRGN-BAL-TYPE2 TO WS-CASH-AMT                 
LRM003*                 ELSE                                                    
LRM003*                   MOVE ZERO              TO WS-CASH-AMT                 
LRM003*                 END-IF                                                  
LRM003*          END-IF END-IF END-IF                                           
                 IF WS-CASH-AMT < ZERO                                          
                    MULTIPLY WS-CASH-AMT BY -1  GIVING ACAT11IO-AMT-02          
                    SET ACAT11IO-AMT-02-CREDIT TO TRUE                          
                 ELSE                                                           
                    MOVE WS-CASH-AMT                TO ACAT11IO-AMT-02          
                    MOVE SPACES TO ACAT11IO-AMT-02-CREDIT-IND                   
                 END-IF                                                         
                 MOVE ACAT11IO-AMT-02-CREDIT-IND TO WS-STTLM-RSN-CD             
              ELSE                                                              
              IF ACAT11IO-CSH-MGN-SHRT-CD = 'S'                                 
                 IF STTLM-RSN-CD OF DCLACTIAST = 'CRED'                         
                    SUBTRACT ASSET-AMT OF DCLACTIAST FROM WS-CASH-AMT           
                 ELSE                                                           
                    ADD      ASSET-AMT OF DCLACTIAST TO    WS-CASH-AMT          
                 END-IF                                                         
                 IF ACAT11IO-AMT-05-CREDIT                                      
                    SUBTRACT ACAT11IO-AMT-05          FROM WS-CASH-AMT          
                 ELSE                                                           
                    ADD      ACAT11IO-AMT-05          TO   WS-CASH-AMT          
                 END-IF                                                         
LRM003*          IF WS-MRGN-BAL-TYPE5 = ZERO                                    
LRM003*             MOVE WS-MRGN-BAL-TYPE5 TO WS-CASH-AMT                       
LRM003*          ELSE                                                           
LRM003*             IF WS-CASH-AMT < ZERO                                       
LRM003*             AND WS-CASH-AMT < WS-MRGN-BAL-TYPE5                         
LRM003*             AND WS-MRGN-BAL-TYPE5 < ZERO                                
LRM003*                MOVE WS-MRGN-BAL-TYPE5 TO WS-CASH-AMT                    
LRM003*             ELSE                                                        
LRM003*                IF WS-CASH-AMT > ZERO                                    
LRM003*                AND WS-CASH-AMT > WS-MRGN-BAL-TYPE5                      
LRM003*                  IF WS-MRGN-BAL-TYPE5 > ZERO                            
LRM003*                    MOVE WS-MRGN-BAL-TYPE5 TO WS-CASH-AMT                
LRM003*                  ELSE                                                   
LRM003*                    MOVE ZERO              TO WS-CASH-AMT                
LRM003*                 END-IF                                                  
LRM003*          END-IF END-IF END-IF                                           
                 IF WS-CASH-AMT < ZERO                                          
                    MULTIPLY WS-CASH-AMT BY -1  GIVING ACAT11IO-AMT-05          
                    SET ACAT11IO-AMT-05-CREDIT TO TRUE                          
                 ELSE                                                           
                    MOVE WS-CASH-AMT                TO ACAT11IO-AMT-05          
                    MOVE SPACES TO ACAT11IO-AMT-05-CREDIT-IND                   
                 END-IF                                                         
                 MOVE ACAT11IO-AMT-05-CREDIT-IND TO WS-STTLM-RSN-CD             
              END-IF END-IF END-IF                                              
              IF WS-CASH-AMT = ZERO                                             
                 MOVE ACAT11IO-STTLM-LCTN-CD TO ACAT11IO-CURRENT-SLOC           
                 MOVE ACAT11IO-CSH-MGN-SHRT-CD TO ACAT11IO-CURRENT-TYPE         
                 MOVE SPACES TO ACAT11IO-CURRENT-SECR                           
                 PERFORM 0420-DELETE-ACTIAST                                    
                 SUBTRACT 1 FROM WS-PTR-RECORDS-INSERTED                        
              ELSE                                                              
                 PERFORM 0390-UPDATE-AMT-RTN                                    
              END-IF                                                            
              SUBTRACT 1 FROM WS-PTR-RECORDS-INSERTED                           
              GO TO 0380-EXIT                                                   
           END-IF.                                                              
                                                                                
LRM003 0380-EXIT. EXIT.                                                         
                                                                                
LRM003 0385-READ-ACTIAST.                                                       
           EXEC SQL                                                     09140000
               SELECT                                                   09170000
                   ASSET_QTY                                                    
                  ,PSTN_CD                                                      
                  ,STTLM_RSN_CD                                                 
                  ,ASSET_AMT                                                    
                  ,UPDT_TMSTP                                                   
                  ,ASSET_DESC_TXT                                               
                  ,ASSET_PRC_CTGY_CD                                            
                  ,WHI_CD                                                       
                  ,ASSET_CMNT_TXT                                               
               INTO                                                             
                  :DCLACTIAST.ASSET-QTY                                         
                 ,:DCLACTIAST.PSTN-CD                                           
                 ,:DCLACTIAST.STTLM-RSN-CD                                      
                 ,:DCLACTIAST.ASSET-AMT                                         
                 ,:DCLACTIAST.UPDT-TMSTP                                        
                 ,:DCLACTIAST.ASSET-DESC-TXT                                    
                 ,:DCLACTIAST.ASSET-PRC-CTGY-CD                                 
                 ,:DCLACTIAST.WHI-CD                                            
                 ,:DCLACTIAST.ASSET-CMNT-TXT                                    
              FROM ACTIAST                                                      
              WHERE (                                                           
                   CLIENT_NBR      =   :ACAT11IO-CLIENT-NBR             09180000
               AND DLVR_NBR        =   :ACAT11IO-DLVR-NBR               09150000
               AND ACCT_DLVR_NBR   =   :ACAT11IO-DLVR-ACCT              09180000
               AND RCV_NBR         =   :ACAT11IO-RCV-NBR                09180000
               AND ACCT_RCV_NBR    =   :ACAT11IO-RCV-ACCT               09180000
               AND ISIN_CNTRY_CD   =   :ACAT11IO-ISIN-CNTRY-CD                  
               AND ISIN_SEC_ISSUE_CD = :ACAT11IO-ISIN-SEC-ISSUE-CD              
               AND ISIN_SEC_CDG_CD =   :ACAT11IO-ISIN-SEC-CDG-CD                
               AND STTLM_LCTN_CD   =   :ACAT11IO-STTLM-LCTN-CD                  
               AND CSH_MGN_SHRT_CD =   :ACAT11IO-CSH-MGN-SHRT-CD                
LRM022         AND ACAT_CONTROL_NBR =  :ACAT11IO-CONTROL-NBR            09180000
                 )                                                      09150000
           END-EXEC.                                                    09200000
                                                                                
LRM022 0387-READ-ACTIAST-BY-SECID.                                              
LRM022     EXEC SQL                                                     09140000
LRM022         SELECT                                                   09170000
LRM022             ASSET_QTY                                                    
LRM022            ,PSTN_CD                                                      
LRM022            ,STTLM_LCTN_CD                                        09180000
LRM022            ,STTLM_RSN_CD                                                 
LRM022            ,ASSET_AMT                                                    
LRM022            ,UPDT_TMSTP                                                   
LRM022            ,ASSET_DESC_TXT                                               
LRM022            ,ASSET_PRC_CTGY_CD                                            
LRM022            ,WHI_CD                                                       
LRM048            ,WHI_STTS_CD                                                  
LRM022            ,ASSET_CMNT_TXT                                               
LRM022         INTO                                                             
LRM022            :DCLACTIAST.ASSET-QTY                                         
LRM022           ,:DCLACTIAST.PSTN-CD                                           
LRM022           ,:DCLACTIAST.STTLM-LCTN-CD                             09180000
LRM022           ,:DCLACTIAST.STTLM-RSN-CD                                      
LRM022           ,:DCLACTIAST.ASSET-AMT                                         
LRM022           ,:DCLACTIAST.UPDT-TMSTP                                        
LRM022           ,:DCLACTIAST.ASSET-DESC-TXT                                    
LRM022           ,:DCLACTIAST.ASSET-PRC-CTGY-CD                                 
LRM022           ,:DCLACTIAST.WHI-CD                                            
LRM048           ,:DCLACTIAST.WHI-STTS-CD                                       
LRM022           ,:DCLACTIAST.ASSET-CMNT-TXT                                    
LRM022        FROM ACTIAST                                                      
LRM022        WHERE (                                                           
LRM022             CLIENT_NBR      =   :ACAT11IO-CLIENT-NBR             09180000
LRM022         AND DLVR_NBR        =   :ACAT11IO-DLVR-NBR               09150000
LRM022         AND ACCT_DLVR_NBR   =   :ACAT11IO-DLVR-ACCT              09180000
LRM022         AND RCV_NBR         =   :ACAT11IO-RCV-NBR                09180000
LRM022         AND ACCT_RCV_NBR    =   :ACAT11IO-RCV-ACCT               09180000
LRM022         AND ISIN_SEC_ISSUE_CD = :ACAT11IO-ISIN-SEC-ISSUE-CD              
LRM022         AND SECURITY_ADP_NBR  = :ACAT11IO-ADP-NBR                        
LRM022         AND CSH_MGN_SHRT_CD   = :ACAT11IO-CSH-MGN-SHRT-CD                
LRM022         AND ACAT_CONTROL_NBR  = :ACAT11IO-CONTROL-NBR            09180000
LRM025         AND TRNFR_TYPE_CD     = :ACAT11IO-TRNFR-TYPE-CD          09180000
LRM022           )                                                      09150000
LRM022     END-EXEC.                                                    09200000
       0390-UPDATE-AMT-RTN.                                                     
           IF ACAT11IO-CSH-MGN-SHRT-CD = 'C'                                    
             EXEC SQL                                                   09140000
               UPDATE ACTIAST                                           09170000
                  SET ASSET_AMT      = :ACAT11IO-AMT-01                         
                     ,STTLM_RSN_CD   = :WS-STTLM-RSN-CD                         
                     ,ASSET_CMNT_TXT = :WS-CMNT-TXT                             
              WHERE (                                                           
                   CLIENT_NBR      =   :ACAT11IO-CLIENT-NBR             09180000
LRM016         AND ACAT_CONTROL_NBR =                                   09180000
LRM016                                 :ACAT11IO-CONTROL-NBR                    
               AND DLVR_NBR        =   :ACAT11IO-DLVR-NBR               09150000
               AND ACCT_DLVR_NBR   =   :ACAT11IO-DLVR-ACCT              09180000
               AND RCV_NBR         =   :ACAT11IO-RCV-NBR                09180000
               AND ACCT_RCV_NBR    =   :ACAT11IO-RCV-ACCT               09180000
               AND ISIN_CNTRY_CD   =   :ACAT11IO-ISIN-CNTRY-CD                  
               AND ISIN_SEC_ISSUE_CD = :ACAT11IO-ISIN-SEC-ISSUE-CD              
               AND ISIN_SEC_CDG_CD =   :ACAT11IO-ISIN-SEC-CDG-CD                
               AND STTLM_LCTN_CD   =   :ACAT11IO-STTLM-LCTN-CD                  
               AND CSH_MGN_SHRT_CD =   :ACAT11IO-CSH-MGN-SHRT-CD                
LRM025         AND TRNFR_TYPE_CD     = :ACAT11IO-TRNFR-TYPE-CD          09180000
                 )                                                      09150000
             END-EXEC                                                   09200000
           ELSE                                                                 
           IF ACAT11IO-CSH-MGN-SHRT-CD = 'M'                                    
             EXEC SQL                                                   09140000
               UPDATE ACTIAST                                           09170000
                  SET ASSET_AMT =    :ACAT11IO-AMT-02                           
                     ,STTLM_RSN_CD = :WS-STTLM-RSN-CD                           
              WHERE (                                                           
                   CLIENT_NBR      =   :ACAT11IO-CLIENT-NBR             09180000
LRM016         AND ACAT_CONTROL_NBR =                                   09180000
LRM016                                 :ACAT11IO-CONTROL-NBR                    
               AND DLVR_NBR        =   :ACAT11IO-DLVR-NBR               09150000
               AND ACCT_DLVR_NBR   =   :ACAT11IO-DLVR-ACCT              09180000
               AND RCV_NBR         =   :ACAT11IO-RCV-NBR                09180000
               AND ACCT_RCV_NBR    =   :ACAT11IO-RCV-ACCT               09180000
               AND ISIN_CNTRY_CD   =   :ACAT11IO-ISIN-CNTRY-CD                  
               AND ISIN_SEC_ISSUE_CD = :ACAT11IO-ISIN-SEC-ISSUE-CD              
               AND ISIN_SEC_CDG_CD =   :ACAT11IO-ISIN-SEC-CDG-CD                
               AND STTLM_LCTN_CD   =   :ACAT11IO-STTLM-LCTN-CD                  
               AND CSH_MGN_SHRT_CD =   :ACAT11IO-CSH-MGN-SHRT-CD                
LRM025         AND TRNFR_TYPE_CD     = :ACAT11IO-TRNFR-TYPE-CD          09180000
                 )                                                      09150000
             END-EXEC                                                   09200000
           ELSE                                                                 
             EXEC SQL                                                   09140000
               UPDATE ACTIAST                                           09170000
                  SET ASSET_AMT =    :ACAT11IO-AMT-05                           
                     ,STTLM_RSN_CD = :WS-STTLM-RSN-CD                           
              WHERE (                                                           
                   CLIENT_NBR      =   :ACAT11IO-CLIENT-NBR             09180000
LRM016         AND ACAT_CONTROL_NBR =                                   09180000
LRM016                                 :ACAT11IO-CONTROL-NBR                    
               AND DLVR_NBR        =   :ACAT11IO-DLVR-NBR               09150000
               AND ACCT_DLVR_NBR   =   :ACAT11IO-DLVR-ACCT              09180000
               AND RCV_NBR         =   :ACAT11IO-RCV-NBR                09180000
               AND ACCT_RCV_NBR    =   :ACAT11IO-RCV-ACCT               09180000
               AND ISIN_CNTRY_CD   =   :ACAT11IO-ISIN-CNTRY-CD                  
               AND ISIN_SEC_ISSUE_CD = :ACAT11IO-ISIN-SEC-ISSUE-CD              
               AND ISIN_SEC_CDG_CD =   :ACAT11IO-ISIN-SEC-CDG-CD                
               AND STTLM_LCTN_CD   =   :ACAT11IO-STTLM-LCTN-CD                  
               AND CSH_MGN_SHRT_CD =   :ACAT11IO-CSH-MGN-SHRT-CD                
LRM025         AND TRNFR_TYPE_CD     = :ACAT11IO-TRNFR-TYPE-CD          09180000
                 )                                                      09150000
             END-EXEC                                                   09200000
           END-IF.                                                              
           SKIP3                                                                
       0400-DELETE-ACTITRF.                                                     
           EXEC SQL                                                     09140000
               DELETE FROM ACTITRF                                      09170000
              WHERE                                                             
                  (CLIENT_NBR    =                                      09180000
                    :ACAT11IO-CLIENT-NBR   AND                          09190000
LRM007             ACAT_CONTROL_NBR =                                           
LRM007              :ACAT11IO-CONTROL-NBR   AND                                 
                   DLVR_NBR      =                                      09150000
                    :ACAT11IO-DLVR-NBR     AND                          09190000
                   ACCT_DLVR_NBR =                                      09180000
                    :ACAT11IO-DLVR-ACCT    AND                          09190000
                   RCV_NBR       =                                      09180000
                    :ACAT11IO-RCV-NBR      AND                          09190000
                   ACCT_RCV_NBR  =                                      09180000
                    :ACAT11IO-RCV-ACCT     AND                          09190000
LRM009             TRNFR_TYPE_CD =                                      09180000
LRM009              :ACAT11IO-TRNFR-TYPE-CD                                     
                 )                                                      09150000
093200     END-EXEC.                                                    09200000
                                                                                
           IF ACAT11IO-IT-REJECT                                                
              SET ACAT11IO-GOOD-RESP TO TRUE                                    
           ELSE                                                                 
093400     EVALUATE SQLCODE                                             09220000
093500          WHEN +0                                                 09230000
093600               SET ACAT11IO-GOOD-RESP TO TRUE                     09240000
093500          WHEN +100                                               09230000
                     CONTINUE                                                   
094000          WHEN OTHER                                              09280000
                     SET ACAT11IO-DB2-ERROR TO TRUE                             
                     PERFORM 9000-WRITE-TO-CICS-LOG                             
                     PERFORM 9500-RETURN-DB2-ERROR                              
094200     END-EVALUATE.                                                09300000
      *--------------------------------------------------------------*          
      * THERE IS NO FOREIGN KEY FROM INITIAL TRANSFER TO INIT ASSET.            
      * MUST ISSUE GENERIC DELETE TO WIPE THEM (IF ANY).                        
      *--------------------------------------------------------------*          
           IF NOT ACAT11IO-IT-REJECT                                            
              PERFORM 0410-DELETE-ALL-ASSETS-IN-TIF                             
           END-IF.                                                              
           IF ACAT11IO-CONTROL-NBR > SPACES                                     
              PERFORM 0440-SET-PTR-NOT-SUBMITTED                                
           END-IF.                                                              
           EJECT                                                                
       0410-DELETE-ALL-ASSETS-IN-TIF.                                           
           EXEC SQL                                                     09140000
               DELETE FROM ACTIAST                                      09170000
              WHERE                                                             
                  (CLIENT_NBR    =                                      09180000
                    :ACAT11IO-CLIENT-NBR   AND                          09190000
LRM007             ACAT_CONTROL_NBR =                                           
LRM007              :ACAT11IO-CONTROL-NBR   AND                                 
                   DLVR_NBR      =                                      09150000
                    :ACAT11IO-DLVR-NBR     AND                          09190000
                   ACCT_DLVR_NBR =                                      09180000
                    :ACAT11IO-DLVR-ACCT    AND                          09190000
                   RCV_NBR       =                                      09180000
                    :ACAT11IO-RCV-NBR      AND                          09190000
                   ACCT_RCV_NBR  =                                      09180000
                    :ACAT11IO-RCV-ACCT     AND                          09190000
LRM009             TRNFR_TYPE_CD =                                      09180000
LRM009              :ACAT11IO-TRNFR-TYPE-CD                                     
                 )                                                      09150000
093200     END-EXEC.                                                    09200000
                                                                                
           IF ACAT11IO-IT-REJECT                                                
              CONTINUE                                                          
           ELSE                                                                 
093400     EVALUATE SQLCODE                                             09220000
093500          WHEN +0                                                 09230000
093600               SET ACAT11IO-GOOD-RESP TO TRUE                     09240000
                WHEN +100                                               09230000
                     SET ACAT11IO-GOOD-RESP TO TRUE                     09240000
094000          WHEN OTHER                                              09280000
                     SET ACAT11IO-DB2-ERROR TO TRUE                             
                     PERFORM 9000-WRITE-TO-CICS-LOG                             
                     PERFORM 9500-RETURN-DB2-ERROR                              
094200     END-EVALUATE.                                                09300000
           EJECT                                                                
       0420-DELETE-ACTIAST.                                                     
           EXEC SQL                                                     09140000
               DELETE FROM ACTIAST                                      09170000
              WHERE                                                             
                  (CLIENT_NBR    =                                      09180000
                    :ACAT11IO-CLIENT-NBR   AND                          09190000
LRM007             ACAT_CONTROL_NBR =                                           
LRM007              :ACAT11IO-CONTROL-NBR   AND                                 
                   DLVR_NBR      =                                      09150000
                    :ACAT11IO-DLVR-NBR          AND                     09190000
                   ACCT_DLVR_NBR =                                      09180000
                    :ACAT11IO-DLVR-ACCT         AND                     09190000
                   RCV_NBR       =                                      09180000
                    :ACAT11IO-RCV-NBR           AND                     09190000
                   ACCT_RCV_NBR  =                                      09180000
                    :ACAT11IO-RCV-ACCT          AND                     09190000
                   ISIN_SEC_ISSUE_CD =                                  09180000
                    :ACAT11IO-CURRENT-SECR      AND                             
                   ISIN_SEC_CDG_CD   =                                  09180000
                    :ACAT11IO-ISIN-SEC-CDG-CD   AND                             
                   STTLM_LCTN_CD     =                                  09180000
                    :ACAT11IO-CURRENT-SLOC      AND                             
                   CSH_MGN_SHRT_CD   =                                  09180000
                    :ACAT11IO-CURRENT-TYPE                                      
                 )                                                      09150000
093200     END-EXEC.                                                    09200000
LRM003***          ISIN_CNTRY_CD  =                                     09180000
LRM003***           :ACAT11IO-ISIN-CNTRY-CD     AND                             
                                                                                
093400     EVALUATE SQLCODE                                             09220000
093500          WHEN +0                                                 09230000
093600               SET ACAT11IO-GOOD-RESP TO TRUE                     09240000
094000          WHEN OTHER                                              09280000
                     SET ACAT11IO-DB2-ERROR TO TRUE                             
                     PERFORM 9000-WRITE-TO-CICS-LOG                             
                     PERFORM 9500-RETURN-DB2-ERROR                              
094200     END-EVALUATE.                                                09300000
           EJECT                                                                
       0430-DELETE-ALL-ASSETS-AMOUNTS.                                          
           EXEC SQL                                                     09140000
               DELETE FROM ACTIAST                                      09170000
              WHERE                                                             
                  (CLIENT_NBR    =                                      09180000
                    :ACAT11IO-CLIENT-NBR   AND                          09190000
LRM008             ACAT_CONTROL_NBR =                                   09180000
LRM008              :ACAT11IO-CONTROL-NBR  AND                                  
                   DLVR_NBR      =                                      09150000
                    :ACAT11IO-DLVR-NBR          AND                     09190000
                   ACCT_DLVR_NBR =                                      09180000
                    :ACAT11IO-DLVR-ACCT         AND                     09190000
                   RCV_NBR       =                                      09180000
                    :ACAT11IO-RCV-NBR           AND                     09190000
                   ACCT_RCV_NBR  =                                      09180000
                    :ACAT11IO-RCV-ACCT          AND                     09190000
                   ISIN_CNTRY_CD =                                      09180000
                        '  '                    AND                     09190000
                   ISIN_SEC_ISSUE_CD =                                  09180000
                      '         '               AND                     09190000
                    STTLM_LCTN_CD  =                                            
                       '40'                     AND                             
LRM008             TRNFR_TYPE_CD =                                      09180000
LRM008              :ACAT11IO-TRNFR-TYPE-CD                                     
                 )                                                      09150000
093200     END-EXEC.                                                    09200000
                                                                                
093400     EVALUATE SQLCODE                                             09220000
093500          WHEN +0                                                 09230000
093600               CONTINUE                                           09240000
                WHEN +100                                               09230000
                     CONTINUE                                           09240000
094000          WHEN OTHER                                              09280000
                     SET ACAT11IO-DB2-ERROR TO TRUE                             
                     PERFORM 9000-WRITE-TO-CICS-LOG                             
                     PERFORM 9500-RETURN-DB2-ERROR                              
094200     END-EVALUATE.                                                09300000
           EXEC SQL                                                     09140000
               DELETE FROM ACTIAST                                      09170000
              WHERE                                                             
                  (CLIENT_NBR    =                                      09180000
                    :ACAT11IO-CLIENT-NBR   AND                          09190000
LRM008             ACAT_CONTROL_NBR =                                   09180000
LRM008              :ACAT11IO-CONTROL-NBR  AND                                  
                   DLVR_NBR      =                                      09150000
                    :ACAT11IO-DLVR-NBR          AND                     09190000
                   ACCT_DLVR_NBR =                                      09180000
                    :ACAT11IO-DLVR-ACCT         AND                     09190000
                   RCV_NBR       =                                      09180000
                    :ACAT11IO-RCV-NBR           AND                     09190000
                   ACCT_RCV_NBR  =                                      09180000
                    :ACAT11IO-RCV-ACCT          AND                     09190000
                   ISIN_CNTRY_CD =                                      09180000
                        '  '                    AND                     09190000
                   ISIN_SEC_ISSUE_CD =                                  09180000
                      '         '               AND                     09190000
                   STTLM_RSN_CD  =                                      09180000
                                'SMA '          AND                     09190000
LRM008             TRNFR_TYPE_CD =                                      09180000
LRM008              :ACAT11IO-TRNFR-TYPE-CD                                     
                 )                                                      09150000
093200     END-EXEC.                                                    09200000
                                                                                
093400     EVALUATE SQLCODE                                             09220000
093500          WHEN +0                                                 09230000
093600               SET ACAT11IO-GOOD-RESP TO TRUE                     09240000
                WHEN +100                                               09230000
                     SET ACAT11IO-GOOD-RESP TO TRUE                     09240000
094000          WHEN OTHER                                              09280000
                     SET ACAT11IO-DB2-ERROR TO TRUE                             
                     PERFORM 9000-WRITE-TO-CICS-LOG                             
                     PERFORM 9500-RETURN-DB2-ERROR                              
094200     END-EVALUATE.                                                09300000
                                                                                
       0440-SET-PTR-NOT-SUBMITTED.                                              
           EXEC SQL                                                     09140000
               UPDATE VTRNFR                                            09170000
                 SET                                                            
                   ACCT_RJCT_RSBM_IND =                                         
                    ' '                                                         
              WHERE                                                             
                  (CLIENT_NBR    =                                      09180000
                    :ACAT11IO-CLIENT-NBR   AND                          09190000
                   ACAT_CONTROL_NBR  =                                  09180000
                    :ACAT11IO-CONTROL-NBR  AND                                  
                   TRNFR_TYPE_CD =                                      09180000
                    'PTR'                                                       
                  )                                                     09150000
           END-EXEC.                                                    09200000
                                                                                
           EVALUATE SQLCODE                                             09220000
               WHEN +0                                                  09230000
                  CONTINUE                                              09240000
               WHEN +100                                                09230000
                  CONTINUE                                              09240000
               WHEN OTHER                                               09280000
                  SET ACAT11IO-DB2-ERROR TO TRUE                                
                  PERFORM 9000-WRITE-TO-CICS-LOG                                
                  PERFORM 9500-RETURN-DB2-ERROR                                 
           END-EVALUATE.                                                09300000
LRM017 0450-UPDATE-FRZN-IND.                                                    
           MOVE WS-TIMESTAMP TO  UPDT-TMSTP OF DCLVTRNFR                        
                                 ACAT11IO-UPDT-TMSTP.                           
           MOVE EIBTRMID TO CICS-TERM-ID-CD OF DCLVTRNFR.                       
           EXEC SQL                                                     09140000
               UPDATE VTRNFR                                            09170000
                 SET                                                            
                   ACCT_FRZN_IND     =                                          
                    'O'                                                         
                  ,UPDT_TMSTP        =                                          
                    :DCLVTRNFR.UPDT-TMSTP                                       
                  ,CICS_TERM_ID_CD   =                                          
                    :ACAT11IO-EIBTRMID                                          
                  ,PRGM_NM           =                                          
                    'ACAT11DB'                                                  
              WHERE                                                             
                  (CLIENT_NBR    =                                      09180000
                    :ACAT11IO-CLIENT-NBR   AND                          09190000
                   ACAT_CONTROL_NBR  =                                  09180000
                    :ACAT11IO-CONTROL-NBR  AND                                  
                   TRNFR_TYPE_CD =                                      09180000
                    'PTR'                                                       
                  )                                                     09150000
093200     END-EXEC.                                                    09200000
                                                                                
           EVALUATE SQLCODE                                             09220000
               WHEN +0                                                  09230000
                  CONTINUE                                              09240000
               WHEN +100                                                09230000
                  CONTINUE                                              09240000
               WHEN OTHER                                               09280000
                  SET ACAT11IO-DB2-ERROR TO TRUE                                
                  PERFORM 9000-WRITE-TO-CICS-LOG                                
                  PERFORM 9500-RETURN-DB2-ERROR                                 
           END-EVALUATE.                                                09300000
           EJECT                                                                
       0500-CREATE-PTR-DLVY-RTN.                                                
           MOVE SPACES TO ACAT11IO-CMNT-TXT                                     
                          ACAT11IO-ASSET-CMNT1-TXT                              
                          ACAT11IO-ASSET-CMNT2-TXT                              
                          ACAT11IO-ASSET-CMNT5-TXT                              
                          ACAT11IO-ASSET-CMNTM-TXT                              
LRM008                    ACAT11IO-NSCC-WTHLD-CD.                               
           MOVE 'N' TO ACAT11IO-BEARER-BOND-CD.                                 
LRM003*****PERFORM 0200-ISRT-ACTITRF.                                   09130000
           PERFORM 0050-OPEN-VASSET-CRSRX.                              09130000
           SET ACAT11IO-GOOD-RESP TO TRUE.                              09240000
           PERFORM UNTIL NOT ACAT11IO-GOOD-RESP                         09130000
              PERFORM 0075-READ-NEXTX                                   09130000
              IF ACAT11IO-ASSET-FOUND                                   09130000
LRM004        AND STTLM-LCTN-CD OF DCLVASSET NOT = '45'                         
                 PERFORM 0077-MOVE-ASSET-TO-IOAREA                              
LRM033           IF STTLM-LCTN-CD OF DCLVASSET = '05'                           
LRM033           AND (STTLM-RSN-CD OF DCLVASSET  = 'DTC ' OR 'CNS ')            
LRM033               MOVE SPACES TO STTLM-RSN-CD OF DCLVASSET                   
LRM033                              ACAT11IO-SLOC-RSN                           
LRM033           END-IF                                                         
                 PERFORM 0530-REPLACE-ASSET-QTY-RTN                             
                    THRU 0530-REPLACE-ASSET-QTY-EXIT                            
*********        PERFORM 0520-ISRT-ASSET-FROM-ACTIVE                            
LRM003           IF WS-CALC-POSN-QTY NOT = ZERO                         MRGIML03
LRM003           OR WS-CASH-AMT NOT = ZERO                                      
                    PERFORM 0220-ISRT-ACTIAST THRU 0220-EXIT               09130
                    ADD 1 TO WS-PTR-RECORDS-INSERTED                            
LRM003           END-IF                                                         
LEM003           SET ACAT11IO-GOOD-RESP TO TRUE                         09240000
              END-IF                                                            
           END-PERFORM.                                                         
           PERFORM 0080-CLOSE-VASSET-CRSRX.                                     
           IF WS-PTR-RECORDS-INSERTED > ZERO                                    
              PERFORM 0510-UPDATE-PTR-TIF                                       
              SET ACAT11IO-FOUND TO TRUE                                        
LRM015        MOVE SPACES TO ACAT11IO-AMT-01-RQST-CD                            
LRM015                       ACAT11IO-AMT-02-RQST-CD                            
LRM015                       ACAT11IO-AMT-05-RQST-CD                            
           ELSE                                                                 
              SET ACAT11IO-NOT-FOUND TO TRUE.                                   
           MOVE WS-PTR-RECORDS-INSERTED TO ACAT11IO-PTD-ASSETS-CREATED.         
                                                                                
       0510-UPDATE-PTR-TIF.                                                     
           MOVE WS-TIMESTAMP TO  UPDT-TMSTP OF DCLVTRNFR                        
                                 ACAT11IO-UPDT-TMSTP.                           
           MOVE EIBTRMID TO CICS-TERM-ID-CD OF DCLVTRNFR.                       
           EXEC SQL                                                     09140000
               UPDATE VTRNFR                                            09170000
                 SET                                                            
                   ACCT_RJCT_RSBM_IND =                                         
                    'S'                                                         
                  ,UPDT_TMSTP        =                                          
                    :DCLVTRNFR.UPDT-TMSTP                                       
                  ,CICS_TERM_ID_CD   =                                          
                    :DCLVTRNFR.CICS-TERM-ID-CD                                  
                  ,PRGM_NM           =                                          
                    'ACAT11DB'                                                  
              WHERE                                                             
                  (CLIENT_NBR    =                                      09180000
                    :ACAT11IO-CLIENT-NBR   AND                          09190000
                   ACAT_CONTROL_NBR  =                                  09180000
                    :ACAT11IO-CONTROL-NBR  AND                                  
                   TRNFR_TYPE_CD =                                      09180000
                    'PTR'                                                       
                  )                                                     09150000
093200     END-EXEC.                                                    09200000
                                                                                
           EVALUATE SQLCODE                                             09220000
               WHEN +0                                                  09230000
                  CONTINUE                                              09240000
               WHEN +100                                                09230000
                  CONTINUE                                              09240000
               WHEN OTHER                                               09280000
                  SET ACAT11IO-DB2-ERROR TO TRUE                                
                  PERFORM 9000-WRITE-TO-CICS-LOG                                
                  PERFORM 9500-RETURN-DB2-ERROR                                 
           END-EVALUATE.                                                09300000
                                                                                
       0520-ISRT-ASSET-FROM-ACTIVE.                                             
      *---------------------------------------------------------------*         
      * THIS RTN WILL CREATE INITIAL ASSET FROM ACTIVE TABLE; USED    *         
      * WHEN COPYING PTR MEMO TO DLVY. NOTE THE VASSET FIELDS ON BELOW*         
      * ARE COPIED DIRECTLY.                                          *         
      *---------------------------------------------------------------*         
           INITIALIZE DCLACTIAST.                                               
           MOVE WS-TIMESTAMP TO  UPDT-TMSTP OF DCLACTIAST                       
                                  CRT-TMSTP OF DCLACTIAST.                      
           MOVE ZEROS TO ASSET-SEQ-NBR OF DCLACTIAST                            
                         PHSCL-SEQ-NBR OF DCLACTIAST                            
                          LGCL-SEQ-NBR OF DCLACTIAST.                           
           MOVE EIBTRMID TO CICS-TERM-ID-CD OF DCLACTIAST.                      
TEMP**** THE FOLLOWING LINE WILL HAVE TO BE DELETED AT A LATER TIME.            
TEMP**** FORCE ASSET SEQ NBR TO BE ZEROS FOR NOW...                             
TEMP       MOVE ZEROS TO ASSET-SEQ-NBR OF DCLVASSET.                            
                                                                                
           EXEC SQL                                                     09140000
               INSERT INTO ACTIAST                                      09170000
                 (                                                      09150000
                   CLIENT_NBR                                           09180000
                  ,DLVR_NBR                                             09150000
                  ,ACCT_DLVR_NBR                                        09180000
                  ,RCV_NBR                                              09180000
                  ,ACCT_RCV_NBR                                         09180000
                  ,ISIN_CNTRY_CD                                                
                  ,ISIN_SEC_ISSUE_CD                                            
                  ,ISIN_SEC_CDG_CD                                              
                  ,STTLM_LCTN_CD                                                
                  ,CSH_MGN_SHRT_CD                                              
                  ,CSH_MRG_SHT_STS_CD                                           
                  ,STTLM_LCTN_STTS_CD                                           
                  ,ISIN_CNTRY_STTS_CD                                           
                  ,SBMTG_PRTCP_NBR                                              
                  ,SBMT_PRT_NR_STS_CD                                           
                  ,ACAT_CONTROL_NBR                                             
                  ,CONTROL_NBR_STS_CD                                           
                  ,ASSET_SEQ_NBR                                                
                  ,AST_SEQ_NBR_STS_CD                                           
                  ,TRANS_TYPE_CD                                                
                  ,TRANS_TYPE_STTS_CD                                           
                  ,PHSCL_SEQ_NBR                                                
                  ,PHSCL_SEQ_STTS_CD                                            
                  ,LGCL_SEQ_NBR                                                 
                  ,LGCL_SEQ_NR_STS_CD                                           
                  ,ASSET_PRC_CTGY_CD                                            
                  ,AST_PRC_CTG_STS_CD                                           
                  ,STTLM_RSN_CD                                                 
                  ,STTLM_RSN_STTS_CD                                            
                  ,ASSET_DESC_TXT                                               
                  ,ASSET_DESC_STTS_CD                                           
                  ,ASSET_RQST_QTY_CD                                            
                  ,ASSET_RQST_STS_CD                                            
                  ,AST_RQST_TRANS_CD                                            
                  ,AST_RQ_TRAN_STS_CD                                           
                  ,ASSET_QTY                                                    
                  ,ASSET_QTY_STTS_CD                                            
                  ,ASSET_PCT                                                    
                  ,ASSET_PCT_STTS_CD                                            
                  ,PSTN_CD                                                      
                  ,PSTN_CD_STTS_CD                                              
                  ,ISO_CRNCY_CD                                                 
                  ,ISO_CRNCY_STTS_CD                                            
                  ,ASSET_AMT                                                    
                  ,ASSET_AMT_STTS_CD                                            
                  ,BEARER_BOND_CD                                               
                  ,BEARER_BND_STTS_CD                                           
                  ,WHI_CD                                                       
                  ,WHI_STTS_CD                                                  
                  ,TRNFR_TYPE_RSN_CD                                            
                  ,TRN_TYP_RSN_STS_CD                                           
                  ,MBS_SERIAL_NBR                                               
                  ,MBS_SERIAL_STTS_CD                                           
                  ,ASSET_CMNT_TXT                                               
                  ,ASSET_CMNT_STTS_CD                                           
                  ,NSCC_WTHLD_CD                                                
                  ,TRANS_RFRN_ID_CD                                             
                  ,TRANS_RFRN_STTS_CD                                           
                  ,ISIN_SEC_IS_STS_CD                                           
                  ,ISIN_SEC_CD_STS_CD                                           
                  ,OPTN_CTGY_CD                                                 
                  ,OPTN_CTGY_STTS_CD                                            
                  ,RCRD_LNGTH_STTS_CD                                           
                  ,RCRD_STTS_CD                                                 
                  ,NSCC_PEND_CD                                                 
                  ,NSCC_ACK_IND                                                 
                  ,PRGM_NM                                                      
                  ,CICS_TERM_ID_CD                                              
                  ,UPDT_TMSTP                                                   
                  ,CRT_TMSTP                                                    
                  ,SECURITY_ADP_NBR                                             
                  ,TRNFR_TYPE_CD                                                
                  ,TRNFR_TYPE_STTS_CD                                           
                  ,RCV_NBR_STTS_CD                                              
                  ,DLVR_NBR_STTS_CD                                             
                  ,CICS_SGNON_ID                                                
                 )                                                      09150000
                 VALUES                                                         
                 (                                                      09150000
                    :ACAT11IO-CLIENT-NBR                                09190000
                   ,:ACAT11IO-DLVR-NBR                                  09190000
                   ,:ACAT11IO-DLVR-ACCT                                 09190000
                   ,:ACAT11IO-RCV-NBR                                   09190000
                   ,:ACAT11IO-RCV-ACCT                                  09190000
                   ,:DCLVASSET.ISIN-CNTRY-CD                                    
                   ,:DCLVASSET.ISIN-SEC-ISSUE-CD                                
                   ,:DCLACTIAST.ISIN-SEC-CDG-CD                                 
                   ,:DCLVASSET.STTLM-LCTN-CD                                    
                   ,:DCLVASSET.CSH-MGN-SHRT-CD                                  
                   ,:DCLVASSET.CSH-MRG-SHT-STS-CD                               
                   ,:DCLACTIAST.STTLM-LCTN-STTS-CD                              
                   ,:DCLACTIAST.ISIN-CNTRY-STTS-CD                              
                   ,:ACAT11IO-DLVR-NBR                                  09190000
                   ,:DCLACTIAST.SBMT-PRT-NR-STS-CD                              
LRM003             ,:ACAT11IO-CONTROL-NBR                                       
                   ,:DCLACTIAST.CONTROL-NBR-STS-CD                              
                   ,:DCLVASSET.ASSET-SEQ-NBR                                    
                   ,:DCLACTIAST.AST-SEQ-NBR-STS-CD                              
                   ,' '                                                         
                   ,:DCLACTIAST.TRANS-TYPE-STTS-CD                              
                   ,:DCLACTIAST.PHSCL-SEQ-NBR                                   
                   ,:DCLACTIAST.PHSCL-SEQ-STTS-CD                               
                   ,:DCLACTIAST.LGCL-SEQ-NBR                                    
                   ,:DCLACTIAST.LGCL-SEQ-NR-STS-CD                              
                   ,:DCLVASSET.ASSET-PRC-CTGY-CD                                
                   ,:DCLACTIAST.AST-PRC-CTG-STS-CD                              
                   ,:DCLVASSET.STTLM-RSN-CD                                     
                   ,:DCLACTIAST.STTLM-RSN-STTS-CD                               
                   ,:DCLVASSET.ASSET-DESC-TXT                                   
                   ,:DCLACTIAST.ASSET-DESC-STTS-CD                              
                   ,:DCLVASSET.ASSET-RQST-QTY-CD                                
                   ,:DCLACTIAST.ASSET-RQST-STS-CD                               
                   ,:DCLVASSET.AST-RQST-TRANS-CD                                
                   ,:DCLACTIAST.AST-RQ-TRAN-STS-CD                              
                   ,:DCLVASSET.ASSET-QTY                                        
                   ,:DCLACTIAST.ASSET-QTY-STTS-CD                               
                   ,:DCLVASSET.ASSET-PCT                                        
                   ,:DCLACTIAST.ASSET-PCT-STTS-CD                               
                   ,:DCLVASSET.PSTN-CD                                          
                   ,:DCLACTIAST.PSTN-CD-STTS-CD                                 
                   ,:DCLACTIAST.ISO-CRNCY-CD                                    
                   ,:DCLACTIAST.ISO-CRNCY-STTS-CD                               
                   ,:DCLVASSET.ASSET-AMT                                        
                   ,:DCLACTIAST.ASSET-AMT-STTS-CD                               
                   ,:DCLVASSET.BEARER-BOND-CD                                   
                   ,:DCLACTIAST.BEARER-BND-STTS-CD                              
                   ,:DCLVASSET.WHI-CD                                           
                   ,:DCLACTIAST.WHI-STTS-CD                                     
                   ,:DCLVASSET.TRNFR-TYPE-RSN-CD                                
                   ,:DCLACTIAST.TRN-TYP-RSN-STS-CD                              
                   ,:DCLVASSET.MBS-SERIAL-NBR                                   
                   ,:DCLVASSET.MBS-SERIAL-STTS-CD                               
                   ,:DCLVASSET.ASSET-CMNT-TXT                                   
                   ,:DCLACTIAST.ASSET-CMNT-STTS-CD                              
                   ,' '                                                         
                   ,:DCLACTIAST.TRANS-RFRN-ID-CD                                
                   ,:DCLACTIAST.TRANS-RFRN-STTS-CD                              
                   ,:DCLACTIAST.ISIN-SEC-IS-STS-CD                              
                   ,:DCLACTIAST.ISIN-SEC-CD-STS-CD                              
                   ,:DCLACTIAST.OPTN-CTGY-CD                                    
                   ,:DCLACTIAST.OPTN-CTGY-STTS-CD                               
                   ,:DCLACTIAST.RCRD-LNGTH-STTS-CD                              
                   ,:DCLACTIAST.RCRD-STTS-CD                                    
                   ,:DCLACTIAST.NSCC-PEND-CD                                    
                   ,:DCLACTIAST.NSCC-ACK-IND                                    
                   ,'ACAT11DB'                                                  
                   ,:DCLACTIAST.CICS-TERM-ID-CD                                 
                   ,:DCLACTIAST.UPDT-TMSTP                                      
                   ,:DCLACTIAST.CRT-TMSTP                                       
                   ,'       '                                                   
                   ,'PTR'                                               09180000
                   ,:DCLACTIAST.TRNFR-TYPE-STTS-CD                              
                   ,:DCLACTIAST.RCV-NBR-STTS-CD                                 
                   ,:DCLACTIAST.DLVR-NBR-STTS-CD                                
                   ,:ACAT11IO-SIGN-ON-ID                                        
                 )                                                      09150000
093200     END-EXEC.                                                    09200000
093400     EVALUATE SQLCODE                                             09220000
093500          WHEN +0                                                 09230000
093600               SET ACAT11IO-GOOD-RESP TO TRUE                     09240000
094000          WHEN OTHER                                              09280000
                     SET ACAT11IO-DB2-ERROR TO TRUE                             
                     PERFORM 9000-WRITE-TO-CICS-LOG                             
                     PERFORM 9500-RETURN-DB2-ERROR                              
094200     END-EVALUATE.                                                09300000
                                                                                
       EJECT                                                            06080002
       0530-REPLACE-ASSET-QTY-RTN.                                              
           MOVE ZEROS TO WS-CALC-POSN-QTY                               MRGIML03
                         WS-CASH-AMT.                                           
LRM017     MOVE 'N' TO WS-CREATE-SEC-LONG-FREEZE-MEMO                   MRGIPS05
LRM017                 WS-CREATE-SEC-SHORT-FREEZ-MEMO                   MRGIPS05
LRM017                 WS-CREATE-CASH-CR-FREEZE-MEMO                    MRGIPS05
LRM017                 WS-CREATE-CASH-DB-FREEZE-MEMO.                   MRGIPS05
           IF ACAT11IO-CSH-MGN-SHRT-CD NOT > SPACES                             
              SET ACAT11IO-CASH-ASSET TO TRUE                                   
           END-IF.                                                              
                                                                                
           IF STTLM-LCTN-CD OF DCLVASSET = '40'                                 
             PERFORM OBTAIN-MARGIN-BAL-RTN                                      
                THRU OBTAIN-MARGIN-BAL-EXIT                                     
             MOVE SPACES TO ACAT11IO-DESC-TXT                                   
             IF STTLM-RSN-CD OF DCLVASSET = 'CRED'                              
                SUBTRACT ASSET-AMT OF DCLVASSET FROM WS-CASH-AMT                
             ELSE                                                               
                ADD      ASSET-AMT OF DCLVASSET TO     WS-CASH-AMT              
             END-IF                                                             
             IF  NOT ACAT11IO-CASH-ASSET                                        
             AND NOT ACAT11IO-MARGIN-ASSET                                      
             AND NOT ACAT11IO-SHORT-ASSET                                       
                PERFORM 0535-SET-CASH-ACCOUNT-TYPE                              
             END-IF                                                             
             IF ACAT11IO-CASH-ASSET                                             
                IF (WS-MRGN-BAL-TYPE1 = ZERO                                    
LRM015          OR ASSET-RQST-QTY-CD OF DCLVASSET = 'F')                        
LRM015             IF (ACAT11IO-SLOC-RSN = SPACES                               
LRM015             OR (ACAT11IO-SLOC-RSN = 'CRED'                               
LRM015             AND WS-MRGN-BAL-TYPE1 < ZERO)                                
LRM015             OR (ACAT11IO-SLOC-RSN NOT = 'CRED'                           
LRM015             AND WS-MRGN-BAL-TYPE1 > ZERO))                               
LRM015                MOVE WS-MRGN-BAL-TYPE1 TO WS-CASH-AMT                     
LRM015             END-IF                                                       
                ELSE                                                            
LRM005             IF ACAT11IO-ASSET-PCT NOT = 0.00                             
LRM005               IF ((ACAT11IO-SLOC-RSN = 'CRED'                            
LRM005               AND WS-MRGN-BAL-TYPE1 < ZERO)                              
LRM005               OR  (ACAT11IO-SLOC-RSN NOT = 'CRED'                        
LRM005               AND WS-MRGN-BAL-TYPE1 > ZERO))                             
LRM005                MOVE WS-MRGN-BAL-TYPE1 TO WS-CASH-AMT                     
LRM005                IF ACAT11IO-ASSET-PCT NOT = 100.00                        
LRM005                   COMPUTE WS-CASH-AMT ROUNDED =                          
LRM005                     WS-CASH-AMT * ACAT11IO-ASSET-PCT / 100               
LRM005                   END-COMPUTE                                            
LRM005                END-IF                                                    
LRM005              ELSE                                                        
LRM005                MOVE 0.00 TO WS-CASH-AMT                                  
LRM005              END-IF                                                      
LRM005                MOVE 0.00 TO ACAT11IO-ASSET-PCT                           
LRM005             END-IF                                                       
                   IF WS-CASH-AMT < ZERO                                        
                   AND WS-CASH-AMT < WS-MRGN-BAL-TYPE1                          
                     IF WS-MRGN-BAL-TYPE1 < ZERO                                
                        MOVE WS-MRGN-BAL-TYPE1 TO WS-CASH-AMT                   
                     ELSE                                                       
                        MOVE ZERO              TO WS-CASH-AMT                   
                     END-IF                                                     
                   ELSE                                                         
                      IF WS-CASH-AMT > ZERO                                     
                      AND WS-CASH-AMT > WS-MRGN-BAL-TYPE1                       
                       IF WS-MRGN-BAL-TYPE1 > ZERO                              
                         MOVE WS-MRGN-BAL-TYPE1 TO WS-CASH-AMT                  
                       ELSE                                                     
                         MOVE ZERO              TO WS-CASH-AMT                  
                      END-IF                                                    
                END-IF END-IF END-IF                                            
XXXX*******     MOVE ASSET-AMT OF DCLVASSET TO ACAT11IO-AMT-01                  
                IF WS-MRGN-BAL-TYPE1 = ZERO                                     
                   MOVE WS-MRGN-BAL-TYPE1 TO WS-CASH-AMT                        
                ELSE                                                            
                   IF WS-CASH-AMT < ZERO                                        
                   AND WS-CASH-AMT < WS-MRGN-BAL-TYPE1                          
                     IF WS-MRGN-BAL-TYPE1 < ZERO                                
                        MOVE WS-MRGN-BAL-TYPE1 TO WS-CASH-AMT                   
                     ELSE                                                       
                        MOVE ZERO              TO WS-CASH-AMT                   
                     END-IF                                                     
                   ELSE                                                         
                     IF WS-CASH-AMT > ZERO                                      
                     AND WS-CASH-AMT > WS-MRGN-BAL-TYPE1                        
                      IF WS-MRGN-BAL-TYPE1 > ZERO                               
                        MOVE WS-MRGN-BAL-TYPE1 TO WS-CASH-AMT                   
                      ELSE                                                      
                        MOVE ZERO              TO WS-CASH-AMT                   
                      END-IF                                                    
                END-IF END-IF END-IF                                            
                IF WS-CASH-AMT < ZERO                                           
                   MULTIPLY WS-CASH-AMT BY -1  GIVING ACAT11IO-AMT-01           
                   SET ACAT11IO-AMT-01-CREDIT TO TRUE                           
                ELSE                                                            
                   MOVE WS-CASH-AMT                TO ACAT11IO-AMT-01           
                   MOVE SPACES TO ACAT11IO-AMT-01-CREDIT-IND                    
                END-IF                                                          
LRM005          MOVE ACAT11IO-AMT-01 TO ACAT11IO-ASSET-AMT                      
             ELSE                                                               
             IF ACAT11IO-MARGIN-ASSET                                           
                IF (WS-MRGN-BAL-TYPE2 = ZERO                                    
LRM015          OR ASSET-RQST-QTY-CD OF DCLVASSET = 'F')                        
LRM015             IF (ACAT11IO-SLOC-RSN = SPACES                               
LRM015             OR (ACAT11IO-SLOC-RSN = 'CRED'                               
LRM015             AND WS-MRGN-BAL-TYPE2 < ZERO)                                
LRM015             OR (ACAT11IO-SLOC-RSN NOT = 'CRED'                           
LRM015             AND WS-MRGN-BAL-TYPE2 > ZERO))                               
LRM015                MOVE WS-MRGN-BAL-TYPE2 TO WS-CASH-AMT                     
LRM015             END-IF                                                       
                ELSE                                                            
LRM005             IF ACAT11IO-ASSET-PCT NOT = 0.00                             
LRM005               IF ((ACAT11IO-SLOC-RSN = 'CRED'                            
LRM005               AND WS-MRGN-BAL-TYPE2 < ZERO)                              
LRM005               OR  (ACAT11IO-SLOC-RSN NOT = 'CRED'                        
LRM005               AND WS-MRGN-BAL-TYPE2 > ZERO))                             
LRM005                MOVE WS-MRGN-BAL-TYPE2 TO WS-CASH-AMT                     
LRM005                IF ACAT11IO-ASSET-PCT NOT = 100.00                        
LRM005                   COMPUTE WS-CASH-AMT ROUNDED =                          
LRM005                     WS-CASH-AMT * ACAT11IO-ASSET-PCT / 100               
LRM005                   END-COMPUTE                                            
LRM005                END-IF                                                    
LRM005              ELSE                                                        
LRM005                MOVE 0.00 TO WS-CASH-AMT                                  
LRM005              END-IF                                                      
LRM005                MOVE 0.00 TO ACAT11IO-ASSET-PCT                           
LRM005             END-IF                                                       
                   IF WS-CASH-AMT < ZERO                                        
                   AND WS-CASH-AMT < WS-MRGN-BAL-TYPE2                          
                     IF WS-MRGN-BAL-TYPE2 < ZERO                                
                        MOVE WS-MRGN-BAL-TYPE2 TO WS-CASH-AMT                   
                     ELSE                                                       
                        MOVE ZERO              TO WS-CASH-AMT                   
                     END-IF                                                     
                   ELSE                                                         
                      IF WS-CASH-AMT > ZERO                                     
                      AND WS-CASH-AMT > WS-MRGN-BAL-TYPE2                       
                       IF WS-MRGN-BAL-TYPE2 > ZERO                              
                         MOVE WS-MRGN-BAL-TYPE2 TO WS-CASH-AMT                  
                       ELSE                                                     
                         MOVE ZERO              TO WS-CASH-AMT                  
                      END-IF                                                    
                END-IF END-IF END-IF                                            
XXXX****        MOVE ASSET-AMT OF DCLVASSET TO ACAT11IO-AMT-02                  
                IF WS-MRGN-BAL-TYPE2 = ZERO                                     
                   MOVE WS-MRGN-BAL-TYPE2 TO WS-CASH-AMT                        
                ELSE                                                            
                   IF WS-CASH-AMT < ZERO                                        
                   AND WS-CASH-AMT < WS-MRGN-BAL-TYPE2                          
                     IF WS-MRGN-BAL-TYPE2 < ZERO                                
                        MOVE WS-MRGN-BAL-TYPE2 TO WS-CASH-AMT                   
                     ELSE                                                       
                        MOVE ZERO              TO WS-CASH-AMT                   
                     END-IF                                                     
                   ELSE                                                         
                     IF WS-CASH-AMT > ZERO                                      
                     AND WS-CASH-AMT > WS-MRGN-BAL-TYPE2                        
                      IF WS-MRGN-BAL-TYPE2 > ZERO                               
                        MOVE WS-MRGN-BAL-TYPE2 TO WS-CASH-AMT                   
                      ELSE                                                      
                        MOVE ZERO              TO WS-CASH-AMT                   
                      END-IF                                                    
                END-IF END-IF END-IF                                            
                IF WS-CASH-AMT < ZERO                                           
                   MULTIPLY WS-CASH-AMT BY -1  GIVING ACAT11IO-AMT-02           
                   SET ACAT11IO-AMT-02-CREDIT TO TRUE                           
                ELSE                                                            
                   MOVE WS-CASH-AMT                TO ACAT11IO-AMT-02           
                   MOVE SPACES TO ACAT11IO-AMT-02-CREDIT-IND                    
                END-IF                                                          
LRM005          MOVE ACAT11IO-AMT-02 TO ACAT11IO-ASSET-AMT                      
             ELSE                                                               
             IF ACAT11IO-SHORT-ASSET                                            
                IF (WS-MRGN-BAL-TYPE5 = ZERO                                    
LRM015          OR ASSET-RQST-QTY-CD OF DCLVASSET = 'F')                        
LRM015             IF (ACAT11IO-SLOC-RSN = SPACES                               
LRM015             OR (ACAT11IO-SLOC-RSN = 'CRED'                               
LRM015             AND WS-MRGN-BAL-TYPE5 < ZERO)                                
LRM015             OR (ACAT11IO-SLOC-RSN NOT = 'CRED'                           
LRM015             AND WS-MRGN-BAL-TYPE5 > ZERO))                               
LRM015                MOVE WS-MRGN-BAL-TYPE5 TO WS-CASH-AMT                     
LRM015             END-IF                                                       
                ELSE                                                            
LRM005             IF ACAT11IO-ASSET-PCT NOT = 0.00                             
LRM005               IF ((ACAT11IO-SLOC-RSN = 'CRED'                            
LRM005               AND WS-MRGN-BAL-TYPE5 < ZERO)                              
LRM005               OR  (ACAT11IO-SLOC-RSN NOT = 'CRED'                        
LRM005               AND WS-MRGN-BAL-TYPE5 > ZERO))                             
LRM005                MOVE WS-MRGN-BAL-TYPE5 TO WS-CASH-AMT                     
LRM005                IF ACAT11IO-ASSET-PCT NOT = 100.00                        
LRM005                   COMPUTE WS-CASH-AMT ROUNDED =                          
LRM005                     WS-CASH-AMT * ACAT11IO-ASSET-PCT / 100               
LRM005                   END-COMPUTE                                            
LRM005                END-IF                                                    
LRM005              ELSE                                                        
LRM005                MOVE 0.00 TO WS-CASH-AMT                                  
LRM005              END-IF                                                      
LRM005                MOVE 0.00 TO ACAT11IO-ASSET-PCT                           
LRM005             END-IF                                                       
                   IF WS-CASH-AMT < ZERO                                        
                   AND WS-CASH-AMT < WS-MRGN-BAL-TYPE5                          
                     IF WS-MRGN-BAL-TYPE5 < ZERO                                
                        MOVE WS-MRGN-BAL-TYPE5 TO WS-CASH-AMT                   
                     ELSE                                                       
                        MOVE ZERO              TO WS-CASH-AMT                   
                     END-IF                                                     
                   ELSE                                                         
                      IF WS-CASH-AMT > ZERO                                     
                      AND WS-CASH-AMT > WS-MRGN-BAL-TYPE5                       
                       IF WS-MRGN-BAL-TYPE5 > ZERO                              
                         MOVE WS-MRGN-BAL-TYPE5 TO WS-CASH-AMT                  
                       ELSE                                                     
                         MOVE ZERO              TO WS-CASH-AMT                  
                      END-IF                                                    
                END-IF END-IF END-IF                                            
XXXX****        MOVE ASSET-AMT OF DCLVASSET TO ACAT11IO-AMT-05                  
                IF WS-MRGN-BAL-TYPE5 = ZERO                                     
                   MOVE WS-MRGN-BAL-TYPE5 TO WS-CASH-AMT                        
                ELSE                                                            
                   IF WS-CASH-AMT < ZERO                                        
                   AND WS-CASH-AMT < WS-MRGN-BAL-TYPE5                          
                     IF WS-MRGN-BAL-TYPE5 < ZERO                                
                        MOVE WS-MRGN-BAL-TYPE5 TO WS-CASH-AMT                   
                     ELSE                                                       
                        MOVE ZERO              TO WS-CASH-AMT                   
                     END-IF                                                     
                   ELSE                                                         
                     IF WS-CASH-AMT > ZERO                                      
                     AND WS-CASH-AMT > WS-MRGN-BAL-TYPE5                        
                      IF WS-MRGN-BAL-TYPE5 > ZERO                               
                        MOVE WS-MRGN-BAL-TYPE5 TO WS-CASH-AMT                   
                      ELSE                                                      
                        MOVE ZERO              TO WS-CASH-AMT                   
                      END-IF                                                    
                END-IF END-IF END-IF                                            
                IF WS-CASH-AMT < ZERO                                           
                   MULTIPLY WS-CASH-AMT BY -1  GIVING ACAT11IO-AMT-05           
                   SET ACAT11IO-AMT-05-CREDIT TO TRUE                           
                ELSE                                                            
                   MOVE WS-CASH-AMT                TO ACAT11IO-AMT-05           
                   MOVE SPACES TO ACAT11IO-AMT-05-CREDIT-IND                    
                END-IF                                                          
LRM005          MOVE ACAT11IO-AMT-05 TO ACAT11IO-ASSET-AMT                      
           END-IF.                                                              
                                                                                
           MOVE ACAT11IO-ASSET-CMNT-TXT TO ACAT11IO-ASSET-CMNTM-TXT.            
           MOVE SPACES TO ACAT11IO-ISIN-SEC-CDG-CD.                             
                                                                                
           MOVE SPACES TO WS-PTR-ORIG-RQST-AMT-MSG.                             
           IF ACAT11IO-RQST-ASSET-PCT                                           
              MOVE ASSET-PCT OF DCLVASSET TO WS-PTR-ORIG-RQST-PCT               
              MOVE '%' TO WS-PTR-ORIG-RQST-PCT-LIT                              
           ELSE                                                                 
           IF ACAT11IO-RQST-ASSET-AMT                                           
              MOVE ASSET-AMT OF DCLVASSET TO WS-PTR-ORIG-RQST-AMT               
           ELSE                                                                 
              MOVE 'Q' TO WS-PTR-ORIG-RQST-QTY-LIT                              
              MOVE ASSET-QTY OF DCLVASSET TO WS-PTR-ORIG-RQST-QTY               
           END-IF.                                                              
           MOVE WS-PTR-ORIG-RQST-AMT-MSG TO                                     
                          ACAT11IO-ASSET-CMNTM-TXT (101 : 19).                  
                                                                                
           IF ACAT11IO-ADP-NBR NOT > SPACES                             MRGIPS05
LRM005***     IF ACAT11IO-ASSET-AMT NOT GREATER .99                             
LRM005***        MOVE ACAT11IO-ASSET-QTY TO ACAT11IO-ASSET-AMT                  
LRM005***        SET ACAT11IO-RQST-ASSET-QTY TO TRUE                            
LRM005***     END-IF                                                            
              GO TO 0530-REPLACE-ASSET-QTY-EXIT                                 
           END-IF.                                                              
                                                                                
           PERFORM OBTAIN-MARGIN-POSN-RTN                                       
                 THRU OBTAIN-MARGIN-POSN-EXIT.                                  
                                                                                
           IF  NOT ACAT11IO-CASH-ASSET                                          
           AND NOT ACAT11IO-MARGIN-ASSET                                        
           AND NOT ACAT11IO-SHORT-ASSET                                         
              PERFORM 0537-SET-POSN-ACCOUNT-TYPE                                
           END-IF.                                                              
                                                                                
           IF ACAT11IO-RQST-ASSET-QTY                                           
              MOVE ACAT11IO-ASSET-QTY TO WS-CALC-POSN-QTY               MRGIML03
              IF ACAT11IO-CASH-ASSET                                            
                 IF WS-MRGN-POSN-QTY-TYPE1 = ACAT11IO-ASSET-QTY         MRGIML03
                    MOVE WS-MRGN-POSN-MV-TYPE1  TO ACAT11IO-ASSET-AMT   MRGIPS05
                 ELSE                                                           
                    COMPUTE WS-CALC-PRICE ROUNDED =                             
                       WS-MRGN-POSN-MV-TYPE1 / WS-MRGN-POSN-QTY-TYPE1   MRGIPS05
                          ON SIZE ERROR MOVE 1.00  TO WS-CALC-PRICE             
                    END-COMPUTE                                                 
                    COMPUTE ACAT11IO-ASSET-AMT =                                
                       ACAT11IO-ASSET-QTY * WS-CALC-PRICE                       
                    END-COMPUTE                                                 
                 END-IF                                                         
              ELSE                                                              
              IF ACAT11IO-MARGIN-ASSET                                          
                 IF WS-MRGN-POSN-QTY-TYPE2 = ACAT11IO-ASSET-QTY         MRGIML03
                    MOVE WS-MRGN-POSN-MV-TYPE2  TO ACAT11IO-ASSET-AMT   MRGIPS05
                 ELSE                                                           
                    COMPUTE WS-CALC-PRICE ROUNDED =                             
                       WS-MRGN-POSN-MV-TYPE2 / WS-MRGN-POSN-QTY-TYPE2   MRGIPS05
                          ON SIZE ERROR MOVE 1.00  TO WS-CALC-PRICE             
                    END-COMPUTE                                                 
                    COMPUTE ACAT11IO-ASSET-AMT =                                
                       ACAT11IO-ASSET-QTY * WS-CALC-PRICE                       
                    END-COMPUTE                                                 
                 END-IF                                                         
              ELSE                                                              
              IF ACAT11IO-SHORT-ASSET                                           
                 IF WS-MRGN-POSN-QTY-TYPE5 = ACAT11IO-ASSET-QTY         MRGIML03
                    MOVE WS-MRGN-POSN-MV-TYPE5  TO ACAT11IO-ASSET-AMT   MRGIPS05
                 ELSE                                                           
                    COMPUTE WS-CALC-PRICE ROUNDED =                             
                       WS-MRGN-POSN-MV-TYPE5 / WS-MRGN-POSN-QTY-TYPE5   MRGIPS05
                          ON SIZE ERROR MOVE 1.00  TO WS-CALC-PRICE             
                    END-COMPUTE                                                 
                    COMPUTE ACAT11IO-ASSET-AMT =                                
                       ACAT11IO-ASSET-QTY * WS-CALC-PRICE                       
                    END-COMPUTE                                                 
                 END-IF                                                         
              END-IF END-IF END-IF                                              
           ELSE                                                                 
           IF ACAT11IO-RQST-ASSET-AMT                                           
              IF ACAT11IO-CASH-ASSET                                            
                 COMPUTE WS-CALC-PRICE ROUNDED =                                
                  WS-MRGN-POSN-MV-TYPE1 / WS-MRGN-POSN-QTY-TYPE1        MRGIPS05
                    ON SIZE ERROR MOVE 1.00  TO WS-CALC-PRICE                   
                 END-COMPUTE                                                    
                 COMPUTE WS-CALC-POSN-QTY ROUNDED =                     MRGIML03
                      ACAT11IO-ASSET-AMT / WS-CALC-PRICE                MRGIML03
                    ON SIZE ERROR MOVE 1.00  TO WS-CALC-POSN-QTY                
                 END-COMPUTE                                                    
                 MOVE WS-CALC-POSN-QTY TO ACAT11IO-ASSET-QTY                    
              ELSE                                                              
              IF ACAT11IO-MARGIN-ASSET                                          
                 COMPUTE WS-CALC-PRICE ROUNDED =                                
                  WS-MRGN-POSN-MV-TYPE2 / WS-MRGN-POSN-QTY-TYPE2        MRGIPS05
                    ON SIZE ERROR MOVE 1.00  TO WS-CALC-PRICE                   
                 END-COMPUTE                                                    
                 COMPUTE WS-CALC-POSN-QTY ROUNDED =                     MRGIML03
                      ACAT11IO-ASSET-AMT / WS-CALC-PRICE                MRGIML03
                    ON SIZE ERROR MOVE 1.00  TO WS-CALC-POSN-QTY                
                 END-COMPUTE                                                    
                 MOVE WS-CALC-POSN-QTY TO ACAT11IO-ASSET-QTY                    
              ELSE                                                              
              IF ACAT11IO-SHORT-ASSET                                           
                 COMPUTE WS-CALC-PRICE ROUNDED =                                
                  WS-MRGN-POSN-MV-TYPE5 / WS-MRGN-POSN-QTY-TYPE5        MRGIPS05
                    ON SIZE ERROR MOVE 1.00  TO WS-CALC-PRICE                   
                 END-COMPUTE                                                    
                 COMPUTE WS-CALC-POSN-QTY ROUNDED =                     MRGIML03
                      ACAT11IO-ASSET-AMT / WS-CALC-PRICE                MRGIML03
                    ON SIZE ERROR MOVE 1.00  TO WS-CALC-POSN-QTY                
                 END-COMPUTE                                                    
                 MOVE WS-CALC-POSN-QTY TO ACAT11IO-ASSET-QTY                    
              END-IF END-IF END-IF                                              
           ELSE                                                                 
LRM013     IF (ACAT11IO-RQST-ASSET-FULL                                         
LRM013     AND ACAT11IO-FULL-QTY)                                               
LRM013        SET ACAT11IO-RQST-ASSET-PCT TO TRUE                               
LRM013        MOVE 100.00 TO ACAT11IO-ASSET-PCT                                 
LRM013     END-IF                                                               
           IF ACAT11IO-RQST-ASSET-PCT                                           
              IF ACAT11IO-CASH-ASSET                                            
                 COMPUTE WS-CALC-POSN-QTY ROUNDED =                     MRGIML03
                   (WS-MRGN-POSN-QTY-TYPE1 *  ACAT11IO-ASSET-PCT / 100) MRGIML03
                 IF (WS-MRGN-POSN-QTY-TYPE1 > ZERO                              
                 AND WS-CALC-POSN-QTY > WS-MRGN-POSN-QTY-TYPE1)                 
                 OR (WS-MRGN-POSN-QTY-TYPE1 < ZERO                              
                 AND WS-CALC-POSN-QTY < WS-MRGN-POSN-QTY-TYPE1)                 
                    MOVE WS-MRGN-POSN-QTY-TYPE1 TO ACAT11IO-ASSET-QTY           
                 ELSE                                                           
                    MOVE WS-CALC-POSN-QTY       TO ACAT11IO-ASSET-QTY           
                 END-IF                                                         
                 COMPUTE WS-CALC-PRICE ROUNDED =                                
                     WS-MRGN-POSN-MV-TYPE1 / WS-MRGN-POSN-QTY-TYPE1     MRGIPS05
                       ON SIZE ERROR MOVE 1.00  TO WS-CALC-PRICE                
                 END-COMPUTE                                                    
                 COMPUTE ACAT11IO-ASSET-AMT =                                   
                      ACAT11IO-ASSET-QTY * WS-CALC-PRICE                        
                 END-COMPUTE                                                    
              ELSE                                                              
              IF ACAT11IO-MARGIN-ASSET                                          
                 COMPUTE WS-CALC-POSN-QTY ROUNDED =                     MRGIML03
                   (WS-MRGN-POSN-QTY-TYPE2 *  ACAT11IO-ASSET-PCT / 100) MRGIML03
                 IF (WS-MRGN-POSN-QTY-TYPE2 > ZERO                              
                 AND WS-CALC-POSN-QTY > WS-MRGN-POSN-QTY-TYPE2)                 
                 OR (WS-MRGN-POSN-QTY-TYPE2 < ZERO                              
                 AND WS-CALC-POSN-QTY < WS-MRGN-POSN-QTY-TYPE2)                 
                    MOVE WS-MRGN-POSN-QTY-TYPE2 TO ACAT11IO-ASSET-QTY           
                 ELSE                                                           
                    MOVE WS-CALC-POSN-QTY       TO ACAT11IO-ASSET-QTY           
                 END-IF                                                         
                 COMPUTE WS-CALC-PRICE ROUNDED =                                
                     WS-MRGN-POSN-MV-TYPE2 / WS-MRGN-POSN-QTY-TYPE2     MRGIPS05
                       ON SIZE ERROR MOVE 1.00  TO WS-CALC-PRICE                
                 END-COMPUTE                                                    
                 COMPUTE ACAT11IO-ASSET-AMT =                                   
                      ACAT11IO-ASSET-QTY * WS-CALC-PRICE                        
                 END-COMPUTE                                                    
              ELSE                                                              
              IF ACAT11IO-SHORT-ASSET                                           
                 COMPUTE WS-CALC-POSN-QTY ROUNDED =                     MRGIML03
                   (WS-MRGN-POSN-QTY-TYPE5 *  ACAT11IO-ASSET-PCT / 100) MRGIML03
                 IF (WS-MRGN-POSN-QTY-TYPE5 > ZERO                              
                 AND WS-CALC-POSN-QTY > WS-MRGN-POSN-QTY-TYPE5)                 
                 OR (WS-MRGN-POSN-QTY-TYPE5 < ZERO                              
                 AND WS-CALC-POSN-QTY < WS-MRGN-POSN-QTY-TYPE5)                 
                    MOVE WS-MRGN-POSN-QTY-TYPE5 TO ACAT11IO-ASSET-QTY           
                 ELSE                                                           
                    MOVE WS-CALC-POSN-QTY       TO ACAT11IO-ASSET-QTY           
                 END-IF                                                         
                 COMPUTE WS-CALC-PRICE ROUNDED =                                
                     WS-MRGN-POSN-MV-TYPE5 / WS-MRGN-POSN-QTY-TYPE5     MRGIPS05
                       ON SIZE ERROR MOVE 1.00  TO WS-CALC-PRICE                
                 END-COMPUTE                                                    
                 COMPUTE ACAT11IO-ASSET-AMT =                                   
                      ACAT11IO-ASSET-QTY * WS-CALC-PRICE                        
                 END-COMPUTE                                                    
              END-IF END-IF END-IF                                              
           END-IF.                                                              
           IF ACAT11IO-ASSET-AMT LESS .01                                       
              MOVE ACAT11IO-ASSET-QTY TO WS-CALC-POSN-QTY                       
              MOVE WS-CALC-POSN-QTY TO ACAT11IO-ASSET-AMT                       
           END-IF.                                                              
TEST       IF ACAT11IO-ASSET-QTY > ZEROS                                MRGIML03
TEST       AND ACAT11IO-ASSET-AMT LESS .01                                      
TEST           MOVE 1.00 TO ACAT11IO-ASSET-AMT                                  
TEST       END-IF.                                                              
LRM003     MOVE ZERO TO ACAT11IO-ASSET-PCT                              MRGIML03
           SET ACAT11IO-RQST-ASSET-QTY TO TRUE.                                 
                                                                                
LRM024     IF  CHLD-WI-KEY = '1'                                                
LRM024         MOVE 'W'            TO ACAT11IO-WHI-CD                           
LRM024     ELSE                                                                 
LRM024         MOVE 'N'            TO ACAT11IO-WHI-CD                           
LRM024     END-IF.                                                              
                                                                                
******** COMPARE MARGIN QTY TO WHAT WE HAVE, AND DON'T EXCEED...                
           IF ACAT11IO-CASH-ASSET                                               
           AND ACAT11IO-ASSET-QTY NOT = ZERO                                    
              IF WS-MRGN-POSN-QTY-TYPE1 = ZERO                          MRGIPS05
                 MOVE ZERO         TO ACAT11IO-ASSET-QTY                MRGIPS05
                                      ACAT11IO-ASSET-AMT                        
              ELSE                                                              
              IF ACAT11IO-PSTN-CD = 'L'                                         
                 IF WS-MRGN-POSN-QTY-TYPE1 > ZERO                       MRGIPS05
                 AND ACAT11IO-ASSET-QTY > WS-MRGN-POSN-QTY-TYPE1        MRGIPS05
                    MOVE WS-MRGN-POSN-QTY-TYPE1 TO ACAT11IO-ASSET-QTY   MRGIPS05
                    MOVE WS-MRGN-POSN-MV-TYPE1  TO ACAT11IO-ASSET-AMT   MRGIPS05
                 ELSE                                                           
                    IF WS-MRGN-POSN-QTY-TYPE1 < ZERO                    MRGIPS05
                       MOVE ZERO         TO ACAT11IO-ASSET-QTY          MRGIPS05
                                            ACAT11IO-ASSET-AMT                  
                    END-IF                                                      
                 END-IF                                                         
              ELSE                                                              
                 MULTIPLY ACAT11IO-ASSET-QTY BY -1 GIVING                       
                                 WS-CALC-POSN-QTY                       MRGIML03
                 IF WS-MRGN-POSN-QTY-TYPE1 < ZERO                       MRGIPS05
                 AND WS-CALC-POSN-QTY < WS-MRGN-POSN-QTY-TYPE1          MRGIPS05
                    MULTIPLY WS-MRGN-POSN-QTY-TYPE1 BY -1               MRGIPS05
                        GIVING ACAT11IO-ASSET-QTY                       MRGIPS05
                    MOVE WS-MRGN-POSN-MV-TYPE1  TO ACAT11IO-ASSET-AMT   MRGIPS05
                 ELSE                                                           
                    IF WS-MRGN-POSN-QTY-TYPE1 > ZERO                    MRGIPS05
                       MOVE ZERO         TO ACAT11IO-ASSET-QTY          MRGIPS05
                                            ACAT11IO-ASSET-AMT                  
                    END-IF                                                      
                 END-IF                                                         
              END-IF END-IF                                                     
           ELSE                                                                 
           IF ACAT11IO-MARGIN-ASSET                                             
           AND ACAT11IO-ASSET-QTY NOT = ZERO                                    
              IF WS-MRGN-POSN-QTY-TYPE2 = ZERO                          MRGIPS05
                 MOVE ZERO         TO ACAT11IO-ASSET-QTY                MRGIPS05
                                      ACAT11IO-ASSET-AMT                        
              ELSE                                                              
              IF ACAT11IO-PSTN-CD = 'L'                                         
                 IF WS-MRGN-POSN-QTY-TYPE2 > ZERO                       MRGIPS05
                 AND ACAT11IO-ASSET-QTY > WS-MRGN-POSN-QTY-TYPE2        MRGIPS05
                    MOVE WS-MRGN-POSN-QTY-TYPE2 TO ACAT11IO-ASSET-QTY   MRGIPS05
                    MOVE WS-MRGN-POSN-MV-TYPE2  TO ACAT11IO-ASSET-AMT   MRGIPS05
                 ELSE                                                           
                    IF WS-MRGN-POSN-QTY-TYPE2 < ZERO                    MRGIPS05
                       MOVE ZERO         TO ACAT11IO-ASSET-QTY          MRGIPS05
                                            ACAT11IO-ASSET-AMT                  
                    END-IF                                                      
                 END-IF                                                         
              ELSE                                                              
                 MULTIPLY ACAT11IO-ASSET-QTY BY -1 GIVING                       
                                 WS-CALC-POSN-QTY                       MRGIML03
                 IF WS-MRGN-POSN-QTY-TYPE2 < ZERO                       MRGIPS05
                 AND WS-CALC-POSN-QTY < WS-MRGN-POSN-QTY-TYPE2          MRGIPS05
                    MULTIPLY WS-MRGN-POSN-QTY-TYPE2 BY -1               MRGIPS05
                        GIVING ACAT11IO-ASSET-QTY                       MRGIPS05
                    MOVE WS-MRGN-POSN-MV-TYPE2  TO ACAT11IO-ASSET-AMT   MRGIPS05
                 ELSE                                                           
                    IF WS-MRGN-POSN-QTY-TYPE2 > ZERO                    MRGIPS05
                       MOVE ZERO         TO ACAT11IO-ASSET-QTY          MRGIPS05
                                            ACAT11IO-ASSET-AMT                  
                    END-IF                                                      
                 END-IF                                                         
              END-IF END-IF                                                     
           ELSE                                                                 
           IF ACAT11IO-SHORT-ASSET                                              
           AND ACAT11IO-ASSET-QTY NOT = ZERO                                    
              IF WS-MRGN-POSN-QTY-TYPE5 = ZERO                          MRGIPS05
                 MOVE ZERO         TO ACAT11IO-ASSET-QTY                MRGIPS05
                                      ACAT11IO-ASSET-AMT                        
              ELSE                                                              
              IF ACAT11IO-PSTN-CD = 'L'                                         
                 IF WS-MRGN-POSN-QTY-TYPE5 > ZERO                       MRGIPS05
                 AND ACAT11IO-ASSET-QTY > WS-MRGN-POSN-QTY-TYPE5        MRGIPS05
                    MOVE WS-MRGN-POSN-QTY-TYPE5 TO ACAT11IO-ASSET-QTY   MRGIPS05
                    MOVE WS-MRGN-POSN-MV-TYPE5  TO ACAT11IO-ASSET-AMT   MRGIPS05
                 ELSE                                                           
                    IF WS-MRGN-POSN-QTY-TYPE5 < ZERO                    MRGIPS05
                       MOVE ZERO         TO ACAT11IO-ASSET-QTY          MRGIPS05
                                            ACAT11IO-ASSET-AMT                  
                    END-IF                                                      
                 END-IF                                                         
              ELSE                                                              
                 MULTIPLY ACAT11IO-ASSET-QTY BY -1 GIVING                       
                                 WS-CALC-POSN-QTY                       MRGIML03
                 IF WS-MRGN-POSN-QTY-TYPE5 < ZERO                       MRGIPS05
                 AND WS-CALC-POSN-QTY < WS-MRGN-POSN-QTY-TYPE5          MRGIPS05
                    MULTIPLY WS-MRGN-POSN-QTY-TYPE5 BY -1               MRGIPS05
                        GIVING ACAT11IO-ASSET-QTY                       MRGIPS05
                    MOVE WS-MRGN-POSN-MV-TYPE5  TO ACAT11IO-ASSET-AMT   MRGIPS05
                 ELSE                                                           
                    IF WS-MRGN-POSN-QTY-TYPE5 > ZERO                    MRGIPS05
                       MOVE ZERO         TO ACAT11IO-ASSET-QTY          MRGIPS05
                                            ACAT11IO-ASSET-AMT                  
                    END-IF                                                      
                 END-IF                                                         
              END-IF END-IF                                                     
           END-IF.                                                              
           MOVE  ACAT11IO-ASSET-QTY TO WS-CALC-POSN-QTY.                        
           MOVE  ACAT11IO-ASSET-AMT TO WS-CASH-AMT.                             
       0530-REPLACE-ASSET-QTY-EXIT. EXIT.                                       
                                                                                
       0535-SET-CASH-ACCOUNT-TYPE.                                              
           IF STTLM-RSN-CD OF DCLVASSET = 'CRED'                                
              IF WS-MRGN-BAL-TYPE1 < ZERO                                       
                 SET ACAT11IO-CASH-ASSET TO TRUE                                
              ELSE                                                              
              IF WS-MRGN-BAL-TYPE2 < ZERO                                       
                 SET ACAT11IO-MARGIN-ASSET TO TRUE                              
              ELSE                                                              
                 SET ACAT11IO-CASH-ASSET TO TRUE                                
           ELSE                                                                 
              IF WS-MRGN-BAL-TYPE1 > ZERO                                       
                 SET ACAT11IO-CASH-ASSET TO TRUE                                
              ELSE                                                              
              IF WS-MRGN-BAL-TYPE2 > ZERO                                       
                 SET ACAT11IO-MARGIN-ASSET TO TRUE                              
              ELSE                                                              
                 SET ACAT11IO-MARGIN-ASSET TO TRUE                              
           END-IF.                                                              
                                                                                
       0537-SET-POSN-ACCOUNT-TYPE.                                              
           IF PSTN-CD OF DCLVASSET = 'L'                                        
              IF WS-MRGN-POSN-QTY-TYPE1 > ZERO                                  
                 SET ACAT11IO-CASH-ASSET TO TRUE                                
              ELSE                                                              
              IF WS-MRGN-POSN-QTY-TYPE2 > ZERO                                  
                 SET ACAT11IO-MARGIN-ASSET TO TRUE                              
              ELSE                                                              
                 SET ACAT11IO-CASH-ASSET TO TRUE                                
           ELSE                                                                 
              IF WS-MRGN-POSN-QTY-TYPE1 < ZERO                                  
                 SET ACAT11IO-CASH-ASSET TO TRUE                                
              ELSE                                                              
              IF WS-MRGN-POSN-QTY-TYPE2 < ZERO                                  
                 SET ACAT11IO-MARGIN-ASSET TO TRUE                              
              ELSE                                                              
              IF WS-MRGN-POSN-QTY-TYPE5 < ZERO                                  
                 SET ACAT11IO-SHORT-ASSET TO TRUE                               
              ELSE                                                              
                 SET ACAT11IO-CASH-ASSET TO TRUE                                
           END-IF.                                                              
                                                                                
       OBTAIN-MARGIN-POSN-RTN.                                                  
           MOVE ZEROS                 TO WS-MRGN-POSN-QTY-TYPE1         MRGIPS05
                                         WS-MRGN-POSN-MV-TYPE1          MRGIPS05
                                         WS-MRGN-POSN-QTY-TYPE2         MRGIPS05
                                         WS-MRGN-POSN-MV-TYPE2          MRGIPS05
                                         WS-MRGN-POSN-QTY-TYPE5         MRGIPS05
                                         WS-MRGN-POSN-MV-TYPE5.         MRGIPS05
HOLIO**--------------------------------------------------------------*          
     **  UNTIL ALPHANUMERIC BRANCH ACCOUNT OF HOLIO IS AVAILABLE, WE            
     **  HAVE TO USE NUMERIC BRANCH/ACCOUNTS (PACKED KEYS HERE).                
HOLIO**--------------------------------------------------------------*          
00548      MOVE ACAT11IO-CLIENT-NBR       TO KEY-CLIENT.                MRGIPS05
00549      MOVE ACAT11IO-DLVR-ACCT        TO KEY-BRANCH.                MRGIPS05
00550      MOVE ACAT11IO-DLVR-ACCT(4 : 5) TO KEY-ACCNT.                 MRGIPS05
00551      MOVE ZEROS                 TO KEY-CURR-CODE.                 MRGIPS05
00552      MOVE 'B'                   TO IO-SHADOW-IND.                 MRGIPS05
00552      MOVE 'N'                   TO IO-FUNC-CODE.                  MRGIPS05
00553      MOVE 'N'                   TO IO-FUNC-CODE-NEW.              MRGIPS05
00554      MOVE '01'                  TO KEY-REC-TYPE.                  MRGIPS05
00555      MOVE '0'                   TO ZERO-ACCNT.                    MRGIPS05
00556      MOVE ACAT11IO-ADP-NBR      TO KEY-CUSIP-NUM.                 MRGIPS05
LRM024*****IF  ACAT11IO-WHI-CD = 'W'                                            
LRM024*****   MOVE '1'                TO KEY-WIC-KEY                            
LRM024*****END-IF.                                                              
*******    IF ACAT11IO-CASH-ASSET                                               
*******       MOVE '01'               TO KEY-ACCNT-TYPE                 MRGIPS05
*******    ELSE                                                                 
*******    IF ACAT11IO-MARGIN-ASSET                                             
*******       MOVE '02'               TO KEY-ACCNT-TYPE                 MRGIPS05
*******    ELSE                                                                 
*******    IF ACAT11IO-SHORT-ASSET                                              
*******       MOVE '05'               TO KEY-ACCNT-TYPE                 MRGIPS05
*******    ELSE                                                                 
              MOVE '01'               TO KEY-ACCNT-TYPE                 MRGIPS05
*******    END-IF.                                                              
                                                                                
           MOVE PSKEY                 TO IO-HOL-KEY                     MRGIPS05
                                         SAVEKEY.                               
           SET IO-MEMO-REQUEST TO TRUE.                                         
*********  SET IO-READ-XREF         TO TRUE.                                    
       GET-MRGN-POSN-RECORD.                                            MRGIPS05
           MOVE B1-CARD-OPTION      TO IO-XREF-B1-CARD-OPTION.                  
           SET IO-ENTERED-SECURITY  TO TRUE.                                    
LRM        MOVE ALL '0' TO WS-99-MEMO-SUBS-AREA.                                
LRM        SET IO-MEMO-REQUEST TO TRUE.                                         
                                                                                
00590      EXEC CICS LINK PROGRAM ('CUSHOLIO')                          MRGIPS05
00591                     COMMAREA(IO-COMMAREA)                         MRGIPS05
00592                     LENGTH  (LENGTH OF IO-COMMAREA)               MRGIPS05
00593      END-EXEC.                                                    MRGIPS05
00594                                                                   MRGIPS05
                                                                                
00595      MOVE IO-RET-CODE        TO REAL-CODE.                        MRGIPS05
           IF IO-OTHER-ERROR                                                    
              NEXT SENTENCE                                                     
           ELSE                                                                 
00596         ADD 1                TO REAL-CODE.                        MRGIPS05
00597                                                                   MRGIPS05
00598                                                                   MRGIPS05
00599      IF REAL-CODE GREATER THAN 6                                  MRGIPS05
00600               GO TO IOERROR                                       MRGIPS05
00601      ELSE                                                         MRGIPS05
00602               GO TO  HOLGO-RTN,                                   MRGIPS05
00603                      INVREQERR,                                   MRGIPS05
00604                      OPENERR,                                     MRGIPS05
00605                      OBTAIN-MARGIN-POSN-EXIT,                     MRGIPS05
00606                      OBTAIN-MARGIN-POSN-EXIT,                     MRGIPS05
00607                      OBTAIN-MARGIN-POSN-EXIT,                     MRGIPS05
00608               DEPENDING ON REAL-CODE.                             MRGIPS05
00609                                                                   MRGIPS05
00610  HOLGO-RTN.                                                       MRGIPS05
00611      SET ADDRESS OF CHLD-SUMMARY-SEGMENT    TO IO-RECORD-POINTER. MRGIPS05
00612       MOVE CHLD-KEY          TO TEMPKEY.                          MRGIPS05
00613       MOVE IO-HOL-KEY        TO PSKEY.                            MRGIPS05
                                                                                
            MOVE IO-XREF-B1-CARD-OPTION  TO B1-CARD-OPTION.                     
                                                                                
00614       IF (CHLD-KEY = HIGH-VALUE)                                  MRGIPS05
00615          OR                                                       MRGIPS05
00616             (SAV-KEY NOT = TEMP-KEY)                              MRGIPS05
               OR                                                               
                  (KEY-CURCOD NOT = '000000')                           MRGIPS05
00617                     GO TO OBTAIN-MARGIN-POSN-FREEZE-CK.           MRGIPS05
00618       IF CHLD-SECURITY-NUMBER = HIGH-VALUE                        MRGIPS05
               GO TO SET-NEXT-HOLIO-ACCT-TYPE.                                  
      *------------------------------------------------------------             
      *   THIS RTN. IS CHECK ENTERED CURRENCY CODE AND SECURITY                 
00636  CHECK-OPEN-ORDER.                                                MRGIPS05
00623       IF KEY-REC-TYPE = '21'                                      MRGIPS05
00624        SET ADDRESS OF CHOO-SUMMARY-SEGMENT  TO IO-RECORD-POINTER  MRGIPS05
00626        SET ADDRESS OF CHLD-SUMMARY-SEGMENT  TO IO-RECORD-POINTER. MRGIPS05
00628                                                                   MRGIPS05
00643  CHECK-KEY.                                                       MRGIPS05
00644       IF MAIN-SAVKEY = MAIN-TEMPKEY                               MRGIPS05
00645          GO TO CHECK-SEC.                                         MRGIPS05
                                                                                
            GO TO OBTAIN-MARGIN-POSN-FREEZE-CK.                                 
                                                                                
00663  CHECK-SEC.                                                       MRGIPS05
00666       MOVE CHLD-ACCOUNT-TYPE     TO UNPK-TYPE.                    MRGIPS05
00664       IF ACAT11IO-ADP-NBR NOT = CHLD-SECURITY-NUMBER(1 : 7)       MRGIPS05
               GO TO SET-NEXT-HOLIO-ACCT-TYPE.                                  
00667       IF WK-PS-TYPE = HIGH-VALUE                                  MRGIPS05
00668                      GO TO OBTAIN-MARGIN-POSN-FREEZE-CK.          MRGIPS05
            IF WK-PS-TYPE = '1'                                                 
00721         ADD CHLD-YESTERDAY-TOTAL-UNITS TO WS-MRGN-POSN-QTY-TYPE1  MRGIPS05
LRM031        IF CHLD-MARKET-VALUE NOT = ZERO                           MRGIPS05
                 ADD CHLD-MARKET-VALUE       TO WS-MRGN-POSN-MV-TYPE1   MRGIPS05
LRM031        ELSE                                                              
LRM031           COMPUTE WS-MRGN-POSN-MV-TYPE1 =                        MRGIPS05
LRM031                CHLD-YESTERDAY-TOTAL-UNITS / 100                          
LRM031        END-IF                                                            
            ELSE                                                                
            IF WK-PS-TYPE = '2'                                                 
00721         ADD CHLD-YESTERDAY-TOTAL-UNITS TO WS-MRGN-POSN-QTY-TYPE2  MRGIPS05
LRM031        IF CHLD-MARKET-VALUE NOT = ZERO                           MRGIPS05
                 ADD CHLD-MARKET-VALUE        TO WS-MRGN-POSN-MV-TYPE2  MRGIPS05
LRM031        ELSE                                                              
LRM031           COMPUTE WS-MRGN-POSN-MV-TYPE2 =                        MRGIPS05
LRM031                CHLD-YESTERDAY-TOTAL-UNITS / 100                          
LRM031        END-IF                                                            
            ELSE                                                                
            IF WK-PS-TYPE = '5'                                                 
00721         ADD CHLD-YESTERDAY-TOTAL-UNITS TO WS-MRGN-POSN-QTY-TYPE5  MRGIPS05
LRM031        IF CHLD-MARKET-VALUE NOT = ZERO                           MRGIPS05
                 ADD CHLD-MARKET-VALUE        TO WS-MRGN-POSN-MV-TYPE5  MRGIPS05
LRM031        ELSE                                                              
LRM031           COMPUTE WS-MRGN-POSN-MV-TYPE5 =                        MRGIPS05
LRM031                CHLD-YESTERDAY-TOTAL-UNITS / 100                          
LRM031        END-IF                                                            
            END-IF.                                                             
       SET-NEXT-HOLIO-ACCT-TYPE.                                                
LRM024      IF KEY-WIC-KEY = '1'                                                
LRM024      AND ACAT11IO-ADP-NBR = CHLD-SECURITY-NUMBER                         
LRM024         GO TO GET-MRGN-POSN-RECORD.                                      
LRM004      IF SAV-ACCNT-TYPE = '01'                                            
               MOVE '02' TO IO-HOL-ACCT-TYPE                                    
LRM004                      SAV-ACCNT-TYPE                                      
               MOVE ACAT11IO-ADP-NBR  TO IO-HOL-SECURITY-NO             MRGIPS05
               GO TO GET-MRGN-POSN-RECORD.                                      
LRM004      IF SAV-ACCNT-TYPE < '05'                                            
               MOVE '05' TO IO-HOL-ACCT-TYPE                                    
LRM004                      SAV-ACCNT-TYPE                                      
               MOVE ACAT11IO-ADP-NBR  TO IO-HOL-SECURITY-NO             MRGIPS05
               GO TO GET-MRGN-POSN-RECORD.                                      
LRM017 OBTAIN-MARGIN-POSN-FREEZE-CK.                                    MRGIPS05
LRM017***-------------------------------------------------------------* MRGIPS05
LRM017* WIPE OUT LONG OR SHORT QTY FROM MARGIN IF FROZEN AS NEEDED,   * MRGIPS05
LRM017* TO CAUSE ASSET NOT TO FULFILL ON PF4.                         * MRGIPS05
LRM017* NOTE - THE FREEZE IS BASED ON BOOKKEEPING, AND DELIVERY OF A  * MRGIPS05
LRM017* LONG CAUSES A SHORT TO THE ACCOUNT.                           * MRGIPS05
LRM017***-------------------------------------------------------------* MRGIPS05
LRM017     IF ACAT11IO-CURR-FREEZE-SEC-LONG  = 'Y'                              
LRM017        IF WS-MRGN-POSN-QTY-TYPE1 < ZERO                          MRGIPS05
LRM017           IF SEC-LONG-FREEZE-MEMO-CREATED                        MRGIPS05
LRM017              MOVE ZERO TO WS-MRGN-POSN-QTY-TYPE1                 MRGIPS05
LRM017                           WS-MRGN-POSN-MV-TYPE1                  MRGIPS05
LRM017           ELSE                                                   MRGIPS05
LRM017              SET CREATE-SEC-LONG-FREEZE-MEMO TO TRUE             MRGIPS05
LRM017           END-IF                                                 MRGIPS05
LRM017        END-IF                                                    MRGIPS05
LRM017        IF WS-MRGN-POSN-QTY-TYPE2 < ZERO                          MRGIPS05
LRM017           IF SEC-LONG-FREEZE-MEMO-CREATED                        MRGIPS05
LRM017              MOVE ZERO TO WS-MRGN-POSN-QTY-TYPE2                 MRGIPS05
LRM017                           WS-MRGN-POSN-MV-TYPE2                  MRGIPS05
LRM017           ELSE                                                   MRGIPS05
LRM017              SET CREATE-SEC-LONG-FREEZE-MEMO TO TRUE             MRGIPS05
LRM017           END-IF                                                 MRGIPS05
LRM017        END-IF                                                    MRGIPS05
LRM017        IF WS-MRGN-POSN-QTY-TYPE5 < ZERO                          MRGIPS05
LRM017           IF SEC-LONG-FREEZE-MEMO-CREATED                        MRGIPS05
LRM017             MOVE ZERO TO WS-MRGN-POSN-QTY-TYPE5                  MRGIPS05
LRM017                          WS-MRGN-POSN-MV-TYPE5                   MRGIPS05
LRM017           ELSE                                                   MRGIPS05
LRM017              SET CREATE-SEC-LONG-FREEZE-MEMO TO TRUE             MRGIPS05
LRM017           END-IF                                                 MRGIPS05
LRM017     END-IF.                                                      MRGIPS05
LRM017     IF ACAT11IO-CURR-FREEZE-SEC-SHORT = 'Y'                              
LRM017        IF WS-MRGN-POSN-QTY-TYPE1 > ZERO                          MRGIPS05
LRM017           IF SEC-SHORT-FREEZE-MEMO-CREATED                       MRGIPS05
LRM017              MOVE ZERO TO WS-MRGN-POSN-QTY-TYPE1                 MRGIPS05
LRM017                           WS-MRGN-POSN-MV-TYPE1                  MRGIPS05
LRM017           ELSE                                                   MRGIPS05
LRM017              SET CREATE-SEC-SHORT-FREEZE-MEMO TO TRUE            MRGIPS05
LRM017           END-IF                                                 MRGIPS05
LRM017        END-IF                                                    MRGIPS05
LRM017        IF WS-MRGN-POSN-QTY-TYPE2 > ZERO                          MRGIPS05
LRM017           IF SEC-SHORT-FREEZE-MEMO-CREATED                       MRGIPS05
LRM017              MOVE ZERO TO WS-MRGN-POSN-QTY-TYPE2                 MRGIPS05
LRM017                           WS-MRGN-POSN-MV-TYPE2                  MRGIPS05
LRM017           ELSE                                                   MRGIPS05
LRM017              SET CREATE-SEC-SHORT-FREEZE-MEMO TO TRUE            MRGIPS05
LRM017           END-IF                                                 MRGIPS05
LRM017        END-IF                                                    MRGIPS05
LRM017        IF WS-MRGN-POSN-QTY-TYPE5 > ZERO                          MRGIPS05
LRM017           IF SEC-SHORT-FREEZE-MEMO-CREATED                       MRGIPS05
LRM017              MOVE ZERO TO WS-MRGN-POSN-QTY-TYPE5                 MRGIPS05
LRM017                           WS-MRGN-POSN-MV-TYPE5                  MRGIPS05
LRM017           ELSE                                                   MRGIPS05
LRM017              SET CREATE-SEC-SHORT-FREEZE-MEMO TO TRUE            MRGIPS05
LRM017           END-IF                                                 MRGIPS05
LRM017        END-IF                                                    MRGIPS05
LRM017     END-IF.                                                      MRGIPS05
       OBTAIN-MARGIN-POSN-EXIT. EXIT.                                           
                                                                                
                                                                                
01402  INVREQERR.                                                               
            MOVE EIBDS                   TO ERR-EIBDS.                          
01403       MOVE 'POSN FILE INVALID REQUEST ERROR'                      MRGIPS05
                  TO ERR-MSG2                                                   
01404        GO TO DISPERR.                                             MRGIPS05
01405                                                                   MRGIPS05
01406  IOERROR.                                                         MRGIPS05
             MOVE EIBDS                   TO ERR-EIBDS.                         
01407        MOVE 'POSN FILE I/O ERROR'   TO ERR-MSG2.                  MRGIPS05
01408        GO TO DISPERR.                                             MRGIPS05
01409                                                                   MRGIPS05
01410  OPENERR.                                                         MRGIPS05
             MOVE EIBDS                   TO ERR-EIBDS.                         
01411        MOVE 'POSN FILE IS CLOSED'   TO ERR-MSG2.                  MRGIPS05
01412        GO TO DISPERR.                                             MRGIPS05
                                                                                
       DISPERR.                                                         MRGIPS05
           MOVE ERR-MSG TO ACAT11IO-SQLERRMC.                                   
           EXEC CICS SYNCPOINT ROLLBACK END-EXEC.                               
           SET ACAT11IO-HOLIO-ERROR TO TRUE                                     
           MOVE WS-COMMAREA TO DFHCOMMAREA(1 : WS-EIBCALEN).                    
           EXEC CICS RETURN END-EXEC.                                   06220000
                                                                        MRGIPS05
062700 EJECT                                                            06080002
       OBTAIN-MARGIN-BAL-RTN.                                                   
                                                                                
           MOVE ZEROS TO WS-MRGN-BAL-TYPE1                                      
                         WS-MRGN-BAL-TYPE2                                      
                         WS-MRGN-BAL-TYPE5.                                     
                                                                                
           MOVE LOW-VALUES                      TO IOB-COMMAREA.                
           MOVE 'R'                             TO IOB-FUNC-CODE.               
           MOVE 'N'                             TO IOB-FUNC-CODE-NEW.           
           MOVE ACAT11IO-CLIENT-NBR             TO WS-BALNC-CLIENT.             
           MOVE ACAT11IO-DLVR-ACCT              TO WS-BALNC-BRANCH.             
           MOVE ACAT11IO-DLVR-ACCT(4 : 5)       TO WS-BALNC-ACCOUNT.            
           MOVE ZERO                            TO WS-BALNC-CURR.               
           MOVE WS-BALNC-KEY                    TO IOB-BAL-KEY.                 
           MOVE 'B'                             TO IOB-SHADOW-IND.              
                                                                                
           EXEC CICS LINK PROGRAM('CUSBALIO')                                   
                          COMMAREA(IOB-COMMAREA)                                
                          LENGTH(LENGTH OF IOB-COMMAREA)                        
                          END-EXEC.                                             
00281                                                                           
00282      IF IOB-INV-FUNC                                                      
00283         GO TO BALIO-INVREQ.                                               
00284      IF IOB-FILE-CLOSED                                                   
00285         GO TO BALIO-NOTOPEN.                                              
00286      IF IOB-NOT-FOUND                                                     
              GO TO OBTAIN-MARGIN-BAL-EXIT.                                     
           IF IOB-GOOD-RETURN                                                   
              GO TO SET-ADDRESS.                                                
00288      IF NOT IOB-GOOD-RETURN                                               
00289         GO TO BALIO-ILLOGIC.                                              
00290                                                                           
       SET-ADDRESS.                                                             
00291      SET ADDRESS OF CMBL-CUSTOMER-BALANCE-SEGMENT                         
00292                                           TO IOB-RECORD-POINTER.          
                                                                                
           IF WS-BALNC-KEY(1:19) NOT = CMBL-KEY(1:19)                           
           OR CMBL-CURRENCY-CODE NOT = '000000'                                 
              GO TO OBTAIN-MARGIN-BAL-EXIT.                                     
******** MOVE BALANCES...                                                       
           IF CMBL-ACTYP1-PRESENT = 1                                           
              MOVE CMBL1-TRADE-DATE-BAL-YSTDY (1) TO WS-MRGN-BAL-TYPE1          
              IF CMBL-MM-FUND-YEST NUMERIC                                      
                 SUBTRACT CMBL-MM-FUND-YEST     FROM WS-MRGN-BAL-TYPE1          
LRM032           PERFORM READ-BANK-DEPOSIT-RTN                                  
           END-IF.                                                              
           IF CMBL-ACTYP2-PRESENT = 1                                           
              MOVE CMBL2-TRADE-DATE-BAL-YSTDY (1) TO WS-MRGN-BAL-TYPE2          
           END-IF.                                                              
           IF CMBL-ACTYP5-PRESENT = 1                                           
              MOVE CMBL5-TRADE-DATE-BAL-YSTDY (1) TO WS-MRGN-BAL-TYPE5          
           END-IF.                                                              
                                                                                
LRM017*** WHEN DELIVERING A CREDIT, IT WILL CAUSE A DEBIT TO CASH.              
LRM017     IF ACAT11IO-CURR-FREEZE-CASH-CR = 'Y'                                
LRM017        IF WS-MRGN-BAL-TYPE1 > ZERO                                       
LRM017           MOVE ZERO TO ACAT11IO-AMT-01                                   
LRM017           IF CASH-DB-FREEZE-MEMO-CREATED                         MRGIPS05
LRM017              MOVE ZERO TO WS-MRGN-BAL-TYPE1                              
LRM017           ELSE                                                           
LRM017              SET CREATE-CASH-DB-FREEZE-MEMO TO TRUE                      
LRM017           END-IF                                                         
LRM017        END-IF                                                            
LRM017        IF WS-MRGN-BAL-TYPE2 > ZERO                                       
LRM017           MOVE ZERO TO ACAT11IO-AMT-02                                   
LRM017           IF CASH-DB-FREEZE-MEMO-CREATED                         MRGIPS05
LRM017              MOVE ZERO TO WS-MRGN-BAL-TYPE2                              
LRM017           ELSE                                                           
LRM017              SET CREATE-CASH-DB-FREEZE-MEMO TO TRUE                      
LRM017           END-IF                                                         
LRM017        END-IF                                                            
LRM017        IF WS-MRGN-BAL-TYPE5 > ZERO                                       
LRM017           MOVE ZERO TO ACAT11IO-AMT-05                                   
LRM017           IF CASH-DB-FREEZE-MEMO-CREATED                         MRGIPS05
LRM017              MOVE ZERO TO WS-MRGN-BAL-TYPE5                              
LRM017           ELSE                                                           
LRM017              SET CREATE-CASH-DB-FREEZE-MEMO TO TRUE                      
LRM017           END-IF                                                         
LRM017        END-IF                                                            
LRM017     END-IF.                                                              
LRM017     IF ACAT11IO-CURR-FREEZE-CASH-DB = 'Y'                                
LRM017        IF WS-MRGN-BAL-TYPE1 < ZERO                                       
LRM017           MOVE ZERO TO ACAT11IO-AMT-01                                   
LRM017           IF CASH-CR-FREEZE-MEMO-CREATED                         MRGIPS05
LRM017              MOVE ZERO TO WS-MRGN-BAL-TYPE1                              
LRM017           ELSE                                                           
LRM017              SET CREATE-CASH-CR-FREEZE-MEMO TO TRUE                      
LRM017           END-IF                                                         
LRM017        END-IF                                                            
LRM017        IF WS-MRGN-BAL-TYPE2 < ZERO                                       
LRM017           MOVE ZERO TO ACAT11IO-AMT-02                                   
LRM017           IF CASH-CR-FREEZE-MEMO-CREATED                         MRGIPS05
LRM017              MOVE ZERO TO WS-MRGN-BAL-TYPE2                              
LRM017           ELSE                                                           
LRM017              SET CREATE-CASH-CR-FREEZE-MEMO TO TRUE                      
LRM017           END-IF                                                         
LRM017        END-IF                                                            
LRM017        IF WS-MRGN-BAL-TYPE5 < ZERO                                       
LRM017           MOVE ZERO TO ACAT11IO-AMT-05                                   
LRM017           IF CASH-CR-FREEZE-MEMO-CREATED                         MRGIPS05
LRM017              MOVE ZERO TO WS-MRGN-BAL-TYPE5                              
LRM017           ELSE                                                           
LRM017              SET CREATE-CASH-CR-FREEZE-MEMO TO TRUE                      
LRM017           END-IF                                                         
LRM017        END-IF                                                            
LRM017     END-IF.                                                              
       OBTAIN-MARGIN-BAL-EXIT. EXIT.                                            
                                                                                
01402  BALIO-INVREQ.                                                            
            MOVE EIBDS                   TO ERR-EIBDS.                          
01403       MOVE 'BALIO INVALID REQUEST ERROR'                                  
                  TO ERR-MSG2                                                   
01404        GO TO DISPERR.                                                     
01405                                                                           
       BALIO-ILLOGIC.                                                           
             MOVE EIBDS                   TO ERR-EIBDS.                         
01407        MOVE 'BALIO I/O ERROR'       TO ERR-MSG2.                          
01408        GO TO DISPERR.                                                     
01409                                                                           
01410  BALIO-NOTOPEN.                                                           
             MOVE EIBDS                   TO ERR-EIBDS.                         
01411        MOVE 'BALIO IS CLOSED'       TO ERR-MSG2.                          
01412        GO TO DISPERR.                                                     
                                                                                
LRM032 READ-BANK-DEPOSIT-RTN.                                                   
LRM032     MOVE LOW-VALUE    TO LBB-COMMAREA                                    
LRM032     MOVE ACAT11IO-CLIENT-NBR TO ACATRSIO-CLIENT-NBR                      
LRM032     MOVE ACAT11IO-DLVR-ACCT(1:3) TO LBB-COMM-BRANCH                      
LRM032     MOVE ACAT11IO-DLVR-ACCT(4:5) TO LBB-COMM-ACCOUNT                     
TEMP********  OBTAIN LIST OF BDF ADP NUMBERS FROM VRSTSEC M### ROWS             
LRM032     SET ACATRSIO-LOOKUP-BANK-DEPOSIT TO TRUE.                            
LRM032     MOVE ZERO TO ACATRSIO-BDF-COUNT                                      
LRMO32     EXEC CICS LINK PROGRAM (WS-ACATRST)                                  
LRM032          COMMAREA(ACATRSTIO-CALL-AREA)                                   
LRM032          LENGTH(LENGTH OF ACATRSTIO-CALL-AREA)                           
LRM032     END-EXEC.                                                            
LRM032     IF ACATRSIO-FOUND                                                    
LRM032        MOVE ACAT11IO-CLIENT-NBR(2:3) TO LBB-COMM-CLIENT-NO               
LRM032        MOVE ACATRSIO-BDF-AREA     TO WS-BDF-SECURITY-TABLE               
LRM032        PERFORM VARYING SUB FROM 1 BY 1                                   
LRM032                UNTIL SUB > WS-BDF-COUNT                                  
LRM032           MOVE WS-BDF-SEC-ENTRY(SUB) TO LBB-COMM-SECURITY                
LRM032           EXEC CICS LINK PROGRAM(WS-MRGRLBB)                             
LRM032               COMMAREA(LB-BANK-COMM-AREA)                                
LRM032               LENGTH(LENGTH OF LB-BANK-COMM-AREA)                        
LRM032           END-EXEC                                                       
LRM032           IF LBB-COMM-GOOD-RETURN                                        
LRM032              SUBTRACT LBB-COMM-YEST-TOT-UNITS                            
LRM032                                         FROM WS-MRGN-BAL-TYPE1           
LRM032           END-IF                                                         
LRM032        END-PERFORM                                                       
LRM032     END-IF.                                                              
           EJECT                                                                
       ABENDED.                                                                 
     ***   EXEC CICS ASSIGN ABCODE(WS-ABCODE) END-EXEC.                         
     ***   MOVE WS-ABEND-MESSAGE TO BHST-MESSAGE.                               
     ***   MOVE '9999' TO BHST-RETURN-CODE.                                     
           MOVE WS-COMMAREA TO DFHCOMMAREA(1 : WS-EIBCALEN).                    
           EXEC CICS RETURN END-EXEC.                                           
      *==============================                                           
                                                                                
       9000-WRITE-TO-CICS-LOG.                                                  
      *==============================                                           
     ***   MOVE SQLCODE TO BHST-SQLCODE.                                        
           IF SQLCODE = -803                                                    
               CONTINUE                                                         
           ELSE                                                                 
               MOVE SPACES             TO WS-ERRL-DATA                          
               SET WRITE-ERROR-TO-LOG  TO TRUE                                  
               MOVE EIBTRNID           TO CALLING-TRAN-ID                       
               MOVE 'ACAT11DB'         TO CALLING-PROGRAM-ID                    
               MOVE SQLCA              TO SQLCA-AREA                            
               EXEC CICS LINK PROGRAM ('FPDB2LOG')                              
                     COMMAREA (WS-ERRL-DATA)                                    
                     LENGTH (LENGTH OF WS-ERRL-DATA) NOHANDLE                   
               END-EXEC                                                         
           END-IF.                                                              
                                                                                
       9500-RETURN-DB2-ERROR.                                                   
           EXEC CICS SYNCPOINT ROLLBACK END-EXEC.                               
           SET ACAT11IO-DB2-ERROR TO TRUE                                       
           MOVE SQLCAID TO ACAT11IO-SQLCAID                                     
           MOVE SQLCODE TO ACAT11IO-SQLCODE                                     
           MOVE SQLERRM TO ACAT11IO-SQLERRM                                     
           MOVE WS-COMMAREA TO DFHCOMMAREA(1 : WS-EIBCALEN).                    
           EXEC CICS RETURN END-EXEC.                                   06220000
