000001* PDX    - ACAT03IP C0354742 05/27/14 08:18:32 TBCHKOP            00001000
CSG001* SSR 101121 REPLACE ILLEGAL CHARS IN MSD-DESC WITH SPACES.               
000001* PDX    - ACAT03IP C0342789 07/29/13 09:27:11 TBLAMUR            00001000
LRM031* SSR 91019 USE CUSIP WHEN PRESENT ON MSD, NOT ISIN.                      
000001* PDX    - ACAT03IP C0330859 10/22/12 14:03:18 TBLAMUR            00001000
LRM030* SSR 85105 USE 12 ISIN ON DATABASE FOR A FOREIGN ISIN (NON US).          
000001* PDX    - ACAT03IP C0318727 01/11/12 13:20:48 TBLAMUR            00001000
000001* PDX    - ACAT03IP C0312396 05/27/11 07:57:29 TBLAMUR            00001000
LRM029* SSR# 77617 ALLOW MULTIPLE PTF REQUEST FOR SAME ACCOUNT/FUND CO.         
000001* PDX    - ACAT03IP C0307245 03/21/11 09:42:09 TBLAMUR            00001000
LRM028* SSR# 74450 ALLOW FULL REQUEST OF SHORT OPTION.                          
000001* PDX    - ACAT03IP C0305327 12/14/10 08:53:26 TBLAMUR            00001000
LRM027* SSR# 73009 USE COPY CATACTYP TO STANDARIZE ACCOUNT TYPE LOOKUP.         
000001* PDX    - ACAT03IP C0300215 08/10/10 14:20:05 TBLAMUR            00001000
LRM026* SSR# 70251 CAUSE TRANSFER LEVEL COMMENT SCREEN POP-UP AFTER             
LRM026* THE PTR WAS ENTERED CLEAN.                                              
000001* PDX    - ACAT03IP C0289853 12/28/09 15:34:48 TBLAMUR            00001000
LRM025* SSR# 59603 OPTION SYMBOLOGY CHANGE TO ADD OPTION EXP DT,                
LRM025* P/C, L/S AND STRIKE PRICE TO SCREEN, ALLOW OPTION ENTRY VIA             
LRM025* THESE WITH SYMBOL.  CALL GETADPNO TO LOOKUP.                            
000001* PDX    - ACAT03IP C0288029 11/09/09 14:23:01 TBLAMUR            00001000
LRM024* SSR# 59603 OPTION SYMBOLOGY CHANGE TO ALLOW ASSET AMT LESS 1.00         
000001* PDX    - ACAT03IP C0278346 03/17/09 08:03:40 TBLAMUR            00001000
LRM023* SSR# 61867 UPGRADE RESTICTED SECURITY FOUND MSG                         
000001* PDX    - ACAT03IP C0275533 03/13/09 14:23:45 TBLAMUR            00001000
LRM022* SSR# 57674 CHANGE RECORD ADDED MSG TO STATE AWAITING XMIT               
LRM022* IF APPLICABLE TO DO SO.                                                 
000001* PDX    - ACAT03IP C0272581 01/27/09 10:36:08 TBLAMUR            00001000
LRM021* SSR# 66164 ALLOW INITIATION WITH FUND COMPANY PRT-TYPE = 3,             
LRM021*      AND CUST-TYPE SS ON PTF.                                           
000001* PDX    - ACAT03IP C0273647 11/26/08 12:01:07 TBLAMUR            00001000
LRM020* MODIFY SSR 57271 WHEN BOTH ACCOUNT AND CUST TYPE ENTERED/CHANGED        
LRM020* AT THE SAME TIME, ACCEPT CUST TYPE AS KEYED, DON'T DEFAULT IT.          
000001* PDX    - ACAT03IP C0267683 09/24/08 09:17:41 TBLAMUR            00001000
LRM019* SSR# 57271 RESET CUST ACCOUNT TYPE ON ACCOUNT CHANGE                    
LRM018* SSR# 56326 RETAIN COMMENT ON FULL CASH REQUEST.                         
000001* PDX    - ACAT03IP C0263391 07/21/08 08:25:38 TBLAMUR            00001000
LRM017* SSR# 55766 ASCENDIS INTERFACE. BROWSE ONLY UNLESS SCON OVERRIDE         
000001* PDX    - ACAT03IP C0266453 06/12/08 08:19:27 TBLAMUR            00001000
LRM017* INSTALL WHEN-ISSUE CHANGE.                                              
000001* PDX    - ACAT03IP C0250441 07/27/07 15:33:57 TBLAMUR            00001000
LRM016* SSR# 53075 SPIN-OFF CHANGES                                             
000001* PDX    - ACAT03IP C0240732 11/09/06 13:35:44 TBLAMUR            00001000
LRM015* SSR# 49202 ALLOW 6 NEW ACCOUNT TYPES.                                   
000001* PDX    - ACAT03IP C0240592 10/20/06 14:28:42 TBLAMUR            00001000
LRM014* SSR# 48634 USE N/A ADT CUSTOMER TYPE TO LOOKUP ACCOUNT TYPE             
000001* PDX    - ACAT03IP C0231507 06/23/06 08:11:19 TBLAMUR            00001000
LRM013* SSR# 45744 BLOCK ENTRY BASED ON ACCOUNT FREEZE                          
LRM013* SSR# 40661 RETAIN USER ID OF INITIATOR.                                 
LRM013*      RESOLVE ISSUE ENTERING FULL IN BALANCE FIELDS AFTER EOF.           
000001* PDX    - ACAT03IP C0230641 02/07/06 10:38:19 TBLAMUR            00001000
LRM012* SSR# 40943 UPGRADE OPTION LOGIC                                         
000001* PDX    - ACAT03IP C0227932 12/12/05 08:58:29 TBLAMUR            00001000
LRM011* SSR# 45207 ALLOW FULL CASH REQUEST                                      
000001* PDX    - ACAT03IP C0227932 11/29/05 09:55:34 TBLAMUR            00001000
LRM010* SSR# 42405 CONTRA ACCOUNT EDIT WARNING, B1 434730                       
000001* PDX    - ACAT03IP C0225533 10/10/05 10:09:53 TBLAMUR            00001000
LRM009* SSR 0043083 ALLOW ASSET REQUEST ASSET FULL AND REMOVE PCT               
000001* PDX    - ACAT03IP C0216396 06/10/05 14:38:05 TBLAMUR            00001000
LRM006* SSR 0039561 PHASE-II ALLOW ASSET REQUEST WITHOUT ASSET TYPE             
LRM006*        - AND DEFAULT ASSET SETTLE LOC BASED ON MSD CLASS CODE           
LRM007*        - ALLOW DUPLICATE PTR REQUEST.                                   
000001* PDX    - ACAT03IP C0179784 10/28/02 10:22:21 TBEDTAK            00001000
000001* PDX    - ACAT03IP C0181367 10/16/02 11:20:59 TBLAMUR            00001000
000001* PDX    - ACAT03IP C0166975 11/16/01 11:09:29 TBLAMUR            00001000
LRM001* P1783864 ALLOW ENTRY WHEN FULL DLVY ON HSTY AND ACAT-CODE NOT D         
000001* PDX    - ACAT03IP C0164523 09/20/01 15:50:03 TBLAMUR            00001000
000001* PDX    - ACAT03IP C0160324 06/22/01 16:26:57 TBLAMUR            00001000
000001* PDX    - ACAT03IP C0146352 08/23/00 11:06:22 TBLAMUR            00001000
000001* PDX    - ACAT03IP C0137569 05/24/00 09:05:18 TBLAMUR            00001000
000001* PDX    - ACAT03IP C0124874 08/24/99 10:42:00 TBLAMUR            00001000
000001* PDX    - ACAT03IP C0122453 03/01/99 12:01:44 TBLAMUR            00001000
000001* PDX    - ACAT03IP C0120327 01/31/99 20:06:21 TBLAMUR            00001000
000001* PDX    - ACAT03IP C0119769 01/07/99 12:49:08 TBLAMUR            00001000
000001* PDX    - ACAT03IP C0109165 10/10/98 13:46:52 TBLAMUR            00001000
000100 IDENTIFICATION DIVISION.                                         00020002
000200 PROGRAM-ID.    ACAT03IP.                                         00030002
000300 AUTHOR.  LARRY MUREY.                                            00040002
000400*REMARKS.                                                         00050002
000500**-------------------------------------------------------------** 00060002
000600*  ACAT INITIAL PARTIAL TRANSFER REQUEST                        *         
000700**-------------------------------------------------------------** 00080002
000800 ENVIRONMENT DIVISION.                                            00090002
000900 DATA DIVISION.                                                   00100002
001000 WORKING-STORAGE SECTION.                                         00110002
001100 COPY PDXIDCOB.                                                   00120002
001200 77  TWA-SIZE                       PIC S9(4) COMP.               00130002
       77  WS-B1PRINT-LENGTH              PIC S9(4) COMP.               00130002
TEMP   77  WS-EDITMOD                     PIC X(08) VALUE 'ACATEDIT'.   00140002
TEMP   77  WS-ACATNAIO                    PIC X(08) VALUE 'ACAT00NA'.   00140002
TEMP   77  WS-ACATPPIO                    PIC X(08) VALUE 'ACATPPDB'.   00140002
TEMP   77  WS-ACATMSD                     PIC X(08) VALUE 'ACATMSD '.   00140002
TEMP   77  WS-ACATRST                     PIC X(08) VALUE 'ACATRST '.   00140002
TEMP   77  WS-ACAT03DB                    PIC X(08) VALUE 'ACAT03DB'.   00140002
TEMP   77  WS-ACATSRCH                    PIC X(08) VALUE 'ACATSRCH'.   00140002
                                                                                
       77  WS-MCACCT                      PIC X(20) VALUE SPACES.               
       77  CURR-EDIT-LEN                  PIC S9(4) COMP  VALUE +35.            
001400*******************************************************           00150002
001500*      TSQ WORK AREA                                              00160002
001600*******************************************************           00170002
001700 01  TSQ-WORK-AREA.                                               00180002
001800     05  TSQ-NAME.                                                00190002
001900         09 TERM-ID                     PIC X(04).                00200002
002000         09 TRAN-ID                     PIC X(04).                00210002
002100     05  ITEM-NUM                       PIC S9(04) COMP VALUE +1. 00220002
002200 EJECT                                                            00230002
       01  WS-DB2-PROBLEM-MSG.                                                  
           05  FILLER                     PIC X(36) VALUE                       
           'ACAT03IP - DB2 UNEXPECTED ERROR '.                                  
           05  WS-DB2-PROBLEM-FUNCTION    PIC X(06) VALUE SPACES.               
           05  WS-DB2-PROBLEM-TABLE       PIC X(09) VALUE SPACES.               
           05  WS-DB2-PROBLEM-ID          PIC -999  VALUE SPACES.               
LRM006     05  FILLER                     PIC X(15) VALUE                       
LRM006         ' CALL HELP DESK'.                                               
                                                                                
       01  WS-SUBMITTED-MSG               PIC X(70) VALUE                       
           'TIF ALREADY SUBMITTED TO NSCC; AWAITING REPLY; BROWSE ONLY'.        
       01  WS-ACKNOWLEDGE-MSG             PIC X(70) VALUE                       
           'TIF AWAITING NSCC ACKNOWLEDGEMENT; BROWSE ONLY'.                    
       01  WS-DUPE-MSG.                                                         
           05  WS-DUPE-MSG-TEXT           PIC X(51) VALUE SPACES.               
           05  WS-DUPE-CONTROL-NBR        PIC X(14) VALUE SPACES.               
LRM023 01  WS-CUSIP-RESTRICTED-MSG.                                             
LRM023     05  FILLER                     PIC X(47) VALUE                       
LRM023             'CUSIP NUMBER FOUND ON RESTRICTED SECURITY TABLE'.           
LRM023     05  FILLER                     PIC X(16) VALUE                       
LRM023             '/BROADRIDGE NBR '.                                          
LRM023     05  WS-CUSIP-RESTRICTED-ADP-NO PIC X(07).                            
002200 EJECT                                                            00230002
002900*******************************************************           00300002
003000*      EDITMOD WORK AREA                                          00310002
003100*******************************************************           00320002
       01  EDIT-AMT-AREA.                                                       
           05  WK-AMT-CODE                PIC X(01) VALUE 'D'.                  
           05  WK-AMT-NUM-ITEM            PIC S9(03) COMP-3 VALUE +1.           
LRM024     05  WK-AMT-IN-LEN              PIC S9(03) COMP-3 VALUE +22.          
           05  WK-AMT-OUT-LEN             PIC S9(03) COMP-3 VALUE +17.          
LRM024     05  WK-AMT-IN                  PIC X(22) VALUE LOW-VALUE.            
           05  WK-AMT-OUT                 PIC S9(15)V99.                        
           05  WK-AMT-DECIMAL-LEN         PIC S9(03) COMP-3 VALUE +2.           
           05  WK-AMT-COMMAR              PIC X(01) VALUE 'Y'.                  
           05  WK-AMT-RET-CODE            PIC X(01) VALUE SPACE.                
           05  FILLER                     PIC X(01) VALUE HIGH-VALUE.           
                                                                                
       01  EDIT-QTY-AREA.                                                       
           05  WK-QTY-CODE                PIC X(01) VALUE 'D'.                  
           05  WK-QTY-NUM-ITEM            PIC S9(03) COMP-3 VALUE +1.           
           05  WK-QTY-IN-LEN              PIC S9(03) COMP-3 VALUE +22.          
           05  WK-QTY-OUT-LEN             PIC S9(03) COMP-3 VALUE +21.          
           05  WK-QTY-IN                  PIC X(22) VALUE LOW-VALUE.            
           05  WK-QTY-OUT-X.                                                    
               07  FILLER                 PIC X(4).                             
               07  WK-QTY-OUT             PIC S9(12)V9(5).                      
           05  WK-QTY-DECIMAL-LEN         PIC S9(03) COMP-3 VALUE +5.           
           05  WK-QTY-COMMAR              PIC X(01) VALUE 'Y'.                  
           05  WK-QTY-RET-CODE            PIC X(01) VALUE SPACE.                
           05  FILLER                     PIC X(01) VALUE HIGH-VALUE.           
                                                                                
LRM025 01  EDIT-STRK-AREA.                                                      
LRM025     05  WK-STRK-CODE               PIC X(01) VALUE 'D'.                  
LRM025     05  WK-STRK-NUM-ITEM           PIC S9(03) COMP-3 VALUE +1.           
LRM025     05  WK-STRK-IN-LEN             PIC S9(03) COMP-3 VALUE +09.          
LRM025     05  WK-STRK-OUT-LEN            PIC S9(03) COMP-3 VALUE +08.          
LRM025     05  WK-STRK-IN                 PIC X(09) VALUE LOW-VALUE.            
LRM025     05  WK-STRK-OUT                PIC S9(5)V9(3).                       
LRM025     05  WK-STRK-DECIMAL-LEN        PIC S9(03) COMP-3 VALUE +3.           
LRM025     05  WK-STRK-COMMAR             PIC X(01) VALUE 'Y'.                  
LRM025     05  WK-STRK-RET-CODE           PIC X(01) VALUE SPACE.                
LRM025     05  FILLER                     PIC X(01) VALUE HIGH-VALUE.           
                                                                                
       01  EDIT-VALUE-AREA.                                                     
           05  WK-VALUE-CODE              PIC X(01) VALUE 'D'.                  
           05  WK-VALUE-NUM-ITEM          PIC S9(03) COMP-3 VALUE +1.           
           05  WK-VALUE-IN-LEN            PIC S9(03) COMP-3 VALUE +22.          
           05  WK-VALUE-OUT-LEN           PIC S9(03) COMP-3 VALUE +21.          
           05  WK-VALUE-IN                PIC X(22) VALUE LOW-VALUE.            
           05  WK-VALUE-OUT-X.                                                  
               07  FILLER                 PIC X(4).                             
               07  WK-VALUE-OUT           PIC S9(15)V9(2).                      
           05  WK-VALUE-DECIMAL-LEN       PIC S9(03) COMP-3 VALUE +2.           
           05  WK-VALUE-COMMAR            PIC X(01) VALUE 'Y'.                  
           05  WK-VALUE-RET-CODE          PIC X(01) VALUE SPACE.                
           05  FILLER                     PIC X(01) VALUE HIGH-VALUE.           
                                                                                
CSG001 01  W-EDIT-ASSET-DESC-TXT-AREA.                                          
CSG001     10 W-SUB2                       PIC S9(03) COMP-3.                   
CSG001     10 W-SUB3                       PIC S9(03) COMP-3.                   
CSG001     10 W-ASSET-DESC-TXT             PIC X(30) VALUE SPACE.               
CSG001     10 W-ASSET-DESC-TMP             PIC X(30) VALUE SPACES.              
CSG001     10 W-ASSET-DESC-TXT-GRP.                                             
CSG001        15 W-ASSET-DESC1-TXT         PIC X(30)  VALUE SPACES.             
CSG001        15 W-ASSET-DESC2-TXT         PIC X(30)  VALUE SPACES.             
CSG001        15 W-ASSET-DESC3-TXT         PIC X(30)  VALUE SPACES.             
CSG001        15 W-ASSET-DESC4-TXT         PIC X(30)  VALUE SPACES.             
CSG001        15 W-ASSET-DESC5-TXT         PIC X(20)  VALUE SPACES.             
CSG001     10 W-JUST-LEFT-REQ-FLAG         PIC X(01).                           
CSG001        88 W-JUST-LEFT-REQ-Y         VALUE 'Y'.                           
CSG001        88 W-JUST-LEFT-REQ-N         VALUE 'N'.                           
CSG001     10 W-JUST-LEFT-FLAG             PIC X(01).                           
CSG001        88 W-JUST-LEFT-DONE          VALUE 'Y'.                           
CSG001        88 W-JUST-LEFT-NOT-DONE      VALUE 'N'.                           
CSG001     10 W-EDIT-ASSET-DESC-TXT-FLAG   PIC X(01).                           
CSG001        88 W-EDIT-ASSET-DESC-TXT-Y   VALUE 'Y'.                           
CSG001        88 W-EDIT-ASSET-DESC-TXT-N   VALUE 'N'.                           
CSG001                                                                          
        01  WS-MQTY-AREA.                                                       
           05  WS-MQTY-ED-D5           PIC ZZZ,ZZZ,ZZZ,ZZZ.99999-.              
           05  WS-MQTY-ED-D4 REDEFINES WS-MQTY-ED-D5                            
                                       PIC ZZZZ,ZZZ,ZZZ,ZZZ.9999-.              
           05  WS-MQTY-ED-D3 REDEFINES WS-MQTY-ED-D4                            
                                       PIC ZZZZZ,ZZZ,ZZZ,ZZZ.999-.              
           05  WS-MQTY-ED-D2 REDEFINES WS-MQTY-ED-D3                            
                                       PIC ZZZZZZ,ZZZ,ZZZ,ZZZ.99-.              
           05  WS-MQTY-ED-D1 REDEFINES WS-MQTY-ED-D2                            
                                       PIC ZZZZZZZ,ZZZ,ZZZ,ZZZ.9-.              
           05  WS-MQTY-ED-D0 REDEFINES WS-MQTY-ED-D1                            
                                       PIC ZZZZZ,ZZZ,ZZZ,ZZZ,ZZZ-.              
LRM025  01  WS-MSTRK-AREA.                                                      
LRM025     05  WS-MSTRK-ED-D3           PIC ZZZZZ.999.                          
002200 EJECT                                                            00230002
004300*******************************************************           00440002
004400*      GET DATE TIME LAYOUT                                       00450002
004500*******************************************************           00460002
004600 01  WSWORKAREA.                                                  00470002
004700     05  WSABSTIME           PIC S9(08) COMP.                     00480002
004800     05  WSMMDDYY.                                                00490002
               09 WS-CUR-MM        PIC XX.                                      
               09  FILLER          PIC X.                                       
               09 WS-CUR-DD        PIC XX.                                      
               09  FILLER          PIC X.                                       
               09 WS-CUR-YY        PIC XX.                                      
004900     05  WSDATESEP           PIC X(01) VALUE '/'.                 00500002
005000     05  WSTIME.                                                  00510002
               09  WS-TIME-HH      PIC XX.                                      
               09  FILLER          PIC X.                                       
               09  WS-TIME-MM      PIC XX.                                      
               09  FILLER          PIC X.                                       
               09  WS-TIME-SS      PIC XX.                                      
005100     05  WSTIMESEP           PIC X(01) VALUE ':'.                 00520002
005200                                                                  00530002
005300 EJECT                                                            00540002
005400*******************************************************           00550002
005500*      I/O CALL AREAS.                                            00560002
005600*******************************************************           00570002
       01  ACATNAIO-CALL-AREA.                                                  
           COPY ACATNAIO.                                                       
                                                                                
       01  ACATPPIO-CALL-AREA.                                                  
           COPY ACATPPIO.                                                       
                                                                                
       01  ACATMSDIO-CALL-AREA.                                                 
           COPY ACATMSDI.                                                       
                                                                                
LRM025     COPY GETADPC.                                                        
                                                                                
       01  ACATRSTIO-CALL-AREA.                                                 
           COPY ACATRSIO.                                                       
                                                                                
       01  ACAT03IO-CALL-AREA.                                                  
           COPY ACAT03IO.                                                       
005300 EJECT                                                            00540002
005400*******************************************************           00550002
005500*      B1 WORK AREA                                               00560002
005600*******************************************************           00570002
       01  B1-RECORD.                                                   00580002
           05  B1-REC-ID.                                               00590002
               09  B1-CLIENT-NO          PIC 9(03) COMP-3.              00600002
               09  B1-CARD-NO            PIC 9(07) COMP-3.              00610002
               09  B1-CLIENT             PIC 9(03) COMP-3.              00620002
               09  B1-SEQUENCE           PIC 9(05) COMP-3 VALUE 1.      00630002
           05  B1-REC-TYP-3              PIC X(01) VALUE '3'.           00640002
           05  B1-RETURN-VALUE           PIC X(35).                     00650002
006100                                                                  00670002
006000 EJECT                                                            00680002
006100                                                                  00690002
006200*******************************************************           00700002
006300*      ACAT03 WORK AREA                                           00710002
006400*******************************************************           00720002
006500 01  ACAT-WORK-AREA.                                              00730002
           05  W-SUB1                    PIC  9(004) VALUE 0.           CAT513  
           05 W-IRA-B1-SW                PIC  X(001).                   CAT513  
              88 W-IRA-B1-FOUND               VALUE 'Y'.                CAT513  
           05 W-CLASS-CODE-B1-SW         PIC  X(001).                   CAT513  
              88 W-CLASS-CODE-B1-FOUND        VALUE 'Y'.                CAT513  
LRM014     05 W-CUST-TYPE-B1-SW          PIC  X(001).                           
LRM014        88 W-CUST-TYPE-B1-FOUND         VALUE 'Y'.                        
LRM014     05 W-ADT-CUSTOMER-TYPE.                                              
LRM014        07 W-ADT-CUSTOMER-TYPE-9   PIC  9(003).                           
LRM025     05 WS-OPTION-SW               PIC X(1) VALUE SPACES.                 
LRM025           88 WS-OPTION-FOUND          VALUE 'Y'.                         
LRM025           88 WS-OPTION-NOT-FOUND      VALUE 'N'.                         
LRM025     05 WS-OPTION-MSECR            PIC X(009) VALUE SPACES.               
           05 W-RETIRE-ACCOUNT-SW        PIC  X(001).                   CAT513  
              88 W-RETIRE-ACCOUNT-FOUND       VALUE 'Y'.                CAT513  
           05 W-IRA-BR-RANGE-SW          PIC  X(001).                   CAT513  
              88 W-IRA-BR-RANGE-FOUND         VALUE 'Y'.                CAT513  
           05 W-IRA-BR-ACT-RANGE-SW      PIC  X(001).                   CAT513  
              88 W-IRA-BR-ACT-RANGE-FOUND     VALUE 'Y'.                CAT513  
434531     05  BH-ACAT-DEFAULT-CUSTOMER-TYPE   PIC XX VALUE SPACES.             
434504     05  BH-ACAT-DEFINE-CUSTOMER-TYPE   PIC X(1) VALUE '0'.       BHACAT  
434534     05  BH-ACAT-RETIRE-ACT-SUB-CTG-NO   PIC S9(3) COMP-3 VALUE 0.CAT513  
           05  BH-ACAT-RETIRE-ACT-SUB-CTG.                              BHACAT  
               07  BH-ACAT-RETIRE-ACT-SUB-CTG-ENT OCCURS 40 TIMES.      BHACAT  
                   09  BH-ACAT-RETIRE-ACT-IRA-CODE     PIC X(1).        BHACAT  
                   09  FILLER                          PIC X.                   
                   09  BH-ACAT-RETIRE-ACT-CUST-TYPE    PIC X(2).        BHACAT  
434535     05  BH-ACAT-CUST-TYPE-VALUE-NO    PIC 9(3) COMP-3 VALUE 0.   BHACAT  
           05  BH-ACAT-CUST-TYPE-VALUES.                                BHACAT  
               07  BH-ACAT-CUST-TYPE-VALUE-ENTRY  OCCURS 100 TIMES.     BHACAT  
                   09  BH-ACAT-CUST-TYPE-FROM-NA       PIC X(3).        BHACAT  
                   09  FILLER                          PIC X.                   
                   09  BH-ACAT-CUST-ACCT-TYPE          PIC X(2).        BHACAT  
009125     05  BH-MGCA-IRA-BR-RANGE-NO       PIC 9(3) COMP-3 VALUE 0.   BHMGCA  
           05  BH-MGCA-IRA-BR-RANGE.                                    BHMGCA  
               07  BH-MGCA-IRA-BR-RANGE-ENTRY      OCCURS 50 TIMES.     BHMGCA  
                   09  BH-MGCA-IRA-BR-RANGE-LO         PIC X(3).        BHMGCA  
                   09  FILLER                          PIC X.                   
                   09  BH-MGCA-IRA-BR-RANGE-HI         PIC X(3).        BHMGCA  
009126     05  BH-MGCA-IRA-BR-ACT-RANGE-NO   PIC 9(3) COMP-3 VALUE 0.   BHMGCA  
           05  BH-MGCA-IRA-BR-ACT-RANGE.                                BHMGCA  
               07  BH-MGCA-IRA-BR-ACT-RANGE-ENTRY  OCCURS 50 TIMES.     BHMGCA  
                   09  BH-MGCA-IRA-BR-ACT-BR-LO        PIC X(3).        BHMGCA  
                   09  FILLER                          PIC X.                   
                   09  BH-MGCA-IRA-BR-ACT-BR-HI        PIC X(3).        BHMGCA  
                   09  FILLER                          PIC X.                   
                   09  BH-MGCA-IRA-BR-ACT-ACT-LO       PIC X(5).        BHMGCA  
                   09  FILLER                          PIC X.                   
                   09  BH-MGCA-IRA-BR-ACT-ACT-HI       PIC X(5).        BHMGCA  
           05  CURRENCY-NUM               PIC 9(03).                            
           05  CURRENCY-X REDEFINES CURRENCY-NUM                                
                                          PIC X(03).                            
           05  WORK-AUTH-BRANCH           PIC X(03).                            
           05  WORK-AUTH-AE               PIC X(03).                            
006600     05  CALLED-PROGRAM-NAME        PIC X(08).                    00740002
006600     05  WORK-QTY-X                 PIC X(20).                    00740002
006700     05  FILLER REDEFINES WORK-QTY-X.                             00750002
006800         09 WORK-QTY                PIC 9(12)V9(05).              00760002
006900         09 FILLER                  PIC X(03).                    00770002
007000     05  WORK-DATE-X.                                             00780002
007100         09 WORK-DATE-X-MM          PIC X(02).                    00790002
007200         09 FILLER                  PIC X(01).                    00800002
007300         09 WORK-DATE-X-YY          PIC X(02).                    00810002
007400     05  WORK-DATE.                                               00820002
007500         09 WORK-DATE-MM            PIC X(02).                    00830002
007600         09 WORK-DATE-YY            PIC X(02).                    00840002
007700     05  TWA-CLIENT-NO-X.                                         00850002
007700         09 TWA-CLIENT-NO-9         PIC 9(04).                    00850002
007800     05  WK-BRW-KEY.                                              00860002
007900         09 WK-BRW-CLIENT           PIC X(03).                    00870002
007900         09 WK-BRW-RECORD-TYPE      PIC X(02)   VALUE '90'.       00870002
008000         09 WK-BRW-CUR-BR-AC.                                     00880002
                  15 WK-BRW-CURRENCY      PIC X(03).                            
                  15 WK-BRW-BRANCH        PIC X(03).                            
                  15 WK-BRW-ACCOUNT       PIC X(05).                            
           05  WK-SUSPEND-COUNT           PIC S9(04) COMP VALUE ZERO.           
           05  WK-BROWSE-FORWARD-FLAG     PIC X(01) VALUE 'Y'.                  
               88  WK-BROWSE-FORWARD      VALUE 'Y'.                            
               88  WK-BROWSE-BACKWARD     VALUE 'N'.                            
008300     05  ALARM-NEEDED-FLAG          PIC X(01)  VALUE 'N'.         00910002
008400         88  ALARM-NEEDED           VALUE  'Y'.                   00920002
008700     05  END-OF-DATA-FLAG           PIC X(01)  VALUE 'N'.         00950002
008800         88  END-OF-DATA            VALUE  'Y'.                   00960002
008900     05  INPUT-ERROR-FLAG           PIC X(01)  VALUE 'N'.         00970002
009000         88  INPUT-ERROR            VALUE  'Y'.                   00980002
009100     05  FIRST-TIME-FLAG            PIC X(01)  VALUE 'N'.         00990002
009200         88  FIRST-TIME             VALUE  'Y'.                   01000002
           05  WS-DELETE-FLAG             PIC X(01)  VALUE 'N'.         00990002
               88  WS-DELETE              VALUE 'Y'.                            
           05  WS-ACCOUNT-CHANGED-FLAG    PIC X(01)  VALUE 'N'.         00970002
               88  ACCOUNT-CHANGED        VALUE  'Y'.                   00980002
LRM020     05  WS-ACCOUNT-TYPE-CHANGED-FG PIC X(01)  VALUE 'N'.                 
LRM020         88  ACCOUNT-TYPE-CHANGED   VALUE  'Y'.                           
           05  WS-ERROR-THIS-LINE-FLAG    PIC X(01)  VALUE 'N'.         00990002
009200         88  ERROR-THIS-LINE        VALUE  'Y'.                   01000002
           05  WS-MCACCT-SW               PIC X(01)  VALUE 'N'.         00990002
               88  MCACCT-ERROR           VALUE 'Y'.                            
009300     05  ERASE-KEY-VALUE            PIC S9(04) COMP VALUE +128.   01010002
009400     05  FILLER REDEFINES ERASE-KEY-VALUE.                        01020002
009500         09  FILLER                 PIC X(01).                    01030002
009600         09  ERASE-KEY              PIC X(01).                    01040002
009700     05  REFORMAT-TIME              PIC 9(07).                    01050002
009800     05  FILLER REDEFINES REFORMAT-TIME.                          01060002
009900         09  FILLER                 PIC X(01).                    01070002
010000         09  REFORMAT-HH            PIC X(02).                    01080002
010100         09  REFORMAT-MM            PIC X(02).                    01090002
010200         09  FILLER                 PIC X(02).                    01100002
010300     05  WORK-TIME.                                               01110002
010400         09  WORK-HH                PIC X(02).                    01120002
010500         09  FILLER                 PIC X(01) VALUE ':'.          01130002
010600         09  WORK-MM                PIC X(02).                    01140002
010700     05  INPUT-OPT-SPACE-FLAG       PIC X(01)  VALUE 'N'.         01150002
010800         88  INPUT-OPT-SPACE        VALUE  'Y'.                   01160002
010900     05  DATA-ONLY-FLAG             PIC X(01)  VALUE 'N'.         01170002
011000         88  DATA-ONLY              VALUE  'Y'.                   01180002
           05  WK-CURSOR                  PIC S9(04) COMP.                      
           05  SYSTEM-MSG                 PIC X(79) VALUE SPACES.       01190002
           05  ABEND-LINE.                                              03630002
               09  ABEND-MSG              PIC X(30).                    03630002
               09  FILLER                 PIC X(11) VALUE ' EIBRESP ='.         
               09  ABEND-EIBRESP          PIC 99.                               
011100     05  UNAUTH-MESSAGE             PIC X(79)                     01190002
011500         VALUE 'UNAUTHORIZED USER.'.                              01230002
011100     05  SEC-MESSAGE                PIC X(79)                     01190002
011500         VALUE 'SIGN ON SECURITY NOT AVAILABLE, TRY AGAIN.'.      01230002
011200     05  ERROR-PROG-MSG.                                          01200002
011300         09  ERROR-PROG-NAME        PIC X(08).                    01210002
011400         09  FILLER                 PIC X(71)                     01220002
011500             VALUE ' PROGRAM NOT AVAILIABLE.'.                    01230002
LRM013     05  WS-FULL-FREEZE-MSG         PIC X(23) VALUE                       
LRM013                              'ACCOUNT IS FULLY FROZEN'.                  
LRM013     05  WS-CASH-FREEZE-MSG         PIC X(29) VALUE                       
LRM013                              'ACCOUNT IS FROZEN FOR CASH'.               
LRM013     05  WS-CASH-FREEZE-IN-MSG      PIC X(29) VALUE                       
LRM013                              'ACCOUNT IS FROZEN FOR CASH IN'.            
LRM013     05  WS-CASH-FREEZE-OUT-MSG     PIC X(30) VALUE                       
LRM013                              'ACCOUNT IS FROZEN FOR CASH OUT'.           
LRM013     05  WS-SEC-FREEZE-MSG          PIC X(28) VALUE                       
LRM013                              'ACCOUNT IS FROZEN FOR SEC'.                
LRM013     05  WS-SEC-FREEZE-IN-MSG       PIC X(28) VALUE                       
LRM013                              'ACCOUNT IS FROZEN FOR SEC IN'.             
LRM013     05  WS-SEC-FREEZE-OUT-MSG      PIC X(29) VALUE                       
LRM013                              'ACCOUNT IS FROZEN FOR SEC OUT'.            
011600     05  SAVE-INTRAN-FLAG           PIC X(01).                    01240002
011700     05  PREV-INTRAN-FLAG           PIC X(01).                    01250002
011800     05  WS-ACAT-NEXT               PIC X.                        01260002
011900     05  LINE-COUNT                 PIC 9(03).                    01270002
012000     05  SUB                        PIC S9(03) COMP-3.            01280002
012000     05  SUB2                       PIC S9(03) COMP-3.            01280002
           05  WS-MQTY-9-UNSIGNED      USAGE COMP-2.                            
           05  WS-SSN-EDIT-FLAG           PIC X  VALUE SPACES.                  
               88  SSN-INVALID            VALUE 'I'.                            
               88  SSN-VALID              VALUE 'V'.                            
           05  WS-SSN-EDIT                PIC X(11) VALUE SPACES.               
           05  WS-TYPE-9                  PIC S9(04) COMP VALUE +0.             
           05  FILLER REDEFINES WS-TYPE-9.                                      
               07  FILLER                 PIC X.                                
               07  WS-TYPE                PIC X.                                
           05  WS-ASSET-DELETE-IND        PIC X  VALUE 'N'.                     
               88  ASSET-JUST-DELETED            VALUE 'Y'.                     
               88  LAST-ASSET-JUST-DELETED       VALUE 'L'.                     
LRM006     05  WK-CNS-IND                 PIC X(01)  VALUE 'N'.                 
LRM006     05  WK-DTC-IND                 PIC X(01)  VALUE 'N'.                 
LRM012     05  WK-MS-CLASS.                                                     
LRM012         10  WK-MS-CLASS-1       PIC 9.                                   
LRM012         10  WK-MS-CLASS-2-5     PIC 9(4).                                
LRM012         10  WK-MS-CLASS-6-7     PIC 9(2).                                
LRM012     05  FILLER                  REDEFINES WK-MS-CLASS.                   
LRM012         10  WK-MS-CLASS-1-2-3   PIC 9(3).                                
LRM012         10  WK-MS-CLASS-4       PIC 9.                                   
LRM012         10  WK-MS-CLASS-5-7     PIC 9(3).                                
LRM012     05  FILLER                  REDEFINES WK-MS-CLASS.                   
LRM012         10  FILLER              PIC 9.                                   
LRM012         10  WK-MS-CLASS-2       PIC 9.                                   
LRM012         10  WK-MS-CLASS-3-4     PIC 9(2).                                
LRM012         10  WK-MS-CLASS-5       PIC 9.                                   
LRM012         10  WK-MS-CLASS-6       PIC 9.                                   
LRM012         10  WK-MS-CLASS-7       PIC 9.                                   
LRM012     05  FILLER                  REDEFINES WK-MS-CLASS.                   
LRM012         10  WK-MS-CLASS-1-2     PIC 9(2).                                
LRM012         10  FILLER              PIC 9(2).                                
LRM012         10  WK-MS-CLASS-5-6-7   PIC 9(3).                                
LRM012     05  FILLER                  REDEFINES WK-MS-CLASS.                   
LRM012         10  FILLER              PIC 9(3).                                
LRM012         10  WK-MS-CLASS-4-5     PIC 9(2).                                
LRM012         10  FILLER              PIC 9(2).                                
00032                                                                   01320002
           EJECT                                                        01350002
       COPY ACATCOM.                                                    01360002
           EJECT                                                        01350002
       COPY ACATSRCH.                                                   01360002
           EJECT                                                        01350002
       COPY SECLINKC.                                                   01360002
           EJECT                                                        01350002
017600 COPY ATTR.                                                       01410002
017700     EJECT                                                        01420002
017800 COPY DFHAID.                                                     01430002
017900     EJECT                                                        01440002
018000 COPY ACAT00M.                                                    01450002
018000 COPY ACAT03M.                                                    01450002
           EJECT                                                        01350002
018000 COPY CATACTYP.                                                   01450002
021300      EJECT                                                       01660002
CSG001/                                                                         
CSG001******************************************************************        
CSG001* ACATS VALID CHARACTER SET FROM "ACATS USER GUIDE (SECTION 19)" *        
CSG001******************************************************************        
CSG001 01  FILLER                        PIC X(08) VALUE 'CATVCHAR'.            
CSG001      COPY CATVCHAR.                                                      
CSG001      EJECT                                                       01660002
CSG001/                                                                         
       01  WS-POP-UP-WORKAREA.                                                  
            COPY ACAT90TS.                                                      
021300      EJECT                                                       01660002
021400 LINKAGE SECTION.                                                 01670002
021500 01  DFHCOMMAREA.                                                 01680002
021600     03  FILLER                    PIC X(2000).                   01690002
                                                                        01900002
021700 COPY TWACOMMN.                                                   01910002
021800     03 TWA-ACAT-AREA.                                            01920002
              05 TWA-ACAT-NOT-FOUND-FLAG      PIC X(01).                01930002
014100           88 TWA-ACAT-NOT-FOUND        VALUE 'Y'.                01950002
              05  TWA-CONFIRM-FLAG            PIC X.                            
                 88 TWA-CONFIRM               VALUE 'Y'.                        
013800        05 TWA-INTRAN-FLAG              PIC X.                    01940002
014100           88 TWA-INTRAN-BRW            VALUE 'B'.                01950002
014200           88 TWA-INTRAN-UPDATE         VALUE 'U'.                01960002
014200           88 TWA-INTRAN-ACT            VALUE 'T'.                01970002
014300           88 TWA-INTRAN-NO-CHANGE      VALUE 'N'.                01980002
              05 TWA-ACTION            PIC X.                                   
              05 TWA-SECR-ACTION       PIC X.                                   
LRM021        05 TWA-INP-TFR-TYP       PIC X(03).                               
              05 TWA-MAP-TABLE.                                         02000002
                  07 TWA-SCREEN        PIC X(01).                       02030002
                  07 TWA-ACAT90CM-UPDATE-IND                                    
                                       PIC X(01).                               
                  07 TWA-MBR           PIC X(03).                       02030002
                  07 TWA-MAC           PIC X(05).                       02030002
                  07 TWA-MRR           PIC X(03).                       02030002
                  07 TWA-MCTYPE        PIC X(02).                       02030002
                  07 TWA-MCBRKR        PIC X(04).                       02030002
                  07 TWA-MCBNAM        PIC X(30).                       02030002
                  07 TWA-MCACCT        PIC X(20).                       02030002
                  07 TWA-MNAME         PIC X(30).                       02030002
                  07 TWA-MNAME2        PIC X(30).                       02030002
                  07 TWA-MNAME3        PIC X(30).                       02030002
                  07 TWA-MSSN          PIC X(11).                       02030002
                  07 TWA-MSSN2         PIC X(11).                       02030002
                  07 TWA-MCCMNT-X120.                                           
                     09 TWA-MCCMNT     PIC X(60).                               
                     09 TWA-MCCMNT2    PIC X(60).                               
                  07 TWA-NA-IRA        PIC X(01).                               
                  07 TWA-MSUBM         PIC X(01).                       02030002
                  07 TWA-MACAT         PIC X(14).                       02030002
                  07 TWA-MSTAT         PIC X(03).                       02030002
                  07 TWA-MNEXT         PIC X(01).                       02030002
                  07 TWA-MCMNT         PIC X(01).                       02030002
                  07 TWA-MDEL          PIC X(01).                       02030002
                  07 TWA-MMRR          PIC X(03).                       02030002
                  07 TWA-MSD           PIC X(08).                       02030002
                  07 TWA-CONTROL-NBR   PIC X(14).                       02030002
                  07 TWA-ORIG-DLVR-NBR PIC X(04).                               
                  07 TWA-ORIG-DLVR-ACCT PIC X(20).                              
                  07 TWA-TRNFR-TYPE-CD PIC X(03).                               
                  07 TWA-STTS-CD       PIC X(03).                               
                  07 TWA-MBAL01        PIC X(19).                               
                  07 TWA-ORIG-MBAL01 PIC X(19).                                 
                  07 TWA-MBAL01-9      USAGE COMP-2.                            
LRM011            07 TWA-MBAL01-RQST-CD     PIC X.                              
LRM011            07 TWA-MBAL01-CREDIT-IND  PIC X.                              
                  07 TWA-MBAL02         PIC X(19).                              
                  07 TWA-ORIG-MBAL02 PIC X(19).                                 
                  07 TWA-MBAL02-9      USAGE COMP-2.                            
LRM011            07 TWA-MBAL02-RQST-CD     PIC X.                              
LRM011            07 TWA-MBAL02-CREDIT-IND  PIC X.                              
                  07 TWA-MBAL05         PIC X(19).                              
                  07 TWA-ORIG-MBAL05 PIC X(19).                                 
                  07 TWA-MBAL05-9      USAGE COMP-2.                            
LRM011            07 TWA-MBAL05-RQST-CD     PIC X.                              
LRM011            07 TWA-MBAL05-CREDIT-IND  PIC X.                              
                  07 TWA-MSMA           PIC X(19).                              
                  07 TWA-ORIG-MSMA      PIC X(19).                              
                  07 TWA-MSMA-9        USAGE COMP-2.                            
                  07 TWA-M1CMNT-X120.                                           
                     09 TWA-M1CMNT     PIC X(60).                               
                     09 TWA-M1CMNT2    PIC X(60).                               
                  07 TWA-M2CMNT-X120.                                           
                     09 TWA-M2CMNT     PIC X(60).                               
                     09 TWA-M2CMNT2    PIC X(60).                               
                  07 TWA-M5CMNT-X120.                                           
                     09 TWA-M5CMNT     PIC X(60).                               
                     09 TWA-M5CMNT2    PIC X(60).                               
                  07 TWA-MMCMNT-X120.                                           
                     09 TWA-MMCMNT     PIC X(60).                               
                     09 TWA-MMCMNT2    PIC X(60).                               
                  07 TWA-UPDT-TMSTP    PIC X(26).                               
LRM007            07 TWA-DUPE-FOUND    PIC X.                                   
                  07 TWA-ASSET-AREA.                                            
                     09 TWA-MSECR      PIC X(12).                               
                     09 TWA-ORIG-MSECR PIC X(12).                               
                     09 TWA-MCD        PIC X(01).                               
                     09 TWA-ORIG-MCD   PIC X(01).                               
                     09 TWA-MCATGR     PIC X(04).                               
                     09 TWA-MSLOC      PIC X(02).                               
*********            09 TWA-MACMNT     PIC X(01).                               
LRM025               09 TWA-MEXPDT     PIC X(06).                               
LRM025               09 TWA-MCALL      PIC X(01).                               
LRM025               09 TWA-MLONG      PIC X(01).                               
LRM025               09 TWA-MSTRIKE    PIC X(09).                               
LRM025               09 TWA-MSTRIKE-9  PIC 9(05)V9(3).                          
                     09 TWA-MTYPE      PIC X(01).                               
                     09 TWA-ORIG-MTYPE PIC X(01).                               
                     09 TWA-KEY-FIELDS.                                         
                        11  TWA-ISIN-CNTRY-CD     PIC X(02).                    
                        11  TWA-ISIN-SEC-ISSUE-CD PIC X(09).                    
                        11  TWA-ISIN-SEC-CDG-CD   PIC X.                        
                     09 TWA-ADP-NBR    PIC X(07).                               
                     09 TWA-MWI        PIC X(01).                               
                     09 TWA-MDESC-GROUP.                                        
                        11 TWA-MDESC   PIC X(30).                               
                        11 TWA-MDESC2  PIC X(30).                               
                        11 TWA-MDESC3  PIC X(30).                               
                     09 TWA-MQTY        PIC X(22).                              
                     09 TWA-ORIG-MQTY   PIC X(22).                              
                     09 TWA-MQTY-9     USAGE COMP-2.                            
                     09 TWA-MAMT-9     USAGE COMP-2.                            
                     09 TWA-MSCMNT-X120.                                        
                        11 TWA-MSCMNT   PIC X(60).                              
                        11 TWA-MSCMNT2  PIC X(60).                              
                                                                                
LRM010        05 TWA-EDIT-MCBRKR       PIC X(04).                               
LRM010        05 TWA-EDIT-MCACCT       PIC X(20).                               
LRM013        05 TWA-FREEZE-CASH-OUT   PIC X.                                   
LRM013        05 TWA-FREEZE-CASH-IN    PIC X.                                   
LRM013        05 TWA-FREEZE-SEC-IN     PIC X.                                   
LRM013        05 TWA-FREEZE-SEC-OUT    PIC X.                                   
LRM021        05 TWA-PRTCP-TYPE-CD     PIC X.                                   
LRM030        05 TWA-ISIN-USED         PIC X(01).                               
              05 TWA-PAGE-AREA.                                         02000002
                  07 TWA-PAGE-NO       PIC S9(08) COMP.                 02030002
                  07 TWA-PAGE-MODE     PIC X.                           02030002
                     88 TWA-ASSET-LVL-PG  VALUE 'A'.                            
                  07 TWA-CURRENT-ASSET-KEY.                             02030002
LRM030               09 TWA-ORIG-CNTRY-CD PIC X(02).                            
                     09 TWA-ORIG-SECR     PIC X(09).                            
                     09 TWA-ORIG-CHKDGT   PIC X(01).                            
                  07 TWA-CURRENT-ASSET-OTHER.                           02030002
                     09 TWA-ORIG-SLOC     PIC X(02).                            
                     09 TWA-ORIG-TYPE     PIC X(01).                            
023800                                                                  02140002
           EJECT                                                        01350002
  *****COPY ACATRPRQ REPLACING ==:ACAT:== BY ==MI==.                    01360002
023900     EJECT                                                        02150002
023800                                                                  02160002
024000 PROCEDURE DIVISION.                                              02170002
024100 INITIALIZATION.                                                  02180002
024200     EXEC CICS IGNORE CONDITION DUPKEY DUPREC  ENDFILE  ERROR     02190002
024300               ILLOGIC INVREQ   IOERR  ITEMERR LENGERR  MAPFAIL   02200002
024400               NOSPACE NOSTG    NOTFND         PGMIDERR QIDERR    02210002
024500     END-EXEC.                                                    02220002
                                                                                
024600     EXEC CICS HANDLE CONDITION NOTOPEN (NOT-OPEN)                02230002
024700                               DISABLED (NOT-OPEN)                02240002
024800                               DSIDERR  (NOT-OPEN)                02250002
024900     END-EXEC.                                                    02260002
025000                                                                  02270002
025100     EXEC CICS ASSIGN TWALENG (TWA-SIZE)                          02280002
025200     END-EXEC.                                                    02290002
025300     IF TWA-SIZE = 0                                              02300002
              MOVE LOW-VALUE TO ACAT03MO                                        
025400        MOVE 'TWA SIZE EQUAL ZERO, FATAL ERROR' TO SYSTEM-MSG     02310002
025500        PERFORM  ERROR-RTN.                                       02320002
025600                                                                  02330002
025700     EXEC CICS ADDRESS TWA (ADDRESS OF TWA-AREA)                  02340002
025800     END-EXEC.                                                    02350002
025900                                                                  02360002
026000     EJECT                                                        02370002
026100                                                                  02380002
026200 MAIN-PROCESSING.                                                 02390002
026300     MOVE EIBTRMID TO TERM-ID.                                    02400002
026400     MOVE EIBTRNID TO TRAN-ID.                                    02410002
026500     MOVE TWA-CLIENT-NO TO TWA-CLIENT-NO-9.                       02420002
026600     MOVE 'N'           TO END-OF-DATA-FLAG.                      02430002
026700     MOVE SPACES        TO SYSTEM-MSG.                            02440002
           MOVE 0             TO WK-SUSPEND-COUNT.                              
           MOVE 0             TO WK-CURSOR.                                     
026800     MOVE 0             TO LINE-COUNT.                            02450002
026900     MOVE LOW-VALUE     TO ACAT03MO.                              02460002
     ***   MOVE ATT-UNPROT TO NEXTA                                     02480002
027100     PERFORM GET-DATE-AND-TIME-RTN.                               02530002
027200     MOVE DFHCOMMAREA          TO ACATCOMM-COMMAREA.              02540002
           PERFORM SET-TRANSACTION-SECURITY-RTN.                                
WAIT*****  IF ACAT-CALLING-PROG-NAME = 'ACAT06JC'                               
WAIT*****  AND ACAT-INP-SEL NOT = 'B'                                           
WAIT*****     MOVE '6' TO TWA-ACTION.                                           
           IF  ACAT-PROGRAM-NAME = 'ACAT03IP'                           02550002
               MOVE SPACES TO ACAT-CALLING-PROG-NAME                            
028100         PERFORM CONTINUE-PROCESS                                 02560002
028000     ELSE                                                         02570002
           IF  ACAT-PROGRAM-NAME = 'RATT01  '                           02550002
               MOVE SPACES TO ACAT-CALLING-PROG-NAME                            
032500         PERFORM READ-TSQ-RTN                                     03810002
032600         PERFORM DELETE-TSQ-RTN                                   03820002
028000     ELSE                                                         02570002
               MOVE 'ACAT03IP' TO ACAT-PROGRAM-NAME                             
027900         PERFORM FIRST-TIME-THRU                                  02580002
028200     END-IF END-IF.                                               02590002
028300                                                                  02600002
028400     EJECT                                                        02610002
028500                                                                  02620002
028600 GET-DATE-AND-TIME-RTN.                                           02630002
028700     EXEC  CICS ASKTIME                                           02640002
028800           ABSTIME(WSABSTIME)                                     02650002
028900     END-EXEC.                                                    02660002
029000     EXEC  CICS FORMATTIME                                        02670002
029100           ABSTIME(WSABSTIME)                                     02680002
029200           MMDDYY(WSMMDDYY)                                       02690002
029300           DATESEP(WSDATESEP)                                     02700002
029400           TIME(WSTIME)                                           02710002
029500           TIMESEP(WSTIMESEP)                                     02720002
029600     END-EXEC.                                                    02730002
029900                                                                  02760002
030800     EJECT                                                        02770002
030900                                                                  02780002
031000 FIRST-TIME-THRU.                                                 02790002
           IF EIBAID = DFHPF10                                                  
           AND ACAT-CALLING-PROG-NAME = 'ACAT90CM'                              
              PERFORM READ-TSQ-RTN                                      03810002
              PERFORM DELETE-TSQ-RTN                                    03820002
              PERFORM READ-ACAT90CM-TS-RTN                              10350002
              MOVE 'DISPLAY REFRESHED' TO SYSTEM-MSG                            
           ELSE                                                                 
           IF EIBAID NOT = DFHPF5                                               
              MOVE SPACES              TO TWA-MAP-TABLE                    02000
              MOVE ZEROS TO TWA-MBAL01-9                                        
                            TWA-MBAL02-9                                        
                            TWA-MBAL05-9                                        
                            TWA-MSMA-9                                          
              MOVE ACAT-INP-BRANCH     TO TWA-MBR                               
              MOVE ACAT-INP-ACCOUNT    TO TWA-MAC                               
              MOVE ACAT-INP-RR         TO TWA-MMRR                              
              MOVE ACAT-INP-CONTRA-BKR TO TWA-MCBRKR                            
LRM021        IF  ACAT-INP-TFR-TYP  = 'PTR' OR 'PTF'                            
LRM021           MOVE ACAT-INP-TFR-TYP TO TWA-INP-TFR-TYP                       
LRM021        ELSE                                                              
LRM021        IF TWA-INP-TFR-TYP = 'PTR' OR 'PTF'                               
LRM021           CONTINUE                                                       
LRM021        ELSE                                                              
LRM021           MOVE 'PTR'            TO TWA-INP-TFR-TYP                       
LRM021        END-IF END-IF                                                     
LRM021        MOVE TWA-INP-TFR-TYP     TO MMTFRO                                
           END-IF.                                                              
           MOVE SPACES TO TWA-MCMNT MCMNTO.                                     
*********  MOVE SPACES TO TWA-MACMNT MACMNTO.                                   
           SET FIRST-TIME TO TRUE.                                      02810002
           MOVE ZERO TO TWA-PAGE-NO.                                            
           MOVE 'B' TO ACAT-NEXT                                                
           PERFORM DELETE-TSQ-RTN.                                      02800002
           IF TWA-ACTION = '6'                                                  
              PERFORM FORMAT-FROM-ACTIVE-RTN.                                   
           PERFORM REFORMAT-SCREEN-DETAIL.                                      
           MOVE TWA-INP-TFR-TYP     TO MMTFRO                                   
           PERFORM REFORMAT-SCREEN-ASSET.                                       
           PERFORM PROCESS-MAP-ITEMS THRU PROCESS-MAP-ITEMS-EXIT.               
                                                                                
   ***** CAUSE UPDATE UPON RETURN FROM POP-UP IF NO ERRORS FOUND.               
           IF ACAT-SIGN-ON-UPDATE                                               
           AND NOT INPUT-ERROR                                                  
           AND ACAT-CALLING-PROG-NAME = 'ACAT90CM'                              
               PERFORM UPDATE-ACAT-IT-RTN.                                      
                                                                                
           IF NOT ACAT-SIGN-ON-UPDATE                                           
           AND EIBAID = DFHPF2                                                  
LRM017        IF ACAT-ASCENDIS-CLIENT                                           
LRM017           MOVE                                                           
LRM017     'ASCENDIS USER DOES NOT HAVE CREATE AUTHORITY; PF2 IGNORED'          
LRM017              TO SYSTEM-MSG                                               
LRM017        ELSE                                                              
                 MOVE                                                           
                   'USER DOES NOT HAVE CREATE AUTHORITY; PF2 IGNORED'           
                    TO SYSTEM-MSG                                               
           END-IF.                                                              
           MOVE SPACES TO ACAT-CALLING-PROG-NAME                                
           PERFORM SEND-MAP-ERASE.                                              
           PERFORM WRITE-TSQ-RTN.                                       10790002
           PERFORM RETURN-TO-CICS.                                      08350002
       EJECT                                                            02860002
       SET-TRANSACTION-SECURITY-RTN.                                            
LRM017     IF ACAT-ASCENDIS-CLIENT                                              
LRM017        SET ACAT-SIGN-ON-BROWSE TO TRUE                                   
LRM017     ELSE                                                                 
           IF ACAT-SUPER-SIGN-ON-UPDATE                                         
              SET ACAT-SIGN-ON-UPDATE TO TRUE                                   
           ELSE                                                                 
               MOVE 'BU'         TO ACAT-SCREEN-IND                             
               SET ACAT-UPDATE-MODE TO TRUE                                     
               MOVE SPACES    TO SECLINK-LIST                           AEISAC07
               MOVE '2'       TO SECLINK-ACTION-CODE                    AEISAC07
               MOVE 'SCON'    TO SECLINK-TYPE                                   
               MOVE ACAT-SEC-LIT TO SECLINK-ITEM                                
               PERFORM CALL-SECLINK-RTN                                 AEISAC07
               IF SECLINK-RETURN-CODE = '00' OR '20'                    AEISAC07
                  SET ACAT-SIGN-ON-UPDATE TO TRUE                               
               ELSE                                                             
                  SET ACAT-SIGN-ON-BROWSE TO TRUE                               
           END-IF.                                                              
                                                                        03690002
       EJECT                                                            02860002
                                                                        03690002
       READ-B1-RTN.                                                     03700002
           MOVE +22 TO WS-B1PRINT-LENGTH.                                       
           EXEC CICS READ                                               03710002
                     DATASET('B1PRINT')                                 03720002
                     INTO(B1-RECORD)                                    03730002
                     RIDFLD(B1-REC-ID)                                  03740002
                     LENGTH(WS-B1PRINT-LENGTH)                          03750002
           END-EXEC.                                                    03760002
       READ-B1-RTN-LONG.                                                03700002
           EXEC CICS READ                                               03710002
                     DATASET('B1PRINT')                                 03720002
                     INTO(B1-RECORD)                                    03730002
                     RIDFLD(B1-REC-ID)                                  03740002
                     LENGTH(LENGTH OF B1-RECORD)                        03750002
           END-EXEC.                                                    03760002
       EJECT                                                            03780002
                                                                        03790002
   400 CONTINUE-PROCESS.                                                03800009
032500     PERFORM READ-TSQ-RTN.                                        03810002
032600     PERFORM DELETE-TSQ-RTN.                                      03820002
032700     SET DATA-ONLY TO TRUE.                                       03830002
033000     EVALUATE TRUE                                                03840002
033100          WHEN EIBAID = DFHPF11 OR DFHCLEAR                       03850002
033200               PERFORM RETURN-CONTROL-RTN                         03860002
033300          WHEN EIBAID = DFHENTER OR DFHPF9                        03870002
033400               PERFORM ENTER-KEY-RTN                              03880002
                WHEN EIBAID = DFHPF1                                            
LRM018               PERFORM RECEIVE-MAP-RTN                                    
LRM018               PERFORM EDIT-INPUT-BRW-RTN                                 
LRM018               PERFORM MERGE-MAP-DTL-RTN                                  
                     PERFORM SEND-POPUP-MAP-RTN                                 
                WHEN EIBAID = DFHPF2                                            
LRM007               IF TWA-DUPE-FOUND = 'Y'                                    
LRM007                  MOVE 'A' TO TWA-ACTION TWA-SECR-ACTION                  
LRM007                  MOVE SPACES TO TWA-ASSET-AREA                   02790002
LRM007                                 TWA-ORIG-MSECR                           
LRM007                                 TWA-ORIG-SLOC                            
LRM025                                 TWA-MEXPDT                               
LRM025                                 TWA-MCALL                                
LRM025                                 TWA-MLONG                                
LRM025                                 TWA-MSTRIKE                              
LRM007                                 TWA-ORIG-MTYPE                           
LRM007                                 TWA-INTRAN-FLAG                          
LRM007                                 TWA-CURRENT-ASSET-KEY            02030002
LRM007                                 TWA-MSUBM                        02030002
LRM019                                 TWA-M1CMNT-X120                          
LRM019                                 TWA-M2CMNT-X120                          
LRM019                                 TWA-M5CMNT-X120                          
LRM019                                 TWA-MMCMNT-X120                          
LRM019                                 TWA-MBAL01-RQST-CD                       
LRM019                                 TWA-MBAL02-RQST-CD                       
LRM019                                 TWA-MBAL05-RQST-CD                       
LRM007                  MOVE ZEROS TO TWA-MBAL01-9                              
LRM007                                TWA-MBAL02-9                              
LRM007                                TWA-MBAL05-9                              
LRM007                                TWA-MSMA-9                                
LRM025                                TWA-MSTRIKE-9                             
LRM007                  MOVE DFHPF5 TO EIBAID                                   
LRM007                  PERFORM FIRST-TIME-THRU                         02790002
LRM007               END-IF                                                     
                     MOVE 'A' TO TWA-ACTION TWA-SECR-ACTION                     
                     MOVE SPACES TO TWA-MAP-TABLE                       02790002
                     MOVE ZEROS TO TWA-MBAL01-9                                 
                                   TWA-MBAL02-9                                 
                                   TWA-MBAL05-9                                 
                                   TWA-MSMA-9                                   
                     PERFORM FIRST-TIME-THRU                            02790002
                WHEN EIBAID = DFHPF5                                            
LRM021               IF TWA-INP-TFR-TYP = 'PTF'                                 
LRM021                  MOVE 'Y'  TO TWA-DUPE-FOUND                             
LRM021                  MOVE 'A'  TO TWA-ACTION                         02790002
LRM021               END-IF                                                     
                     MOVE 'A' TO TWA-SECR-ACTION                                
                     MOVE SPACES TO TWA-ASSET-AREA                      02790002
                                    TWA-INTRAN-FLAG                             
LRM007                              TWA-ORIG-MSECR                              
LRM007                              TWA-ORIG-SLOC                               
LRM007                              TWA-ORIG-MTYPE                              
LRM025                              TWA-MEXPDT                                  
LRM025                              TWA-MCALL                                   
LRM025                              TWA-MLONG                                   
LRM025                              TWA-MSTRIKE                                 
LRM007                              TWA-CURRENT-ASSET-KEY               02030002
                     PERFORM FIRST-TIME-THRU                            02790002
033700          WHEN EIBAID = DFHPF7                                    03910002
033800               PERFORM PAGE-BACKWARD-TIF                          03920002
033500          WHEN EIBAID = DFHPF8                                    03890002
033600               PERFORM PAGE-FORWARD-TIF                           03900002
033500          WHEN EIBAID = DFHPA1                                    03890002
033600               PERFORM PAGE-FORWARD-RTN                           03900002
033700          WHEN EIBAID = DFHPA2                                    03910002
033800               PERFORM PAGE-BACKWARD-RTN                          03920002
033900          WHEN OTHER                                              03930002
                     MOVE LOW-VALUE TO ACAT03MO                         03940002
                     MOVE -1 TO MNEXTL                                          
034000               MOVE 'ERROR FUNCTION KEY'                          03950002
034100                 TO SYSTEM-MSG                                    03960002
034200               PERFORM ERROR-RTN                                  03970002
034300     END-EVALUATE.                                                03980002
034400                                                                  03990002
DD6700     EJECT                                                        04240002
036800                                                                  04250002
037500 RECEIVE-MAP-RTN.                                                 04320002
037600     EXEC CICS RECEIVE MAP('TRLMAP')                                      
037700                       MAPSET('ACAT00M')                          04340002
                             FROM(ACAT-RECEIVE-MAP)                     04350002
037800                       LENGTH(ACAT-RECEIVE-MAP-LENGTH)            04360002
037900     END-EXEC.                                                    04370002
           MOVE +1000 TO ACAT-RECEIVE-MAP-LENGTH.                               
037600     EXEC CICS RECEIVE MAP('ACAT03M')                                     
037700                       MAPSET('ACAT03M')                          04340002
                             FROM(ACAT-RECEIVE-MAP)                     04350002
037800                       LENGTH(ACAT-RECEIVE-MAP-LENGTH)            04360002
037900     END-EXEC.                                                    04370002
038000                                                                  04380002
038100     EJECT                                                        04390002
038200                                                                  04400002
038300 ENTER-KEY-RTN.                                                   04410002
038400     PERFORM RECEIVE-MAP-RTN.                                     04420002
038700     PERFORM EDIT-INPUT-BRW-RTN.                                  04440010
*******    IF ACAT-SIGN-ON-UPDATE                                               
038600        PERFORM MERGE-MAP-DTL-RTN.                                04430002
038600     PERFORM MERGE-MAP-NEXT-RTN.                                  04430002
039300     IF TWA-MNEXT GREATER SPACES AND NOT = 'B'                    04470002
              MOVE TWA-MNEXT TO ACAT-INP-SEL                                    
039300        PERFORM PROCESS-JUMP-RTN.                                 04470002
           IF TWA-MCMNT GREATER ' '                                             
              MOVE 'A' TO TWA-SCREEN                                            
              PERFORM SEND-POPUP-MAP-RTN.                                       
           IF TWA-MCTYPE(1 : 1) = '?'                                           
           OR EIBAID = DFHPF9                                                   
              MOVE 'T' TO TWA-SCREEN                                            
              PERFORM SEND-POPUP-MAP-RTN.                                       
*********  IF TWA-MACMNT GREATER ' '                                            
*********     MOVE 'S' TO TWA-SCREEN                                            
*********     PERFORM SEND-POPUP-MAP-RTN.                                       
*********  IF ACAT-SIGN-ON-UPDATE                                               
065800        MOVE 'N' TO INPUT-ERROR-FLAG                                      
              PERFORM PROCESS-MAP-ITEMS THRU PROCESS-MAP-ITEMS-EXIT             
              IF INPUT-ERROR                                                    
LRM022        OR (TWA-INTRAN-BRW AND TWA-ACTION NOT = 'A')              01950002
              OR FIRST-TIME                                                     
              OR ACAT-SIGN-ON-BROWSE                                            
                 MOVE SPACES TO TWA-INTRAN-FLAG                         01940002
                 PERFORM ERROR-RTN                                              
              ELSE                                                              
                PERFORM UPDATE-ACAT-IT-RTN                                      
                PERFORM ERROR-RTN.                                              
                                                                                
           PERFORM ERROR-RTN.                                                   
040200                                                                  04560002
040300 EJECT                                                            04570002
040300 PROCESS-JUMP-RTN.                                                04570002
           MOVE 'ACAT03IP' TO ACAT-CALLING-PROG-NAME.                           
           MOVE ACAT-INP-SEL   TO WS-ACAT-NEXT.                                 
           MOVE 'B'            TO ACAT-NEXT ACAT-INP-SEL.                       
  *****    MOVE ACAT-COMMON-WORK-AREA TO ACAT-SUM-RESTORE-AREA                  
  *****                                  ACAT-NFD-RESTORE-AREA.                 
           PERFORM SCREEN-SECURITY-CHECK.                                       
                                                                                
       COPY ACATJUMP.                                                           
           IF CALLED-PROGRAM-NAME = SPACES                                      
              MOVE -1             TO MNEXTL                                     
              MOVE ATT-UNPROT-BRT TO MNEXTA                                     
              MOVE 'NEXT TRANSACTION SELECTION IS INVALID' TO                   
                  SYSTEM-MSG                                                    
              MOVE SPACES     TO ACAT-CALLING-PROG-NAME                         
              PERFORM ERROR-RTN.                                                
                                                                                
           MOVE -1 TO MNEXTL.                                                   
           MOVE WS-ACAT-NEXT         TO ACAT-INP-SEL ACAT-NEXT.                 
           PERFORM INVOKE-DETAIL-PROGRAM-RTN.                                   
           MOVE -1 TO MNEXTL.                                                   
           PERFORM ERROR-RTN.                                                   
                                                                        04770310
       SCREEN-SECURITY-CHECK.                                                   
           IF  ACAT-SUPER-SIGN-ON-UPDATE                                        
           OR  ACAT-SUPER-SIGN-ON-BROWSE                                        
           OR  ACAT-JUMP-ANYWHERE                                               
           OR  WS-ACAT-NEXT = '$'                                               
               CONTINUE                                                         
           ELSE                                                                 
               MOVE WS-ACAT-NEXT TO ACAT-SCREEN-IND                             
*********      SET ACAT-UPDATE-MODE TO TRUE                                     
               MOVE SPACES    TO SECLINK-LIST                           AEISAC07
               MOVE '2'       TO SECLINK-ACTION-CODE                    AEISAC07
               MOVE 'SCON'    TO SECLINK-TYPE                                   
               MOVE ACAT-SEC-LIT TO SECLINK-ITEM                                
               PERFORM CALL-SECLINK-RTN                                 AEISAC07
               IF SECLINK-RETURN-CODE = '00' OR '20'                    AEISAC07
                  MOVE SECLINK-USER-ID TO ACAT-SIGN-ON-ID                       
               ELSE                                                             
                  SET ACAT-BROWSE-MODE TO TRUE                                  
                  MOVE SPACES    TO SECLINK-LIST                        AEISAC07
                  MOVE '2'       TO SECLINK-ACTION-CODE                 AEISAC07
                  MOVE 'SCON'    TO SECLINK-TYPE                                
                  MOVE ACAT-SEC-LIT TO SECLINK-ITEM                             
                  PERFORM CALL-SECLINK-RTN                              AEISAC07
                  IF SECLINK-RETURN-CODE = '00' OR '20'                 AEISAC07
                     MOVE SPACE TO ACAT-SIGN-ON-SEC-FLAG                        
                  ELSE                                                          
                     MOVE 'USER NOT AUTHORIZED TO USE NEXT SELECTION '  AEISAC07
                          TO SYSTEM-MSG                                 AEISAC07
                     MOVE WS-ACAT-NEXT                                  AEISAC07
                          TO SYSTEM-MSG(44 : 1)                         AEISAC07
                     MOVE -1             TO MNEXTL                              
                     MOVE ATT-UNPROT-BRT TO MNEXTA                              
                     PERFORM ERROR-RTN                                          
                  END-IF                                                        
               END-IF                                                           
           END-IF.                                                              
       EJECT                                                            04570002
                                                                        04770310
   100 EDIT-INPUT-BRW-RTN.                                              04800010
      *    MOVE TWA-INTRAN-FLAG TO SAVE-INTRAN-FLAG.                    04812002
           IF MMBRL > 0                                                 04809210
              MOVE MMBRI TO    ACAT-INP-BRANCH                                  
           ELSE                                                         04809510
           IF MMBRA = ERASE-KEY                                         04809610
              MOVE SPACES TO   ACAT-INP-BRANCH                          04809710
           END-IF END-IF.                                               04809910
                                                                                
           IF MMACL > 0                                                 04809210
              MOVE MMACI TO   ACAT-INP-ACCOUNT                                  
           ELSE                                                         04809510
           IF MMACA = ERASE-KEY                                         04809610
              MOVE SPACES TO  ACAT-INP-ACCOUNT                          04809710
           END-IF END-IF.                                               04809910
                                                                                
           IF MMRRL > 0                                                 04809210
              MOVE MMRRI TO    ACAT-INP-RR                                      
           ELSE                                                         04809510
           IF MMRRA = ERASE-KEY                                         04809610
                 MOVE SPACES TO ACAT-INP-RR                             04809710
           END-IF END-IF.                                               04809910
                                                                                
           IF MMTFRL > 0                                                04809210
              MOVE MMTFRI TO   ACAT-INP-TFR-TYP                                 
           ELSE                                                         04809510
           IF MMTFRA = ERASE-KEY                                        04809610
                 MOVE SPACES TO ACAT-INP-TFR-TYP                        04809710
           END-IF END-IF.                                               04809910
                                                                                
           IF MMRDL > 0                                                 04809210
              MOVE MMRDI TO    ACAT-INP-RCV-DEL                                 
           ELSE                                                         04809510
           IF MMRDA = ERASE-KEY                                         04809610
                 MOVE SPACES TO ACAT-INP-RCV-DEL                        04809710
           END-IF END-IF.                                               04809910
                                                                                
           IF MMBKRL > 0                                                04809210
              MOVE MMBKRI TO   ACAT-INP-CONTRA-BKR                              
           ELSE                                                         04809510
           IF MMBKRA = ERASE-KEY                                        04809610
                 MOVE SPACES TO ACAT-INP-CONTRA-BKR                     04809710
           END-IF END-IF.                                               04809910
                                                                                
           IF MMSTATL > 0                                               04809210
              MOVE MMSTATI TO  ACAT-INP-STATUS                                  
           ELSE                                                         04809510
           IF MMSTATA = ERASE-KEY                                       04809610
                 MOVE SPACES TO ACAT-INP-STATUS                         04809710
           END-IF END-IF.                                               04809910
                                                                                
           IF MMSDL > 0                                                 04809210
              MOVE MMSDI TO    ACAT-INP-STTL-DT                                 
           ELSE                                                         04809510
           IF MMSDA = ERASE-KEY                                         04809610
                 MOVE SPACES TO ACAT-INP-STTL-DT                        04809710
           END-IF END-IF.                                               04809910
                                                                                
           IF MBRL > 0                                                  04809210
              IF MBRI = TWA-MBR                                                 
                 CONTINUE                                                       
              ELSE                                                              
                 MOVE MBRI TO TWA-MBR                                           
                 SET TWA-INTRAN-BRW TO TRUE                             04809410
                 SET ACCOUNT-CHANGED TO TRUE                                    
              END-IF                                                            
           ELSE                                                         04809510
           IF MBRA = ERASE-KEY                                          04809610
                 MOVE SPACES TO TWA-MBR                                 04809710
                 SET TWA-INTRAN-BRW TO TRUE                             04809810
           END-IF END-IF.                                               04809910
                                                                                
           IF MACL > 0                                                  04809210
              IF MACI = TWA-MAC                                                 
                 CONTINUE                                                       
              ELSE                                                              
                 MOVE MACI TO TWA-MAC                                           
                 SET TWA-INTRAN-BRW TO TRUE                             04809410
                 SET ACCOUNT-CHANGED TO TRUE                                    
              END-IF                                                            
           ELSE                                                         04809510
           IF MACA = ERASE-KEY                                          04809610
                 MOVE SPACES TO TWA-MAC                                 04809710
                 SET TWA-INTRAN-BRW TO TRUE                             04809810
           END-IF END-IF.                                               04809910
                                                                                
CSG001 EDIT-ASSET-DESC-TXT.                                                     
CSG001* MOVE SPACES FOR THE SPECIAL CHARACTERS FOUND IN ASSET-DESC-TXT.         
CSG001* AND LEFT JUSTIFY THE DESCRIPTIONS.                                      
CSG001     MOVE SPACES                   TO W-EDIT-ASSET-DESC-TXT-FLAG          
CSG001     PERFORM                                                              
CSG001         VARYING W-SUB2 FROM 1 BY 1                                       
CSG001           UNTIL W-SUB2 > W-SUB3                                          
CSG001            MOVE W-ASSET-DESC-TXT(W-SUB2:1)                               
CSG001                                         TO W-EDIT-CHAR-AREA2             
CSG001         IF NOT W-VALID-CHARACTER2                                        
CSG001            MOVE SPACES         TO W-ASSET-DESC-TXT(W-SUB2:1)             
CSG001            SET W-EDIT-ASSET-DESC-TXT-Y  TO TRUE                          
CSG001         END-IF                                                           
CSG001     END-PERFORM                                                          
CSG001*                                                                         
CSG001     IF W-JUST-LEFT-REQ-Y                                                 
CSG001        IF W-EDIT-ASSET-DESC-TXT-Y AND                                    
CSG001           W-ASSET-DESC-TXT(1:1) = SPACES                                 
CSG001           SET W-JUST-LEFT-NOT-DONE       TO TRUE                         
CSG001           PERFORM                                                        
CSG001             VARYING W-SUB2 FROM 2 BY 1                                   
CSG001               UNTIL W-SUB2 > 30 OR W-JUST-LEFT-DONE                      
CSG001             IF W-ASSET-DESC-TXT(W-SUB2 : 1) NOT = SPACES         03760002
CSG001                MOVE SPACES               TO W-ASSET-DESC-TMP     03760002
CSG001                MOVE W-ASSET-DESC-TXT(W-SUB2 : )                  03760002
CSG001                                          TO W-ASSET-DESC-TMP     03760002
CSG001                MOVE W-ASSET-DESC-TMP     TO W-ASSET-DESC-TXT             
CSG001                SET W-JUST-LEFT-DONE      TO TRUE                 03760002
CSG001             END-IF                                               03760002
CSG001           END-PERFORM                                            03760002
CSG001        END-IF                                                    03760002
CSG001        MOVE SPACES                    TO W-JUST-LEFT-REQ-FLAG            
CSG001     END-IF                                                       03760002
CSG001                                                                  03760002
CSG001     MOVE 0    TO W-SUB3.                                         03760002
                                                                                
062900 MERGE-MAP-DTL-RTN.                                               06100002
           IF MCBRKRL > 0                                               04809210
              IF MCBRKRI = TWA-MCBRKR                                           
                 CONTINUE                                                       
              ELSE                                                              
                 MOVE MCBRKRI TO TWA-MCBRKR                                     
           ELSE                                                         04809510
           IF MCBRKRA = ERASE-KEY                                       04809610
                 MOVE SPACES TO TWA-MCBRKR                              04809710
           END-IF END-IF.                                               04809910
                                                                                
           IF MCACCTL > 0                                               04809210
              IF MCACCTI = TWA-MCACCT                                           
                 CONTINUE                                                       
              ELSE                                                              
                 MOVE MCACCTI(1 : MCACCTL) TO TWA-MCACCT                        
           ELSE                                                         04809510
           IF MCACCTA = ERASE-KEY                                       04809610
                 MOVE SPACES TO TWA-MCACCT                              04809710
           END-IF END-IF.                                               04809910
                                                                                
           PERFORM                                                              
               VARYING SUB2 FROM 1 BY 1                                         
                  UNTIL SUB2 > 20                                               
              IF TWA-MCACCT(SUB2 : 1) < SPACES                                  
                 MOVE SPACES TO TWA-MCACCT(SUB2 : 1)                            
              END-IF                                                            
           END-PERFORM.                                                         
                                                                                
           IF MCTYPEL > 0                                               04809210
LRM020        IF MCTYPEI NOT = TWA-MCTYPE                                       
LRM020           SET ACCOUNT-TYPE-CHANGED TO TRUE                               
                 MOVE MCTYPEI TO TWA-MCTYPE                                     
LRM020        END-IF                                                            
           ELSE                                                         04809510
           IF MCTYPEA = ERASE-KEY                                       04809610
                 MOVE SPACES TO TWA-MCTYPE                              04809710
           END-IF END-IF.                                               04809910
                                                                                
           IF MCBNAML > 0                                               04809210
              MOVE MCBNAMI TO TWA-MCBNAM                                        
           ELSE                                                         04809510
           IF MCBNAMA = ERASE-KEY                                       04809610
                 MOVE SPACES TO TWA-MCBNAM                              04809710
           END-IF END-IF.                                               04809910
                                                                                
           IF MNAMEL > 0                                                04809210
              MOVE MNAMEI(1 : MNAMEL) TO TWA-MNAME                              
           ELSE                                                         04809510
           IF MNAMEA = ERASE-KEY                                        04809610
                 MOVE SPACES TO TWA-MNAME                               04809710
           END-IF END-IF.                                               04809910
                                                                                
           IF MNAME2L > 0                                               04809210
              MOVE MNAME2I (1 : MNAME2L) TO TWA-MNAME2                          
           ELSE                                                         04809510
           IF MNAME2A = ERASE-KEY                                       04809610
                 MOVE SPACES TO TWA-MNAME2                              04809710
           END-IF END-IF.                                               04809910
                                                                                
           PERFORM                                                              
               VARYING SUB2 FROM 1 BY 1                                         
                  UNTIL SUB2 > 30                                               
              IF TWA-MNAME(SUB2 : 1) < SPACES                                   
                 MOVE SPACES TO TWA-MNAME(SUB2 : 1)                             
              END-IF                                                            
              IF TWA-MNAME2(SUB2 : 1) < SPACES                                  
                 MOVE SPACES TO TWA-MNAME2(SUB2 : 1)                            
              END-IF                                                            
           END-PERFORM.                                                         
                                                                                
           IF MSSNL > 0                                                 04809210
              MOVE MSSNI(1 : MSSNL) TO TWA-MSSN                                 
           ELSE                                                         04809510
           IF MSSNA = ERASE-KEY                                         04809610
                 MOVE SPACES TO TWA-MSSN                                04809710
           END-IF END-IF.                                               04809910
                                                                                
           IF MSSN2L > 0                                                04809210
              MOVE MSSN2I (1 : MSSN2L) TO TWA-MSSN2                             
           ELSE                                                         04809510
           IF MSSN2A = ERASE-KEY                                        04809610
                 MOVE SPACES TO TWA-MSSN2                               04809710
           END-IF END-IF.                                               04809910
                                                                                
           IF MACATL > 0                                                04809210
              MOVE MACATI TO TWA-MACAT                                          
           ELSE                                                         04809510
           IF MACATA = ERASE-KEY                                        04809610
                 MOVE SPACES TO TWA-MACAT                               04809710
           END-IF END-IF.                                               04809910
                                                                                
           IF MSTATL > 0                                                04809210
              MOVE MSTATI TO TWA-MSTAT                                          
           ELSE                                                         04809510
           IF MSTATA = ERASE-KEY                                        04809610
                 MOVE SPACES TO TWA-MSTAT                               04809710
           END-IF END-IF.                                               04809910
                                                                                
           IF MSDL > 0                                                  04809210
              MOVE MSDI TO TWA-MSD                                              
           ELSE                                                         04809510
           IF MSDA = ERASE-KEY                                          04809610
                 MOVE SPACES TO TWA-MSD                                 04809710
           END-IF END-IF.                                               04809910
                                                                                
     ****** ASSET SECTION                                                       
           IF MBAL01L > 0                                               04809210
LRM013        MOVE MBAL01I (1 : MBAL01L) TO TWA-MBAL01                          
           ELSE                                                         04809510
           IF MBAL01A = ERASE-KEY                                       04809610
                 MOVE SPACES TO TWA-MBAL01                              04809710
LRM019                          TWA-M1CMNT-X120                                 
LRM019                          TWA-MBAL01-RQST-CD                              
LRM019                          TWA-MBAL01-CREDIT-IND                           
LRM019           MOVE ZEROS TO TWA-MBAL01-9                                     
           END-IF END-IF.                                               04809910
                                                                                
           IF MBAL02L > 0                                               04809210
LRM013        MOVE MBAL02I (1 : MBAL02L) TO TWA-MBAL02                          
           ELSE                                                         04809510
           IF MBAL02A = ERASE-KEY                                       04809610
                 MOVE SPACES TO TWA-MBAL02                              04809710
LRM019                          TWA-M2CMNT-X120                                 
LRM019                          TWA-MBAL02-RQST-CD                              
LRM019                          TWA-MBAL02-CREDIT-IND                           
LRM019           MOVE ZEROS TO TWA-MBAL02-9                                     
           END-IF END-IF.                                               04809910
                                                                                
           IF MBAL05L > 0                                               04809210
LRM013        MOVE MBAL05I (1 : MBAL05L) TO TWA-MBAL05                          
           ELSE                                                         04809510
           IF MBAL05A = ERASE-KEY                                       04809610
                 MOVE SPACES TO TWA-MBAL05                              04809710
LRM019                          TWA-M5CMNT-X120                                 
LRM019                          TWA-MBAL05-RQST-CD                              
LRM019                          TWA-MBAL05-CREDIT-IND                           
LRM019           MOVE ZEROS TO TWA-MBAL05-9                                     
           END-IF END-IF.                                               04809910
                                                                                
LRM013     PERFORM VARYING SUB FROM 1 BY 1                                      
LRM013            UNTIL SUB > 19                                                
LRM013        IF TWA-MBAL01 (SUB : 1) = LOW-VALUE                               
LRM013           MOVE ' ' TO TWA-MBAL01 (SUB : 1)                               
LRM013        END-IF                                                            
LRM013        IF TWA-MBAL02 (SUB : 1) = LOW-VALUE                               
LRM013           MOVE ' ' TO TWA-MBAL02 (SUB : 1)                               
LRM013        END-IF                                                            
LRM013        IF TWA-MBAL05 (SUB : 1) = LOW-VALUE                               
LRM013           MOVE ' ' TO TWA-MBAL05 (SUB : 1)                               
LRM013        END-IF                                                            
LRM013     END-PERFORM.                                                         
                                                                                
           IF MSMAL > 0                                                 04809210
              MOVE MSMAI TO TWA-MSMA                                            
           ELSE                                                         04809510
           IF MSMAA = ERASE-KEY                                         04809610
                 MOVE SPACES TO TWA-MSMA                                04809710
           END-IF END-IF.                                               04809910
                                                                                
           IF MSECRL > 0                                                04809210
              MOVE MSECRI TO TWA-MSECR                                          
           ELSE                                                         04809510
           IF MSECRA = ERASE-KEY                                        04809610
                 MOVE SPACES TO TWA-MSECR                               04809710
           END-IF END-IF.                                               04809910
                                                                                
           IF MSLOCL > 0                                                04809210
              MOVE MSLOCI TO TWA-MSLOC                                          
           ELSE                                                         04809510
           IF MSLOCA = ERASE-KEY                                        04809610
                 MOVE SPACES TO TWA-MSLOC                               04809710
           END-IF END-IF.                                               04809910
                                                                                
           IF MCATGRL > 0                                               04809210
              MOVE MCATGRI TO TWA-MCATGR                                        
           ELSE                                                         04809510
           IF MCATGRA = ERASE-KEY                                       04809610
                 MOVE SPACES TO TWA-MCATGR                              04809710
           END-IF END-IF.                                               04809910
                                                                                
*********  IF MACMNTL > 0                                               04809210
*********     MOVE MACMNTI TO TWA-MACMNT                                        
*********  ELSE                                                         04809510
*********  IF MACMNTA = ERASE-KEY                                       04809610
*********        MOVE SPACES TO TWA-MACMNT                              04809710
*********  END-IF END-IF.                                               04809910
                                                                                
           IF MCDL > 0                                                  04809210
              MOVE MCDI TO TWA-MCD                                              
           ELSE                                                         04809510
           IF MCDA = ERASE-KEY                                          04809610
                 MOVE SPACES TO TWA-MCD                                 04809710
           END-IF END-IF.                                               04809910
                                                                                
           IF MQTYL > 0                                                 04809210
              MOVE MQTYI TO TWA-MQTY                                            
           ELSE                                                         04809510
           IF MQTYA = ERASE-KEY                                         04809610
                 MOVE SPACES TO TWA-MQTY                                04809710
           END-IF END-IF.                                               04809910
                                                                                
           IF MDESCL > 0                                                04809210
              MOVE MDESCI(1 : MDESCL) TO TWA-MDESC                              
CSG001* IN SOME CASES MSD DESCRIPTIONS CONTAIN SPECIAL CHARACTERS.              
CSG001* CORRECT THEM BY REPLACING SPECIAL CHARACTERS WITH SPACES.               
CSG001        MOVE TWA-MDESC                 TO W-ASSET-DESC-TXT                
CSG001        MOVE 30                        TO W-SUB3                          
CSG001        SET W-JUST-LEFT-REQ-Y          TO TRUE                            
CSG001        PERFORM EDIT-ASSET-DESC-TXT                                       
CSG001        MOVE W-ASSET-DESC-TXT          TO TWA-MDESC                       
CSG001                                                                          
           ELSE                                                         04809510
           IF MDESCA = ERASE-KEY                                        04809610
                 MOVE SPACES TO TWA-MDESC                               04809710
           END-IF END-IF.                                               04809910
                                                                                
           IF MWIL > 0                                                  04809210
              MOVE MWII TO TWA-MWI                                              
           ELSE                                                         04809510
           IF MWIA = ERASE-KEY                                          04809610
                 MOVE SPACES TO TWA-MWI                                 04809710
           END-IF END-IF.                                               04809910
                                                                                
           IF MTYPEL > 0                                                04809210
              MOVE MTYPEI TO TWA-MTYPE                                          
           ELSE                                                         04809510
           IF MTYPEA = ERASE-KEY                                        04809610
                 MOVE SPACES TO TWA-MTYPE                               04809710
           END-IF END-IF.                                               04809910
                                                                                
LRM025     IF MEXPDTL > 0                                               04809210
LRM025        MOVE MEXPDTI TO TWA-MEXPDT                                        
LRM025     ELSE                                                         04809510
LRM025     IF MEXPDTA = ERASE-KEY                                       04809610
LRM025           MOVE SPACES TO TWA-MEXPDT                              04809710
LRM025     END-IF END-IF.                                               04809910
LRM025                                                                          
LRM025     IF MCALLL > 0                                                04809210
LRM025        MOVE MCALLI TO TWA-MCALL                                          
LRM025     ELSE                                                         04809510
LRM025     IF MCALLA = ERASE-KEY                                        04809610
LRM025           MOVE SPACES TO TWA-MCALL                               04809710
LRM025     END-IF END-IF.                                               04809910
LRM025                                                                          
LRM025     IF MLONGL > 0                                                04809210
LRM025        MOVE MLONGI TO TWA-MLONG                                          
LRM025     ELSE                                                         04809510
LRM025     IF MLONGA = ERASE-KEY                                        04809610
LRM025           MOVE SPACES TO TWA-MLONG                               04809710
LRM025     END-IF END-IF.                                               04809910
LRM025                                                                          
LRM025     IF MSTRIKEL > 0                                              04809210
LRM025        MOVE MSTRIKEI TO TWA-MSTRIKE                                      
LRM025     ELSE                                                         04809510
LRM025     IF MSTRIKEA = ERASE-KEY                                      04809610
LRM025           MOVE SPACES TO TWA-MSTRIKE                             04809710
LRM025     END-IF END-IF.                                               04809910
                                                                                
           IF MDESC2L > 0                                               04809210
              MOVE MDESC2I(1 : MDESC2L) TO TWA-MDESC2                           
CSG001        MOVE TWA-MDESC2                TO W-ASSET-DESC-TXT                
CSG001        MOVE 30                        TO W-SUB3                          
CSG001        SET  W-JUST-LEFT-REQ-N         TO TRUE                            
CSG001        PERFORM EDIT-ASSET-DESC-TXT                                       
CSG001        MOVE W-ASSET-DESC-TXT          TO TWA-MDESC2                      
           ELSE                                                         04809510
           IF MDESC2A = ERASE-KEY                                       04809610
                 MOVE SPACES TO TWA-MDESC2                              04809710
           END-IF END-IF.                                               04809910
                                                                                
           IF MDESC3L > 0                                               04809210
              MOVE MDESC3I(1 : MDESC3L) TO TWA-MDESC3                           
CSG001        MOVE TWA-MDESC3                TO W-ASSET-DESC-TXT                
CSG001        MOVE 30                        TO W-SUB3                          
CSG001        SET  W-JUST-LEFT-REQ-N         TO TRUE                            
CSG001        PERFORM EDIT-ASSET-DESC-TXT                                       
CSG001        MOVE W-ASSET-DESC-TXT          TO TWA-MDESC3                      
           ELSE                                                         04809510
           IF MDESC3A = ERASE-KEY                                       04809610
                 MOVE SPACES TO TWA-MDESC3                              04809710
           END-IF END-IF.                                               04809910
                                                                                
062900 MERGE-MAP-NEXT-RTN.                                              06100002
           IF MNEXTL > 0                                                04809210
              MOVE MNEXTI TO TWA-MNEXT                                          
           ELSE                                                         04809510
           IF MNEXTA = ERASE-KEY                                        04809610
                 MOVE SPACES TO TWA-MNEXT                               04809710
           END-IF END-IF.                                               04809910
                                                                                
           IF MSUBML > 0                                                04809210
              MOVE MSUBMI TO TWA-MSUBM                                          
           ELSE                                                         04809510
           IF MSUBMA = ERASE-KEY                                        04809610
                 MOVE SPACES TO TWA-MSUBM                               04809710
           END-IF END-IF.                                               04809910
                                                                                
           IF MCMNTL > 0                                                04809210
              MOVE MCMNTI TO TWA-MCMNT                                          
           ELSE                                                         04809510
           IF MCMNTA = ERASE-KEY                                        04809610
                 MOVE SPACES TO TWA-MCMNT                               04809710
           END-IF END-IF.                                               04809910
                                                                                
           IF MDELL > 0                                                 04809210
              MOVE MDELI TO TWA-MDEL                                            
           ELSE                                                         04809510
           IF MDELA = ERASE-KEY                                         04809610
                 MOVE SPACES TO TWA-MDEL                                04809710
           END-IF END-IF.                                               04809910
                                                                                
       EJECT                                                                    
       MOVE-ACAT03IO-TO-TWA-RTN.                                                
           MOVE ACAT03IO-DLVR-NBR   TO TWA-MCBRKR                               
                                       TWA-ORIG-DLVR-NBR.                       
           MOVE ACAT03IO-DLVR-ACCT  TO TWA-MCACCT                               
                                       TWA-ORIG-DLVR-ACCT.                      
           MOVE ACAT03IO-RCV-ACCT   TO TWA-MBR.                                 
           MOVE ACAT03IO-RCV-ACCT(4 : 5) TO TWA-MAC.                            
           MOVE ACAT03IO-RR-CD    TO TWA-MRR.                                   
           MOVE ACAT03IO-CMNT-TXT TO TWA-MCCMNT-X120.                           
           MOVE ACAT03IO-ASSET-CMNT1-TXT TO TWA-M1CMNT-X120.                    
           MOVE ACAT03IO-ASSET-CMNT2-TXT TO TWA-M2CMNT-X120.                    
           MOVE ACAT03IO-ASSET-CMNT5-TXT TO TWA-M5CMNT-X120.                    
           MOVE ACAT03IO-ASSET-CMNTM-TXT TO TWA-MMCMNT-X120.                    
           MOVE ACAT03IO-RCV-ACCT-TYPE-CD TO TWA-MCTYPE.                02030002
           MOVE ACAT03IO-RCV-CUST-NM            TO TWA-MNAME.           02030002
           MOVE ACAT03IO-RCV-CUST-NM(31 : 30)   TO TWA-MNAME2.          02030002
           MOVE ACAT03IO-RCV-SS-PRIM-NBR(1 : 3) TO TWA-MSSN.            02030002
           MOVE ACAT03IO-RCV-SS-PRIM-NBR(4 : 2) TO TWA-MSSN(5 : 2).     02030002
           MOVE ACAT03IO-RCV-SS-PRIM-NBR(6 : 4) TO TWA-MSSN(8 : 4).     02030002
           MOVE '-'                             TO TWA-MSSN(4 : 1)      02030002
                                                   TWA-MSSN(7 : 1).     02030002
           IF ACAT03IO-RCV-SS-SCNDY-NBR NOT GREATER SPACES                      
              MOVE SPACES TO TWA-MSSN2                                          
           ELSE                                                                 
              MOVE ACAT03IO-RCV-SS-SCNDY-NBR(1 : 3) TO TWA-MSSN2                
              MOVE ACAT03IO-RCV-SS-SCNDY-NBR(4 : 2) TO TWA-MSSN2(5 : 2)         
              MOVE ACAT03IO-RCV-SS-SCNDY-NBR(6 : 4) TO TWA-MSSN2(8 : 4)         
              MOVE '-'                              TO TWA-MSSN2(4 : 1) 02030002
                                                       TWA-MSSN2(7 : 1) 02030002
           END-IF.                                                              
           IF ACAT03IO-NSCC-SUBMIT-ELIGABLE                                     
               MOVE 'Y'   TO TWA-MSUBM                                  02030002
           ELSE                                                                 
              MOVE SPACES TO TWA-MSUBM.                                         
                                                                                
           IF ACAT03IO-NSCC-SUBMITTED                                           
           OR NOT ACAT-SIGN-ON-UPDATE                                           
               MOVE 'B' TO TWA-ACTION                                           
           ELSE                                                                 
               MOVE 'C' TO TWA-ACTION.                                          
                                                                                
           MOVE ACAT03IO-CONTROL-NBR TO TWA-CONTROL-NBR.                        
           MOVE ACAT03IO-TRNFR-TYPE-CD TO TWA-TRNFR-TYPE-CD.                    
           MOVE ACAT03IO-STTS-CD       TO TWA-STTS-CD.                          
                                                                                
LRM019     MOVE SPACES TO TWA-MBAL01 TWA-MBAL02 TWA-MBAL05                      
LRM019        TWA-ORIG-MBAL01 TWA-ORIG-MBAL02 TWA-ORIG-MBAL05                   
LRM019        TWA-MBAL01-CREDIT-IND TWA-MBAL02-CREDIT-IND                       
LRM019        TWA-MBAL05-CREDIT-IND.                                            
           MOVE ACAT03IO-AMT-01    TO TWA-MBAL01-9.                             
           IF ACAT03IO-AMT-01-CREDIT                                            
              COMPUTE TWA-MBAL01-9 = TWA-MBAL01-9 * -1                          
              END-COMPUTE.                                                      
LRM011     MOVE ACAT03IO-AMT-01-RQST-CD    TO TWA-MBAL01-RQST-CD.               
LRM011     MOVE ACAT03IO-AMT-01-CREDIT-IND TO TWA-MBAL01-CREDIT-IND.            
           MOVE ACAT03IO-AMT-02    TO TWA-MBAL02-9.                             
           IF ACAT03IO-AMT-02-CREDIT                                            
              COMPUTE TWA-MBAL02-9 = TWA-MBAL02-9 * -1                          
              END-COMPUTE.                                                      
LRM011     MOVE ACAT03IO-AMT-02-RQST-CD    TO TWA-MBAL02-RQST-CD.               
LRM011     MOVE ACAT03IO-AMT-02-CREDIT-IND TO TWA-MBAL02-CREDIT-IND.            
           MOVE ACAT03IO-AMT-05    TO TWA-MBAL05-9.                             
           IF ACAT03IO-AMT-05-CREDIT                                            
              COMPUTE TWA-MBAL05-9 = TWA-MBAL05-9 * -1                          
              END-COMPUTE.                                                      
LRM011     MOVE ACAT03IO-AMT-05-RQST-CD    TO TWA-MBAL05-RQST-CD.               
LRM011     MOVE ACAT03IO-AMT-05-CREDIT-IND TO TWA-MBAL05-CREDIT-IND.            
           MOVE ACAT03IO-AMT-SMA   TO TWA-MSMA-9.                               
           IF ACAT03IO-AMT-SMA-CREDIT                                           
              COMPUTE TWA-MSMA-9 = TWA-MSMA-9 * -1                              
              END-COMPUTE.                                                      
           MOVE ACAT03IO-UPDT-TMSTP TO TWA-UPDT-TMSTP.                          
                                                                                
     ****** ASSET SECTION:                                                      
       MOVE-ACAT03IO-ASSET-TO-TWA.                                              
           MOVE ACAT03IO-ISIN-CNTRY-CD      TO TWA-ISIN-CNTRY-CD.               
LRM030     IF ACAT03IO-KEY-FIELDS(1:2) NOT = 'US' AND SPACES                    
LRM030        MOVE 'I' TO TWA-ISIN-USED                                         
LRM030        MOVE ACAT03IO-KEY-FIELDS TO TWA-MSECR                             
LRM030                                    TWA-ORIG-MSECR                        
LRM030                                    TWA-CURRENT-ASSET-KEY                 
LRM030     ELSE                                                                 
LRM030        MOVE ' ' TO TWA-ISIN-USED                                         
              MOVE ACAT03IO-ISIN-SEC-ISSUE-CD  TO TWA-MSECR                     
                                                  TWA-ORIG-MSECR                
              MOVE ACAT03IO-KEY-FIELDS TO         TWA-CURRENT-ASSET-KEY         
              MOVE SPACES                      TO TWA-ISIN-SEC-CDG-CD           
LRM030     END-IF.                                                              
           MOVE ACAT03IO-STTLM-LCTN-CD      TO TWA-MSLOC                        
                                               TWA-ORIG-SLOC.                   
           MOVE ACAT03IO-ADP-NBR            TO TWA-ADP-NBR.                     
           MOVE ACAT03IO-ASSET-PRC-CTGY-CD  TO TWA-MCATGR.                      
           IF ACAT03IO-RQST-ASSET-AMT                                           
              MOVE 'V' TO TWA-MCD                                               
              MOVE ACAT03IO-ASSET-AMT  TO TWA-MQTY-9                            
           ELSE                                                                 
           IF ACAT03IO-RQST-ASSET-QTY                                           
              MOVE 'P' TO TWA-MCD                                               
              MOVE ACAT03IO-ASSET-QTY  TO TWA-MQTY-9                            
           ELSE                                                                 
           IF ACAT03IO-RQST-ASSET-PCT                                           
              MOVE '%' TO TWA-MCD                                               
              MOVE ACAT03IO-ASSET-PCT  TO TWA-MQTY-9                            
           ELSE                                                                 
              MOVE ZEROS               TO TWA-MQTY-9                            
LRM009        IF ACAT03IO-DESC-TXT > SPACES                                     
LRM009           MOVE 'F' TO TWA-MCD                                            
LRM028           IF ACAT03IO-SHORT-ASSET-QTY                                    
LRM028              MOVE 'SHORT' TO TWA-MQTY TWA-ORIG-MQTY                      
LRM028           END-IF                                                         
LRM009        ELSE                                                              
LRM009           MOVE ' ' TO TWA-MCD                                            
LRM009        END-IF                                                            
           END-IF.                                                              
                                                                                
    **** ACAT03IO-PSTN-CD BASED ON POSITIVE OR NEGATIVE QTY BELOW.              
           IF ACAT03IO-SHORT-ASSET-QTY                                          
              COMPUTE TWA-MQTY-9 = TWA-MQTY-9 * -1                              
              COMPUTE TWA-MAMT-9 = TWA-MAMT-9 * -1                              
              END-COMPUTE.                                                      
                                                                                
           IF ACAT03IO-CASH-ASSET                                               
              MOVE '1' TO TWA-MTYPE                                             
           ELSE                                                                 
           IF ACAT03IO-MARGIN-ASSET                                             
              MOVE '2' TO TWA-MTYPE                                             
           ELSE                                                                 
           IF ACAT03IO-SHORT-ASSET                                              
              MOVE '5' TO TWA-MTYPE                                             
           ELSE                                                                 
              MOVE SPACES TO TWA-MTYPE                                          
           END-IF.                                                              
           MOVE TWA-MTYPE TO  TWA-ORIG-MTYPE.                                   
           MOVE ACAT03IO-CSH-MGN-SHRT-CD TO TWA-ORIG-TYPE.                      
                                                                                
           MOVE ACAT03IO-WHI-CD    TO TWA-MWI.                                  
           MOVE ACAT03IO-DESC-TXT  TO TWA-MDESC-GROUP.                          
CSG001* IN SOME CASES MSD DESCRIPTIONS CONTAIN SPECIAL CHARACTERS.              
CSG001* CORRECT THEM BY REPLACING SPECIAL CHARACTERS WITH SPACES.               
CSG001     MOVE TWA-MDESC-GROUP            TO W-ASSET-DESC-TXT-GRP              
CSG001     MOVE W-ASSET-DESC1-TXT          TO W-ASSET-DESC-TXT                  
CSG001     MOVE 30                         TO W-SUB3                            
CSG001     SET  W-JUST-LEFT-REQ-Y          TO TRUE                              
CSG001     PERFORM EDIT-ASSET-DESC-TXT                                          
CSG001     MOVE W-ASSET-DESC-TXT           TO W-ASSET-DESC1-TXT                 
CSG001     MOVE W-ASSET-DESC2-TXT          TO W-ASSET-DESC-TXT                  
CSG001     MOVE 30                         TO W-SUB3                            
CSG001     SET  W-JUST-LEFT-REQ-N          TO TRUE                              
CSG001     PERFORM EDIT-ASSET-DESC-TXT                                          
CSG001     MOVE W-ASSET-DESC-TXT           TO W-ASSET-DESC2-TXT                 
CSG001     MOVE W-ASSET-DESC3-TXT          TO W-ASSET-DESC-TXT                  
CSG001     MOVE 30                         TO W-SUB3                            
CSG001     SET  W-JUST-LEFT-REQ-N          TO TRUE                              
CSG001     PERFORM EDIT-ASSET-DESC-TXT                                          
CSG001     MOVE W-ASSET-DESC-TXT           TO W-ASSET-DESC3-TXT                 
CSG001     MOVE SPACES                     TO TWA-MDESC-GROUP                   
CSG001     MOVE W-ASSET-DESC-TXT-GRP(1:90) TO TWA-MDESC-GROUP                   
CSG001                                                                          
           MOVE ACAT03IO-ASSET-CMNT-TXT  TO TWA-MSCMNT-X120.                    
                                                                                
       REFORMAT-SCREEN-DETAIL.                                                  
********   MOVE LOW-VALUES  TO ACAT03MO.                                        
           MOVE TWA-MBR     TO MBRO.                                            
           MOVE TWA-MAC     TO MACO.                                            
           MOVE TWA-MRR     TO MRRO.                                            
           MOVE TWA-MCTYPE  TO MCTYPEO.                                         
           MOVE TWA-MCBRKR  TO MCBRKRO.                                         
           MOVE TWA-MCBNAM  TO MCBNAMO.                                         
           MOVE TWA-MCACCT  TO MCACCTO.                                         
           MOVE TWA-MNAME   TO MNAMEO.                                          
           MOVE TWA-MNAME2  TO MNAME2O.                                         
           MOVE TWA-MSSN    TO MSSNO.                                           
           MOVE TWA-MSSN2   TO MSSN2O.                                          
           MOVE TWA-MACAT   TO MACATO.                                          
           MOVE TWA-MSTAT   TO MSTATO.                                          
           MOVE TWA-MSD     TO MSDO.                                            
           MOVE TWA-MNEXT   TO MNEXTO.                                          
           MOVE TWA-MSUBM   TO MSUBMO.                                          
           MOVE TWA-MCMNT   TO MCMNTO.                                          
           MOVE TWA-MDEL    TO MDELO.                                           
LRM018     IF TWA-MBAL01 = 'FULL' OR 'FULL-'                                    
LRM018        MOVE 'F' TO TWA-MBAL01-RQST-CD                                    
LRM018        IF TWA-MBAL01 = 'FULL-'                                           
LRM018           MOVE 'C' TO TWA-MBAL01-CREDIT-IND                              
LRM018     END-IF.                                                              
LRM011     IF TWA-MBAL01-RQST-CD = 'F'                                          
LRM011        MOVE ZEROS TO TWA-MBAL01-9                                        
LRM011        IF TWA-MBAL01-CREDIT-IND = 'C'                                    
LRM011           MOVE 'FULL-' TO MBAL01I TWA-MBAL01 TWA-ORIG-MBAL01             
LRM011        ELSE                                                              
LRM011           MOVE 'FULL'  TO MBAL01I TWA-MBAL01 TWA-ORIG-MBAL01             
LRM011     ELSE                                                                 
           IF TWA-MBAL01-9 NOT = ZEROS                                          
              MOVE TWA-MBAL01-9 TO MBAL01O                                      
              MOVE MBAL01O TO TWA-MBAL01 TWA-ORIG-MBAL01                        
           ELSE                                                                 
              MOVE SPACES       TO MBAL01I                                      
                              TWA-MBAL01 TWA-ORIG-MBAL01                        
           END-IF.                                                              
                                                                                
LRM018     IF TWA-MBAL02 = 'FULL' OR 'FULL-'                                    
LRM018        MOVE 'F' TO TWA-MBAL02-RQST-CD                                    
LRM018        IF TWA-MBAL02 = 'FULL-'                                           
LRM018           MOVE 'C' TO TWA-MBAL02-CREDIT-IND                              
LRM018     END-IF.                                                              
LRM011     IF TWA-MBAL02-RQST-CD = 'F'                                          
LRM011        MOVE ZEROS TO TWA-MBAL02-9                                        
LRM011        IF TWA-MBAL02-CREDIT-IND = 'C'                                    
LRM011           MOVE 'FULL-' TO MBAL02I TWA-MBAL02 TWA-ORIG-MBAL02             
LRM011        ELSE                                                              
LRM011           MOVE 'FULL'  TO MBAL02I TWA-MBAL02 TWA-ORIG-MBAL02             
LRM011     ELSE                                                                 
           IF TWA-MBAL02-9 NOT = ZEROS                                          
              MOVE TWA-MBAL02-9 TO MBAL02O                                      
              MOVE MBAL02O TO TWA-MBAL02 TWA-ORIG-MBAL02                        
           ELSE                                                                 
              MOVE SPACES       TO MBAL02I                                      
                              TWA-MBAL02 TWA-ORIG-MBAL02                        
           END-IF.                                                              
                                                                                
LRM018     IF TWA-MBAL05 = 'FULL' OR 'FULL-'                                    
LRM018        MOVE 'F' TO TWA-MBAL05-RQST-CD                                    
LRM018        IF TWA-MBAL05 = 'FULL-'                                           
LRM018           MOVE 'C' TO TWA-MBAL05-CREDIT-IND                              
LRM018     END-IF.                                                              
LRM011     IF TWA-MBAL05-RQST-CD = 'F'                                          
LRM011        MOVE ZEROS TO TWA-MBAL05-9                                        
LRM011        IF TWA-MBAL05-CREDIT-IND = 'C'                                    
LRM011           MOVE 'FULL-' TO MBAL05I TWA-MBAL05 TWA-ORIG-MBAL05             
LRM011        ELSE                                                              
LRM011           MOVE 'FULL'  TO MBAL05I TWA-MBAL05 TWA-ORIG-MBAL05             
LRM011     ELSE                                                                 
           IF TWA-MBAL05-9 NOT = ZEROS                                          
              MOVE TWA-MBAL05-9 TO MBAL05O                                      
              MOVE MBAL05O TO TWA-MBAL05 TWA-ORIG-MBAL05                        
           ELSE                                                                 
              MOVE SPACES       TO MBAL05I                                      
                              TWA-MBAL05 TWA-ORIG-MBAL05                        
           END-IF.                                                              
                                                                                
           IF TWA-MSMA-9 NOT = ZEROS                                            
              MOVE TWA-MSMA-9 TO MSMAO                                          
              MOVE MSMAO TO TWA-MSMA TWA-ORIG-MSMA                              
           ELSE                                                                 
              MOVE SPACES     TO MSMAI                                          
                            TWA-MSMA TWA-ORIG-MSMA                              
           END-IF.                                                              
                                                                                
           MOVE TWA-CONTROL-NBR TO MACATO.                                      
           PERFORM SET-STATUS-MSG-RTN.                                          
                                                                                
S/D ****** NOT DEFINED...    TO MSDO.                                           
     **** FIELDS ON ASSET SECTION...                                            
                                                                                
       REFORMAT-SCREEN-ASSET.                                                   
           MOVE TWA-MSECR    TO MSECRO.                                         
           MOVE TWA-MCATGR   TO MCATGRO.                                        
           MOVE TWA-MSLOC    TO MSLOCO.                                         
           MOVE TWA-MCD      TO MCDO.                                           
           IF TWA-MCD = 'P'                                                     
              MOVE TWA-MQTY-9 TO WK-QTY-OUT                                     
              MOVE WK-QTY-OUT    TO WS-MQTY-ED-D5                               
              MOVE WS-MQTY-AREA TO MQTYO TWA-MQTY TWA-ORIG-MQTY                 
           ELSE                                                                 
           IF TWA-MCD = 'V'                                                     
              MOVE TWA-MQTY-9 TO WK-VALUE-OUT                                   
              MOVE WK-VALUE-OUT    TO WS-MQTY-ED-D2                             
              MOVE WS-MQTY-AREA TO MQTYO TWA-MQTY TWA-ORIG-MQTY                 
           ELSE                                                                 
           IF TWA-MCD = '%'                                                     
              MOVE TWA-MQTY-9 TO WK-QTY-OUT                                     
              MOVE WK-QTY-OUT    TO WS-MQTY-ED-D5                               
              MOVE WS-MQTY-AREA TO MQTYO TWA-MQTY TWA-ORIG-MQTY                 
           ELSE                                                                 
LRM028        IF TWA-MQTY = 'SHORT'                                             
LRM028           MOVE TWA-MQTY     TO MQTYO          TWA-ORIG-MQTY              
LRM028        ELSE                                                              
                 MOVE SPACES       TO MQTYO TWA-MQTY TWA-ORIG-MQTY              
           END-IF.                                                              
                                                                                
           MOVE TWA-MWI   TO MWIO.                                              
           MOVE TWA-MTYPE TO MTYPEO.                                            
           MOVE TWA-MDESC TO MDESCO.                                            
CSG001* IN SOME CASES MSD DESCRIPTIONS CONTAIN SPECIAL CHARACTERS.              
CSG001* CORRECT THEM BY REPLACING SPECIAL CHARACTERS WITH SPACES.               
CSG001     MOVE MDESCO                    TO W-ASSET-DESC-TXT                   
CSG001     MOVE 30                        TO W-SUB3                             
CSG001     SET  W-JUST-LEFT-REQ-Y         TO TRUE                               
CSG001     PERFORM EDIT-ASSET-DESC-TXT                                          
CSG001     MOVE W-ASSET-DESC-TXT          TO MDESCO                             
           MOVE TWA-MDESC2 TO MDESC2O.                                          
CSG001     MOVE MDESC2O                   TO W-ASSET-DESC-TXT                   
CSG001     MOVE 30                        TO W-SUB3                             
CSG001     SET  W-JUST-LEFT-REQ-N         TO TRUE                               
CSG001     PERFORM EDIT-ASSET-DESC-TXT                                          
CSG001     MOVE W-ASSET-DESC-TXT          TO MDESC2O                            
           MOVE TWA-MDESC3 TO MDESC3O.                                          
CSG001     MOVE MDESC3O                   TO W-ASSET-DESC-TXT                   
CSG001     MOVE 30                        TO W-SUB3                             
CSG001     SET  W-JUST-LEFT-REQ-N         TO TRUE                               
CSG001     PERFORM EDIT-ASSET-DESC-TXT                                          
CSG001     MOVE W-ASSET-DESC-TXT          TO MDESC3O                            
                                                                                
LRM025     IF FIRST-TIME                                                01000002
LRM025        CONTINUE                                                  01000002
LRM025     ELSE                                                         01000002
LRM025     IF TWA-ACTION NOT = 'C'                                              
LRM025     OR TWA-SECR-ACTION NOT = 'A'                                         
LRM025        MOVE ATT-ASKIP TO MEXPDTA MCALLA MLONGA MSTRIKEA                  
LRM025     END-IF.                                                              
                                                                                
           SKIP3                                                                
       SET-STATUS-MSG-RTN.                                                      
           IF TWA-STTS-CD NOT GREATER SPACES                            08505010
              MOVE SPACES TO MSTATO                                             
           ELSE                                                                 
           EVALUATE TWA-STTS-CD                                         08505010
               WHEN '100'                                               08506010
                    MOVE '100-REQUEST'               TO MSTATO          08507010
               WHEN '110'                                               08506010
                    MOVE '110-REQUEST ADJUST'        TO MSTATO          08507010
               WHEN '120'                                               08506010
                    MOVE '120-REQUEST ADJUST PAST'   TO MSTATO          08507010
               WHEN '130'                                               08506010
                    MOVE '130-REQUEST PAST'          TO MSTATO          08507010
               WHEN '140'                                               08506010
                    MOVE '140-REQUEST REJECT'        TO MSTATO          08507010
               WHEN '200'                                               08506010
                    MOVE '200-REVIEW'                TO MSTATO          08507010
               WHEN '210'                                               08507110
                    MOVE '210-REVIEW ADJUST'         TO MSTATO          08508010
               WHEN '220'                                               08509010
                    MOVE '220-REVIEW ERROR'          TO MSTATO          08509110
               WHEN '230'                                               08509010
                    MOVE '230-REVIEW ACCELERATE'     TO MSTATO          08509110
               WHEN '300'                                               08509210
                    MOVE '300-SETTLE PREP'   TO MSTATO                  08509310
               WHEN '310'                                               08509410
                    MOVE '310-SETTLE CLOSE'  TO MSTATO                  08509510
               WHEN '400'                                               08509710
                    MOVE '400-CLOSE PURGE'   TO MSTATO                  08509810
               WHEN '500'                                               08509910
                    MOVE '500-MEMO PARTIAL REQUEST'      TO MSTATO      08510010
               WHEN '510'                                               08510110
                    MOVE '510-MEMO PURGE PARTIAL REQUEST' TO MSTATO     08510210
               WHEN '600'                                               08510110
                    MOVE '600-REJECT'    TO MSTATO                      08510210
               WHEN OTHER                                               08510110
                    MOVE TWA-STTS-CD     TO MSTATO                      08510210
           END-EVALUATE.                                                08510310
                                                                                
           EJECT                                                                
       PROCESS-MAP-ITEMS.                                                       
           MOVE ATT-UNPROT TO MBRA.                                             
           IF TWA-MBR NOT GREATER SPACES                                        
              MOVE ATT-UNPROT-BRT TO MBRA                                       
              IF NOT INPUT-ERROR                                                
                 MOVE -1 TO MBRL                                                
                 MOVE 'BRANCH IS REQUIRED' TO SYSTEM-MSG                        
                 SET INPUT-ERROR TO TRUE.                                       
                                                                                
           MOVE ATT-UNPROT TO MACA.                                             
           IF TWA-MAC NOT GREATER SPACES                                        
              MOVE ATT-UNPROT-BRT TO MACA                                       
              IF NOT INPUT-ERROR                                                
                 MOVE -1 TO MACL                                                
                 MOVE 'ACCOUNT IS REQUIRED' TO SYSTEM-MSG                       
                 SET INPUT-ERROR TO TRUE.                                       
                                                                                
           IF NOT INPUT-ERROR                                                   
              SET ACATNAIO-NA-READ TO TRUE                                      
              MOVE TWA-CLIENT-NO-X(2 : 3) TO ACATNAIO-CLIENT                    
              MOVE TWA-MBR         TO ACATNAIO-BR                               
              MOVE TWA-MAC         TO ACATNAIO-AC                               
              PERFORM LINK-TO-ACATNAIO-RTN                                      
              IF ACATNAIO-NOT-FOUND                                             
                 MOVE ATT-UNPROT-BRT TO MBRA                                    
                                        MACA                                    
                 MOVE -1 TO MBRL                                                
                 MOVE 'BRANCH/ACCOUNT NOT ON N/A' TO SYSTEM-MSG                 
                 SET INPUT-ERROR TO TRUE                                        
              ELSE                                                              
                                                                                
                 PERFORM CHECK-ACCOUNT-RESTRICTIONS-RTN                         
                 MOVE ACATNAIO-RR    TO TWA-MRR     MRRO                        
                 IF  ACAT-SUPER-SIGN-ON-UPDATE                                  
                 OR  ACAT-SUPER-SIGN-ON-BROWSE                                  
                    CONTINUE                                                    
                 ELSE                                                           
                    MOVE TWA-MRR  TO SRCH-INP-RR                                
                    MOVE TWA-MBR  TO SRCH-INP-BRANCH                            
                    PERFORM SIGNON-SECR-CHECK-RTN                               
                    IF SRCH-SIGNON-SECR-CHECK-FAIL                              
                       MOVE ATT-UNPROT-BRT TO MBRA                              
                                              MACA                              
                       MOVE -1 TO MBRL                                          
                       MOVE SRCH-MSG TO SYSTEM-MSG                              
                       SET INPUT-ERROR TO TRUE                                  
                       PERFORM ERROR-RTN                                        
                    END-IF                                                      
                 END-IF                                                         
LRM013           IF NOT INPUT-ERROR                                             
LRM013           AND ACAT-ACCOUNT-FREEZE-CLIENT                                 
LRM013              MOVE TWA-CLIENT-NO-X TO ACATRSIO-CLIENT-NBR                 
LRM013              MOVE TWA-MBR TO ACATRSIO-BRANCH                             
LRM013              MOVE TWA-MAC TO ACATRSIO-ACCOUNT                            
LRM013              SET ACATRSIO-LOOKUP-ACCOUNT-FREEZE TO TRUE                  
LRM003              MOVE ALL 'N' TO ACATRSIO-FREEZE-INDICATORS                  
LRM003              MOVE 'Y' TO ACATRSIO-FREEZE-B                               
LRM003                          ACATRSIO-FREEZE-D                               
LRM013              PERFORM LINK-TO-ACATRSTIO-RTN                               
LRM013              IF ACATRSIO-FREEZE-CASH-IN                                  
LRM013              AND ACATRSIO-FREEZE-CASH-OUT                                
LRM013              AND ACATRSIO-FREEZE-SEC-IN                                  
LRM013              AND ACATRSIO-FREEZE-SEC-OUT                                 
LRM013                 MOVE ATT-UNPROT-BRT TO MBRA                              
LRM013                                        MACA                              
LRM013                 MOVE -1 TO MBRL                                          
LRM013                 SET INPUT-ERROR TO TRUE                                  
LRM013                 MOVE WS-FULL-FREEZE-MSG TO SYSTEM-MSG                    
LRM013              END-IF                                                      
LRM013              MOVE ACATRSIO-FREEZE-A TO TWA-FREEZE-CASH-OUT               
LRM013              MOVE ACATRSIO-FREEZE-B TO TWA-FREEZE-CASH-IN                
LRM013              MOVE ACATRSIO-FREEZE-C TO TWA-FREEZE-SEC-OUT                
LRM013              MOVE ACATRSIO-FREEZE-D TO TWA-FREEZE-SEC-IN                 
LRM013           END-IF                                                         
                 IF (TWA-MNAME NOT > SPACES                                     
                 OR ACCOUNT-CHANGED )                                           
                    IF ACATNAIO-SSN(1 : 1) GREATER SPACES                       
                       MOVE ACATNAIO-SSN(1 : 3) TO TWA-MSSN(1 : 3)              
                       MOVE '-'                 TO TWA-MSSN(4 : 1)              
                       MOVE ACATNAIO-SSN(4 : 2) TO TWA-MSSN(5 : 2)              
                       MOVE '-'                 TO TWA-MSSN(7 : 1)              
                       MOVE ACATNAIO-SSN(6 : 4) TO TWA-MSSN(8 : 4)              
                    ELSE                                                        
                       MOVE SPACES TO TWA-MSSN                                  
                    END-IF                                                      
                    MOVE TWA-MSSN TO MSSNO                                      
                    IF ACATNAIO-SSN2(1 : 1) GREATER SPACES                      
                       MOVE ACATNAIO-SSN2(1 : 3) TO TWA-MSSN2(1 : 3)            
                       MOVE '-'                  TO TWA-MSSN2(4 : 1)            
                       MOVE ACATNAIO-SSN2(4 : 2) TO TWA-MSSN2(5 : 2)            
                       MOVE '-'                  TO TWA-MSSN2(7 : 1)            
                       MOVE ACATNAIO-SSN2(6 : 4) TO TWA-MSSN2(8 : 4)            
                    ELSE                                                        
                       MOVE SPACES TO TWA-MSSN2                                 
                    END-IF                                                      
                    MOVE TWA-MSSN2 TO MSSN2O                                    
                    MOVE ACATNAIO-IRA   TO TWA-NA-IRA                           
                    MOVE ACATNAIO-NAME  TO TWA-MNAME   MNAMEO                   
                    MOVE ACATNAIO-NAME2 TO TWA-MNAME2  MNAME2O.                 
                                                                                
           MOVE ATT-UNPROT TO MBAL01A.                                          
           IF TWA-MBAL01 GREATER SPACES                                         
LRM021        IF TWA-PRTCP-TYPE-CD = '3'                                        
LRM021           MOVE ATT-UNPROT-BRT TO MBAL01A                                 
LRM021           IF NOT INPUT-ERROR                                             
LRM021              MOVE -1 TO MBAL01L                                          
LRM021              SET INPUT-ERROR TO TRUE                                     
LRM021              MOVE 'CASH BALANCE INVALID ON PTF' TO SYSTEM-MSG            
LRM021           END-IF                                                         
LRM021        ELSE                                                              
LRM013        IF TWA-FREEZE-CASH-OUT = 'Y'                                      
LRM013        AND TWA-FREEZE-CASH-IN = 'Y'                                      
LRM013           MOVE ATT-UNPROT-BRT TO MBAL01A                                 
LRM013           IF NOT INPUT-ERROR                                             
LRM013              MOVE -1 TO MBAL01L                                          
LRM013              SET INPUT-ERROR TO TRUE                                     
LRM013              MOVE WS-CASH-FREEZE-MSG TO SYSTEM-MSG                       
LRM013           END-IF                                                         
LRM013        ELSE                                                              
              IF TWA-MBAL01 NOT = TWA-ORIG-MBAL01                               
LRM011           IF (TWA-MBAL01 = 'FULL'                                        
LRM011           OR TWA-MBAL01 = 'FULL-')                                       
LRM011              MOVE TWA-MBAL01 TO TWA-ORIG-MBAL01                          
LRM011              MOVE ZEROS      TO TWA-MBAL01-9                             
LRM018              MOVE 'F'        TO TWA-MBAL01-RQST-CD                       
LRM018              IF TWA-MBAL01 = 'FULL-'                                     
LRM018                 MOVE 'C' TO ACAT03IO-AMT-01-CREDIT-IND                   
LRM018              END-IF                                                      
LRM011           ELSE                                                           
                 MOVE TWA-MBAL01  TO WK-AMT-IN                                  
                 EXEC CICS LINK PROGRAM(WS-EDITMOD)                             
                             COMMAREA(EDIT-AMT-AREA)                            
                             LENGTH(LENGTH OF EDIT-AMT-AREA)                    
                 END-EXEC                                                       
                 IF WK-AMT-RET-CODE = SPACE                                     
                    IF WK-AMT-OUT = ZEROS                                       
                       MOVE SPACES           TO MBAL01I                         
                    ELSE                                                        
                       MOVE WK-AMT-OUT TO MBAL01O                               
                    END-IF                                                      
                    MOVE WK-AMT-OUT TO TWA-MBAL01-9                             
                    MOVE MBAL01I TO TWA-MBAL01                                  
                                    TWA-ORIG-MBAL01                             
LRM013              IF TWA-FREEZE-CASH-OUT = 'Y'                                
LRM013              AND (TWA-MBAL01-9 > ZERO                                    
LRM013              OR TWA-MBAL01 = 'FULL ')                                    
LRM013                 MOVE ATT-UNPROT-BRT TO MBAL01A                           
LRM013                 MOVE SPACES TO TWA-ORIG-MBAL01                           
LRM013                 IF NOT INPUT-ERROR                                       
LRM013                    MOVE -1 TO MBAL01L                                    
LRM013                    SET INPUT-ERROR TO TRUE                               
LRM013                    MOVE WS-CASH-FREEZE-OUT-MSG TO SYSTEM-MSG             
LRM013                 END-IF                                                   
LRM013              ELSE                                                        
LRM013              IF TWA-FREEZE-CASH-IN  = 'Y'                                
LRM013              AND (TWA-MBAL01-9 < ZERO                                    
LRM013              OR TWA-MBAL01 = 'FULL-')                                    
LRM013                 MOVE ATT-UNPROT-BRT TO MBAL01A                           
LRM013                 MOVE SPACES TO TWA-ORIG-MBAL01                           
LRM013                 IF NOT INPUT-ERROR                                       
LRM013                    MOVE -1 TO MBAL01L                                    
LRM013                    SET INPUT-ERROR TO TRUE                               
LRM013                    MOVE WS-CASH-FREEZE-IN-MSG TO SYSTEM-MSG              
LRM013                 END-IF                                                   
LRM013              END-IF END-IF                                               
                 ELSE                                                           
                    MOVE ATT-UNPROT-BRT TO MBAL01A                              
                    IF NOT INPUT-ERROR                                          
                       MOVE -1 TO MBAL01L                                       
                       SET INPUT-ERROR TO TRUE                                  
                       MOVE 'BALANCE 01 IS INVALID'                             
                             TO SYSTEM-MSG                                      
                    END-IF                                                      
                 END-IF                                                         
LRM011           END-IF                                                         
              END-IF                                                            
           ELSE                                                                 
              MOVE ZEROS       TO TWA-MBAL01-9                                  
LRM019        MOVE SPACES      TO TWA-M1CMNT-X120                               
LRM019                            TWA-MBAL01-RQST-CD                            
LRM019                            TWA-MBAL01-CREDIT-IND                         
           END-IF.                                                              
                                                                        10870002
           MOVE ATT-UNPROT TO MBAL02A.                                          
           IF TWA-MBAL02 GREATER SPACES                                         
LRM021        IF TWA-PRTCP-TYPE-CD = '3'                                        
LRM021           MOVE ATT-UNPROT-BRT TO MBAL02A                                 
LRM021           IF NOT INPUT-ERROR                                             
LRM021              MOVE -1 TO MBAL02L                                          
LRM021              SET INPUT-ERROR TO TRUE                                     
LRM021              MOVE 'CASH BALANCE INVALID ON PTF' TO SYSTEM-MSG            
LRM021           END-IF                                                         
LRM021        ELSE                                                              
LRM013        IF TWA-FREEZE-CASH-IN = 'Y'                                       
LRM013        AND TWA-FREEZE-CASH-OUT = 'Y'                                     
LRM013           MOVE ATT-UNPROT-BRT TO MBAL02A                                 
LRM013           IF NOT INPUT-ERROR                                             
LRM013              MOVE -1 TO MBAL02L                                          
LRM013              SET INPUT-ERROR TO TRUE                                     
LRM013              MOVE WS-CASH-FREEZE-MSG TO SYSTEM-MSG                       
LRM013           END-IF                                                         
LRM013        ELSE                                                              
              IF TWA-MBAL02 NOT = TWA-ORIG-MBAL02                               
LRM011           IF (TWA-MBAL02 = 'FULL'                                        
LRM011           OR TWA-MBAL02 = 'FULL-')                                       
LRM011              MOVE TWA-MBAL02 TO TWA-ORIG-MBAL02                          
LRM011              MOVE ZEROS      TO TWA-MBAL02-9                             
LRM018              MOVE 'F'        TO TWA-MBAL02-RQST-CD                       
LRM018              IF TWA-MBAL02 = 'FULL-'                                     
LRM018                 MOVE 'C' TO ACAT03IO-AMT-02-CREDIT-IND                   
LRM018              END-IF                                                      
LRM011           ELSE                                                           
                 MOVE TWA-MBAL02  TO WK-AMT-IN                                  
                 EXEC CICS LINK PROGRAM(WS-EDITMOD)                             
                             COMMAREA(EDIT-AMT-AREA)                            
                             LENGTH(LENGTH OF EDIT-AMT-AREA)                    
                 END-EXEC                                                       
                 IF WK-AMT-RET-CODE = SPACE                                     
                    IF WK-AMT-OUT = ZEROS                                       
                       MOVE SPACES           TO MBAL02I                         
                    ELSE                                                        
                       MOVE WK-AMT-OUT TO MBAL02O                               
                    END-IF                                                      
                    MOVE WK-AMT-OUT TO TWA-MBAL02-9                             
                    MOVE MBAL02I TO TWA-MBAL02                                  
                                    TWA-ORIG-MBAL02                             
LRM013              IF TWA-FREEZE-CASH-OUT = 'Y'                                
LRM013              AND (TWA-MBAL02-9 > ZERO                                    
LRM013              OR TWA-MBAL02 = 'FULL ')                                    
LRM013                 MOVE ATT-UNPROT-BRT TO MBAL02A                           
LRM013                 MOVE SPACES TO TWA-ORIG-MBAL02                           
LRM013                 IF NOT INPUT-ERROR                                       
LRM013                    MOVE -1 TO MBAL02L                                    
LRM013                    SET INPUT-ERROR TO TRUE                               
LRM013                    MOVE WS-CASH-FREEZE-OUT-MSG TO SYSTEM-MSG             
LRM013                 END-IF                                                   
LRM013              ELSE                                                        
LRM013              IF TWA-FREEZE-CASH-IN  = 'Y'                                
LRM013              AND (TWA-MBAL02-9 < ZERO                                    
LRM013              OR TWA-MBAL02 = 'FULL-')                                    
LRM013                 MOVE ATT-UNPROT-BRT TO MBAL02A                           
LRM013                 MOVE SPACES TO TWA-ORIG-MBAL02                           
LRM013                 IF NOT INPUT-ERROR                                       
LRM013                    MOVE -1 TO MBAL02L                                    
LRM013                    SET INPUT-ERROR TO TRUE                               
LRM013                    MOVE WS-CASH-FREEZE-IN-MSG TO SYSTEM-MSG              
LRM013                 END-IF                                                   
LRM013              END-IF END-IF                                               
                 ELSE                                                           
                    MOVE ATT-UNPROT-BRT TO MBAL02A                              
                    IF NOT INPUT-ERROR                                          
                       MOVE -1 TO MBAL02L                                       
                       SET INPUT-ERROR TO TRUE                                  
                       MOVE 'BALANCE 02 IS INVALID'                             
                             TO SYSTEM-MSG                                      
                    END-IF                                                      
                 END-IF                                                         
LRM011           END-IF                                                         
              END-IF                                                            
           ELSE                                                                 
              MOVE ZEROS       TO TWA-MBAL02-9                                  
LRM019        MOVE SPACES      TO TWA-M2CMNT-X120                               
LRM019                            TWA-MBAL02-RQST-CD                            
LRM019                            TWA-MBAL02-CREDIT-IND                         
           END-IF.                                                              
                                                                        10870002
           MOVE ATT-UNPROT TO MBAL05A.                                          
           IF TWA-MBAL05 GREATER SPACES                                         
LRM021        IF TWA-PRTCP-TYPE-CD = '3'                                        
LRM021           MOVE ATT-UNPROT-BRT TO MBAL05A                                 
LRM021           IF NOT INPUT-ERROR                                             
LRM021              MOVE -1 TO MBAL05L                                          
LRM021              SET INPUT-ERROR TO TRUE                                     
LRM021              MOVE 'CASH BALANCE INVALID ON PTF' TO SYSTEM-MSG            
LRM021           END-IF                                                         
LRM021        ELSE                                                              
LRM013        IF TWA-FREEZE-CASH-IN = 'Y'                                       
LRM013        AND TWA-FREEZE-CASH-OUT = 'Y'                                     
LRM013           MOVE ATT-UNPROT-BRT TO MBAL05A                                 
LRM013           IF NOT INPUT-ERROR                                             
LRM013              MOVE -1 TO MBAL05L                                          
LRM013              SET INPUT-ERROR TO TRUE                                     
LRM013              MOVE WS-CASH-FREEZE-MSG TO SYSTEM-MSG                       
LRM013           END-IF                                                         
LRM013        ELSE                                                              
              IF TWA-MBAL05 NOT = TWA-ORIG-MBAL05                               
LRM011           IF (TWA-MBAL05 = 'FULL'                                        
LRM011           OR TWA-MBAL05 = 'FULL-')                                       
LRM011              MOVE TWA-MBAL05 TO TWA-ORIG-MBAL05                          
LRM011              MOVE ZEROS       TO TWA-MBAL05-9                            
LRM018              MOVE 'F'        TO TWA-MBAL05-RQST-CD                       
LRM018              IF TWA-MBAL05 = 'FULL-'                                     
LRM018                 MOVE 'C' TO ACAT03IO-AMT-05-CREDIT-IND                   
LRM018              END-IF                                                      
LRM011           ELSE                                                           
                 MOVE TWA-MBAL05  TO WK-AMT-IN                                  
                 EXEC CICS LINK PROGRAM(WS-EDITMOD)                             
                             COMMAREA(EDIT-AMT-AREA)                            
                             LENGTH(LENGTH OF EDIT-AMT-AREA)                    
                 END-EXEC                                                       
                 IF WK-AMT-RET-CODE = SPACE                                     
                    IF WK-AMT-OUT = ZEROS                                       
                       MOVE SPACES           TO MBAL05I                         
                    ELSE                                                        
                       MOVE WK-AMT-OUT TO MBAL05O                               
                    END-IF                                                      
                    MOVE WK-AMT-OUT TO TWA-MBAL05-9                             
                    MOVE MBAL05I TO TWA-MBAL05                                  
                                    TWA-ORIG-MBAL05                             
LRM013              IF TWA-FREEZE-CASH-OUT = 'Y'                                
LRM013              AND (TWA-MBAL05-9 > ZERO                                    
LRM013              OR TWA-MBAL05 = 'FULL ')                                    
LRM013                 MOVE ATT-UNPROT-BRT TO MBAL05A                           
LRM013                 MOVE SPACES TO TWA-ORIG-MBAL05                           
LRM013                 IF NOT INPUT-ERROR                                       
LRM013                    MOVE -1 TO MBAL05L                                    
LRM013                    SET INPUT-ERROR TO TRUE                               
LRM013                    MOVE WS-CASH-FREEZE-OUT-MSG TO SYSTEM-MSG             
LRM013                 END-IF                                                   
LRM013              ELSE                                                        
LRM013              IF TWA-FREEZE-CASH-IN  = 'Y'                                
LRM013              AND (TWA-MBAL05-9 < ZERO                                    
LRM013              OR TWA-MBAL05 = 'FULL-')                                    
LRM013                 MOVE ATT-UNPROT-BRT TO MBAL05A                           
LRM013                 MOVE SPACES TO TWA-ORIG-MBAL05                           
LRM013                 IF NOT INPUT-ERROR                                       
LRM013                    MOVE -1 TO MBAL05L                                    
LRM013                    SET INPUT-ERROR TO TRUE                               
LRM013                    MOVE WS-CASH-FREEZE-IN-MSG TO SYSTEM-MSG              
LRM013                 END-IF                                                   
LRM013              END-IF END-IF                                               
                 ELSE                                                           
                    MOVE ATT-UNPROT-BRT TO MBAL05A                              
                    IF NOT INPUT-ERROR                                          
                       MOVE -1 TO MBAL05L                                       
                       SET INPUT-ERROR TO TRUE                                  
                       MOVE 'BALANCE 05 IS INVALID'                             
                             TO SYSTEM-MSG                                      
                    END-IF                                                      
                 END-IF                                                         
LRM011           END-IF                                                         
              END-IF                                                            
           ELSE                                                                 
              MOVE ZEROS       TO TWA-MBAL05-9                                  
LRM019        MOVE SPACES      TO TWA-M5CMNT-X120                               
LRM019                            TWA-MBAL05-RQST-CD                            
LRM019                            TWA-MBAL05-CREDIT-IND                         
           END-IF.                                                              
                                                                        10870002
           MOVE ATT-UNPROT TO MSMAA.                                            
           IF TWA-MSMA GREATER SPACES                                           
LRM021        IF TWA-PRTCP-TYPE-CD = '3'                                        
LRM021           MOVE ATT-UNPROT-BRT TO MSMAA                                   
LRM021           IF NOT INPUT-ERROR                                             
LRM021              MOVE -1 TO MSMAL                                            
LRM021              SET INPUT-ERROR TO TRUE                                     
LRM021              MOVE 'SMA BALANCE INVALID ON PTF' TO SYSTEM-MSG             
LRM021           END-IF                                                         
LRM021        ELSE                                                              
              IF TWA-MSMA NOT = TWA-ORIG-MSMA                                   
                 MOVE TWA-MSMA    TO WK-AMT-IN                                  
                 EXEC CICS LINK PROGRAM(WS-EDITMOD)                             
                             COMMAREA(EDIT-AMT-AREA)                            
                             LENGTH(LENGTH OF EDIT-AMT-AREA)                    
                 END-EXEC                                                       
                 IF WK-AMT-RET-CODE = SPACE                                     
                    IF WK-AMT-OUT < ZEROS                                       
                       MOVE ATT-UNPROT-BRT TO MSMAA                             
                       IF NOT INPUT-ERROR                                       
                          MOVE -1 TO MSMAL                                      
                          SET INPUT-ERROR TO TRUE                               
                          MOVE 'SMA BALANCE LESS THAN ZERO'                     
                                TO SYSTEM-MSG                                   
                       END-IF                                                   
                    ELSE                                                        
                       IF WK-AMT-OUT = ZEROS                                    
                          MOVE SPACES           TO MSMAI                        
                       ELSE                                                     
                          MOVE WK-AMT-OUT TO MSMAO                              
                       END-IF                                                   
                       MOVE WK-AMT-OUT TO TWA-MSMA-9                            
                       MOVE MSMAI TO TWA-MSMA                                   
                                     TWA-ORIG-MSMA                              
                 ELSE                                                           
                    MOVE ATT-UNPROT-BRT TO MSMAA                                
                    IF NOT INPUT-ERROR                                          
                       MOVE -1 TO MSMAL                                         
                       SET INPUT-ERROR TO TRUE                                  
                       MOVE 'SMA BALANCE IS INVALID'                            
                             TO SYSTEM-MSG                                      
                    END-IF                                                      
                 END-IF                                                         
              END-IF                                                            
           ELSE                                                                 
              MOVE ZEROS       TO TWA-MSMA-9                                    
LRM019        MOVE SPACES      TO TWA-MMCMNT-X120                               
           END-IF.                                                              
                                                                                
           IF (TWA-MCTYPE NOT GREATER SPACES                                    
LRM020     OR (TWA-MCTYPE GREATER SPACES                                        
LRM020       AND ACCOUNT-CHANGED                                                
LRM020       AND NOT ACCOUNT-TYPE-CHANGED))                                     
           AND ACATNAIO-FOUND                                                   
              PERFORM SET-CUST-TYPE-B1-DEFAULT-RTN                              
              MOVE TWA-MCTYPE  TO MCTYPEO                                       
           END-IF.                                                              
                                                                        10870002
           MOVE ATT-UNPROT TO MCTYPEA.                                          
           IF TWA-MCTYPE NOT GREATER SPACES                                     
              MOVE ATT-UNPROT-BRT TO MCTYPEA                                    
              IF NOT INPUT-ERROR                                                
                 MOVE -1 TO MCTYPEL                                             
                 MOVE                                                           
                   'CUST ACCOUNT TYPE IS REQUIRED; PRESS PF9 FOR LIST'          
                        TO SYSTEM-MSG                                           
                 SET INPUT-ERROR TO TRUE                                        
              END-IF                                                            
           ELSE                                                                 
LRM021     IF TWA-MCTYPE = 'SS'                                                 
LRM021        CONTINUE                                                          
LRM021     ELSE                                                                 
              MOVE 1 TO SUB                                                     
LRM027        PERFORM UNTIL SUB > WS-ACCOUNT-TYPE-CHOICES                       
                        OR WS-ACCOUNT-TYPE(SUB) = TWA-MCTYPE                    
                 ADD 1 TO SUB                                                   
              END-PERFORM                                                       
LRM027        IF SUB > WS-ACCOUNT-TYPE-CHOICES                                  
                 MOVE ATT-UNPROT-BRT TO MCTYPEA                                 
                 IF NOT INPUT-ERROR                                             
                    MOVE -1 TO MCTYPEL                                          
                    MOVE                                                        
                    'CUST ACCOUNT TYPE IS INVALID; PRESS PF9 FOR LIST'          
                            TO SYSTEM-MSG                                       
                    SET INPUT-ERROR TO TRUE.                                    
                                                                                
           MOVE ATT-UNPROT TO MCBRKRA.                                          
           IF TWA-MCBRKR NOT GREATER SPACES                                     
              MOVE ATT-UNPROT-BRT TO MCBRKRA                                    
              IF NOT INPUT-ERROR                                                
                 MOVE -1 TO MCBRKRL                                             
                 MOVE 'CONTRA BROKER IS REQUIRED' TO SYSTEM-MSG                 
                 SET INPUT-ERROR TO TRUE                                        
              END-IF                                                            
           ELSE                                                                 
           IF TWA-MCBRKR = ACAT-ADP-BROKER                                      
              MOVE ATT-UNPROT-BRT TO MCBRKRA                                    
              IF NOT INPUT-ERROR                                                
                 MOVE -1 TO MCBRKRL                                             
                 MOVE 'CONTRA BROKER CANNOT BE YOURSELF' TO SYSTEM-MSG          
                 SET INPUT-ERROR TO TRUE                                        
              END-IF                                                            
           ELSE                                                                 
              MOVE TWA-MCBRKR TO ACATPPIO-BRKR                                  
              SET ACATPPIO-READ TO TRUE                                         
              PERFORM LINK-TO-ACATPPIO-RTN                                      
              IF ACATPPIO-FOUND                                                 
                 MOVE ACATPPIO-NAME TO TWA-MCBNAM  MCBNAMO                      
LRM021           MOVE ACATPPIO-PRTCP-TYPE-CD TO TWA-PRTCP-TYPE-CD               
LRM021           IF ACATPPIO-PRTCP-TYPE-CD = '3'                                
LRM021              IF TWA-INP-TFR-TYP NOT = 'PTF'                              
LRM021                 MOVE '          CHANGED TO PTF MODE' TO DUPMSGO          
LRM021              ELSE                                                        
LRM021                 MOVE '          PTF MODE'            TO DUPMSGO          
LRM021              END-IF                                                      
LRM021              MOVE 'PTF' TO TWA-INP-TFR-TYP MMTFRO                        
LRM021           ELSE                                                           
LRM021              MOVE 'PTR' TO TWA-INP-TFR-TYP MMTFRO                        
LRM021              MOVE SPACES                             TO DUPMSGO          
LRM021           END-IF                                                         
              ELSE                                                              
                 MOVE SPACES        TO TWA-MCBNAM  MCBNAMO                      
                 MOVE ATT-UNPROT-BRT TO MCBRKRA                                 
                 IF NOT INPUT-ERROR                                             
                    MOVE -1 TO MCBRKRL                                          
                    SET INPUT-ERROR TO TRUE                                     
                    IF ACATPPIO-NOT-FOUND                                       
                       MOVE 'CONTRA BROKER IS INVALID' TO SYSTEM-MSG            
                    ELSE                                                        
                    IF ACATPPIO-DB-ERROR                                        
                       MOVE 'READ'            TO WS-DB2-PROBLEM-FUNCTION        
                       MOVE ACATPPIO-SQLCAID  TO WS-DB2-PROBLEM-TABLE           
                       MOVE ACATPPIO-SQLCODE  TO WS-DB2-PROBLEM-ID              
                       MOVE WS-DB2-PROBLEM-MSG TO SYSTEM-MSG                    
                       PERFORM DB2-ERROR-RTN.                                   
                                                                                
LRM021     IF TWA-MCTYPE = 'SS'                                                 
LRM021     AND TWA-INP-TFR-TYP NOT = 'PTF'                                      
LRM021        MOVE ATT-UNPROT-BRT TO MCTYPEA                                    
LRM021        IF NOT INPUT-ERROR                                                
LRM021           MOVE -1 TO MCTYPEL                                             
LRM021           MOVE                                                           
LRM021             'CUST ACCOUNT TYPE SS ONLY VALID ON PTF'                     
LRM021                     TO SYSTEM-MSG                                        
LRM021             SET INPUT-ERROR TO TRUE.                                     
                                                                                
           MOVE ATT-UNPROT TO MCACCTA.                                          
LRM010     MOVE SPACES TO MCACMSGO.                                             
           PERFORM JUSTIFY-LEFT-MCACCT.                                         
           IF MCACCT-ERROR                                                      
              MOVE ATT-UNPROT-BRT TO MCACCTA                                    
              IF NOT INPUT-ERROR                                                
                 MOVE -1 TO MCACCTL                                             
                 MOVE 'CONTRA ACCOUNT CHARACTERS NOT A THRU Z, 0 THRU 9'        
                                TO SYSTEM-MSG                                   
                 SET INPUT-ERROR TO TRUE                                        
              END-IF                                                            
           ELSE                                                                 
           IF TWA-MCACCT(1 : 1) NOT GREATER SPACES                              
              MOVE ATT-UNPROT-BRT TO MCACCTA                                    
              IF NOT INPUT-ERROR                                                
                 MOVE -1 TO MCACCTL                                             
                 MOVE 'CONTRA ACCOUNT IS REQUIRED' TO SYSTEM-MSG                
                 SET INPUT-ERROR TO TRUE                                        
              END-IF                                                            
           ELSE                                                                 
              MOVE TWA-MCACCT TO MCACCTO                                        
LRM010        IF TWA-MCACCT > SPACES                                            
LRM010        AND TWA-MCBRKR > SPACES                                           
LRM010           MOVE TWA-CLIENT-NO-X TO ACATRSIO-CLIENT-NBR                    
LRM010           SET ACATRSIO-EDIT-CONTRA-ACCT TO TRUE                          
LRM010           MOVE TWA-MCBRKR TO ACATRSIO-BRKR-CONTRA-NBR                    
LRM010           MOVE TWA-MCACCT TO ACATRSIO-CONTRA-ACCT                        
LRM010           PERFORM LINK-TO-ACATRSTIO-RTN                                  
LRM010           IF ACATRSIO-CONTRA-EDIT-FAIL                                   
LRM010              MOVE ATT-ASKIP-BRT  TO MCACMSGA                             
LRM010              MOVE 'ACCOUNT EDIT WARNING' TO MCACMSGO                     
LRM010              IF ACATRSIO-CONTRA-ACCT-FAIL-NBR > '00'                     
LRM010                 MOVE ACATRSIO-CONTRA-ACCT-FAIL-NBR                       
LRM010                                          TO MCACMSGO (22 : 2)            
LRM010              END-IF                                                      
LRM010              IF (TWA-ACTION = 'A' OR LOW-VALUES)                         
LRM010              AND (TWA-MCACCT NOT = TWA-EDIT-MCACCT                       
LRM010               OR TWA-MCBRKR NOT = TWA-EDIT-MCBRKR)                       
LRM010                 MOVE ATT-UNPROT-BRT TO MCACCTA                           
LRM010                 MOVE TWA-MCACCT TO TWA-EDIT-MCACCT                       
LRM010                 MOVE TWA-MCBRKR TO TWA-EDIT-MCBRKR                       
LRM010                 IF NOT INPUT-ERROR                                       
LRM010                    MOVE -1 TO MCACCTL                                    
LRM010                    MOVE                                                  
LRM010                   'PRESS ENTER TO BYPASS CONTRA ACCOUNT WARNING'         
LRM010                       TO SYSTEM-MSG                                      
LRM010                    SET INPUT-ERROR TO TRUE                               
LRM010     END-IF.                                                              
                                                                                
      *---------------------------------------------------------------*         
      * THE ACTION DETERMINATION LOGIC BELOW ASSUMES (INSERT) WHEN TIF          
      * NOT FOUND AND (UPDATE) WHEN FOUND.  ONCE A RECORD IS DISPLAYED,         
      * THEN CHANGES TO BR/AC IS A LOGICAL KEY CHANGE (NEW SESSION),            
      * CHANGES TO DLVR BRKR/ACCT IS AN (UPDATE) TO THIS RECORD.                
      *---------------------------------------------------------------*         
******** ON KEY CHANGE, SEE WHAT'S ON FILE...                                   
           IF NOT INPUT-ERROR                                                   
           AND (TWA-INTRAN-BRW                                          04809810
             OR TWA-MCBRKR NOT = TWA-ORIG-DLVR-NBR                              
             OR TWA-MCACCT NOT = TWA-ORIG-DLVR-ACCT)                            
              PERFORM READ-ACAT-RTN                                             
              IF ACAT03IO-FUL-FOUND                                             
                 SET TWA-INTRAN-BRW TO TRUE                                     
                 MOVE ATT-UNPROT-BRT TO MCBRKRA                                 
                                        MCACCTA                                 
                 IF NOT INPUT-ERROR                                             
                    SET INPUT-ERROR TO TRUE                                     
                    MOVE -1 TO MCBRKRL                                          
                    MOVE                                                        
                  'FULL TIF EXISTS FOR THIS CONTRA BROKER / ACCOUNT'            
                                TO SYSTEM-MSG                                   
                 END-IF                                                         
              ELSE                                                              
              IF ACAT03IO-FUL-HISTORY                                           
              AND ACATNAIO-FOUND                                                
LRM001        AND ACATNAIO-ACAT-CODE = 'D'                                      
                 MOVE ATT-UNPROT-BRT TO MBRA                                    
                                        MACA                                    
                 MOVE -1 TO MBRL                                                
                 SET INPUT-ERROR TO TRUE                                        
                 MOVE                                                           
                   'TIF NOT ALLOWED; TIF HISTORY FOUND WITH FUL DLVRY'          
                      TO WS-DUPE-MSG-TEXT                                       
                 MOVE ACAT03IO-DUPE-CONTROL-NBR TO WS-DUPE-CONTROL-NBR          
                 MOVE WS-DUPE-MSG TO SYSTEM-MSG                                 
              ELSE                                                              
              IF ACAT03IO-OTHER-ACTIVE                                          
                 MOVE ATT-UNPROT-BRT TO MBRA                                    
                                        MACA                                    
                 MOVE -1 TO MBRL                                                
                 SET INPUT-ERROR TO TRUE                                        
                 MOVE                                                           
                   'TIF NOT ALLOWED - OTHER ACTIVE TRANSFER FOUND'              
                      TO WS-DUPE-MSG-TEXT                                       
                 MOVE ACAT03IO-DUPE-CONTROL-NBR TO WS-DUPE-CONTROL-NBR          
                 MOVE WS-DUPE-MSG TO SYSTEM-MSG                                 
              ELSE                                                              
              IF (ACAT03IO-NOT-FOUND                                            
LRM022        OR ACAT03IO-FUL-HISTORY                                           
LRM029********OR ACAT03IO-TRNFR-TYPE-CD = 'PTF'                                 
              OR (ACAT03IO-ACTIVE-FOUND                                         
LRM029           AND (ACAT03IO-TRNFR-TYPE-CD = 'PTR' OR 'PTF')                  
                 AND ACAT03IO-STTS-CD = '140' OR '600'))                        
                 IF ACAT-SIGN-ON-UPDATE                                         
                    MOVE 'A' TO TWA-ACTION TWA-SECR-ACTION                      
                 ELSE                                                           
                    SET TWA-INTRAN-BRW TO TRUE                                  
                    MOVE ATT-UNPROT-BRT TO MCBRKRA                              
                                           MCACCTA                              
                    IF NOT INPUT-ERROR                                          
                       MOVE -1 TO MCBRKRL                                       
                       MOVE                                                     
                       'TIF NOT FOUND; USE PA1 FOR GENERIC BROWSE'              
                                TO SYSTEM-MSG                                   
                       SET INPUT-ERROR TO TRUE                                  
                    END-IF                                                      
              ELSE                                                              
  ********** FOUND...                                                           
                 IF ACAT03IO-TRNFR-TYPE-CD = 'FUL'                              
                    MOVE ATT-UNPROT-BRT TO MCBRKRA                              
                                           MCACCTA                              
                    IF NOT INPUT-ERROR                                          
                       MOVE -1 TO MCBRKRL                                       
                       MOVE                                                     
                     'FULL TIF ALREADY EXISTS FOR THIS BRKR/ACCOUNT'            
                                TO SYSTEM-MSG                                   
                       SET INPUT-ERROR TO TRUE                                  
                    END-IF                                                      
                 ELSE                                                           
                 IF NOT TWA-INTRAN-BRW                                          
                 AND TWA-ACTION = 'C'                                           
                 AND TWA-ORIG-DLVR-NBR > SPACES                                 
                 AND (TWA-ORIG-DLVR-NBR NOT = TWA-MCBRKR                        
                   OR TWA-ORIG-DLVR-ACCT NOT = TWA-MCACCT)                      
                    MOVE ATT-UNPROT-BRT TO MCBRKRA                              
                                           MCACCTA                              
                    IF NOT INPUT-ERROR                                          
                       MOVE -1 TO MCBRKRL                                       
                       MOVE                                                     
                     'CONTRA BRKR/ACCOUNT ALREADY EXISTS ON ANOTHER TIF'        
                                TO SYSTEM-MSG                                   
                       SET INPUT-ERROR TO TRUE                                  
                    END-IF                                                      
                 ELSE                                                           
LRM007              MOVE 'PF2 TO CREATE ADDITIONAL TIF' TO DUPMSGO              
LRM007              IF TWA-DUPE-FOUND NOT = 'Y'                                 
                       PERFORM READ-NEXT-ASSET-RTN                              
LRM007              END-IF                                                      
LRM007              MOVE 'Y'  TO TWA-DUPE-FOUND                                 
                    IF TWA-INTRAN-BRW                                           
                    OR (TWA-ACTION NOT = 'B' AND 'C')                           
                       PERFORM MOVE-ACAT03IO-TO-TWA-RTN                         
                       PERFORM REFORMAT-SCREEN-DETAIL                           
                       MOVE 'TRANSFER DISPLAYED' TO SYSTEM-MSG                  
                       MOVE ACAT03IO-DLVR-NBR  TO TWA-ORIG-DLVR-NBR             
                       MOVE ACAT03IO-DLVR-ACCT TO TWA-ORIG-DLVR-ACCT            
                       IF (ACAT03IO-ACTIVE-FOUND                                
                          AND (ACAT03IO-STTS-CD = '140' OR '600'))              
                       OR (ACAT03IO-FOUND                                       
                          AND (ACAT03IO-NSCC-SUBMIT-ELIGABLE                    
                            OR ACAT03IO-NSCC-SUBMIT-HOLD))                      
                          MOVE 'C' TO TWA-ACTION                                
                          MOVE -1 TO MNAMEL                                     
                          IF TWA-MSUBM = 'Y'                                    
                             MOVE 'TIF DISPLAYED / AWAITING NSCC XMIT'          
                                  TO SYSTEM-MSG                                 
                          ELSE                                                  
                             MOVE 'TIF DISPLAYED / SUBMIT PENDING'              
                                  TO SYSTEM-MSG                                 
                          END-IF                                                
                          MOVE -1 TO MNAMEL                                     
                       ELSE                                                     
                          MOVE 'A' TO TWA-SECR-ACTION                           
                          MOVE -1 TO MBRL                                       
                          SET INPUT-ERROR TO TRUE                               
                          IF ACAT03IO-NSCC-ACKNOWLEDGEMENT                      
                             MOVE WS-ACKNOWLEDGE-MSG TO SYSTEM-MSG              
                          ELSE                                                  
                          IF ACAT03IO-NSCC-SUBMITTED                            
                             MOVE WS-SUBMITTED-MSG TO SYSTEM-MSG                
                          ELSE                                                  
                          IF ACAT03IO-ACTIVE-FOUND                              
LRM017                       IF ACAT-ASCENDIS-CLIENT                            
LRM017                       MOVE                                               
LRM017             'ACTIVE TRANSFER DISPLAYED / BROWSE ONLY / ASCENDIS'         
LRM017                            TO SYSTEM-MSG                                 
LRM017                       ELSE                                               
                             MOVE                                               
                               'ACTIVE TRANSFER DISPLAYED / BROWSE ONLY'        
                                  TO SYSTEM-MSG                                 
                          ELSE                                                  
LRM017                       IF ACAT-ASCENDIS-CLIENT                            
LRM017                       MOVE                                               
LRM017                     'TRANSFER DISPLAYED / BROWSE ONLY / ASCENDIS'        
LRM017                            TO SYSTEM-MSG                                 
LRM017                       ELSE                                               
                             MOVE 'TRANSFER DISPLAYED / BROWSE ONLY'            
                                  TO SYSTEM-MSG.                                
                                                                                
           MOVE ATT-UNPROT TO  MNAMEA                                           
                               MNAME2A.                                         
                                                                                
           MOVE ATT-UNPROT TO  MSSNA.                                           
           IF TWA-MSSN = SPACES                                                 
              MOVE ATT-UNPROT-BRT TO MSSNA                                      
              IF NOT INPUT-ERROR                                                
                 MOVE -1 TO MSSNL                                               
                 MOVE 'TAX ID NUMBER IS REQUIRED' TO SYSTEM-MSG                 
                 SET INPUT-ERROR TO TRUE                                        
              END-IF                                                            
           ELSE                                                                 
              MOVE TWA-MSSN TO WS-SSN-EDIT                                      
              PERFORM SSN-EDIT-RTN                                              
              IF SSN-INVALID                                                    
                 MOVE ATT-UNPROT-BRT TO MSSNA                                   
                 IF NOT INPUT-ERROR                                             
                    MOVE -1 TO MSSNL                                            
                    MOVE 'TAX ID NUMBER IS INVALID' TO SYSTEM-MSG               
                    SET INPUT-ERROR TO TRUE                                     
                 END-IF                                                         
              ELSE                                                              
                 MOVE WS-SSN-EDIT TO TWA-MSSN MSSNO.                            
                                                                                
           MOVE ATT-UNPROT TO  MSSN2A.                                          
           IF TWA-MSSN2 NOT = SPACES AND LOW-VALUES                             
              MOVE TWA-MSSN2 TO WS-SSN-EDIT                                     
              PERFORM SSN-EDIT-RTN                                              
              IF SSN-INVALID                                                    
                 MOVE ATT-UNPROT-BRT TO MSSN2A                                  
                 IF NOT INPUT-ERROR                                             
                    MOVE -1 TO MSSN2L                                           
                    MOVE '2ND TAX ID NUMBER IS INVALID' TO SYSTEM-MSG           
                    SET INPUT-ERROR TO TRUE                                     
                 END-IF                                                         
              ELSE                                                              
                 MOVE WS-SSN-EDIT TO TWA-MSSN2 MSSN2O.                          
                                                                                
           MOVE ATT-UNPROT TO MCMNTA.                                           
           IF TWA-MCMNT GREATER SPACES                                          
           AND TWA-MCMNT NOT = 'Y' AND 'N'                                      
              MOVE ATT-UNPROT-BRT TO MCMNTA                                     
              IF NOT INPUT-ERROR                                                
                 MOVE -1 TO MCMNTL                                              
                 MOVE 'COMMENT INDICATOR MUST BE Y OR SPACE'                    
                             TO SYSTEM-MSG                                      
                 SET INPUT-ERROR TO TRUE.                                       
                                                                                
           MOVE ATT-UNPROT TO MSUBMA.                                           
           IF TWA-MSUBM GREATER SPACES                                          
           AND TWA-MSUBM NOT = 'Y' AND 'N'                                      
              MOVE ATT-UNPROT-BRT TO MSUBMA                                     
              IF NOT INPUT-ERROR                                                
                 MOVE -1 TO MSUBML                                              
                 MOVE 'SUBMIT INDICATOR MUST BE Y, N OR SPACE'                  
                             TO SYSTEM-MSG                                      
                 SET INPUT-ERROR TO TRUE.                                       
                                                                                
           MOVE ATT-UNPROT TO MDELA.                                            
           IF TWA-MDEL GREATER SPACES                                           
           AND TWA-MDEL NOT = 'Y' AND 'N'                                       
              MOVE ATT-UNPROT-BRT TO MDELA                                      
              IF NOT INPUT-ERROR                                                
                 MOVE -1 TO MDELL                                               
                 MOVE 'DELETE INDICATOR MUST BE Y, N OR SPACE'                  
                             TO SYSTEM-MSG                                      
                 SET INPUT-ERROR TO TRUE.                                       
                                                                                
           IF TWA-ACTION NOT = 'C'                                              
              MOVE ATT-ASKIP TO MDELA.                                          
                                                                                
     **** FIELDS ON ASSET SECTION...                                            
           MOVE ATT-UNPROT TO MSECRA.                                           
           IF TWA-MSECR NOT GREATER SPACES                                      
              CONTINUE                                                          
           ELSE                                                                 
           IF TWA-SECR-ACTION NOT = 'A' AND SPACES                              
KEYCH      AND TWA-MSECR NOT = TWA-ORIG-MSECR                                   
              PERFORM BROWSE-ASSET-RTN                                          
           ELSE                                                                 
           IF (TWA-SECR-ACTION = 'A' OR SPACES)                                 
           OR (TWA-SECR-ACTION = 'C' AND TWA-MSECR NOT = TWA-ORIG-MSECR)        
LRM021        PERFORM VARYING SUB FROM 1 BY 1                                   
LRM021              UNTIL SUB GREATER 12                                        
LRM021           IF TWA-MSECR(SUB : 1) < ' '                                    
LRM021              MOVE SPACE TO TWA-MSECR (SUB : 1)                           
LRM021           END-IF                                                         
LRM021        END-PERFORM                                                       
LRM025        IF TWA-MEXPDT  > SPACES                                           
LRM025        OR TWA-MCALL   > SPACES                                           
LRM025        OR TWA-MLONG   > SPACES                                           
LRM025        OR TWA-MSTRIKE > SPACES                                           
LRM025        OR TWA-MLONG > SPACES                                             
LRM025        OR TWA-MSTRIKE > SPACES                                           
LRM025           PERFORM LOOKUP-OPTION-BY-KEYS-RTN                              
LRM025           IF WS-OPTION-NOT-FOUND                                         
LRM025              GO TO SKIP-MSD-READ                                         
LRM025           END-IF                                                         
LRM025        END-IF                                                            
              SET ACATMSD-MSD-READ TO TRUE                                      
LRM030* RETAIN THE SAME ADP NUMBER WHEN THE ISIN IS ON THE SCREEN AND           
LRM030*   IT WAS NOT CHANGED FROM THE PREVIOUS LOOKUP.                          
LRM030        IF TWA-MSECR > SPACES                                             
LRM030        AND TWA-MSECR = TWA-ORIG-MSECR                                    
LRM030        AND TWA-MSECR(1:2) NOT = 'US'                                     
LRM030        AND TWA-MSECR(10:1) > SPACES                                      
LRM030        AND TWA-MSECR(11:1) > SPACES                                      
LRM030        AND TWA-MSECR(12:1) > SPACES                                      
LRM030        AND TWA-ADP-NBR > SPACES                                          
LRM030           MOVE TWA-ADP-NBR TO TWA-MSECR                                  
LRM030        END-IF                                                            
              MOVE TWA-MSECR TO ACATMSD-SEARCH-KEY                              
              PERFORM LINK-TO-ACATMSDIO-RTN                                     
              IF ACATMSD-FOUND                                                  
                 MOVE ACATMSD-ADP-NBR TO TWA-ADP-NBR                            
                 IF (TWA-MDESC(1 : 1) NOT GREATER SPACES                        
                 OR TWA-MSECR NOT = TWA-ORIG-MSECR)                             
LRM030              IF ACATMSD-CUSIP > SPACES                                   
LRM031              AND (ACATMSD-CUSIP(1:2) NOT = 'XX'                          
LRM031               OR (ACATMSD-CUSIP(1:2) = 'XX'                              
LRM031              AND  ACATMSD-ISIN NOT > SPACES))                            
LRM031**************AND (ACATMSD-ISIN(1:2) = SPACES OR 'US')                    
LRM030                 MOVE SPACES       TO TWA-ISIN-USED                       
LRM031                                      TWA-KEY-FIELDS                      
                       MOVE ACATMSD-CUSIP   TO TWA-MSECR MSECRO                 
LRM030                                      TWA-ORIG-MSECR                      
                                       TWA-CURRENT-ASSET-KEY                    
LRM030              ELSE                                                        
LRM030              IF ACATMSD-ISIN > SPACES                                    
LRM030                 MOVE 'I'          TO TWA-ISIN-USED                       
LRM030                 MOVE ACATMSD-ISIN TO TWA-MSECR MSECRO                    
LRM030                                      TWA-ORIG-MSECR                      
LRM030                                     TWA-CURRENT-ASSET-KEY                
LRM031                                     TWA-KEY-FIELDS                       
LRM031              ELSE                                                        
LRM031                 MOVE SPACES       TO TWA-ISIN-USED                       
LRM031                 MOVE 'XX' TO TWA-MSECR                                   
LRM031                 MOVE ACATMSD-ADP-NBR TO TWA-MSECR (3 : 7)                
LRM031                 MOVE TWA-MSECR    TO MSECRO                              
LRM031                                 TWA-CURRENT-ASSET-KEY                    
LRM031                                 TWA-KEY-FIELDS                           
LRM030              END-IF END-IF                                               
LRM025              MOVE SPACES TO TWA-MEXPDT MEXPDTO                           
LRM025                             TWA-MCALL  MCALLO                            
LRM025                             TWA-MLONG  MLONGO                            
LRM025                             TWA-MSTRIKE MSTRIKEO                         
LRM025              MOVE ATT-ASKIP TO MEXPDTA MCALLA MLONGA MSTRIKEA            
LRM012**************OPTION ASSET BOOKS W/WRONG ADP NBR.                         
LRM012              MOVE ACATMSD-CLASS-CD TO WK-MS-CLASS                        
LRM012              IF  (TWA-ADP-NBR (1:1) = '8' OR '9')                        
LRM012              AND (WK-MS-CLASS-1-2-3 = '664' OR '665')                    
LRM012                 MOVE 'XX' TO TWA-MSECR                                   
LRM012                 MOVE ACATMSD-ADP-NBR TO TWA-MSECR (3 : 7)                
LRM012                 MOVE TWA-MSECR    TO MSECRO                              
LRM012                                 TWA-CURRENT-ASSET-KEY                    
LRM012              END-IF                                                      
LRM012              IF TWA-MDESC(1 : 1) NOT GREATER SPACES                      
                       MOVE ACATMSD-DESC    TO TWA-MDESC MDESCO                 
CSG001* IN SOME CASES MSD DESCRIPTIONS CONTAIN SPECIAL CHARACTERS.              
CSG001* CORRECT THEM BY REPLACING SPECIAL CHARACTERS WITH SPACES.               
CSG001                 MOVE ACATMSD-DESC      TO W-ASSET-DESC-TXT               
CSG001                 MOVE 30                TO W-SUB3                         
CSG001                 SET  W-JUST-LEFT-REQ-Y TO TRUE                           
CSG001                 PERFORM EDIT-ASSET-DESC-TXT                              
CSG001                 MOVE W-ASSET-DESC-TXT  TO TWA-MDESC MDESCO               
                       MOVE ACATMSD-DESC2   TO TWA-MDESC2 MDESC2O               
CSG001                 MOVE ACATMSD-DESC2     TO W-ASSET-DESC-TXT               
CSG001                 MOVE 30                TO W-SUB3                         
CSG001                 SET  W-JUST-LEFT-REQ-N TO TRUE                           
CSG001                 PERFORM EDIT-ASSET-DESC-TXT                              
CSG001                 MOVE W-ASSET-DESC-TXT  TO TWA-MDESC2 MDESC2O             
                       MOVE ACATMSD-DESC3   TO TWA-MDESC3 MDESC3O               
CSG001                 MOVE ACATMSD-DESC3     TO W-ASSET-DESC-TXT               
CSG001                 MOVE 30                TO W-SUB3                         
CSG001                 SET  W-JUST-LEFT-REQ-N TO TRUE                           
CSG001                 PERFORM EDIT-ASSET-DESC-TXT                              
CSG001                 MOVE W-ASSET-DESC-TXT  TO TWA-MDESC3 MDESC3O             
LRM012              END-IF                                                      
                 END-IF                                                         
                 PERFORM CHECK-ISIN-RESTRICTIONS-RTN                            
LRM008           PERFORM CHECK-DUPE-ISIN-RTN                                    
                 IF TWA-MCATGR NOT GREATER SPACES                               
                 OR TWA-MSECR NOT = TWA-ORIG-MSECR                              
                    PERFORM SET-PRICING-CATEGORY-CODE-RTN                       
                 END-IF                                                         
              ELSE                                                              
              IF ACATMSD-NOT-FOUND                                              
                 MOVE ATT-UNPROT-BRT TO MSECRA                                  
                 IF NOT INPUT-ERROR                                             
                    MOVE -1 TO MSECRL                                           
                    MOVE 'SECURITY NOT FOUND ON MSD' TO SYSTEM-MSG              
                    SET INPUT-ERROR TO TRUE                                     
                 END-IF                                                         
              ELSE                                                              
              IF ACATMSD-NOT-AVAIL                                              
                 MOVE ATT-UNPROT-BRT TO MSECRA                                  
                 IF NOT INPUT-ERROR                                             
                    MOVE -1 TO MSECRL                                           
                    MOVE 'MSD FILE IS NOT AVAILABLE' TO SYSTEM-MSG              
                    SET INPUT-ERROR TO TRUE                                     
                 END-IF                                                         
              ELSE                                                              
              IF ACATMSD-ERROR                                                  
                 MOVE ATT-UNPROT-BRT TO MSECRA                                  
                 IF NOT INPUT-ERROR                                             
                    MOVE -1 TO MSECRL                                           
LRM016              MOVE 'MSD FILE PROBLEM / CALL HELP DESK'                    
                                                       TO SYSTEM-MSG            
                    SET INPUT-ERROR TO TRUE                                     
                 END-IF.                                                        
                                                                                
LRM025 SKIP-MSD-READ.                                                           
           IF TWA-SECR-ACTION = 'C'                                             
           AND TWA-MCD = 'D'                                                    
              GO TO SKIP-ASSET-EDIT.                                            
                                                                                
LRM013     IF TWA-FREEZE-SEC-IN = 'Y'                                           
LRM013     AND TWA-FREEZE-SEC-OUT = 'Y'                                         
LRM013     AND (TWA-MSECR GREATER SPACES                                        
LRM013      OR TWA-MDESC(1 : 10) GREATER SPACES                                 
LRM013      OR TWA-MCATGR > SPACES                                              
LRM013      OR TWA-MSLOC > SPACES                                               
LRM013      OR TWA-MQTY > SPACES                                                
LRM013      OR TWA-MCD > SPACES                                                 
LRM013      OR TWA-MTYPE > SPACES)                                              
LRM013         MOVE ATT-UNPROT-BRT TO MSECRA                                    
LRM013         IF NOT INPUT-ERROR                                               
LRM013            MOVE -1 TO MSECRL                                             
LRM013            MOVE WS-SEC-FREEZE-MSG TO SYSTEM-MSG                          
LRM013            SET INPUT-ERROR TO TRUE                                       
LRM013         END-IF                                                           
LRM013     END-IF.                                                              
           IF TWA-MSECR NOT GREATER SPACES                                      
           AND TWA-MDESC(1 : 1) NOT GREATER SPACES                              
              IF (TWA-MCATGR > SPACES                                           
                OR TWA-MSLOC > SPACES                                           
                OR TWA-MQTY > SPACES                                            
                OR TWA-MCD > SPACES                                             
                OR TWA-MTYPE > SPACES)                                          
                   MOVE ATT-UNPROT-BRT TO MSECRA                                
                   IF NOT INPUT-ERROR                                           
                      MOVE -1 TO MSECRL                                         
                      MOVE                                                      
                    'EITHER CUSIP OR DESCRIPTION IS REQUIRED WHEN OTHER         
      -        'ASSET FIELDS ARE PRESENT'                                       
                            TO SYSTEM-MSG                                       
                      SET INPUT-ERROR TO TRUE                                   
                   END-IF                                                       
              ELSE                                                              
                 GO TO SKIP-ASSET-EDIT.                                         
                                                                                
           MOVE ATT-UNPROT TO MCATGRA.                                          
           IF TWA-MCATGR > SPACES                                               
              IF (TWA-MCATGR = 'ANNU' OR 'CDCP' OR 'CORP' OR 'EQU '             
                  OR 'FCUR' OR 'FDEB' OR 'GOVT' OR 'LPAR' OR 'MBS '             
                  OR 'MFMM' OR 'MFNM' OR 'MUNI' OR 'OTH ' OR 'UARP'             
                  OR 'UDSC' OR 'UIT ' OR 'ZERO')                                
                     CONTINUE                                                   
              ELSE                                                              
                 MOVE ATT-UNPROT-BRT TO MCATGRA                                 
                 IF NOT INPUT-ERROR                                             
                    MOVE -1 TO MCATGRL                                          
                    MOVE 'CATEGORY CODE IS INVALID' TO SYSTEM-MSG               
                    SET INPUT-ERROR TO TRUE.                                    
                                                                                
LRM021     IF TWA-MCATGR > SPACES                                               
LRM021     AND TWA-INP-TFR-TYP = 'PTF'                                          
LRM021        IF (TWA-MCATGR NOT = 'MFMM' AND 'MFNM')                           
LRM021           MOVE ATT-UNPROT-BRT TO MCATGRA                                 
LRM021           IF NOT INPUT-ERROR                                             
LRM021              MOVE -1 TO MCATGRL                                          
LRM021              MOVE 'CATEGORY CODE MUST BE MFMM OR MFNM ON PTF'            
LRM021                       TO SYSTEM-MSG                                      
LRM021              SET INPUT-ERROR TO TRUE.                                    
                                                                                
           MOVE ATT-UNPROT TO MSLOCA.                                           
           IF TWA-MSLOC NOT GREATER SPACES                                      
LRM025        IF ACATMSD-FOUND                                                  
LRM006           PERFORM SET-DEFAULT-SETTLE-LOC-RTN                             
LRM025        END-IF                                                            
LRM006*****   MOVE '00' TO TWA-MSLOC MSLOCO                                     
           ELSE                                                                 
           IF (TWA-MSLOC = '00' OR '05' OR '10' OR '15' OR '20' OR '25'         
                        OR '30' OR '35' OR '40' OR '45' OR '50')                
              CONTINUE                                                          
           ELSE                                                                 
              MOVE ATT-UNPROT-BRT TO MSLOCA                                     
              IF NOT INPUT-ERROR                                                
                 MOVE -1 TO MSLOCL                                              
                 MOVE 'LOCATION CODE IS INALID' TO SYSTEM-MSG                   
                 SET INPUT-ERROR TO TRUE                                        
              END-IF.                                                           
                                                                                
LRM021     IF TWA-PRTCP-TYPE-CD = '3'                                           
LRM021     AND TWA-MSLOC > SPACES                                               
LRM021     AND TWA-MSLOC NOT = '10'                                             
LRM021        MOVE ATT-UNPROT-BRT TO MSLOCA                                     
LRM021        IF NOT INPUT-ERROR                                                
LRM021           MOVE -1 TO MSLOCL                                              
LRM021           MOVE 'SETTLE LOCATION CODE MUST BE "10" ON PTF'                
LRM021                       TO SYSTEM-MSG                                      
LRM021           SET INPUT-ERROR TO TRUE                                        
LRM021        END-IF.                                                           
                                                                                
*********  MOVE ATT-UNPROT TO MACMNTA.                                          
********   IF TWA-MACMNT GREATER SPACES                                         
********   AND TWA-MACMNT NOT = 'Y'                                             
********      MOVE ATT-UNPROT-BRT TO MACMNTA                                    
********      IF NOT INPUT-ERROR                                                
********         MOVE -1 TO MACMNTL                                             
********         MOVE 'COMMENT INDICATOR MUST BE Y OR SPACE'                    
********                     TO SYSTEM-MSG                                      
********         SET INPUT-ERROR TO TRUE.                                       
                                                                                
           MOVE ATT-UNPROT TO  MCDA.                                            
           IF TWA-MCD = 'D'                                                     
              IF TWA-SECR-ACTION = 'C'                                          
                 CONTINUE                                                       
              ELSE                                                              
                 MOVE ATT-UNPROT-BRT TO MCDA                                    
                 IF NOT INPUT-ERROR                                             
                    MOVE -1 TO MCDL                                             
                    MOVE 'DELETE (D) ONLY ALLOWED ON AN EXISTING ASSET'         
                         TO SYSTEM-MSG                                          
                    SET INPUT-ERROR TO TRUE                                     
                 END-IF                                                         
           ELSE                                                                 
           IF (TWA-MCD > SPACES                                                 
             OR TWA-MQTY > SPACES)                                              
           AND (TWA-MCD NOT = 'P' AND 'V' AND 'F' AND 'D')                      
              MOVE ATT-UNPROT-BRT TO MCDA                                       
              IF NOT INPUT-ERROR                                                
                 MOVE -1 TO MCDL                                                
                 MOVE                                                           
              'NUMERIC OPTION CD MUST BE P(SHARES), V(DOLLARS), F(FULL)         
      -            'OR D(DELETE)'                                               
                      TO SYSTEM-MSG                                             
                 SET INPUT-ERROR TO TRUE                                        
              END-IF.                                                           
                                                                                
           MOVE ATT-UNPROT TO  MQTYA.                                           
LRM006     IF TWA-MQTY NOT GREATER SPACES                                       
           AND TWA-MCD NOT = 'F'                                                
LRM006        MOVE ATT-UNPROT-BRT TO MQTYA                                      
LRM006        IF NOT INPUT-ERROR                                                
LRM006           MOVE -1 TO MQTYL                                               
LRM006           SET INPUT-ERROR TO TRUE                                        
LRM006           MOVE 'QTY/DOLLAR VALUE IS REQUIRED'                            
LRM006                          TO SYSTEM-MSG                                   
LRM006        END-IF                                                            
LRM006     ELSE                                                                 
           IF TWA-MQTY GREATER SPACES                                           
              IF TWA-MCD = 'P'                                                  
                 PERFORM EDIT-QTY-RTN                                           
              ELSE                                                              
              IF TWA-MCD = 'V'                                                  
                 PERFORM EDIT-DOLLAR-AMT-RTN                                    
              ELSE                                                              
              IF TWA-MCD = 'F'                                                  
                 PERFORM EDIT-FULL-REQUEST-RTN                                  
LRM028              THRU EDIT-FULL-REQ-EXIT                                     
              ELSE                                                              
              IF TWA-MCD = 'D'                                                  
                 CONTINUE                                                       
              ELSE                                                              
                 MOVE ATT-UNPROT-BRT TO MQTYA                                   
                 IF NOT INPUT-ERROR                                             
                    MOVE -1 TO MQTYL                                            
                    SET INPUT-ERROR TO TRUE                                     
                    MOVE                                                        
            'QTY FIELD NOT ALLOWED WITHOUT CD / ERASE FOR FULL POSITION'        
                                TO SYSTEM-MSG                                   
                 END-IF                                                         
           ELSE                                                                 
              IF TWA-MCD = 'P' OR 'V'                                           
                 MOVE ATT-UNPROT-BRT TO MQTYA                                   
                 IF NOT INPUT-ERROR                                             
                    MOVE -1 TO MQTYL                                            
                    MOVE 'SHARES FIELD MISSING'                                 
                       TO SYSTEM-MSG                                            
                 SET INPUT-ERROR TO TRUE                                        
              END-IF.                                                           
                                                                                
           MOVE ATT-UNPROT TO MDESCA.                                           
           IF TWA-MDESC(1 : 1) NOT GREATER SPACES                               
              MOVE ATT-UNPROT-BRT TO MDESCA                                     
              IF NOT INPUT-ERROR                                                
                 MOVE -1 TO MDESCL                                              
                 MOVE 'THE FIRST DESCRIPTION IS REQUIRED' TO SYSTEM-MSG         
                 SET INPUT-ERROR TO TRUE                                        
              END-IF                                                            
LRM021     ELSE                                                                 
LRM021        PERFORM VARYING SUB FROM 1 BY 1                                   
LRM021              UNTIL SUB GREATER 30                                        
LRM021           IF TWA-MDESC(SUB : 1) < ' '                                    
LRM021              MOVE SPACE TO TWA-MDESC (SUB : 1)                           
LRM021           END-IF                                                         
LRM021           IF TWA-MDESC2(SUB : 1) < ' '                                   
LRM021              MOVE SPACE TO TWA-MDESC2 (SUB : 1)                          
LRM021           END-IF                                                         
LRM021           IF TWA-MDESC3(SUB : 1) < ' '                                   
LRM021              MOVE SPACE TO TWA-MDESC3 (SUB : 1)                          
LRM021           END-IF                                                         
LRM021        END-PERFORM.                                                      
                                                                                
           MOVE ATT-UNPROT TO MWIA.                                             
           IF TWA-MWI NOT > SPACES                                              
              MOVE 'N' TO TWA-MWI MWIO                                          
           ELSE                                                                 
LRM017     IF TWA-MWI NOT = 'W' AND 'N'                                         
              MOVE ATT-UNPROT-BRT TO MWIA                                       
              IF NOT INPUT-ERROR                                                
                 MOVE -1 TO MWIL                                                
LRM017           MOVE 'WHEN-ISSUE INDICATOR MUST BE W OR N'                     
                        TO SYSTEM-MSG                                           
                 SET INPUT-ERROR TO TRUE                                        
              END-IF.                                                           
                                                                                
           MOVE ATT-UNPROT TO MTYPEA.                                           
LRM006***  IF TWA-MTYPE NOT GREATER SPACES                                      
LRM006***     MOVE ATT-UNPROT-BRT TO MTYPEA                                     
LRM006***     IF NOT INPUT-ERROR                                                
LRM006***        MOVE -1 TO MTYPEL                                              
LRM006***        MOVE 'ASSET TYPE IS REQUIRED' TO SYSTEM-MSG                    
LRM006***        SET INPUT-ERROR TO TRUE                                        
LRM006***     END-IF                                                            
LRM006***  ELSE                                                                 
LRM006***     IF TWA-MTYPE NOT = '1' AND '2' AND '5'                            
LRM006     IF TWA-MTYPE NOT = '1' AND '2' AND '5' AND ' '                       
                 MOVE ATT-UNPROT-BRT TO MTYPEA                                  
                 IF NOT INPUT-ERROR                                             
                    MOVE -1 TO MTYPEL                                           
LRM006***           MOVE 'ASSET TYPE MUST BE 1, 2 OR 5' TO SYSTEM-MSG           
LRM006              MOVE 'ASSET TYPE MUST BE 1, 2, 5 OR SPACE'                  
LRM006                                                  TO SYSTEM-MSG           
                    SET INPUT-ERROR TO TRUE                                     
                 END-IF.                                                        
                                                                                
                                                                                
   ****** ON ASSET KEY CHANGE, MAKE SURE THE TARGET ASSET KEY IS NOT            
   ****** ALREADY ON FILE:                                                      
              IF NOT INPUT-ERROR                                                
              AND (TWA-MSECR NOT = TWA-ORIG-MSECR                               
                OR TWA-MSLOC NOT =  TWA-ORIG-SLOC                               
                OR TWA-MTYPE NOT =  TWA-ORIG-MTYPE                              
LRM007          OR TWA-SECR-ACTION = 'A')                                       
                  MOVE 'A' TO TWA-SECR-ACTION                                   
                  PERFORM READ-ASSET-RTN                                        
                  IF ACAT03IO-FOUND                                             
LRM007            AND TWA-DUPE-FOUND NOT = 'Y'                                  
                     MOVE ATT-UNPROT-BRT TO MSECRA                              
                                            MSLOCA                              
                                            MTYPEA                              
LRM007               MOVE 'C' TO TWA-SECR-ACTION                                
LRM007               PERFORM MOVE-ACAT03IO-ASSET-TO-TWA                         
                     IF NOT INPUT-ERROR                                         
                        MOVE -1 TO MSECRL                                       
                        MOVE                                                    
           'ASSET KEYS SECR/LOC/TYPE ALREADY EXISTS; CHANGE OR DELETE'          
                            TO SYSTEM-MSG                                       
                        SET INPUT-ERROR TO TRUE                                 
                     END-IF                                                     
           END-IF.                                                              
                                                                                
           MOVE ATT-UNPROT TO MDESC2A                                           
                              MDESC3A.                                          
                                                                                
       SKIP-ASSET-EDIT.                                                         
   ****** ASSURE AT LEAST ONE ASSET (BALANCE OR ASSET RECORD EXISTS).           
           IF  TWA-MBAL01 NOT > SPACES                                          
           AND TWA-MBAL02 NOT > SPACES                                          
           AND TWA-MBAL05 NOT > SPACES                                          
           AND TWA-MSMA NOT > SPACES                                            
           AND TWA-MDESC(1 : 5) NOT > SPACES                                    
              MOVE ATT-UNPROT-BRT TO MBAL01A                                    
              IF NOT INPUT-ERROR                                                
LRM021           IF TWA-INP-TFR-TYP = 'PTF'                                     
LRM021              MOVE -1 TO MSECRL                                           
LRM021              MOVE 'AT LEAST ONE ASSET IS REQUIRED ON TIF'                
LRM021                 TO SYSTEM-MSG                                            
                 ELSE                                                           
LRM021           IF EIBAID NOT = DFHPF5                                         
                    MOVE -1 TO MBAL01L                                          
                    MOVE                                                        
                      'AT LEAST ONE BALANCE OR ASSET IS REQUIRED ON TIF'        
                       TO SYSTEM-MSG                                            
LRM021           END-IF END-IF                                                  
                 SET INPUT-ERROR TO TRUE                                        
              END-IF.                                                           
                                                                                
           IF TWA-ACTION = 'B'                                                  
           OR NOT ACAT-SIGN-ON-UPDATE                                           
              PERFORM ASKIP-MAP-RTN                                             
              MOVE ATT-UNPROT TO MBRA MACA                                      
              MOVE -1 TO MBRL                                                   
              IF SYSTEM-MSG(1 : 1) = SPACES                                     
                 MOVE 'TIF DISPLAYED / BROWSE ONLY'  TO SYSTEM-MSG              
              END-IF                                                            
           ELSE                                                                 
           IF EIBAID = DFHPF2                                                   
              MOVE -1 TO MBRL                                                   
              MOVE 'PLEASE ENTER NEW TIF' TO SYSTEM-MSG                         
           ELSE                                                                 
           IF EIBAID = DFHPF5                                                   
              MOVE -1 TO MSECRL                                                 
LRM021        IF TWA-INP-TFR-TYP = 'PTF'                                        
LRM021        AND TWA-DUPE-FOUND = 'Y'                                          
LRM021           MOVE 'ENTERING NEXT PTF ASSET GENERATES SEPERATE TIF'          
LRM021                                          TO SYSTEM-MSG                   
LRM021        ELSE                                                              
                 MOVE 'PLEASE ENTER NEXT ASSET' TO SYSTEM-MSG                   
           ELSE                                                                 
           IF NOT INPUT-ERROR                                                   
           AND SYSTEM-MSG = SPACES                                              
           AND EIBAID = DFHENTER                                                
              MOVE 'NO ERRORS FOUND' TO SYSTEM-MSG                              
              MOVE -1 TO MNAMEL.                                                
                                                                                
       PROCESS-MAP-ITEMS-EXIT. EXIT.                                            
                                                                                
LRM025 LOOKUP-OPTION-BY-KEYS-RTN.                                               
LRM025     MOVE ATT-UNPROT TO MEXPDTA                                           
LRM025     IF TWA-MEXPDT NOT > SPACES                                           
LRM025        MOVE ATT-UNPROT-BRT TO MEXPDTA                                    
LRM025        MOVE 'N' TO WS-OPTION-SW                                          
LRM025        IF NOT INPUT-ERROR                                                
LRM025           MOVE -1 TO MEXPDTL                                             
LRM025           MOVE 'OPTION EXPIRATION DATE MMDDYY IS REQUIRED'               
LRM025                                                  TO SYSTEM-MSG           
LRM025           SET INPUT-ERROR TO TRUE                                        
LRM025        END-IF                                                            
LRM025     ELSE                                                                 
LRM025        IF (TWA-MEXPDT NOT NUMERIC                                        
LRM025        OR (TWA-MEXPDT(1 : 2) < '01' OR > '12')                           
LRM025        OR (TWA-MEXPDT(3 : 2) < '01' OR > '31'))                          
LRM025           MOVE ATT-UNPROT-BRT TO MEXPDTA                                 
LRM025           MOVE 'N' TO WS-OPTION-SW                                       
LRM025           IF NOT INPUT-ERROR                                             
LRM025              MOVE -1 TO MEXPDTL                                          
LRM025              MOVE 'OPTION EXPIRATION DATE MMDDYY IS INVALID'             
LRM025                                                  TO SYSTEM-MSG           
LRM025              SET INPUT-ERROR TO TRUE                                     
LRM025           END-IF                                                         
LRM025        END-IF                                                            
LRM025     END-IF.                                                              
                                                                                
LRM025     MOVE ATT-UNPROT TO MCALLA                                            
LRM025     IF TWA-MCALL NOT > SPACES                                            
LRM025        MOVE ATT-UNPROT-BRT TO MCALLA                                     
LRM025        MOVE 'N' TO WS-OPTION-SW                                          
LRM025        IF NOT INPUT-ERROR                                                
LRM025           MOVE -1 TO MCALLL                                              
LRM025           MOVE 'OPTION PUT/CALL IS REQUIRED'  TO SYSTEM-MSG              
LRM025           SET INPUT-ERROR TO TRUE                                        
LRM025        END-IF                                                            
LRM025     ELSE                                                                 
LRM025        IF (TWA-MCALL NOT = 'P' AND 'C')                                  
LRM025           MOVE ATT-UNPROT-BRT TO MCALLA                                  
LRM025           MOVE 'N' TO WS-OPTION-SW                                       
LRM025           IF NOT INPUT-ERROR                                             
LRM025              MOVE -1 TO MCALLL                                           
LRM025              MOVE 'OPTION PUT/CALL MUST BE P OR C'  TO SYSTEM-MSG        
LRM025              SET INPUT-ERROR TO TRUE                                     
LRM025           END-IF                                                         
LRM025        END-IF                                                            
LRM025     END-IF.                                                              
LRM025                                                                          
LRM025     MOVE ATT-UNPROT TO MLONGA                                            
LRM025     IF TWA-MLONG NOT > SPACES                                            
LRM025        MOVE ATT-UNPROT-BRT TO MLONGA                                     
LRM025        MOVE 'N' TO WS-OPTION-SW                                          
LRM025        IF NOT INPUT-ERROR                                                
LRM025           MOVE -1 TO MLONGL                                              
LRM025           MOVE 'OPTION LONG/SORT IS REQUIRED'  TO SYSTEM-MSG             
LRM025           SET INPUT-ERROR TO TRUE                                        
LRM025        END-IF                                                            
LRM025     ELSE                                                                 
LRM025        IF (TWA-MLONG NOT = 'L' AND 'S')                                  
LRM025           MOVE ATT-UNPROT-BRT TO MLONGA                                  
LRM025           MOVE 'N' TO WS-OPTION-SW                                       
LRM025           IF NOT INPUT-ERROR                                             
LRM025              MOVE -1 TO MLONGL                                           
LRM025              MOVE 'OPTION LONG/SORT MUST BE L OR S' TO SYSTEM-MSG        
LRM025              SET INPUT-ERROR TO TRUE                                     
LRM025           END-IF                                                         
LRM025        END-IF                                                            
LRM025     END-IF.                                                              
LRM025                                                                          
LRM025     MOVE ATT-UNPROT TO MSTRIKEA                                          
LRM025     IF TWA-MSTRIKE NOT > SPACES                                          
LRM025        MOVE ATT-UNPROT-BRT TO MSTRIKEA                                   
LRM025        MOVE 'N' TO WS-OPTION-SW                                          
LRM025        IF NOT INPUT-ERROR                                                
LRM025           MOVE -1 TO MSTRIKEL                                            
LRM025           MOVE 'OPTION STRIKE PRICE IS REQUIRED'                         
LRM025                                               TO SYSTEM-MSG              
LRM025           SET INPUT-ERROR TO TRUE                                        
LRM025        END-IF                                                            
LRM025     ELSE                                                                 
LRM025        MOVE TWA-MSTRIKE TO WK-STRK-IN                                    
LRM025        EXEC CICS LINK PROGRAM(WS-EDITMOD)                                
LRM025                 COMMAREA(EDIT-STRK-AREA)                                 
LRM025                 LENGTH(LENGTH OF EDIT-STRK-AREA)                         
LRM025        END-EXEC                                                          
LRM025        IF WK-STRK-RET-CODE = SPACE                                       
LRM025           MOVE WK-STRK-OUT   TO WS-MSTRK-ED-D3 TWA-MSTRIKE-9             
LRM025           MOVE WS-MSTRK-AREA TO MSTRIKEO                                 
LRM025        ELSE                                                              
LRM025           MOVE ATT-UNPROT-BRT TO MSTRIKEA                                
LRM025           MOVE 'N' TO WS-OPTION-SW                                       
LRM025           IF NOT INPUT-ERROR                                             
LRM025              MOVE -1 TO MSTRIKEL                                         
LRM025              MOVE 'OPTION STRIKE PRICE IS INVALID'                       
LRM025                                                  TO SYSTEM-MSG           
LRM025              SET INPUT-ERROR TO TRUE                                     
LRM025           END-IF                                                         
LRM025        END-IF                                                            
LRM025     END-IF.                                                              
                                                                                
LRM025     IF WS-OPTION-SW NOT = 'N'                                            
LRM025     AND TWA-MEXPDT > SPACES                                              
LRM025        MOVE ' '                   TO GETADP-COMMAREA                     
LRM025        MOVE TWA-CLIENT-NO         TO GETADP-CLIENT-NBR                   
LRM025        MOVE TWA-MSECR             TO GETADP-OPTION-UNDSEC                
LRM025        MOVE TWA-MCALL             TO GETADP-OPTION-PC                    
LRM025        MOVE TWA-MLONG             TO GETADP-OPTION-LS                    
LRM025        MOVE TWA-MSTRIKE-9         TO GETADP-OPTION-STRIKE                
LRM025        MOVE TWA-MEXPDT(1:2)       TO GETADP-OPTION-MONTH                 
LRM025        MOVE TWA-MEXPDT(3:2)       TO GETADP-OPTION-DAY                   
LRM025        MOVE TWA-MEXPDT(5:2)       TO GETADP-OPTION-YR                    
LRM025        EXEC CICS LINK PROGRAM('GETADPOL')                                
LRM025               COMMAREA(GETADP-COMMAREA)                                  
LRM025               LENGTH(LENGTH OF GETADP-COMMAREA)                          
LRM025        END-EXEC                                                          
LRM025        EVALUATE TRUE                                                     
LRM025        WHEN GETADP-RET-CODE  = ' '                                       
LRM025             MOVE 'XX'            TO WS-OPTION-MSECR                      
LRM025             MOVE GETADP-ADP-NBR  TO WS-OPTION-MSECR (3 : 7)              
LRM025             MOVE WS-OPTION-MSECR TO TWA-MSECR                            
LRM025****                                 TWA-ORIG-MSECR                       
LRM025****                                 TWA-ORIG-SECR                        
LRM025             MOVE 'Y' TO WS-OPTION-SW                                     
LRM025        WHEN GETADP-RET-CODE  = 'N'                                       
LRM025*            'N' = NOT FOUND / NO KEY PASSED                              
LRM025             MOVE ATT-UNPROT-BRT TO MSECRA MEXPDTA MSTRIKEA               
LRM025                                    MCALLA MLONGA                         
LRM025             MOVE 'N' TO WS-OPTION-SW                                     
LRM025             IF NOT INPUT-ERROR                                           
LRM025                MOVE 'OPTION NOT FOUND ON MSD' TO SYSTEM-MSG              
LRM025                MOVE -1 TO MSECRL                                         
LRM025                SET INPUT-ERROR TO TRUE                                   
LRM025             END-IF                                                       
LRM025        WHEN GETADP-RET-CODE  = 'D'                                       
LRM025*            'D' = BAD DB2/SQL RETURN CODE                                
LRM025             MOVE ATT-UNPROT-BRT TO MSECRA MEXPDTA MSTRIKEA               
LRM025                                    MCALLA MLONGA                         
LRM025             MOVE 'N' TO WS-OPTION-SW                                     
LRM025             IF NOT INPUT-ERROR                                           
LRM025                MOVE ' GETOPTNO:BAD DB2/SQL RC' TO SYSTEM-MSG             
LRM025                MOVE -1 TO MSECRL                                         
LRM025                SET INPUT-ERROR TO TRUE                                   
LRM025             END-IF                                                       
LRM025        WHEN GETADP-RET-CODE  = 'E'                                       
LRM025*            'E' = BAD COMMAREA LENGTH                                    
LRM025             MOVE ATT-UNPROT-BRT TO MSECRA MEXPDTA MSTRIKEA               
LRM025                                    MCALLA MLONGA                         
LRM025             MOVE 'N' TO WS-OPTION-SW                                     
LRM025             IF NOT INPUT-ERROR                                           
LRM025                MOVE ' GETOPTNO:BAD COMMAREA LENGTH' TO SYSTEM-MSG        
LRM025                MOVE -1 TO MSECRL                                         
LRM025                SET INPUT-ERROR TO TRUE                                   
LRM025             END-IF                                                       
LRM025        WHEN GETADP-RET-CODE  = 'I'                                       
LRM025*            'I' = BAD RETURN FROM MSDISIN READ                           
LRM025             MOVE ATT-UNPROT-BRT TO MSECRA MEXPDTA MSTRIKEA               
LRM025                                    MCALLA MLONGA                         
LRM025             MOVE 'N' TO WS-OPTION-SW                                     
LRM025             IF NOT INPUT-ERROR                                           
LRM025                MOVE ' GETOPTNO:BAD MSDISIN READ' TO SYSTEM-MSG           
LRM025                MOVE -1 TO MSECRL                                         
LRM025                SET INPUT-ERROR TO TRUE                                   
LRM025             END-IF                                                       
LRM025        WHEN GETADP-RET-CODE  = 'B'                                       
LRM025*            'B' = BAD RETURN FROM B1 FILE READ                           
LRM025             MOVE ATT-UNPROT-BRT TO MSECRA MEXPDTA MSTRIKEA               
LRM025                                    MCALLA MLONGA                         
LRM025             MOVE 'N' TO WS-OPTION-SW                                     
LRM025             IF NOT INPUT-ERROR                                           
LRM025                MOVE ' GETOPTNO:BAD B1 FILE READ' TO SYSTEM-MSG           
LRM025                MOVE -1 TO MSECRL                                         
LRM025                SET INPUT-ERROR TO TRUE                                   
LRM025             END-IF                                                       
LRM025        WHEN GETADP-RET-CODE  = 'C'                                       
LRM025*            'C' = NO CLIENT NUMBER PASSED                                
LRM025             MOVE ATT-UNPROT-BRT TO MSECRA MEXPDTA MSTRIKEA               
LRM025                                    MCALLA MLONGA                         
LRM025             MOVE 'N' TO WS-OPTION-SW                                     
LRM025             IF NOT INPUT-ERROR                                           
LRM025                MOVE ' GETOPTNO:NO CLIENT NUMBER' TO SYSTEM-MSG           
LRM025                MOVE -1 TO MSECRL                                         
LRM025                SET INPUT-ERROR TO TRUE                                   
LRM025             END-IF                                                       
LRM025        WHEN OTHER                                                        
LRM025             MOVE ATT-UNPROT-BRT TO MSECRA MEXPDTA MSTRIKEA               
LRM025                                    MCALLA MLONGA                         
LRM025             MOVE 'N' TO WS-OPTION-SW                                     
LRM025             IF NOT INPUT-ERROR                                           
LRM025                MOVE ' GETOPTNO:I/O ERROR' TO SYSTEM-MSG                  
LRM025                MOVE -1 TO MSECRL                                         
LRM025                SET INPUT-ERROR TO TRUE                                   
LRM025             END-IF                                                       
LRM025        END-EVALUATE                                                      
LRM025     END-IF.                                                              
                                                                                
       SIGNON-SECR-CHECK-RTN.                                                   
           SET SECURITY-LOOKUP TO TRUE.                                         
           EXEC CICS LINK PROGRAM (WS-ACATSRCH)                         02890002
                COMMAREA(ACAT-SRCH-COMM-AREA)                           02900002
                LENGTH(LENGTH OF ACAT-SRCH-COMM-AREA)                   02910002
           END-EXEC.                                                    02920002
                                                                                
       JUSTIFY-LEFT-MCACCT.                                                     
           MOVE 1 TO SUB SUB2.                                                  
           MOVE SPACES TO WS-MCACCT.                                            
           PERFORM UNTIL SUB GREATER 20                                         
              IF TWA-MCACCT(SUB : 1) NOT = SPACES AND LOW-VALUES                
                 IF ((TWA-MCACCT(SUB : 1) >= 'A' AND <= 'Z')                    
                  OR (TWA-MCACCT(SUB : 1) >= '0' AND <= '9'))                   
                    MOVE TWA-MCACCT(SUB : 1) TO WS-MCACCT(SUB2 : 1)             
                    ADD 1 TO SUB2                                               
                 ELSE                                                           
                    SET MCACCT-ERROR TO TRUE                                    
                    MOVE 20 TO SUB                                              
                 END-IF                                                         
              END-IF                                                            
              ADD 1 TO SUB                                                      
           END-PERFORM.                                                         
                                                                                
           IF NOT MCACCT-ERROR                                                  
              MOVE WS-MCACCT TO TWA-MCACCT.                                     
                                                                                
       SSN-EDIT-RTN.                                                            
           IF (WS-SSN-EDIT(1 : 3) NUMERIC                                       
           AND WS-SSN-EDIT(4 : 1) = '-'                                         
           AND WS-SSN-EDIT(7 : 1) = '-'                                         
           AND WS-SSN-EDIT(5 : 2) NUMERIC                                       
           AND WS-SSN-EDIT(8 : 4) NUMERIC)                                      
              SET SSN-VALID TO TRUE                                             
           ELSE                                                                 
           IF (WS-SSN-EDIT(1 : 9) NUMERIC                                       
           AND WS-SSN-EDIT(10 : 2) = SPACES)                                    
              MOVE WS-SSN-EDIT(8 : 2) TO WS-SSN-EDIT(10 : 2)                    
              MOVE WS-SSN-EDIT(6 : 2) TO WS-SSN-EDIT(8 : 2)                     
              MOVE WS-SSN-EDIT(5 : 1) TO WS-SSN-EDIT(6 : 1)                     
              MOVE WS-SSN-EDIT(4 : 1) TO WS-SSN-EDIT(5 : 1)                     
              MOVE '-'                TO WS-SSN-EDIT(4 : 1)                     
                                         WS-SSN-EDIT(7 : 1)                     
              SET SSN-VALID TO TRUE                                             
           ELSE                                                                 
              SET SSN-INVALID TO TRUE                                           
           END-IF.                                                              
                                                                                
       SET-CUST-TYPE-B1-DEFAULT-RTN.                                            
           MOVE TWA-CLIENT-NO   TO B1-CLIENT-NO B1-CLIENT.              03580002
           MOVE 434531          TO B1-CARD-NO.                          03590002
           PERFORM READ-B1-RTN.                                         03600002
           IF EIBRESP  = +0                                             03610002
           AND B1-RETURN-VALUE(1 : 2) GREATER SPACES                            
               MOVE B1-RETURN-VALUE(1 : 2) TO TWA-MCTYPE                        
                                        BH-ACAT-DEFAULT-CUSTOMER-TYPE           
           END-IF.                                                              
           IF  BH-ACAT-DEFAULT-CUSTOMER-TYPE > ' '                      CAT513  
               MOVE BH-ACAT-DEFAULT-CUSTOMER-TYPE TO TWA-MCTYPE         CAT513  
           ELSE                                                         CAT513  
               MOVE 'SN'                          TO TWA-MCTYPE         CAT513  
           END-IF.                                                      CAT513  
                                                                        CAT513  
***********PERFORM 5314-CHECK-RETIRE-RANGE THRU 5314-EXIT.              CAT513  
                                                                        CAT513  
           PERFORM 5315-CHECK-IRA-BR-RANGE THRU 5315-EXIT.              CAT513  
           IF  W-IRA-BR-RANGE-SW = 'Y'                                  CAT513  
               CONTINUE                                                 CAT513  
           ELSE                                                         CAT513  
               PERFORM 5316-CHECK-IRA-BR-ACT-RANGE THRU 5316-EXIT       CAT513  
           END-IF.                                                      CAT513  
                                                                        CAT513  
           MOVE 434534          TO B1-CARD-NO.                          03590002
           MOVE ZERO TO EIBRESP.                                        03610002
           MOVE 1 TO B1-SEQUENCE.                                       00630002
           PERFORM UNTIL EIBRESP NOT = ZERO                                     
                    OR B1-SEQUENCE > 40                                 CAT513  
              PERFORM READ-B1-RTN                                       03600002
              IF EIBRESP  = +0                                          03610002
                 IF B1-RETURN-VALUE(1 : 1) GREATER SPACES                       
                    ADD 1 TO BH-ACAT-RETIRE-ACT-SUB-CTG-NO              CAT513  
                    MOVE B1-RETURN-VALUE(1 : 4) TO                              
                         BH-ACAT-RETIRE-ACT-SUB-CTG-ENT(B1-SEQUENCE)    BHACAT  
                 END-IF                                                         
                 ADD 1 TO B1-SEQUENCE                                   00630002
              END-IF                                                            
           END-PERFORM.                                                 BHACAT  
           MOVE 1 TO B1-SEQUENCE.                                       00630002
                                                                                
           MOVE 434504          TO B1-CARD-NO.                          03590002
           PERFORM READ-B1-RTN.                                         03600002
           IF EIBRESP  = +0                                             03610002
           AND B1-RETURN-VALUE(1 : 1) GREATER SPACES                            
               MOVE B1-RETURN-VALUE(1 : 1) TO                                   
                   BH-ACAT-DEFINE-CUSTOMER-TYPE                         CAT513  
           END-IF.                                                              
                                                                                
           IF  BH-ACAT-RETIRE-ACT-SUB-CTG-NO > 0                        CAT513  
           AND ACATNAIO-IRA > ' '                                       CAT513  
               PERFORM 5311-EDIT-IRA-IND THRU 5311-EXIT                 CAT513  
           ELSE                                                         CAT513  
LRM014         PERFORM 5312-LOAD-CLASS-CODE-B1                                  
               IF  BH-ACAT-DEFINE-CUSTOMER-TYPE = '0'                   CAT513  
                   PERFORM 5312-EDIT-CLASS-CODE THRU 5312-EXIT          CAT513  
               ELSE                                                     CAT513  
                   IF  BH-ACAT-DEFINE-CUSTOMER-TYPE = '1'               CAT513  
                       PERFORM 5313-EDIT-ADT-CUST-TYPE THRU 5313-EXIT   CAT513  
                   END-IF                                               CAT513  
               END-IF                                                   CAT513  
           END-IF.                                                      CAT513  
                                                                        CAT513  
       5311-EDIT-IRA-IND.                                               CAT513  
           MOVE 434534          TO B1-CARD-NO.                          03590002
           MOVE ZERO TO EIBRESP.                                        03610002
           MOVE 1 TO B1-SEQUENCE.                                       00630002
           PERFORM UNTIL EIBRESP NOT = ZERO                                     
                    OR B1-SEQUENCE > 40                                 CAT513  
              PERFORM READ-B1-RTN                                       03600002
              IF EIBRESP  = +0                                          03610002
                 ADD 1 TO BH-ACAT-RETIRE-ACT-SUB-CTG-NO                 CAT513  
                 MOVE B1-RETURN-VALUE(1 : 4) TO                                 
                        BH-ACAT-RETIRE-ACT-SUB-CTG-ENT(B1-SEQUENCE)     BHACAT  
                 ADD 1 TO B1-SEQUENCE                                   00630002
              END-IF                                                            
           END-PERFORM.                                                 BHACAT  
           MOVE 1 TO B1-SEQUENCE.                                       00630002
                                                                                
           MOVE 'N' TO W-IRA-B1-SW.                                     CAT513  
           MOVE 1 TO W-SUB1.                                            CAT513  
       5311-LOOP.                                                       CAT513  
           IF  BH-ACAT-RETIRE-ACT-IRA-CODE (W-SUB1) = ' '               CAT513  
               GO TO 5311-EXIT                                          CAT513  
           END-IF                                                       CAT513  
           IF  BH-ACAT-RETIRE-ACT-IRA-CODE (W-SUB1) =                   CAT513  
                                             ACATNAIO-IRA               CAT513  
               MOVE BH-ACAT-RETIRE-ACT-CUST-TYPE (W-SUB1)               CAT513  
                                             TO TWA-MCTYPE              CAT513  
               MOVE 'Y' TO W-IRA-B1-SW                                  CAT513  
           END-IF                                                       CAT513  
           IF  W-SUB1 < BH-ACAT-RETIRE-ACT-SUB-CTG-NO                   CAT513  
               ADD 1 TO W-SUB1                                          CAT513  
               GO TO 5311-LOOP                                          CAT513  
           END-IF.                                                      CAT513  
                                                                        CAT513  
       5311-EXIT. EXIT.                                                 CAT513  
      /                                                                 CAT513  
LRM014 5312-LOAD-CLASS-CODE-B1.                                                 
           MOVE 434535          TO B1-CARD-NO.                          03590002
           MOVE ZERO TO EIBRESP.                                        03610002
           MOVE 1 TO B1-SEQUENCE.                                       00630002
           PERFORM UNTIL EIBRESP NOT = ZERO                                     
                    OR B1-SEQUENCE > 100                                BHACAT  
              PERFORM READ-B1-RTN                                       03600002
              IF EIBRESP  = +0                                          03610002
LRM004           IF B1-RETURN-VALUE(1 : 3) > SPACES                     CAT513  
                    ADD 1 TO  BH-ACAT-CUST-TYPE-VALUE-NO                        
                    MOVE B1-RETURN-VALUE(1 : 6) TO                      BHACAT  
                        BH-ACAT-CUST-TYPE-VALUE-ENTRY(B1-SEQUENCE)      00630002
LRM017              ADD 1 TO B1-SEQUENCE                                        
LRM017           ELSE                                                           
LRM017              MOVE +13 TO EIBRESP                                         
LRM004           END-IF                                                         
              END-IF                                                            
           END-PERFORM.                                                 BHACAT  
       5312-EDIT-CLASS-CODE.                                            CAT513  
           MOVE 1 TO B1-SEQUENCE.                                       00630002
                                                                        CAT513  
           MOVE 'N' TO W-CLASS-CODE-B1-SW.                              CAT513  
           MOVE 1 TO W-SUB1.                                            CAT513  
       5312-LOOP.                                                       CAT513  
           IF  W-SUB1 > BH-ACAT-CUST-TYPE-VALUE-NO                      CAT513  
           OR  BH-ACAT-CUST-TYPE-FROM-NA (W-SUB1) = ' '                 CAT513  
           OR  W-CLASS-CODE-B1-SW  = 'Y'                                CAT513  
               GO TO 5312-EXIT                                          CAT513  
           END-IF                                                       CAT513  
           IF  BH-ACAT-CUST-TYPE-FROM-NA (W-SUB1)                       CAT513  
                                           = ACATNAIO-ACCT-CLASS-EXP    CAT513  
               MOVE BH-ACAT-CUST-ACCT-TYPE (W-SUB1)                     CAT513  
                                                 TO TWA-MCTYPE          CAT513  
               MOVE 'Y' TO W-CLASS-CODE-B1-SW                           CAT513  
LRM014         GO TO 5312-EXIT                                                  
           END-IF                                                       CAT513  
           IF  W-SUB1 < BH-ACAT-CUST-TYPE-VALUE-NO                      CAT513  
           AND W-CLASS-CODE-B1-SW NOT = 'Y'                             CAT513  
               ADD 1 TO W-SUB1                                          CAT513  
               GO TO 5312-LOOP                                          CAT513  
           END-IF.                                                      CAT513  
                                                                        CAT513  
       5312-EXIT. EXIT.                                                 CAT513  
      /                                                                 CAT513  
       5313-EDIT-ADT-CUST-TYPE.                                         CAT513  
                                                                        CAT513  
LRM014     IF BH-ACAT-CUST-TYPE-VALUE-NO = 0                                    
              EVALUATE ACATNAIO-ADT-CUSTOMER-TYPE                       CAT513  
                    WHEN  000     CONTINUE                              CAT513  
                    WHEN  001     MOVE 'TR' TO TWA-MCTYPE               CAT513  
                    WHEN  003     MOVE 'CU' TO TWA-MCTYPE               CAT513  
                    WHEN  004     MOVE 'CO' TO TWA-MCTYPE               CAT513  
                    WHEN  008     MOVE 'SN' TO TWA-MCTYPE               CAT513  
                    WHEN  011     MOVE 'JT' TO TWA-MCTYPE               CAT513  
                    WHEN  012     MOVE 'JT' TO TWA-MCTYPE               CAT513  
                    WHEN  013     MOVE 'AG' TO TWA-MCTYPE               CAT513  
                    WHEN  015     MOVE 'QP' TO TWA-MCTYPE               CAT513  
                    WHEN  018     MOVE 'TR' TO TWA-MCTYPE               CAT513  
                    WHEN  021     MOVE '21' TO TWA-MCTYPE               CAT513  
                    WHEN OTHER    MOVE 'OT' TO TWA-MCTYPE               CAT513  
              END-EVALUATE                                              CAT513  
LRM014        GO TO 5313-EXIT                                                   
LRM014     END-IF.                                                              
LRM014                                                                          
LRM014     MOVE 'N' TO W-CUST-TYPE-B1-SW.                                       
LRM014     MOVE 1 TO W-SUB1.                                                    
LRM014     MOVE ACATNAIO-ADT-CUSTOMER-TYPE TO W-ADT-CUSTOMER-TYPE-9.            
LRM014 5313-LOOP.                                                               
LRM014     IF  BH-ACAT-CUST-TYPE-FROM-NA (W-SUB1) = ' '                         
LRM014         GO TO 5313-EXIT                                                  
LRM014     END-IF                                                               
LRM014     IF  BH-ACAT-CUST-TYPE-FROM-NA (W-SUB1)                               
LRM014                               =  W-ADT-CUSTOMER-TYPE                     
LRM014         MOVE BH-ACAT-CUST-ACCT-TYPE (W-SUB1)                             
LRM014                                           TO TWA-MCTYPE                  
LRM014         MOVE 'Y' TO W-CUST-TYPE-B1-SW                                    
LRM014         GO TO 5313-EXIT                                                  
LRM014     END-IF                                                               
LRM014     IF  W-SUB1 < BH-ACAT-CUST-TYPE-VALUE-NO                              
LRM014         ADD 1 TO W-SUB1                                                  
LRM014         GO TO 5313-LOOP                                                  
LRM014     END-IF.                                                              
LRM014                                                                          
       5313-EXIT. EXIT.                                                 CAT513  
      /                                                                 CAT513  
       5315-CHECK-IRA-BR-RANGE.                                         CAT513  
           MOVE 009125          TO B1-CARD-NO.                          03590002
           MOVE ZERO TO EIBRESP.                                        03610002
           MOVE 1 TO B1-SEQUENCE.                                       00630002
           PERFORM UNTIL EIBRESP NOT = ZERO                                     
                    OR B1-SEQUENCE > 49                                 BHACAT  
              PERFORM READ-B1-RTN                                       03600002
              IF EIBRESP  = +0                                          03610002
                 IF B1-RETURN-VALUE(1 : 3) > SPACES                             
                    ADD 1 TO BH-MGCA-IRA-BR-RANGE-NO                    CAT513  
                    MOVE B1-RETURN-VALUE(1 : 7) TO                              
                        BH-MGCA-IRA-BR-RANGE-ENTRY(B1-SEQUENCE)         BHMGCA  
                    ADD 1 TO B1-SEQUENCE                                00630002
                 ELSE                                                           
                    MOVE +13 TO EIBRESP                                         
                 END-IF                                                         
              END-IF                                                            
           END-PERFORM.                                                 BHACAT  
           MOVE 1 TO B1-SEQUENCE.                                       00630002
                                                                        CAT513  
           MOVE 'N' TO W-IRA-BR-RANGE-SW.                               CAT513  
           IF  BH-MGCA-IRA-BR-RANGE-NO = 0                              CAT513  
               GO TO 5315-EXIT.                                         CAT513  
           MOVE 1 TO W-SUB1.                                            CAT513  
       5315-LOOP.                                                       CAT513  
           IF  TWA-MBR  >= BH-MGCA-IRA-BR-RANGE-LO (W-SUB1) AND         CAT513  
               TWA-MBR  <= BH-MGCA-IRA-BR-RANGE-HI (W-SUB1)             CAT513  
               MOVE 'IR'  TO TWA-MCTYPE                                 CAT513  
               MOVE 'Y' TO W-IRA-BR-RANGE-SW                            CAT513  
***************DISPLAY*'***IRA-BR*FOUND*'*******************************CAT513  
*********************'*LO='*BH-MGCA-IRA-BR-RANGE-LO*(W-SUB1)************CAT513  
*********************'*HI='*BH-MGCA-IRA-BR-RANGE-HI*(W-SUB1)************CAT513  
           ELSE                                                         CAT513  
               IF  W-SUB1 < BH-MGCA-IRA-BR-RANGE-NO                     CAT513  
                   ADD 1 TO W-SUB1                                      CAT513  
               GO TO 5315-LOOP                                          CAT513  
           END-IF.                                                      CAT513  
                                                                        CAT513  
       5315-EXIT. EXIT.                                                 CAT513  
      /                                                                 CAT513  
       5316-CHECK-IRA-BR-ACT-RANGE.                                     CAT513  
           MOVE 009126          TO B1-CARD-NO.                          03590002
           MOVE ZERO TO EIBRESP.                                        03610002
           MOVE 1 TO B1-SEQUENCE.                                       00630002
           PERFORM UNTIL EIBRESP NOT = ZERO                                     
                    OR B1-SEQUENCE > 49                                 BHACAT  
              PERFORM READ-B1-RTN-LONG                                  03600002
              IF EIBRESP  = +0                                          03610002
                 IF B1-RETURN-VALUE(1 : 3) > SPACES                             
                    ADD 1 TO BH-MGCA-IRA-BR-ACT-RANGE-NO                BHMGCA  
                    MOVE B1-RETURN-VALUE(1 : 19) TO                             
                        BH-MGCA-IRA-BR-ACT-RANGE-ENTRY(B1-SEQUENCE)     BHMGCA  
                    ADD 1 TO B1-SEQUENCE                                00630002
                 ELSE                                                           
                    MOVE +13 TO EIBRESP                                         
                 END-IF                                                         
              END-IF                                                            
           END-PERFORM.                                                 BHACAT  
           MOVE 1 TO B1-SEQUENCE.                                       00630002
                                                                        CAT513  
           MOVE 'N' TO W-IRA-BR-ACT-RANGE-SW.                           CAT513  
           IF  BH-MGCA-IRA-BR-ACT-RANGE-NO = 0                          CAT513  
               GO TO 5316-EXIT.                                         CAT513  
           MOVE 1 TO W-SUB1.                                            CAT513  
       5316-LOOP.                                                       CAT513  
           IF  (TWA-MBR >= BH-MGCA-IRA-BR-ACT-BR-LO (W-SUB1) AND        CAT513  
                TWA-MBR <= BH-MGCA-IRA-BR-ACT-BR-HI (W-SUB1))           CAT513  
           AND (TWA-MAC >= BH-MGCA-IRA-BR-ACT-ACT-LO (W-SUB1) AND       CAT513  
                TWA-MAC <= BH-MGCA-IRA-BR-ACT-ACT-HI (W-SUB1))          CAT513  
                  MOVE 'IR'  TO TWA-MCTYPE                              CAT513  
                  MOVE 'Y' TO W-IRA-BR-ACT-RANGE-SW                     CAT513  
******************DISPLAY*'***IRA-BR-ACT*FOUND*'************************CAT513  
*********************'*LO='*BH-MGCA-IRA-BR-ACT-BR-LO*(W-SUB1)***********CAT513  
*********************'*HI='*BH-MGCA-IRA-BR-ACT-BR-HI*(W-SUB1)***********CAT513  
*********************'*LO='*BH-MGCA-IRA-BR-ACT-ACT-LO*(W-SUB1)**********CAT513  
*********************'*HI='*BH-MGCA-IRA-BR-ACT-ACT-HI*(W-SUB1)**********CAT513  
           ELSE                                                         CAT513  
               IF  W-SUB1 < BH-MGCA-IRA-BR-ACT-RANGE-NO                 CAT513  
                   ADD 1 TO W-SUB1                                      CAT513  
               GO TO 5316-LOOP                                          CAT513  
           END-IF.                                                      CAT513  
                                                                        CAT513  
       5316-EXIT. EXIT.                                                 CAT513  
                                                                                
       EDIT-QTY-RTN.                                                            
           MOVE TWA-MQTY  TO WK-QTY-IN                                          
           EXEC CICS LINK PROGRAM(WS-EDITMOD)                                   
                       COMMAREA(EDIT-QTY-AREA)                                  
                       LENGTH(LENGTH OF EDIT-QTY-AREA)                          
           END-EXEC                                                             
           IF WK-QTY-RET-CODE = SPACE                                           
              MOVE WK-QTY-OUT    TO WS-MQTY-ED-D5 TWA-MQTY-9                    
              MOVE WS-MQTY-AREA TO MQTYO TWA-ORIG-MQTY                          
LRM013        IF TWA-FREEZE-SEC-OUT = 'Y'                                       
LRM013        AND TWA-MQTY-9 < ZERO                                             
LRM013           MOVE ATT-UNPROT-BRT TO MQTYA                                   
LRM013           IF NOT INPUT-ERROR                                             
LRM013              MOVE -1 TO MQTYL                                            
LRM013              SET INPUT-ERROR TO TRUE                                     
LRM013              MOVE WS-SEC-FREEZE-OUT-MSG TO SYSTEM-MSG                    
LRM013           END-IF                                                         
LRM013        ELSE                                                              
LRM013        IF TWA-FREEZE-SEC-IN  = 'Y'                                       
LRM013        AND TWA-MQTY-9 > ZERO                                             
LRM013           MOVE ATT-UNPROT-BRT TO MQTYA                                   
LRM013           IF NOT INPUT-ERROR                                             
LRM013              MOVE -1 TO MQTYL                                            
LRM013              SET INPUT-ERROR TO TRUE                                     
LRM013              MOVE WS-SEC-FREEZE-IN-MSG TO SYSTEM-MSG                     
LRM013           END-IF                                                         
LRM013        END-IF END-IF                                                     
           ELSE                                                                 
              MOVE ATT-UNPROT-BRT TO MQTYA                                      
              IF NOT INPUT-ERROR                                                
                 MOVE -1 TO MQTYL                                               
                 SET INPUT-ERROR TO TRUE                                        
                 MOVE 'QTY FIELD (INTENDED TO BE SHARES) IS INVALID'            
                             TO SYSTEM-MSG                                      
           END-IF.                                                              
                                                                                
       EDIT-DOLLAR-AMT-RTN.                                                     
           MOVE TWA-MQTY  TO WK-VALUE-IN                                        
           EXEC CICS LINK PROGRAM(WS-EDITMOD)                                   
                       COMMAREA(EDIT-VALUE-AREA)                                
                       LENGTH(LENGTH OF EDIT-VALUE-AREA)                        
           END-EXEC                                                             
           IF WK-VALUE-RET-CODE = SPACE                                         
              MOVE WK-VALUE-OUT   TO WS-MQTY-ED-D2  TWA-MQTY-9                  
              MOVE WS-MQTY-AREA TO MQTYO TWA-ORIG-MQTY                          
           ELSE                                                                 
              MOVE ATT-UNPROT-BRT TO MQTYA                                      
              IF NOT INPUT-ERROR                                                
                 MOVE -1 TO MQTYL                                               
                 SET INPUT-ERROR TO TRUE                                        
                    MOVE                                                        
             'QTY FIELD (INTENDED TO BE A DOLLARS) IS INVALID'                  
                             TO SYSTEM-MSG                                      
           END-IF.                                                              
                                                                                
       EDIT-FULL-REQUEST-RTN.                                                   
LRM028     IF TWA-MQTY = '-' OR 'FULL-' OR 'SHORT'                              
LRM028        MOVE ZERO TO TWA-MQTY-9                                           
LRM028        MOVE 'SHORT' TO MQTYO TWA-MQTY TWA-ORIG-MQTY                      
LRM028        GO TO EDIT-FULL-REQ-EXIT.                                         
                                                                                
           MOVE TWA-MQTY  TO WK-QTY-IN                                          
           EXEC CICS LINK PROGRAM(WS-EDITMOD)                                   
                       COMMAREA(EDIT-QTY-AREA)                                  
                       LENGTH(LENGTH OF EDIT-QTY-AREA)                          
           END-EXEC                                                             
           IF WK-QTY-RET-CODE = SPACE                                           
              IF WK-QTY-OUT = ZERO                                              
                 MOVE WK-QTY-OUT    TO WS-MQTY-ED-D5  TWA-MQTY-9                
                 MOVE WS-MQTY-AREA TO MQTYO TWA-ORIG-MQTY                       
              ELSE                                                              
                 MOVE ATT-UNPROT-BRT TO MQTYA                                   
                 IF NOT INPUT-ERROR                                             
                    MOVE -1 TO MQTYL                                            
                    SET INPUT-ERROR TO TRUE                                     
                    MOVE                                                        
             'QTY FIELD MUST BE ZERO WITH FULL REQUEST'                         
                             TO SYSTEM-MSG                                      
                 END-IF                                                         
           ELSE                                                                 
              MOVE ATT-UNPROT-BRT TO MQTYA                                      
              IF NOT INPUT-ERROR                                                
                 MOVE -1 TO MQTYL                                               
                 SET INPUT-ERROR TO TRUE                                        
                 MOVE                                                           
            'QTY FIELD MUST BE ZERO OR SHORT (FULL REQUEST) IS INVALID'         
                             TO SYSTEM-MSG                                      
           END-IF.                                                              
                                                                                
LRM028 EDIT-FULL-REQ-EXIT. EXIT.                                                
                                                                                
       CHECK-ISIN-RESTRICTIONS-RTN.                                             
           SET ACATRSIO-VERIFY-ISIN-SEC TO TRUE.                                
           SET ACATRSIO-RECEIVER TO TRUE.                                       
           MOVE TWA-CLIENT-NO-X TO ACATRSIO-CLIENT-NBR.                         
           MOVE TWA-MSECR       TO ACATRSIO-ISIN-SEC.                           
           MOVE TWA-ADP-NBR TO ACATRSIO-ADP-NBR.                                
           MOVE TWA-MCBRKR  TO ACATRSIO-BRKR-CONTRA-NBR.                        
           PERFORM LINK-TO-ACATRSTIO-RTN.                                       
           IF ACATRSIO-DB2-ERROR                                                
              MOVE 'RSS-RD'          TO WS-DB2-PROBLEM-FUNCTION                 
              MOVE ACATRSIO-SQLCAID  TO WS-DB2-PROBLEM-TABLE                    
              MOVE ACATRSIO-SQLCODE  TO WS-DB2-PROBLEM-ID                       
              MOVE WS-DB2-PROBLEM-MSG TO SYSTEM-MSG                             
              PERFORM DB2-ERROR-RTN.                                            
                                                                                
TBD********    07  ACATRSIO-MEMO-IND = 'Y'                                      
********* ASSUME NEED CROSS EDIT FOR STTL-LOC TO ASSURE MEMO.                   
                                                                                
           IF ACATRSIO-FOUND                                                    
              MOVE ATT-UNPROT-BRT TO MSECRA                                     
              IF NOT INPUT-ERROR                                                
                 MOVE -1 TO MSECRL                                              
LRM023           MOVE TWA-ADP-NBR TO WS-CUSIP-RESTRICTED-ADP-NO                 
LRM023           MOVE WS-CUSIP-RESTRICTED-MSG                                   
LRM023*************'CUSIP NUMBER FOUND ON RESTRICTED SECURITY TABLE'            
                            TO SYSTEM-MSG                                       
                 SET INPUT-ERROR TO TRUE                                        
              END-IF                                                            
           ELSE                                                                 
              IF ACATRSIO-PRIVATE-RANGE-FOUND                                   
                 MOVE ATT-UNPROT-BRT TO MSECRA                                  
                 IF NOT INPUT-ERROR                                             
                    MOVE -1 TO MSECRL                                           
LRM016              MOVE 'BRD SEC NUMBER FOUND ON PRIVATE RANGE FILE'           
                            TO SYSTEM-MSG                                       
                    SET INPUT-ERROR TO TRUE                                     
                 END-IF.                                                        
                                                                                
*********      ACATRSIO-PRIVATE-RANGE-IOERR                                     
*********      07  ACATRSIO-PRNGFL-RESP        PIC S9(8) COMP.                  
                                                                                
       CHECK-ACCOUNT-RESTRICTIONS-RTN.                                          
           SET ACATRSIO-VERIFY-ACCOUNT TO TRUE.                                 
           MOVE TWA-CLIENT-NO-X TO ACATRSIO-CLIENT-NBR.                         
           MOVE TWA-MBR         TO ACATRSIO-BRANCH.                             
           MOVE TWA-MAC         TO ACATRSIO-ACCOUNT.                            
           PERFORM LINK-TO-ACATRSTIO-RTN.                                       
           IF ACATRSIO-DB2-ERROR                                                
              MOVE 'RSB-RD'          TO WS-DB2-PROBLEM-FUNCTION                 
              MOVE ACATRSIO-SQLCAID  TO WS-DB2-PROBLEM-TABLE                    
              MOVE ACATRSIO-SQLCODE  TO WS-DB2-PROBLEM-ID                       
              MOVE WS-DB2-PROBLEM-MSG TO SYSTEM-MSG                             
              PERFORM DB2-ERROR-RTN.                                            
                                                                                
           IF ACATRSIO-FOUND                                                    
              MOVE ATT-UNPROT-BRT TO MBRA  MACA                                 
              IF NOT INPUT-ERROR                                                
                 MOVE -1 TO MBRL                                                
LRM016           MOVE 'BRD BRANCH/ACCOUNT IS RESTRICTED'                        
                            TO SYSTEM-MSG                                       
                 SET INPUT-ERROR TO TRUE                                        
              END-IF.                                                           
                                                                                
LRM008 CHECK-DUPE-ISIN-RTN.                                                     
LRM008     SET ACAT03IO-DUPE-AST-CHECK TO TRUE.                                 
LRM008     MOVE TWA-CLIENT-NO-X   TO ACAT03IO-CLIENT-NBR.                       
LRM008     MOVE TWA-MCBRKR        TO ACAT03IO-DLVR-NBR.                         
LRM008     MOVE TWA-MCACCT        TO ACAT03IO-DLVR-ACCT.                        
LRM008     IF TWA-MTYPE = '1'                                                   
LRM008        SET ACAT03IO-CASH-ASSET TO TRUE                                   
LRM008     ELSE                                                                 
LRM008     IF TWA-MTYPE = '2'                                                   
LRM008        SET ACAT03IO-MARGIN-ASSET TO TRUE                                 
LRM008     ELSE                                                                 
LRM008     IF TWA-MTYPE = '5'                                                   
LRM008        SET ACAT03IO-SHORT-ASSET TO TRUE                                  
LRM008     ELSE                                                                 
LRM008        MOVE SPACES TO ACAT03IO-CSH-MGN-SHRT-CD                           
LRM008     END-IF.                                                              
LRM008     MOVE TWA-MSECR         TO ACAT03IO-ISIN-SEC-ISSUE-CD.                
LRM008     MOVE TWA-ADP-NBR       TO ACAT03IO-ADP-NBR.                          
LRM008     PERFORM LINK-TO-ACAT03IO-RTN.                                        
LRM008     IF ACAT03IO-OTHER-AST-FND                                            
LRM008        MOVE ATT-UNPROT-BRT TO MSECRA                                     
LRM008        IF NOT INPUT-ERROR                                                
LRM008           MOVE -1 TO MSECRL                                              
LRM008           MOVE 'ASSET NOT ALLOWED - RECEIVE ON OTHER ACTIVE PTR'         
LRM008                TO WS-DUPE-MSG-TEXT                                       
LRM008           MOVE ACAT03IO-DUPE-CONTROL-NBR TO WS-DUPE-CONTROL-NBR          
LRM008           MOVE WS-DUPE-MSG TO SYSTEM-MSG                                 
LRM008           SET INPUT-ERROR TO TRUE                                        
LRM008        END-IF                                                            
LRM008     END-IF.                                                              
                                                                                
       SET-PRICING-CATEGORY-CODE-RTN.                                           
LRM012***** LEAVE DEFAULT OF SPACES, AS NSCC PTR RCVR SIDE EDIT NOT             
LRM012***** SO STRICT, AND LESS CHANCE OF REJECT.                               
           MOVE '    ' TO TWA-MCATGR MCATGRO                                    
LRM006****** OPTIONS USE OTH PRICING CATEGORY                                   
           IF  (TWA-ADP-NBR (1:1) = '8' OR '9')                                 
                    AND                                                         
                (ACATMSD-CLASS-CD (1 : 3) = '664' OR '665')                     
              MOVE 'OTH ' TO TWA-MCATGR MCATGRO                                 
           ELSE                                                                 
           IF  ACATMSD-CLASS-CD(1 : 1) = '6'                                    
           AND (ACATMSD-CLASS-CD(7 : 1) = '7' OR '8')                           
              MOVE 'ANNU' TO TWA-MCATGR MCATGRO                                 
           ELSE                                                                 
           IF  ACATMSD-CLASS-CD(1 : 2) = '27'                                   
           AND (ACATMSD-CLASS-CD(7 : 1) = '5' OR '6' OR '7' OR '9' )            
              MOVE 'CDCP' TO TWA-MCATGR MCATGRO                                 
           ELSE                                                                 
           IF  ACATMSD-CLASS-CD(1 : 1) = '2'                                    
           AND (ACATMSD-CLASS-CD(4 : 2) NOT = '21' AND '71')                    
           AND (ACATMSD-CLASS-CD(2 : 1) NOT = '9'                               
           AND  ACATMSD-CLASS-CD(5 : 1) NOT = '1')                              
           AND (ACATMSD-CLASS-CD(5 : 3) NOT = '701' AND '702' AND '703')        
              MOVE 'CORP' TO TWA-MCATGR MCATGRO                                 
           ELSE                                                                 
           IF  ACATMSD-CLASS-CD(1 : 1) = '1'                                    
           OR  (ACATMSD-CLASS-CD(1 : 2) = '65')                                 
              MOVE 'EQU ' TO TWA-MCATGR MCATGRO                                 
           ELSE                                                                 
********     UNDEFINED TEST...                                                  
********      MOVE 'FCUR' TO TWA-MCATGR MCATGRO                                 
********   ELSE                                                                 
           IF (ACATMSD-CLASS-CD(1 : 1) = '2' OR '3' OR '4' OR '7')              
           AND ACATMSD-DESC(1 : 3) = '***'                                      
              MOVE 'FDEB' TO TWA-MCATGR MCATGRO                                 
           ELSE                                                                 
           IF  ACATMSD-CLASS-CD(1 : 1) = '1'                                    
           AND ACATMSD-DESC(1 : 3) = '***'                                      
              MOVE 'FEQU' TO TWA-MCATGR MCATGRO                                 
           ELSE                                                                 
           IF (ACATMSD-CLASS-CD(1 : 1) = '3'                                    
           AND (ACATMSD-CLASS-CD(5 : 3) = '211' OR '711'))                      
           OR (ACATMSD-CLASS-CD(1 : 1) = '2'                                    
           AND (ACATMSD-CLASS-CD(5 : 3) = '210' OR '710'))                      
              MOVE 'GOVT' TO TWA-MCATGR MCATGRO                                 
           ELSE                                                                 
           IF  ACATMSD-CLASS-CD(1 : 1) = '6'                                    
           AND ACATMSD-CLASS-CD(7 : 1) = '1'                                    
              MOVE 'LPAR' TO TWA-MCATGR MCATGRO                                 
           ELSE                                                                 
           IF  ACATMSD-CLASS-CD(1 : 1) = '1'                                    
           AND (ACATMSD-CLASS-CD(7 : 1) = '1' OR '2' OR '3')                    
              MOVE 'MBS ' TO TWA-MCATGR MCATGRO                                 
           ELSE                                                                 
           IF (ACATMSD-CLASS-CD(1 : 2) = '15'                                   
           AND  ACATMSD-CLASS-CD(7 : 1) = '6')                                  
           OR (ACATMSD-CLASS-CD(1 : 2) = '63'                                   
           AND  ACATMSD-CLASS-CD(7 : 1) = '6')                                  
              MOVE 'MFMM' TO TWA-MCATGR MCATGRO                                 
           ELSE                                                                 
           IF (ACATMSD-CLASS-CD(1 : 2) = '15' OR '63')                          
           AND (ACATMSD-CLASS-CD(7 : 1) NOT = '6')                              
              MOVE 'MFNM' TO TWA-MCATGR MCATGRO                                 
           ELSE                                                                 
           IF  ACATMSD-CLASS-CD(1 : 1) = '4'                                    
              MOVE 'MUNI' TO TWA-MCATGR MCATGRO                                 
           ELSE                                                                 
********     UNDEFINED TEST...                                                  
********      MOVE 'UARP' TO TWA-MCATGR MCATGRO                                 
********   ELSE                                                                 
********     UNDEFINED TEST...                                                  
********      MOVE 'UDSC' TO TWA-MCATGR MCATGRO                                 
********   ELSE                                                                 
           IF  ACATMSD-CLASS-CD(1 : 1) = '7'                                    
              MOVE 'UIT ' TO TWA-MCATGR MCATGRO                                 
           ELSE                                                                 
           IF (ACATMSD-CLASS-CD(1 : 2) = '29' OR '39')                          
              MOVE 'ZERO' TO TWA-MCATGR MCATGRO                                 
           END-IF.                                                              
                                                                                
LRM006 SET-DEFAULT-SETTLE-LOC-RTN.                                              
           EVALUATE ACATMSD-CLASS-CD (1:1)                                      
               WHEN '1'                                                         
                     IF (ACATMSD-CLASS-CD (5:1) = '5' OR '6')                   
                         MOVE  'Y'       TO WK-CNS-IND                          
                     END-IF                                                     
               WHEN '2'                                                         
                     IF (ACATMSD-CLASS-CD (5:1) = '2' OR '5' OR '6')            
                         MOVE  'Y'       TO WK-CNS-IND                          
                     END-IF                                                     
               WHEN '3'                                                         
                     IF  (ACATMSD-CLASS-CD (5:1) = '2' OR '6')                  
                         MOVE  'Y'       TO WK-CNS-IND                          
                     END-IF                                                     
               WHEN '4'                                                         
                     IF  ACATMSD-CLASS-CD (5:1) = '6'                           
                         MOVE  'Y'       TO WK-CNS-IND                          
                     END-IF                                                     
               WHEN '6'                                                         
                     IF  ACATMSD-CLASS-CD (2:1) = '6'                           
                         CONTINUE                                               
                     ELSE                                                       
                       IF  (ACATMSD-CLASS-CD (5:1) = '5' OR '6')                
                           MOVE  'Y'     TO WK-CNS-IND                          
                       END-IF                                                   
                     END-IF                                                     
               WHEN '7'                                                         
                     IF  ACATMSD-CLASS-CD (5:1) = '6'                           
                         MOVE  'Y'       TO WK-CNS-IND                          
                     END-IF                                                     
               WHEN OTHER                                                       
                    CONTINUE                                                    
           END-EVALUATE                                                         
                                                                                
           MOVE '00' TO  TWA-MSLOC MSLOCO                                       
                         TWA-ORIG-SLOC                                          
                                                                                
           IF (ACATMSD-CLASS-CD (4:1) = '2' OR '3' OR '4'                       
                                OR '5' OR '6' OR '7')                           
               MOVE  'Y'       TO WK-DTC-IND                                    
           END-IF.                                                              
                                                                                
           IF  WK-DTC-IND = 'Y'                                                 
               MOVE '25'           TO TWA-MSLOC MSLOCO                          
                                      TWA-ORIG-SLOC                             
           END-IF.                                                              
           IF  WK-CNS-IND = 'Y'                                                 
               MOVE '05'           TO TWA-MSLOC MSLOCO                          
                                      TWA-ORIG-SLOC                             
           END-IF                                                               
                                                                                
           IF  (TWA-MCATGR = 'MFMM' OR 'MFNM')                                  
               MOVE '10'           TO TWA-MSLOC MSLOCO                          
                                       TWA-ORIG-SLOC                            
           END-IF                                                               
           IF  (TWA-ADP-NBR (1:1) = '8' OR '9')                                 
                    AND                                                         
                (ACATMSD-CLASS-CD (1 : 3) = '664' OR '665')                     
              MOVE '35' TO  TWA-MSLOC MSLOCO                                    
                            TWA-ORIG-SLOC                                       
           END-IF.                                                              
062700 EJECT                                                            06080002
062800                                                                  06090002
       RETURN-FROM-DETAIL-RTN.                                                  
031100     PERFORM DELETE-TSQ-RTN.                                      02800002
031200     SET FIRST-TIME TO TRUE.                                      02810002
070900                                                                  06740002
071000 EJECT                                                            06750002
       CALL-SECLINK-RTN.                                                AEISAC07
00442      EXEC CICS LINK PROGRAM ('SECLINK')                           AEISAC07
                COMMAREA(SECLINK-LIST)                                          
00443           LENGTH(LENGTH OF SECLINK-LIST)                          AEISAC07
           END-EXEC.                                                            
                                                                                
           EJECT                                                                
087100                                                                  07220110
       INVOKE-DETAIL-PROGRAM-RTN.                                       07225010
           EXEC CICS XCTL PROGRAM(CALLED-PROGRAM-NAME)                          
                          COMMAREA(ACATCOMM-COMMAREA)                           
           END-EXEC.                                                            
  ******** MOVE 'Y' TO ACAT-NOTFND-FLAG.                                        
           MOVE CALLED-PROGRAM-NAME TO ERROR-PROG-NAME.                         
           MOVE 'B' TO ACAT-NEXT.                                               
           MOVE ERROR-PROG-MSG    TO SYSTEM-MSG.                                
           MOVE LOW-VALUE TO ACAT03MO.                                          
           MOVE SPACES     TO ACAT-CALLING-PROG-NAME.                           
                                                                                
096300     EJECT                                                        07630002
096400                                                                  07640002
   500 INIT-MAP-RTN.                                                    07650005
096600     MOVE SPACES     TO ACAT03MO                                  07660002
                              TWA-MAP-TABLE.                            02000002
           MOVE ZEROS TO TWA-MBAL01-9                                           
                         TWA-MBAL02-9                                           
                         TWA-MBAL05-9                                           
                         TWA-MSMA-9.                                            
098100     EJECT                                                        07770002
                                                                                
           SKIP3                                                                
       ASKIP-MAP-RTN.                                                           
           MOVE ATT-ASKIP TO MCTYPEA                                            
                             MCBRKRA                                            
                             MCBNAMA                                            
                             MCACCTA                                            
                             MBAL01A                                    04809610
                             MBAL02A                                    04809610
                             MBAL05A                                    04809610
                             MSMAA                                      04809610
                             MNAMEA                                             
                             MNAME2A                                            
                             MSSNA                                              
                             MSSN2A                                             
                             MACATA                                             
                             MSTATA                                             
                             MSDA                                               
                             MSUBMA                                             
                             MCMNTA.                                            
                                                                                
           PERFORM ASKIP-MAP-SECURITY-SECTION.                                  
                                                                                
       ASKIP-MAP-SECURITY-SECTION.                                              
           MOVE ATT-ASKIP TO MSECRA                                             
LRM025                       MEXPDTA MCALLA MLONGA MSTRIKEA                     
                             MCATGRA                                            
                             MSLOCA                                             
                             MQTYA                                              
                             MCDA                                               
                             MWIA                                               
                             MTYPEA                                             
                             MDESCA                                             
                             MDESC2A                                            
                             MDESC3A.                                           
********                     MACMNTA.                                           
102000 EJECT                                                            07940002
102100                                                                  07950002
103000 SEND-MAP-RETURN.                                                 08040002
           MOVE -1 TO MBRL.                                                     
103600     IF (LINE-COUNT = 0)                                          08120002
103700     AND DATA-ONLY                                                08130002
104000        EVALUATE TRUE                                             08140002
104100           WHEN EIBAID = DFHPA1                                   08150002
104200               SET ALARM-NEEDED TO TRUE                           08160002
104300               MOVE 'BOTTOM OF DATA.         ' TO SYSTEM-MSG      08170002
104400           WHEN EIBAID = DFHPA2                                   08180002
104500               SET ALARM-NEEDED TO TRUE                           08190002
104600               MOVE 'TOP OF DATA.            ' TO SYSTEM-MSG      08200002
104700           WHEN OTHER                                             08210002
104800               PERFORM ACAT-IT-NOT-FOUND-RTN                      08220002
104900        END-EVALUATE                                              08230002
105000     END-IF.                                                      08240002
           PERFORM INIT-MAP-INPUT-AREA.                                         
           MOVE ATT-UNPROT TO MNEXTA                                    02480002
105100     SET TWA-INTRAN-NO-CHANGE TO TRUE.                            08250002
105100     MOVE 'N' TO  TWA-ACAT-NOT-FOUND-FLAG.                        08250002
105200     MOVE SYSTEM-MSG     TO  TRLMSGO.                             08260002
105300     IF  SYSTEM-MSG NOT = SPACES                                  08270002
105400         MOVE ATT-ASKIP-BRT  TO  TRLMSGA                          08280002
105500     END-IF.                                                      08290002
127200     PERFORM WRITE-TSQ-RTN.                                       10790002
    00     IF  DATA-ONLY                                                08300002
105700         PERFORM SEND-MAP-DATA-ONLY                               08310002
105800     ELSE                                                         08320002
105900         PERFORM SEND-MAP-ERASE                                   08330002
           END-IF.                                                              
           MOVE 'ACAT03IP' TO ACAT-PROGRAM-NAME.                        08340002
106000     PERFORM RETURN-TO-CICS.                                      08350002
106100                                                                  08360002
106200     EJECT                                                        08370002
106100                                                                  08360002
       INIT-MAP-INPUT-AREA.                                                     
           MOVE ACAT-INP-BRANCH      TO MBRO.                                   
           MOVE ACAT-INP-ACCOUNT     TO MACO.                                   
           MOVE TWA-CLIENT-NO-X(2 : 3) TO MCLINBO.                              
029700     MOVE WSTIME            TO MTIMEO.                            02740002
029800     MOVE WSMMDDYY          TO MDATEO.                            02750002
106100                                                                  08360002
106200     EJECT                                                        08370002
106100                                                                  08360002
       ACAT-IT-NOT-FOUND-RTN.                                                   
           IF EIBAID = DFHPF10                                                  
           OR WS-DELETE                                                         
           OR FIRST-TIME                                                        
           OR TWA-INTRAN-BRW                                                    
              MOVE LOW-VALUE TO ACAT03MO                                        
              PERFORM INIT-MAP-RTN                                              
              MOVE LOW-VALUE TO TWA-MAP-TABLE                                   
                                ACAT03MO.                                       
           MOVE ZEROS TO TWA-MBAL01-9                                           
                         TWA-MBAL02-9                                           
                         TWA-MBAL05-9                                           
                         TWA-MSMA-9.                                            
                                                                                
           PERFORM INIT-MAP-INPUT-AREA.                                         
           MOVE ATT-UNPROT TO MNEXTA.                                   02480002
           MOVE ATT-UNPROT-BRT TO MBRA                                  02490002
           MOVE -1 TO MBRL                                                      
           IF NOT ACAT-SIGN-ON-UPDATE                                           
              PERFORM ASKIP-MAP-RTN.                                            
           IF WS-DELETE                                                         
              MOVE 'RECORD DELETED / NO RECORDS FOUND' TO TRLMSGO       08220002
           ELSE                                                                 
              MOVE 'NO RECORDS FOUND' TO TRLMSGO.                       08220002
           MOVE ATT-ASKIP-BRT  TO  TRLMSGA                              08280002
           IF FIRST-TIME                                                        
           OR WS-DELETE                                                         
              MOVE 'ACAT03IP' TO ACAT-PROGRAM-NAME                      08340002
              PERFORM SEND-MAP-ERASE                                    08330002
           ELSE                                                                 
              PERFORM SEND-MAP-DATA-ONLY.                                       
                                                                                
           PERFORM WRITE-TSQ-RTN                                        10790002
           PERFORM RETURN-TO-CICS.                                      08350002
                                                                                
106200     EJECT                                                        08370002
106100                                                                  08360002
106400 SEND-MAP-ERASE.                                                  08390002
027000     MOVE 'ACAX'        TO MTRANSO.                               08400002
           MOVE TWA-CLIENT-NO-X(2 : 3) TO MCLINBO.                              
029700     MOVE WSTIME        TO MTIMEO.                                02740002
029800     MOVE WSMMDDYY      TO MDATEO.                                02750002
106500     EXEC CICS SEND MAP('HDRMAP')                                 08410002
106600               MAPSET('ACAT00M')                                  08420002
106700               FROM(HDRMAPO)                                      08430002
106800               ACCUM                                              08440002
                     CURSOR                                                     
106900               ERASE                                              08450002
107000     END-EXEC.                                                    08460002
106500     EXEC CICS SEND MAP('ACAT03M')                                08410002
106600               MAPSET('ACAT03M')                                  08420002
106700               FROM(ACAT03MO)                                     08430002
106800               ACCUM                                              08440002
                     CURSOR                                                     
107000     END-EXEC.                                                    08460002
           MOVE SYSTEM-MSG TO TRLMSGO.                                          
106500     EXEC CICS SEND MAP('TRLMAP')                                 08410002
106600               MAPSET('ACAT00M')                                  08420002
106700               FROM(TRLMAPO)                                      08430002
106800               ACCUM                                              08440002
107000     END-EXEC.                                                    08460002
106500     EXEC CICS SEND PAGE                                          08410002
107000     END-EXEC.                                                    08460002
107100                                                                  08470002
107200 EJECT                                                            08480002
107300                                                                  08490002
107400 SEND-MAP-DATA-ONLY.                                              08500002
027000     MOVE 'ACAX'         TO MTRANSO.                              08510002
           MOVE TWA-CLIENT-NO-X(2 : 3) TO MCLINBO.                              
029700     MOVE WSTIME         TO MTIMEO.                               02740002
029800     MOVE WSMMDDYY       TO MDATEO.                               02750002
    ***    IF FIRST-TIME                                                        
    ***    AND (WK-CURSOR NOT = 0)                                              
              EXEC CICS SEND MAP('HDRMAP')                              08410002
                        MAPSET('ACAT00M')                               08420002
                        FROM(HDRMAPO)                                   08430002
                        ACCUM                                           08440002
                        CURSOR                                          08550002
                        DATAONLY                                        08560002
               END-EXEC                                                 08460002
107600         EXEC CICS SEND MAP('ACAT03M')                            08520002
107700                   MAPSET('ACAT03M')                              08530002
107800                   FROM(ACAT03MO)                                 08540002
107900                   CURSOR                                         08550002
108000                   DATAONLY                                       08560002
                         ACCUM                                             08440
108100         END-EXEC                                                         
               MOVE SYSTEM-MSG TO TRLMSGO                                       
               EXEC CICS SEND MAP('TRLMAP')                                08410
                         MAPSET('ACAT00M')                                 08420
                         FROM(TRLMAPO)                                     08430
                         DATAONLY                                       08560002
                         ACCUM                                             08440
               END-EXEC                                                    08460
               EXEC CICS SEND PAGE                                      08410002
               END-EXEC.                                                08460002
108200                                                                  08580002
       SEND-POPUP-MAP-RTN.                                                      
                                                                                
           IF TWA-SCREEN NOT = 'A'                                              
           AND EIBAID = DFHPF1                                                  
              IF EIBCPOSN >= 602 AND < 640                                      
                 MOVE '1' TO TWA-SCREEN                                         
              ELSE                                                              
              IF EIBCPOSN >= 682 AND < 720                                      
                 MOVE '2' TO TWA-SCREEN                                         
              ELSE                                                              
              IF EIBCPOSN >= 762 AND < 880                                      
                 MOVE '5' TO TWA-SCREEN                                         
              ELSE                                                              
              IF EIBCPOSN >= 842 AND < 960                                      
                 MOVE 'M' TO TWA-SCREEN                                         
              ELSE                                                              
              IF EIBCPOSN < 1121                                                
                 MOVE 'A' TO TWA-SCREEN                                         
              ELSE                                                              
                 MOVE 'S' TO TWA-SCREEN                                         
           END-IF.                                                              
                                                                                
           MOVE SPACES TO TWA-MCMNT.                                            
           PERFORM WRITE-TSQ-RTN.                                       10790002
           PERFORM WRITE-ACAT90CM-TS-RTN.                                       
           MOVE '$' TO WS-ACAT-NEXT.                                            
           MOVE 'ACAT90CM' TO CALLED-PROGRAM-NAME.                              
           PERFORM INVOKE-DETAIL-PROGRAM-RTN.                           07225010
                                                                                
       WRITE-ACAT90CM-TS-RTN.                                                   
           IF ACAT-SIGN-ON-UPDATE                                               
           AND TWA-ACTION NOT = 'B'                                             
              MOVE 'Y' TO TWA-ACAT90CM-UPDATE-IND                               
           ELSE                                                                 
              MOVE 'N' TO TWA-ACAT90CM-UPDATE-IND.                              
                                                                                
           MOVE 'ACA$'   TO TRAN-ID.                                    02410002
           EXEC CICS DELETEQ TS QUEUE(TSQ-NAME)                         10490002
           END-EXEC.                                                    10500002
                                                                        10510002
           MOVE TWA-MAP-TABLE TO ACAT90CM-TS-AREA.                              
           IF TWA-SCREEN = 'A'                                                  
              MOVE TWA-MCCMNT-X120 TO ACAT90CM-TS-MCCMNT-X120                   
           ELSE                                                                 
           IF TWA-SCREEN = '1'                                                  
              MOVE TWA-M1CMNT-X120 TO ACAT90CM-TS-MCCMNT-X120                   
           ELSE                                                                 
           IF TWA-SCREEN = '2'                                                  
              MOVE TWA-M2CMNT-X120 TO ACAT90CM-TS-MCCMNT-X120                   
           ELSE                                                                 
           IF TWA-SCREEN = '5'                                                  
              MOVE TWA-M5CMNT-X120 TO ACAT90CM-TS-MCCMNT-X120                   
           ELSE                                                                 
           IF TWA-SCREEN = 'M'                                                  
              MOVE TWA-MMCMNT-X120 TO ACAT90CM-TS-MCCMNT-X120                   
           ELSE                                                                 
           IF TWA-SCREEN = 'S'                                                  
              MOVE TWA-MSCMNT-X120 TO ACAT90CM-TS-MCCMNT-X120                   
              MOVE TWA-MDESC       TO ACAT90CM-TS-MNAME                         
CSG001* IN SOME CASES MSD DESCRIPTIONS CONTAIN SPECIAL CHARACTERS.              
CSG001* CORRECT THEM BY REPLACING SPECIAL CHARACTERS WITH SPACES.               
CSG001        MOVE ACAT90CM-TS-MNAME    TO W-ASSET-DESC-TXT                     
CSG001        MOVE 30                   TO W-SUB3                               
CSG001        SET  W-JUST-LEFT-REQ-Y    TO TRUE                                 
CSG001        PERFORM EDIT-ASSET-DESC-TXT                                       
CSG001        MOVE W-ASSET-DESC-TXT     TO ACAT90CM-TS-MNAME                    
              MOVE TWA-MDESC2      TO ACAT90CM-TS-MNAME2                        
CSG001        MOVE ACAT90CM-TS-MNAME2   TO W-ASSET-DESC-TXT                     
CSG001        MOVE 30                   TO W-SUB3                               
CSG001        SET  W-JUST-LEFT-REQ-N    TO TRUE                                 
CSG001        PERFORM EDIT-ASSET-DESC-TXT                                       
CSG001        MOVE W-ASSET-DESC-TXT     TO ACAT90CM-TS-MNAME2                   
              MOVE TWA-MDESC3      TO ACAT90CM-TS-MNAME3                        
CSG001        MOVE ACAT90CM-TS-MNAME3   TO W-ASSET-DESC-TXT                     
CSG001        MOVE 30                   TO W-SUB3                               
CSG001        SET  W-JUST-LEFT-REQ-N    TO TRUE                                 
CSG001        PERFORM EDIT-ASSET-DESC-TXT                                       
CSG001        MOVE W-ASSET-DESC-TXT     TO ACAT90CM-TS-MNAME3                   
           END-IF.                                                              
124700     EXEC CICS WRITEQ TS QUEUE(TSQ-NAME)                          10530002
124800                         FROM(ACAT90CM-TS-AREA)                   10540002
124900                         LENGTH(LENGTH OF ACAT90CM-TS-AREA)       10550002
                               ITEM(ITEM-NUM)                           10560002
125000     END-EXEC.                                                    10570002
125100     IF EIBRESP NOT = +0                                          10580002
              MOVE LOW-VALUE TO ACAT03MO                                        
125200        MOVE 'ACAT03 WRITE TSQ ERROR ON ACA$'                     10590002
125300          TO SYSTEM-MSG                                           10600002
125500     END-IF.                                                      10620002
                                                                                
123600 READ-ACAT90CM-TS-RTN.                                            10350002
           MOVE 'ACA$'   TO TRAN-ID.                                    02410002
           EXEC CICS READQ TS QUEUE(TSQ-NAME)                           10360002
                              INTO(ACAT90CM-TS-AREA)                    10370002
                              LENGTH(LENGTH OF ACAT90CM-TS-AREA)        10380002
                              ITEM(ITEM-NUM)                            10390002
124000     END-EXEC.                                                    10400002
125100     IF EIBRESP = +0                                              10410002
              IF ACAT90CM-TS-SCREEN = 'A'                                       
                 MOVE ACAT90CM-TS-MCCMNT-X120 TO TWA-MCCMNT-X120                
                 MOVE ACAT90CM-TS-MSUBM       TO TWA-MSUBM                      
              ELSE                                                              
              IF ACAT90CM-TS-SCREEN = '1'                                       
                 MOVE ACAT90CM-TS-MCCMNT-X120 TO TWA-M1CMNT-X120                
                 MOVE ACAT90CM-TS-MSUBM       TO TWA-MSUBM                      
              ELSE                                                              
              IF ACAT90CM-TS-SCREEN = '2'                                       
                 MOVE ACAT90CM-TS-MCCMNT-X120 TO TWA-M2CMNT-X120                
                 MOVE ACAT90CM-TS-MSUBM       TO TWA-MSUBM                      
              ELSE                                                              
              IF ACAT90CM-TS-SCREEN = '5'                                       
                 MOVE ACAT90CM-TS-MCCMNT-X120 TO TWA-M5CMNT-X120                
                 MOVE ACAT90CM-TS-MSUBM       TO TWA-MSUBM                      
              ELSE                                                              
              IF ACAT90CM-TS-SCREEN = 'M'                                       
                 MOVE ACAT90CM-TS-MCCMNT-X120 TO TWA-MMCMNT-X120                
                 MOVE ACAT90CM-TS-MSUBM       TO TWA-MSUBM                      
              ELSE                                                              
              IF ACAT90CM-TS-SCREEN = 'S'                                       
                 MOVE ACAT90CM-TS-MCCMNT-X120 TO TWA-MSCMNT-X120                
                 MOVE ACAT90CM-TS-MSUBM       TO TWA-MSUBM                      
              ELSE                                                              
              IF ACAT90CM-TS-SCREEN = 'T'                                       
                 MOVE ACAT90CM-TS-MCTYPE TO TWA-MCTYPE                          
           END-IF.                                                              
           MOVE SPACES   TO TWA-SCREEN.                                         
           MOVE 'ACAX'   TO TRAN-ID.                                    02410002
108300 EJECT                                                            08590002
108400                                                                  08600002
108500 PAGE-FORWARD-RTN.                                                08610002
           MOVE TWA-CLIENT-NO-X   TO ACAT03IO-CLIENT-NBR.                       
           MOVE ACAT-ADP-BROKER   TO ACAT03IO-RCV-NBR.                          
LRM021     IF TWA-INP-TFR-TYP = 'PTF'                                           
LRM021        MOVE 'PTF'          TO ACAT03IO-TRNFR-TYPE-CD                     
LRM021     ELSE                                                                 
              MOVE 'PTR'          TO ACAT03IO-TRNFR-TYPE-CD.                    
           MOVE TWA-CLIENT-NO-X   TO ACAT03IO-CLIENT-NBR.                       
LRM007     MOVE TWA-CONTROL-NBR   TO ACAT03IO-CONTROL-NBR.                      
           MOVE TWA-MCBRKR        TO ACAT03IO-DLVR-NBR.                         
           MOVE TWA-MCACCT        TO ACAT03IO-DLVR-ACCT.                        
           MOVE ACAT-ADP-BROKER   TO ACAT03IO-RCV-NBR.                          
           MOVE TWA-MBR           TO ACAT03IO-RCV-ACCT.                         
           MOVE TWA-MAC           TO ACAT03IO-RCV-ACCT(4 : 5).                  
           MOVE TWA-CURRENT-ASSET-KEY TO ACAT03IO-CURRENT-ASSET-KEY             
                                         ACAT03IO-KEY-FIELDS.                   
           MOVE TWA-MSLOC TO ACAT03IO-CURRENT-SLOC.                             
LRM030     MOVE TWA-ORIG-TYPE TO ACAT03IO-CURRENT-TYPE.                         
                                                                                
           SET ACAT03IO-IT-READ-NEXTS TO TRUE                                   
           PERFORM LINK-TO-ACAT03IO-RTN.                                        
           IF ACAT03IO-NOT-FOUND                                                
              IF (EIBAID = DFHPF7 OR DFHPF8)                                    
                 CONTINUE                                                       
              ELSE                                                              
                 MOVE 'BOTTOM OF ASSET DATA' TO SYSTEM-MSG                      
                 PERFORM  ERROR-RTN                                     03650002
           ELSE                                                                 
           IF NOT ACAT03IO-FOUND                                                
              MOVE LOW-VALUE TO ACAT03MO                                03620002
              MOVE 'NX-AS'           TO WS-DB2-PROBLEM-FUNCTION                 
              MOVE ACAT03IO-SQLCAID  TO WS-DB2-PROBLEM-TABLE                    
              MOVE ACAT03IO-SQLCODE  TO WS-DB2-PROBLEM-ID                       
              MOVE WS-DB2-PROBLEM-MSG TO SYSTEM-MSG                             
              PERFORM DB2-ERROR-RTN.                                            
                                                                                
           MOVE 'C' TO TWA-SECR-ACTION.                                         
           PERFORM MOVE-ACAT03IO-ASSET-TO-TWA.                                  
           PERFORM REFORMAT-SCREEN-ASSET.                                       
           MOVE SPACES TO TWA-INTRAN-FLAG.                                      
           PERFORM PROCESS-MAP-ITEMS THRU PROCESS-MAP-ITEMS-EXIT.               
           IF TWA-ACTION = 'B'                                                  
              CONTINUE                                                          
           ELSE                                                                 
           IF EIBAID = DFHPF7                                                   
LRM021        IF TWA-INP-TFR-TYP = 'PTF'                                        
LRM021           MOVE 'PRIOR PTR TIF DISPLAYED' TO SYSTEM-MSG                   
LRM021        ELSE                                                              
                 MOVE 'PRIOR PTR TIF DISPLAYED' TO SYSTEM-MSG                   
           ELSE                                                                 
           IF EIBAID = DFHPF8                                                   
LRM021        IF TWA-INP-TFR-TYP = 'PTF'                                        
LRM021           MOVE 'NEXT PTF TIF DISPLAYED' TO SYSTEM-MSG                    
LRM021        ELSE                                                              
                 MOVE 'NEXT PTR TIF DISPLAYED' TO SYSTEM-MSG                    
           ELSE                                                                 
              MOVE 'NEXT ASSET DISPLAYED' TO SYSTEM-MSG.                        
           PERFORM SEND-MAP-DATA-ONLY.                                  10250002
           PERFORM WRITE-TSQ-RTN.                                       10790002
           PERFORM RETURN-TO-CICS.                                      08350002
                                                                        08960002
       BROWSE-ASSET-RTN.                                                        
           MOVE TWA-CLIENT-NO-X   TO ACAT03IO-CLIENT-NBR.                       
LRM007     MOVE TWA-CONTROL-NBR   TO ACAT03IO-CONTROL-NBR.                      
           MOVE ACAT-ADP-BROKER   TO ACAT03IO-RCV-NBR.                          
LRM021     IF TWA-INP-TFR-TYP = 'PTF'                                           
LRM021        MOVE 'PTF'          TO ACAT03IO-TRNFR-TYPE-CD                     
LRM021     ELSE                                                                 
              MOVE 'PTR'          TO ACAT03IO-TRNFR-TYPE-CD.                    
           MOVE TWA-CLIENT-NO-X   TO ACAT03IO-CLIENT-NBR.                       
           MOVE TWA-MCBRKR        TO ACAT03IO-DLVR-NBR.                         
           MOVE TWA-MCACCT        TO ACAT03IO-DLVR-ACCT.                        
           MOVE ACAT-ADP-BROKER   TO ACAT03IO-RCV-NBR.                          
           MOVE TWA-MBR           TO ACAT03IO-RCV-ACCT.                         
           MOVE TWA-MAC           TO ACAT03IO-RCV-ACCT(4 : 5).                  
******* WHEN THE USER CHANGES CUSIP/ADP/SYMBOL ON SCREEN, TRY TO OBTAIN         
******* THE ASSOCIATED CUSIP NBR TO USE FOR BROWSING. IF NOT FOUND, USE         
******* THIS FIELD ASIS (EG. 123 ) AS THE STARTING POINT.                       
           IF TWA-MSECR NOT = TWA-ORIG-MSECR                                    
              SET ACATMSD-MSD-READ TO TRUE                                      
              MOVE TWA-MSECR TO ACATMSD-SEARCH-KEY                              
              PERFORM LINK-TO-ACATMSDIO-RTN                                     
              IF ACATMSD-FOUND                                                  
                 MOVE ACATMSD-CUSIP   TO ACAT03IO-CURRENT-SECR                  
              ELSE                                                              
                 MOVE TWA-MSECR TO ACAT03IO-CURRENT-SECR                02030002
           ELSE                                                                 
              MOVE TWA-MSECR TO ACAT03IO-CURRENT-SECR                   02030002
           END-IF.                                                              
                                                                                
           MOVE TWA-MSLOC TO ACAT03IO-CURRENT-SLOC.                             
           IF TWA-MTYPE = '1'                                                   
              SET ACAT03IO-CASH-ASSET TO TRUE                                   
           ELSE                                                                 
           IF TWA-MTYPE = '2'                                                   
              SET ACAT03IO-MARGIN-ASSET TO TRUE                                 
           ELSE                                                                 
           IF TWA-MTYPE = '5'                                                   
              SET ACAT03IO-SHORT-ASSET TO TRUE                                  
           ELSE                                                                 
              MOVE SPACES TO ACAT03IO-CSH-MGN-SHRT-CD                           
           END-IF.                                                              
           MOVE ACAT03IO-CSH-MGN-SHRT-CD TO WS-TYPE.                    02030002
LRM***** BACK SUBTRACT 1 BIT FROM TYPE (LAST KEY FIELD) TO CAUSE                
******** GREATER THEN LOGIC TO READ PROPPER RECORD.                             
TEMP*******COMPUTE WS-TYPE-9 = WS-TYPE-9 - 1.                                   
           MOVE WS-TYPE TO ACAT03IO-CURRENT-TYPE.                       02030002
                                                                                
           SET ACAT03IO-IT-READ-NEXTS TO TRUE                                   
           PERFORM LINK-TO-ACAT03IO-RTN.                                        
           IF ACAT03IO-NOT-FOUND                                                
              MOVE 'BOTTOM OF ASSET DATA' TO SYSTEM-MSG                         
              PERFORM  ERROR-RTN                                        03650002
           ELSE                                                                 
           IF NOT ACAT03IO-FOUND                                                
              MOVE LOW-VALUE TO ACAT03MO                                03620002
              MOVE 'BR-AS'           TO WS-DB2-PROBLEM-FUNCTION                 
              MOVE ACAT03IO-SQLCAID  TO WS-DB2-PROBLEM-TABLE                    
              MOVE ACAT03IO-SQLCODE  TO WS-DB2-PROBLEM-ID                       
              MOVE WS-DB2-PROBLEM-MSG TO SYSTEM-MSG                             
              PERFORM DB2-ERROR-RTN.                                            
                                                                                
           PERFORM MOVE-ACAT03IO-ASSET-TO-TWA.                                  
           PERFORM REFORMAT-SCREEN-ASSET.                                       
           MOVE SPACES TO TWA-INTRAN-FLAG.                                      
           PERFORM PROCESS-MAP-ITEMS THRU PROCESS-MAP-ITEMS-EXIT.               
                                                                                
LRM030*****IF ACAT03IO-ISIN-SEC-ISSUE-CD NOT = ACAT03IO-CURRENT-SECR    02030002
LRM030     IF ACAT03IO-KEY-FIELDS NOT = ACAT03IO-CURRENT-ASSET-KEY      02030002
           OR ACAT03IO-STTLM-LCTN-CD     NOT = ACAT03IO-CURRENT-SLOC            
           OR ACAT03IO-CSH-MGN-SHRT-CD   NOT = ACAT03IO-CURRENT-TYPE            
              MOVE 'NEXT ASSET NOT FOUND; GENERIC BROWSE ASSUMED'               
                  TO SYSTEM-MSG                                                 
           ELSE                                                                 
              MOVE 'NEXT ASSET DISPLAYED' TO SYSTEM-MSG                         
           END-IF.                                                              
           PERFORM SEND-MAP-DATA-ONLY.                                  10250002
           PERFORM WRITE-TSQ-RTN.                                       10790002
           PERFORM RETURN-TO-CICS.                                      08350002
                                                                        08960002
111200     EJECT                                                        08970002
111300                                                                  08980002
111400 PAGE-BACKWARD-RTN.                                               08990002
           MOVE TWA-CLIENT-NO-X   TO ACAT03IO-CLIENT-NBR.                       
LRM007     MOVE TWA-CONTROL-NBR   TO ACAT03IO-CONTROL-NBR.                      
           MOVE ACAT-ADP-BROKER   TO ACAT03IO-RCV-NBR.                          
LRM021     IF TWA-INP-TFR-TYP = 'PTF'                                           
LRM021        MOVE 'PTF'          TO ACAT03IO-TRNFR-TYPE-CD                     
LRM021     ELSE                                                                 
              MOVE 'PTR'          TO ACAT03IO-TRNFR-TYPE-CD.                    
           MOVE TWA-CLIENT-NO-X   TO ACAT03IO-CLIENT-NBR.                       
           MOVE TWA-MCBRKR        TO ACAT03IO-DLVR-NBR.                         
           MOVE TWA-MCACCT        TO ACAT03IO-DLVR-ACCT.                        
           MOVE ACAT-ADP-BROKER   TO ACAT03IO-RCV-NBR.                          
           MOVE TWA-MBR           TO ACAT03IO-RCV-ACCT.                         
           MOVE TWA-MAC           TO ACAT03IO-RCV-ACCT(4 : 5).                  
           MOVE TWA-CURRENT-ASSET-KEY TO ACAT03IO-CURRENT-ASSET-KEY             
LRM030                                   ACAT03IO-KEY-FIELDS.                   
           MOVE TWA-MSLOC TO ACAT03IO-CURRENT-SLOC.                             
LRM030     MOVE TWA-ORIG-TYPE TO ACAT03IO-CURRENT-TYPE.                         
                                                                                
           SET ACAT03IO-IT-READ-PREV4 TO TRUE                                   
           PERFORM LINK-TO-ACAT03IO-RTN.                                        
           IF ACAT03IO-NOT-FOUND                                                
              MOVE 'TOP OF ASSET DATA' TO SYSTEM-MSG                            
              PERFORM  ERROR-RTN                                        03650002
           ELSE                                                                 
           IF NOT ACAT03IO-FOUND                                                
              MOVE LOW-VALUE TO ACAT03MO                                03620002
              MOVE 'PR-AS'           TO WS-DB2-PROBLEM-FUNCTION                 
              MOVE ACAT03IO-SQLCAID  TO WS-DB2-PROBLEM-TABLE                    
              MOVE ACAT03IO-SQLCODE  TO WS-DB2-PROBLEM-ID                       
              MOVE WS-DB2-PROBLEM-MSG TO SYSTEM-MSG                             
              PERFORM DB2-ERROR-RTN.                                            
                                                                                
LRM028     MOVE 'C' TO TWA-SECR-ACTION.                                         
           PERFORM MOVE-ACAT03IO-ASSET-TO-TWA.                                  
           PERFORM REFORMAT-SCREEN-ASSET.                                       
           PERFORM PROCESS-MAP-ITEMS THRU PROCESS-MAP-ITEMS-EXIT.               
           MOVE 'PREV ASSET DISPLAYED' TO SYSTEM-MSG.                           
           PERFORM SEND-MAP-DATA-ONLY.                                  10250002
           PERFORM WRITE-TSQ-RTN.                                       10790002
           PERFORM RETURN-TO-CICS.                                      08350002
                                                                        08960002
           EJECT                                                        09240002
033800 PAGE-FORWARD-TIF.                                                03920002
           MOVE TWA-CLIENT-NO-X   TO ACAT03IO-CLIENT-NBR.                       
LRM007     MOVE TWA-CONTROL-NBR   TO ACAT03IO-CONTROL-NBR.                      
           MOVE ACAT-ADP-BROKER   TO ACAT03IO-RCV-NBR.                          
LRM021     IF TWA-INP-TFR-TYP = 'PTF'                                           
LRM021        MOVE 'PTF'          TO ACAT03IO-TRNFR-TYPE-CD                     
LRM021     ELSE                                                                 
              MOVE 'PTR'          TO ACAT03IO-TRNFR-TYPE-CD.                    
           MOVE TWA-CLIENT-NO-X   TO ACAT03IO-CLIENT-NBR.                       
           MOVE TWA-MCBRKR        TO ACAT03IO-DLVR-NBR.                         
           MOVE TWA-MCACCT        TO ACAT03IO-DLVR-ACCT.                        
           MOVE ACAT-ADP-BROKER   TO ACAT03IO-RCV-NBR.                          
           MOVE TWA-MBR           TO ACAT03IO-RCV-ACCT.                         
           MOVE TWA-MAC           TO ACAT03IO-RCV-ACCT(4 : 5).                  
           MOVE TWA-CURRENT-ASSET-KEY TO ACAT03IO-CURRENT-ASSET-KEY.            
                                                                                
           SET ACAT03IO-IT-READ-NEXTA TO TRUE                                   
           PERFORM LINK-TO-ACAT03IO-RTN.                                        
           IF ACAT03IO-NOT-FOUND                                                
              MOVE 'BOTTOM OF TIF(S) FOR BRANCH/ACCOUNT' TO SYSTEM-MSG          
              PERFORM  ERROR-RTN                                        03650002
           ELSE                                                                 
           IF NOT ACAT03IO-FOUND                                                
              MOVE LOW-VALUE TO ACAT03MO                                03620002
              MOVE 'NX-AC'           TO WS-DB2-PROBLEM-FUNCTION                 
              MOVE ACAT03IO-SQLCAID  TO WS-DB2-PROBLEM-TABLE                    
              MOVE ACAT03IO-SQLCODE  TO WS-DB2-PROBLEM-ID                       
              MOVE WS-DB2-PROBLEM-MSG TO SYSTEM-MSG                             
              PERFORM DB2-ERROR-RTN.                                            
                                                                                
           SET TWA-INTRAN-BRW TO TRUE.                                          
           PERFORM MOVE-ACAT03IO-TO-TWA-RTN.                                    
           PERFORM REFORMAT-SCREEN-DETAIL.                                      
           MOVE SPACES TO TWA-CURRENT-ASSET-KEY                         02030002
                          TWA-ASSET-AREA.                                       
           MOVE ' ' TO TWA-SECR-ACTION                                          
           INITIALIZE ACAT03IO-PT-ASSET-FIELDS.                                 
           PERFORM PAGE-FORWARD-RTN.                                            
                                                                                
033800 PAGE-BACKWARD-TIF.                                               03920002
           MOVE TWA-CLIENT-NO-X   TO ACAT03IO-CLIENT-NBR.                       
LRM007     MOVE TWA-CONTROL-NBR   TO ACAT03IO-CONTROL-NBR.                      
           MOVE ACAT-ADP-BROKER   TO ACAT03IO-RCV-NBR.                          
LRM021     IF TWA-INP-TFR-TYP = 'PTF'                                           
LRM021        MOVE 'PTF'          TO ACAT03IO-TRNFR-TYPE-CD                     
LRM021     ELSE                                                                 
              MOVE 'PTR'          TO ACAT03IO-TRNFR-TYPE-CD.                    
           MOVE TWA-CLIENT-NO-X   TO ACAT03IO-CLIENT-NBR.                       
           MOVE TWA-MCBRKR        TO ACAT03IO-DLVR-NBR.                         
           MOVE TWA-MCACCT        TO ACAT03IO-DLVR-ACCT.                        
           MOVE ACAT-ADP-BROKER   TO ACAT03IO-RCV-NBR.                          
           MOVE TWA-MBR           TO ACAT03IO-RCV-ACCT.                         
           MOVE TWA-MAC           TO ACAT03IO-RCV-ACCT(4 : 5).                  
           MOVE TWA-CURRENT-ASSET-KEY TO ACAT03IO-CURRENT-ASSET-KEY.            
                                                                                
           SET ACAT03IO-IT-READ-PREV1 TO TRUE                                   
           PERFORM LINK-TO-ACAT03IO-RTN.                                        
           IF ACAT03IO-NOT-FOUND                                                
              MOVE 'TOP OF TIF(S) FOR BRANCH/ACCOUNT' TO SYSTEM-MSG             
              PERFORM  ERROR-RTN                                        03650002
           ELSE                                                                 
           IF NOT ACAT03IO-FOUND                                                
              MOVE LOW-VALUE TO ACAT03MO                                03620002
              MOVE 'PV-AC'           TO WS-DB2-PROBLEM-FUNCTION                 
              MOVE ACAT03IO-SQLCAID  TO WS-DB2-PROBLEM-TABLE                    
              MOVE ACAT03IO-SQLCODE  TO WS-DB2-PROBLEM-ID                       
              MOVE WS-DB2-PROBLEM-MSG TO SYSTEM-MSG                             
              PERFORM DB2-ERROR-RTN.                                            
                                                                                
           SET TWA-INTRAN-BRW TO TRUE.                                          
           PERFORM MOVE-ACAT03IO-TO-TWA-RTN.                                    
           PERFORM REFORMAT-SCREEN-DETAIL.                                      
           MOVE SPACES TO TWA-CURRENT-ASSET-KEY                         02030002
                          TWA-ASSET-AREA.                                       
           MOVE ' ' TO TWA-SECR-ACTION                                          
           INITIALIZE ACAT03IO-PT-ASSET-FIELDS.                                 
           PERFORM PAGE-FORWARD-RTN.                                            
                                                                        09250002
           EJECT                                                        09870002
       LINK-TO-ACATNAIO-RTN.                                                    
00442      EXEC CICS LINK PROGRAM (WS-ACATNAIO)                         02890002
                COMMAREA(ACATNAIO-CALL-AREA)                            02900002
00443           LENGTH(LENGTH OF ACATNAIO-CALL-AREA)                    02910002
           END-EXEC.                                                    02920002
                                                                                
       LINK-TO-ACATPPIO-RTN.                                                    
00442      EXEC CICS LINK PROGRAM (WS-ACATPPIO)                         02890002
                COMMAREA(ACATPPIO-CALL-AREA)                            02900002
00443           LENGTH(LENGTH OF ACATPPIO-CALL-AREA)                    02910002
           END-EXEC.                                                    02920002
                                                                                
       LINK-TO-ACATMSDIO-RTN.                                                   
00442      EXEC CICS LINK PROGRAM (WS-ACATMSD)                          02890002
                COMMAREA(ACATMSDIO-CALL-AREA)                           02900002
00443           LENGTH(LENGTH OF ACATMSDIO-CALL-AREA)                   02910002
           END-EXEC.                                                    02920002
                                                                                
       LINK-TO-ACATRSTIO-RTN.                                                   
00442      EXEC CICS LINK PROGRAM (WS-ACATRST)                          02890002
                COMMAREA(ACATRSTIO-CALL-AREA)                           02900002
00443           LENGTH(LENGTH OF ACATRSTIO-CALL-AREA)                   02910002
           END-EXEC.                                                    02920002
                                                                                
       LINK-TO-ACAT03IO-RTN.                                                    
           MOVE ACAT-SUPER-SIGN-ON-SEC-FLAG                                     
                    TO ACAT03IO-SUPER-SIGN-FLAG.                                
00442      EXEC CICS LINK PROGRAM (WS-ACAT03DB)                         02890002
                COMMAREA(ACAT03IO-CALL-AREA)                            02900002
00443           LENGTH(LENGTH OF ACAT03IO-CALL-AREA)                    02910002
           END-EXEC.                                                    02920002
       UPDATE-ACAT-IT-RTN.                                                      
LRM003        MOVE ACAT-SIGN-ON-ID TO ACAT03IO-SIGN-ON-ID.                      
              IF TWA-ACTION = 'A'                                               
                 PERFORM CREATE-ACAT-IT-RECORD                                  
              ELSE                                                              
              MOVE TWA-CURRENT-ASSET-KEY TO ACAT03IO-CURRENT-ASSET-KEY  02030002
LRM030        MOVE TWA-ORIG-TYPE         TO ACAT03IO-CURRENT-TYPE               
              IF TWA-ACTION = 'C'                                               
                 IF TWA-MDEL = 'Y'                                              
                    PERFORM DELETE-ACAT-IT-RECORD                               
                 ELSE                                                           
                    PERFORM UPDATE-ACAT-IT-RECORD                               
              END-IF END-IF END-IF.                                             
                                                                                
           EJECT                                                        09870002
       CREATE-ACAT-IT-RECORD.                                                   
           SET ACAT03IO-IT-ISRT TO TRUE.                                        
           MOVE TWA-CLIENT-NO-X   TO ACAT03IO-CLIENT-NBR.                       
           MOVE TWA-MCBRKR        TO ACAT03IO-DLVR-NBR.                         
           MOVE TWA-MCACCT        TO ACAT03IO-DLVR-ACCT.                        
           MOVE ACAT-ADP-BROKER   TO ACAT03IO-RCV-NBR.                          
           MOVE TWA-MBR           TO ACAT03IO-RCV-ACCT.                         
           MOVE TWA-MAC           TO ACAT03IO-RCV-ACCT(4 : 5).                  
LRM021     IF TWA-PRTCP-TYPE-CD = '3'                                           
LRM021        MOVE 'PTF'             TO ACAT03IO-TRNFR-TYPE-CD                  
LRM021     ELSE                                                                 
              MOVE 'PTR'             TO ACAT03IO-TRNFR-TYPE-CD.                 
           MOVE TWA-MCCMNT-X120   TO ACAT03IO-CMNT-TXT.                         
           MOVE TWA-M1CMNT-X120   TO ACAT03IO-ASSET-CMNT1-TXT.                  
           MOVE TWA-M2CMNT-X120   TO ACAT03IO-ASSET-CMNT2-TXT.                  
           MOVE TWA-M5CMNT-X120   TO ACAT03IO-ASSET-CMNT5-TXT.                  
           MOVE TWA-MMCMNT-X120   TO ACAT03IO-ASSET-CMNTM-TXT.                  
LRM007     MOVE TWA-DUPE-FOUND    TO ACAT03IO-DUPE-FOUND.                       
           IF ACAT-OCC-BROKER > SPACES                                          
              MOVE '0'             TO ACAT03IO-RCV-OCC-BRKR-NBR(1 : 1)          
              MOVE ACAT-OCC-BROKER TO ACAT03IO-RCV-OCC-BRKR-NBR(2 : 4)          
           ELSE                                                                 
              MOVE SPACES          TO ACAT03IO-RCV-OCC-BRKR-NBR.                
           MOVE TWA-MRR           TO ACAT03IO-RR-CD.                    02030002
           MOVE TWA-MCTYPE        TO ACAT03IO-RCV-ACCT-TYPE-CD.         02030002
           MOVE TWA-MNAME         TO ACAT03IO-RCV-CUST-NM.              02030002
           MOVE TWA-MNAME2        TO ACAT03IO-RCV-CUST-NM(31 : 30).     02030002
           MOVE TWA-MSSN(1 : 3)   TO ACAT03IO-RCV-SS-PRIM-NBR(1 : 3).   02030002
           MOVE TWA-MSSN(5 : 2)   TO ACAT03IO-RCV-SS-PRIM-NBR(4 : 2).   02030002
           MOVE TWA-MSSN(8 : 4)   TO ACAT03IO-RCV-SS-PRIM-NBR(6 : 4).   02030002
           IF TWA-MSSN2(1 : 1) NOT GREATER SPACES                               
              MOVE SPACES           TO ACAT03IO-RCV-SS-SCNDY-NBR                
           ELSE                                                                 
              MOVE TWA-MSSN2(1 : 3) TO ACAT03IO-RCV-SS-SCNDY-NBR(1 : 3)         
              MOVE TWA-MSSN2(5 : 2) TO ACAT03IO-RCV-SS-SCNDY-NBR(4 : 2)         
              MOVE TWA-MSSN2(8 : 4) TO ACAT03IO-RCV-SS-SCNDY-NBR(6 : 4)         
           END-IF.                                                              
           IF TWA-MSUBM = 'Y'                                           02030002
              SET ACAT03IO-NSCC-SUBMIT-ELIGABLE TO TRUE                         
           ELSE                                                                 
              SET ACAT03IO-NSCC-SUBMIT-HOLD     TO TRUE.                        
                                                                                
LRM021     IF TWA-PRTCP-TYPE-CD = '3'                                           
LRM021        MOVE 'PTF' TO ACAT03IO-TRNFR-TYPE-CD                              
LRM021     ELSE                                                                 
              MOVE 'PTR' TO ACAT03IO-TRNFR-TYPE-CD.                             
           MOVE ' ' TO ACAT03IO-ACCT-RJCT-RSBM-IND.                             
LRM030     IF TWA-ISIN-USED = 'I'                                               
LRM030        MOVE TWA-MSECR(1:2) TO ACAT03IO-ISIN-CNTRY-CD                     
LRM030        MOVE TWA-MSECR(3:9) TO ACAT03IO-ISIN-SEC-ISSUE-CD                 
LRM030        MOVE TWA-MSECR(12:1) TO ACAT03IO-ISIN-SEC-CDG-CD                  
LRM030     ELSE                                                                 
              MOVE 'US' TO ACAT03IO-ISIN-CNTRY-CD                               
              MOVE TWA-MSECR TO ACAT03IO-ISIN-SEC-ISSUE-CD                      
              MOVE SPACES TO ACAT03IO-ISIN-SEC-CDG-CD                           
LRM030     END-IF.                                                              
LRM030     MOVE ACAT03IO-KEY-FIELDS TO TWA-CURRENT-ASSET-KEY.                   
LRM030        MOVE TWA-ORIG-TYPE         TO ACAT03IO-CURRENT-TYPE               
           MOVE TWA-MSLOC  TO ACAT03IO-STTLM-LCTN-CD.                           
           MOVE TWA-ADP-NBR TO ACAT03IO-ADP-NBR.                                
           MOVE TWA-MCATGR  TO ACAT03IO-ASSET-PRC-CTGY-CD.                      
           MOVE 'P' TO ACAT03IO-ASSET-RQST-QTY-CD.                              
    **** SET ACAT03IO-PSTN-CD BASED ON POSITIVE OR NEGATIVE QTY BELOW.          
           IF TWA-MQTY-9 < ZERO                                                 
LRM028     OR TWA-MQTY = 'SHORT'                                                
              SET ACAT03IO-SHORT-ASSET-QTY TO TRUE                              
           ELSE                                                                 
           IF TWA-MQTY-9 > ZERO                                                 
LRM009     OR TWA-MCD = 'F'                                                     
              SET ACAT03IO-LONG-ASSET-QTY TO TRUE                               
           ELSE                                                                 
              SET ACAT03IO-NA-ASSET-QTY TO TRUE                                 
           END-IF.                                                              
                                                                                
           MOVE ZEROS              TO ACAT03IO-ASSET-AMT                        
                                      ACAT03IO-ASSET-QTY                        
                                      ACAT03IO-ASSET-PCT.                       
                                                                                
           IF TWA-MQTY-9 LESS ZERO                                              
              COMPUTE WS-MQTY-9-UNSIGNED =  TWA-MQTY-9 * -1                     
              END-COMPUTE                                                       
           ELSE                                                                 
              MOVE TWA-MQTY-9      TO WS-MQTY-9-UNSIGNED                        
           END-IF.                                                              
           IF TWA-MCD = 'V'                                                     
              SET ACAT03IO-RQST-ASSET-AMT TO TRUE                               
              MOVE WS-MQTY-9-UNSIGNED TO ACAT03IO-ASSET-AMT                     
           ELSE                                                                 
           IF TWA-MCD = 'P'                                                     
              SET ACAT03IO-RQST-ASSET-QTY TO TRUE                               
              MOVE WS-MQTY-9-UNSIGNED TO ACAT03IO-ASSET-QTY                     
           ELSE                                                                 
           IF TWA-MCD = '%'                                                     
              SET ACAT03IO-RQST-ASSET-PCT TO TRUE                               
              MOVE WS-MQTY-9-UNSIGNED TO ACAT03IO-ASSET-PCT                     
              IF WS-MQTY-9-UNSIGNED = 100                                       
                 MOVE 'F' TO ACAT03IO-ASSET-RQST-QTY-CD                         
              END-IF                                                            
           ELSE                                                                 
LRM009        MOVE SPACES TO ACAT03IO-AST-RQST-TRANS-CD                         
LRM009        MOVE 'F' TO ACAT03IO-ASSET-RQST-QTY-CD                            
LRM009        MOVE ZEROS           TO ACAT03IO-ASSET-QTY                        
           END-IF.                                                              
           IF TWA-MTYPE = '1'                                                   
              SET ACAT03IO-CASH-ASSET TO TRUE                                   
           ELSE                                                                 
           IF TWA-MTYPE = '2'                                                   
              SET ACAT03IO-MARGIN-ASSET TO TRUE                                 
           ELSE                                                                 
           IF TWA-MTYPE = '5'                                                   
              SET ACAT03IO-SHORT-ASSET TO TRUE                                  
           ELSE                                                                 
              MOVE SPACES TO ACAT03IO-CSH-MGN-SHRT-CD                           
           END-IF.                                                              
                                                                                
           MOVE TWA-MWI         TO ACAT03IO-WHI-CD.                             
           MOVE TWA-MDESC-GROUP TO ACAT03IO-DESC-TXT.                           
LRM012     IF TWA-ADP-NBR > SPACES                                              
LRM012        MOVE 'ADP-SEC:'  TO ACAT03IO-DESC-TXT(121 : 8)                    
LRM012        MOVE TWA-ADP-NBR TO ACAT03IO-DESC-TXT(129 : 7)                    
LRM012     END-IF.                                                              
                                                                                
CSG001* IN SOME CASES MSD DESCRIPTIONS CONTAIN SPECIAL CHARACTERS.              
CSG001* CORRECT THEM BY REPLACING SPECIAL CHARACTERS WITH SPACES.               
CSG001     MOVE ACAT03IO-DESC-TXT          TO W-ASSET-DESC-TXT-GRP              
CSG001                                                                          
CSG001     MOVE W-ASSET-DESC1-TXT          TO W-ASSET-DESC-TXT                  
CSG001     MOVE 30                         TO W-SUB3                            
CSG001     SET  W-JUST-LEFT-REQ-Y          TO TRUE                              
CSG001     PERFORM EDIT-ASSET-DESC-TXT                                          
CSG001     MOVE W-ASSET-DESC-TXT           TO W-ASSET-DESC1-TXT                 
CSG001     MOVE W-ASSET-DESC2-TXT          TO W-ASSET-DESC-TXT                  
CSG001     MOVE 30                         TO W-SUB3                            
CSG001     SET  W-JUST-LEFT-REQ-N          TO TRUE                              
CSG001     PERFORM EDIT-ASSET-DESC-TXT                                          
CSG001     MOVE W-ASSET-DESC-TXT           TO W-ASSET-DESC2-TXT                 
CSG001     MOVE W-ASSET-DESC3-TXT          TO W-ASSET-DESC-TXT                  
CSG001     MOVE 30                         TO W-SUB3                            
CSG001     SET  W-JUST-LEFT-REQ-N          TO TRUE                              
CSG001     PERFORM EDIT-ASSET-DESC-TXT                                          
CSG001     MOVE W-ASSET-DESC-TXT           TO W-ASSET-DESC3-TXT                 
CSG001     MOVE W-ASSET-DESC4-TXT          TO W-ASSET-DESC-TXT                  
CSG001     MOVE 30                         TO W-SUB3                            
CSG001     SET  W-JUST-LEFT-REQ-N          TO TRUE                              
CSG001     PERFORM EDIT-ASSET-DESC-TXT                                          
CSG001     MOVE W-ASSET-DESC-TXT           TO W-ASSET-DESC4-TXT                 
CSG001     MOVE W-ASSET-DESC5-TXT          TO W-ASSET-DESC-TXT                  
CSG001     MOVE 20                         TO W-SUB3                            
CSG001     SET  W-JUST-LEFT-REQ-N          TO TRUE                              
CSG001     PERFORM EDIT-ASSET-DESC-TXT                                          
CSG001     MOVE W-ASSET-DESC-TXT           TO W-ASSET-DESC5-TXT                 
CSG001                                                                          
CSG001     MOVE W-ASSET-DESC-TXT-GRP       TO ACAT03IO-DESC-TXT                 
CSG001                                                                          
           IF TWA-MBAL01-9 < ZERO                                               
              SET ACAT03IO-AMT-01-CREDIT TO TRUE                                
              COMPUTE WS-MQTY-9-UNSIGNED =  TWA-MBAL01-9 * -1                   
              END-COMPUTE                                                       
              MOVE WS-MQTY-9-UNSIGNED TO ACAT03IO-AMT-01                        
           ELSE                                                                 
              MOVE SPACES TO ACAT03IO-AMT-01-CREDIT-IND                         
              MOVE TWA-MBAL01-9    TO ACAT03IO-AMT-01                           
           END-IF.                                                              
LRM011     IF  TWA-MBAL01 = 'FULL'                                              
LRM011        MOVE 'F' TO ACAT03IO-AMT-01-RQST-CD                               
LRM011        MOVE ' ' TO ACAT03IO-AMT-01-CREDIT-IND                            
LRM011     ELSE                                                                 
LRM011     IF TWA-MBAL01 = 'FULL-'                                              
LRM011        MOVE 'F' TO ACAT03IO-AMT-01-RQST-CD                               
LRM011        MOVE 'C' TO ACAT03IO-AMT-01-CREDIT-IND                            
LRM011     ELSE                                                                 
LRM011        MOVE 'P' TO ACAT03IO-AMT-01-RQST-CD                               
LRM011     END-IF.                                                              
                                                                                
           IF TWA-MBAL02-9 < ZERO                                               
              SET ACAT03IO-AMT-02-CREDIT TO TRUE                                
              COMPUTE WS-MQTY-9-UNSIGNED =  TWA-MBAL02-9 * -1                   
              END-COMPUTE                                                       
              MOVE WS-MQTY-9-UNSIGNED TO ACAT03IO-AMT-02                        
           ELSE                                                                 
              MOVE SPACES TO ACAT03IO-AMT-02-CREDIT-IND                         
              MOVE TWA-MBAL02-9    TO ACAT03IO-AMT-02                           
           END-IF.                                                              
LRM011     IF  TWA-MBAL02 = 'FULL'                                              
LRM011        MOVE 'F' TO ACAT03IO-AMT-02-RQST-CD                               
LRM011        MOVE ' ' TO ACAT03IO-AMT-02-CREDIT-IND                            
LRM011     ELSE                                                                 
LRM011     IF TWA-MBAL02 = 'FULL-'                                              
LRM011        MOVE 'F' TO ACAT03IO-AMT-02-RQST-CD                               
LRM011        MOVE 'C' TO ACAT03IO-AMT-02-CREDIT-IND                            
LRM011     ELSE                                                                 
LRM011        MOVE 'P' TO ACAT03IO-AMT-02-RQST-CD                               
LRM011     END-IF.                                                              
                                                                                
           IF TWA-MBAL05-9 < ZERO                                               
              SET ACAT03IO-AMT-05-CREDIT TO TRUE                                
              COMPUTE WS-MQTY-9-UNSIGNED =  TWA-MBAL05-9 * -1                   
              END-COMPUTE                                                       
              MOVE WS-MQTY-9-UNSIGNED TO ACAT03IO-AMT-05                        
           ELSE                                                                 
              MOVE SPACES TO ACAT03IO-AMT-05-CREDIT-IND                         
              MOVE TWA-MBAL05-9    TO ACAT03IO-AMT-05                           
           END-IF.                                                              
LRM011     IF  TWA-MBAL05 = 'FULL'                                              
LRM011        MOVE 'F' TO ACAT03IO-AMT-05-RQST-CD                               
LRM011        MOVE ' ' TO ACAT03IO-AMT-05-CREDIT-IND                            
LRM011     ELSE                                                                 
LRM011     IF TWA-MBAL05 = 'FULL-'                                              
LRM011        MOVE 'F' TO ACAT03IO-AMT-05-RQST-CD                               
LRM011        MOVE 'C' TO ACAT03IO-AMT-05-CREDIT-IND                            
LRM011     ELSE                                                                 
LRM011        MOVE 'P' TO ACAT03IO-AMT-05-RQST-CD                               
LRM011     END-IF.                                                              
                                                                                
           IF TWA-MSMA-9 < ZERO                                                 
              SET ACAT03IO-AMT-SMA-CREDIT TO TRUE                               
              COMPUTE WS-MQTY-9-UNSIGNED =  TWA-MSMA-9 * -1                     
              END-COMPUTE                                                       
              MOVE WS-MQTY-9-UNSIGNED TO ACAT03IO-AMT-SMA                       
           ELSE                                                                 
              MOVE SPACES TO ACAT03IO-AMT-SMA-CREDIT-IND                        
              MOVE TWA-MSMA-9      TO ACAT03IO-AMT-SMA                          
           END-IF.                                                              
           MOVE TWA-MSCMNT-X120 TO ACAT03IO-ASSET-CMNT-TXT.                     
           MOVE TWA-CONTROL-NBR TO ACAT03IO-CONTROL-NBR.                        
LRM013     MOVE ACAT-CICS-NETNAME    TO ACAT03IO-NETNAME                        
LRM013     MOVE ACAT-CICS-USER-ID    TO ACAT03IO-USER-ID                        
LRM013     MOVE ACAT-CICS-USER-NAME  TO ACAT03IO-USER-NAME                      
           PERFORM LINK-TO-ACAT03IO-RTN.                                        
           IF ACAT03IO-GOOD-RESP                                                
              MOVE -1 TO MSUBML                                                 
              IF TWA-MSUBM = 'Y'                                                
LRM022           MOVE 'RECORD CREATED SUCCESSFULLY; AWAITING XMIT'              
                                                    TO SYSTEM-MSG               
              ELSE                                                              
LRM026           MOVE -1 TO MBRL                                                
                 MOVE 'RECORD RETAINED / SUBMIT PENDING' TO SYSTEM-MSG          
              END-IF                                                            
              MOVE 'C' TO TWA-ACTION                                            
              IF (TWA-MSECR > SPACES OR TWA-MDESC(1 : 1) > SPACES)              
                 MOVE 'C' TO TWA-SECR-ACTION                                    
              END-IF                                                            
              MOVE ACAT03IO-DLVR-NBR  TO TWA-ORIG-DLVR-NBR                      
              MOVE ACAT03IO-DLVR-ACCT TO TWA-ORIG-DLVR-ACCT                     
              MOVE TWA-MSECR TO  TWA-CURRENT-ASSET-KEY                          
              MOVE TWA-MSLOC TO  TWA-ORIG-SLOC                                  
LRM030                           ACAT03IO-CURRENT-SLOC                          
              MOVE TWA-MTYPE TO  TWA-ORIG-MTYPE                                 
              MOVE ACAT03IO-CSH-MGN-SHRT-CD TO TWA-ORIG-TYPE                    
              MOVE ATT-UNPROT TO MDELA                                          
              MOVE ACAT03IO-UPDT-TMSTP TO TWA-UPDT-TMSTP                        
LRM007        IF TWA-DUPE-FOUND = 'Y'                                           
LRM007           MOVE ACAT03IO-CONTROL-NBR TO TWA-CONTROL-NBR                   
LRM007           MOVE TWA-CONTROL-NBR TO MACATO                                 
LRM007        END-IF                                                            
LRM007        MOVE 'N'  TO TWA-DUPE-FOUND                                       
              PERFORM  ERROR-RTN                                        03650002
           ELSE                                                                 
              MOVE LOW-VALUE TO ACAT03MO                                03620002
              MOVE 'WRITE'           TO WS-DB2-PROBLEM-FUNCTION                 
              MOVE ACAT03IO-SQLCAID  TO WS-DB2-PROBLEM-TABLE                    
              MOVE ACAT03IO-SQLCODE  TO WS-DB2-PROBLEM-ID                       
              MOVE WS-DB2-PROBLEM-MSG TO SYSTEM-MSG                             
              PERFORM DB2-ERROR-RTN.                                            
                                                                                
           SKIP3                                                                
                                                                                
       UPDATE-ACAT-IT-RECORD.                                                   
           SET ACAT03IO-IT-UPD  TO TRUE.                                        
           MOVE TWA-CLIENT-NO-X   TO ACAT03IO-CLIENT-NBR.                       
           MOVE TWA-MCBRKR        TO ACAT03IO-DLVR-NBR.                         
           MOVE TWA-MCACCT        TO ACAT03IO-DLVR-ACCT.                        
           MOVE ACAT-ADP-BROKER   TO ACAT03IO-RCV-NBR.                          
           MOVE TWA-MBR           TO ACAT03IO-RCV-ACCT.                         
           MOVE TWA-MAC           TO ACAT03IO-RCV-ACCT(4 : 5).                  
           MOVE TWA-MCCMNT-X120   TO ACAT03IO-CMNT-TXT.                         
           MOVE TWA-M1CMNT-X120   TO ACAT03IO-ASSET-CMNT1-TXT.                  
           MOVE TWA-M2CMNT-X120   TO ACAT03IO-ASSET-CMNT2-TXT.                  
           MOVE TWA-M5CMNT-X120   TO ACAT03IO-ASSET-CMNT5-TXT.                  
           MOVE TWA-MMCMNT-X120   TO ACAT03IO-ASSET-CMNTM-TXT.                  
           MOVE TWA-MRR           TO ACAT03IO-RR-CD.                    02030002
           MOVE TWA-MCTYPE        TO ACAT03IO-RCV-ACCT-TYPE-CD.         02030002
           MOVE TWA-MNAME         TO ACAT03IO-RCV-CUST-NM.              02030002
           MOVE TWA-MNAME2        TO ACAT03IO-RCV-CUST-NM(31 : 30).     02030002
           MOVE TWA-MSSN(1 : 3)   TO ACAT03IO-RCV-SS-PRIM-NBR(1 : 3).   02030002
           MOVE TWA-MSSN(5 : 2)   TO ACAT03IO-RCV-SS-PRIM-NBR(4 : 2).   02030002
           MOVE TWA-MSSN(8 : 4)   TO ACAT03IO-RCV-SS-PRIM-NBR(6 : 4).   02030002
           IF TWA-MSSN2(1 : 1) NOT GREATER SPACES                               
              MOVE SPACES           TO ACAT03IO-RCV-SS-SCNDY-NBR                
           ELSE                                                                 
              MOVE TWA-MSSN2(1 : 3) TO ACAT03IO-RCV-SS-SCNDY-NBR(1 : 3)         
              MOVE TWA-MSSN2(5 : 2) TO ACAT03IO-RCV-SS-SCNDY-NBR(4 : 2)         
              MOVE TWA-MSSN2(8 : 4) TO ACAT03IO-RCV-SS-SCNDY-NBR(6 : 4)         
           END-IF.                                                              
           IF ACAT-OCC-BROKER > SPACES                                          
              MOVE '0'             TO ACAT03IO-RCV-OCC-BRKR-NBR(1 : 1)          
              MOVE ACAT-OCC-BROKER TO ACAT03IO-RCV-OCC-BRKR-NBR(2 : 4)          
           ELSE                                                                 
              MOVE SPACES          TO ACAT03IO-RCV-OCC-BRKR-NBR.                
           IF TWA-MSUBM = 'Y'                                           02030002
              SET ACAT03IO-NSCC-SUBMIT-ELIGABLE TO TRUE                         
           ELSE                                                                 
              SET ACAT03IO-NSCC-SUBMIT-HOLD     TO TRUE.                        
                                                                                
LRM021     IF TWA-PRTCP-TYPE-CD = '3'                                           
LRM021        MOVE 'PTF' TO ACAT03IO-TRNFR-TYPE-CD                              
LRM021     ELSE                                                                 
              MOVE 'PTR' TO ACAT03IO-TRNFR-TYPE-CD.                             
           MOVE ' '   TO ACAT03IO-ACCT-RJCT-RSBM-IND.                           
                                                                                
           MOVE TWA-ORIG-DLVR-NBR  TO ACAT03IO-ORIG-DLVR-NBR.                   
           MOVE TWA-ORIG-DLVR-ACCT TO ACAT03IO-ORIG-DLVR-ACCT.                  
                                                                                
LRM030     IF TWA-ISIN-USED = 'I'                                               
LRM030        MOVE TWA-MSECR(1:2) TO ACAT03IO-ISIN-CNTRY-CD                     
LRM030        MOVE TWA-MSECR(3:9) TO ACAT03IO-ISIN-SEC-ISSUE-CD                 
LRM030        MOVE TWA-MSECR(12:1) TO ACAT03IO-ISIN-SEC-CDG-CD                  
LRM030     ELSE                                                                 
              MOVE 'US' TO ACAT03IO-ISIN-CNTRY-CD                               
              MOVE TWA-MSECR TO ACAT03IO-ISIN-SEC-ISSUE-CD                      
              MOVE SPACES TO ACAT03IO-ISIN-SEC-CDG-CD                           
LRM030     END-IF.                                                              
LRM030     MOVE ACAT03IO-KEY-FIELDS TO ACAT03IO-CURRENT-ASSET-KEY               
           MOVE TWA-MSLOC  TO ACAT03IO-STTLM-LCTN-CD                            
                              ACAT03IO-CURRENT-SLOC.                            
LRM030     MOVE TWA-ORIG-TYPE TO ACAT03IO-CURRENT-TYPE.                         
           MOVE TWA-ADP-NBR TO ACAT03IO-ADP-NBR.                                
           MOVE TWA-MCATGR  TO ACAT03IO-ASSET-PRC-CTGY-CD.                      
           MOVE 'P' TO ACAT03IO-ASSET-RQST-QTY-CD.                              
    **** SET ACAT03IO-PSTN-CD BASED ON POSITIVE OR NEGATIVE QTY BELOW.          
           IF TWA-MQTY-9 < ZERO                                                 
LRM028     OR TWA-MQTY = 'SHORT'                                                
              SET ACAT03IO-SHORT-ASSET-QTY TO TRUE                              
           ELSE                                                                 
           IF TWA-MQTY-9 > ZERO                                                 
LRM009     OR TWA-MCD = 'F'                                                     
              SET ACAT03IO-LONG-ASSET-QTY TO TRUE                               
           ELSE                                                                 
              SET ACAT03IO-NA-ASSET-QTY TO TRUE                                 
           END-IF.                                                              
                                                                                
           IF TWA-MQTY-9 LESS ZERO                                              
              COMPUTE WS-MQTY-9-UNSIGNED =  TWA-MQTY-9 * -1                     
              END-COMPUTE                                                       
           ELSE                                                                 
              MOVE TWA-MQTY-9      TO WS-MQTY-9-UNSIGNED                        
           END-IF.                                                              
           MOVE ZEROS              TO ACAT03IO-ASSET-AMT                        
                                      ACAT03IO-ASSET-QTY                        
                                      ACAT03IO-ASSET-PCT.                       
                                                                                
           IF TWA-MCD = 'V'                                                     
              SET ACAT03IO-RQST-ASSET-AMT TO TRUE                               
              MOVE WS-MQTY-9-UNSIGNED TO ACAT03IO-ASSET-AMT                     
           ELSE                                                                 
           IF TWA-MCD = 'P'                                                     
              SET ACAT03IO-RQST-ASSET-QTY TO TRUE                               
              MOVE WS-MQTY-9-UNSIGNED TO ACAT03IO-ASSET-QTY                     
LRM012********MOVE TWA-MAMT-9      TO ACAT03IO-ASSET-AMT                        
           ELSE                                                                 
           IF TWA-MCD = '%'                                                     
              SET ACAT03IO-RQST-ASSET-PCT TO TRUE                               
              MOVE WS-MQTY-9-UNSIGNED TO ACAT03IO-ASSET-PCT                     
              IF WS-MQTY-9-UNSIGNED = 100                                       
                 MOVE 'F' TO ACAT03IO-ASSET-RQST-QTY-CD                         
              END-IF                                                            
           ELSE                                                                 
              MOVE SPACES TO ACAT03IO-AST-RQST-TRANS-CD                         
              MOVE 'F' TO ACAT03IO-ASSET-RQST-QTY-CD                            
              MOVE ZEROS           TO ACAT03IO-ASSET-QTY                        
           END-IF.                                                              
           IF TWA-MTYPE = '1'                                                   
              SET ACAT03IO-CASH-ASSET TO TRUE                                   
           ELSE                                                                 
           IF TWA-MTYPE = '2'                                                   
              SET ACAT03IO-MARGIN-ASSET TO TRUE                                 
           ELSE                                                                 
           IF TWA-MTYPE = '5'                                                   
              SET ACAT03IO-SHORT-ASSET TO TRUE                                  
           ELSE                                                                 
              MOVE SPACES TO ACAT03IO-CSH-MGN-SHRT-CD                           
           END-IF.                                                              
                                                                                
           MOVE TWA-MWI         TO ACAT03IO-WHI-CD.                             
           MOVE TWA-MDESC-GROUP TO ACAT03IO-DESC-TXT.                           
LRM012     IF TWA-ADP-NBR > SPACES                                              
LRM012        MOVE 'ADP-SEC:'  TO ACAT03IO-DESC-TXT(121 : 8)                    
LRM012        MOVE TWA-ADP-NBR TO ACAT03IO-DESC-TXT(129 : 7)                    
LRM012     END-IF.                                                              
                                                                                
CSG001* IN SOME CASES MSD DESCRIPTIONS CONTAIN SPECIAL CHARACTERS.              
CSG001* CORRECT THEM BY REPLACING SPECIAL CHARACTERS WITH SPACES.               
CSG001     MOVE ACAT03IO-DESC-TXT          TO W-ASSET-DESC-TXT-GRP              
CSG001                                                                          
CSG001     MOVE W-ASSET-DESC1-TXT          TO W-ASSET-DESC-TXT                  
CSG001     MOVE 30                         TO W-SUB3                            
CSG001     SET  W-JUST-LEFT-REQ-Y          TO TRUE                              
CSG001     PERFORM EDIT-ASSET-DESC-TXT                                          
CSG001     MOVE W-ASSET-DESC-TXT           TO W-ASSET-DESC1-TXT                 
CSG001     MOVE W-ASSET-DESC2-TXT          TO W-ASSET-DESC-TXT                  
CSG001     MOVE 30                         TO W-SUB3                            
CSG001     SET  W-JUST-LEFT-REQ-N          TO TRUE                              
CSG001     PERFORM EDIT-ASSET-DESC-TXT                                          
CSG001     MOVE W-ASSET-DESC-TXT           TO W-ASSET-DESC2-TXT                 
CSG001     MOVE W-ASSET-DESC3-TXT          TO W-ASSET-DESC-TXT                  
CSG001     MOVE 30                         TO W-SUB3                            
CSG001     SET  W-JUST-LEFT-REQ-N          TO TRUE                              
CSG001     PERFORM EDIT-ASSET-DESC-TXT                                          
CSG001     MOVE W-ASSET-DESC-TXT           TO W-ASSET-DESC3-TXT                 
CSG001     MOVE W-ASSET-DESC4-TXT          TO W-ASSET-DESC-TXT                  
CSG001     MOVE 30                         TO W-SUB3                            
CSG001     SET  W-JUST-LEFT-REQ-N          TO TRUE                              
CSG001     PERFORM EDIT-ASSET-DESC-TXT                                          
CSG001     MOVE W-ASSET-DESC-TXT           TO W-ASSET-DESC4-TXT                 
CSG001     MOVE W-ASSET-DESC5-TXT          TO W-ASSET-DESC-TXT                  
CSG001     MOVE 20                         TO W-SUB3                            
CSG001     SET  W-JUST-LEFT-REQ-N          TO TRUE                              
CSG001     PERFORM EDIT-ASSET-DESC-TXT                                          
CSG001     MOVE W-ASSET-DESC-TXT           TO W-ASSET-DESC5-TXT                 
CSG001                                                                          
CSG001     MOVE W-ASSET-DESC-TXT-GRP       TO ACAT03IO-DESC-TXT                 
CSG001                                                                          
           IF TWA-MBAL01-9 < ZERO                                               
              SET ACAT03IO-AMT-01-CREDIT TO TRUE                                
              COMPUTE WS-MQTY-9-UNSIGNED =  TWA-MBAL01-9 * -1                   
              END-COMPUTE                                                       
              MOVE WS-MQTY-9-UNSIGNED TO ACAT03IO-AMT-01                        
           ELSE                                                                 
              MOVE SPACES TO ACAT03IO-AMT-01-CREDIT-IND                         
              MOVE TWA-MBAL01-9    TO ACAT03IO-AMT-01                           
           END-IF.                                                              
LRM011     IF  TWA-MBAL01 = 'FULL'                                              
LRM011        MOVE 'F' TO ACAT03IO-AMT-01-RQST-CD                               
LRM011        MOVE ' ' TO ACAT03IO-AMT-01-CREDIT-IND                            
LRM011     ELSE                                                                 
LRM011     IF TWA-MBAL01 = 'FULL-'                                              
LRM011        MOVE 'F' TO ACAT03IO-AMT-01-RQST-CD                               
LRM011        MOVE 'C' TO ACAT03IO-AMT-01-CREDIT-IND                            
LRM011     ELSE                                                                 
LRM011        MOVE 'P' TO ACAT03IO-AMT-01-RQST-CD                               
LRM011     END-IF.                                                              
                                                                                
           IF TWA-MBAL02-9 < ZERO                                               
              SET ACAT03IO-AMT-02-CREDIT TO TRUE                                
              COMPUTE WS-MQTY-9-UNSIGNED =  TWA-MBAL02-9 * -1                   
              END-COMPUTE                                                       
              MOVE WS-MQTY-9-UNSIGNED TO ACAT03IO-AMT-02                        
           ELSE                                                                 
              MOVE SPACES TO ACAT03IO-AMT-02-CREDIT-IND                         
              MOVE TWA-MBAL02-9    TO ACAT03IO-AMT-02                           
           END-IF.                                                              
LRM011     IF  TWA-MBAL02 = 'FULL'                                              
LRM011        MOVE 'F' TO ACAT03IO-AMT-02-RQST-CD                               
LRM011        MOVE ' ' TO ACAT03IO-AMT-02-CREDIT-IND                            
LRM011     ELSE                                                                 
LRM011     IF TWA-MBAL02 = 'FULL-'                                              
LRM011        MOVE 'F' TO ACAT03IO-AMT-02-RQST-CD                               
LRM011        MOVE 'C' TO ACAT03IO-AMT-02-CREDIT-IND                            
LRM011     ELSE                                                                 
LRM011        MOVE 'P' TO ACAT03IO-AMT-02-RQST-CD                               
LRM011     END-IF.                                                              
                                                                                
           IF TWA-MBAL05-9 < ZERO                                               
              SET ACAT03IO-AMT-05-CREDIT TO TRUE                                
              COMPUTE WS-MQTY-9-UNSIGNED =  TWA-MBAL05-9 * -1                   
              END-COMPUTE                                                       
              MOVE WS-MQTY-9-UNSIGNED TO ACAT03IO-AMT-05                        
           ELSE                                                                 
              MOVE SPACES TO ACAT03IO-AMT-05-CREDIT-IND                         
              MOVE TWA-MBAL05-9    TO ACAT03IO-AMT-05                           
           END-IF.                                                              
LRM011     IF  TWA-MBAL05 = 'FULL'                                              
LRM011        MOVE 'F' TO ACAT03IO-AMT-05-RQST-CD                               
LRM011        MOVE ' ' TO ACAT03IO-AMT-05-CREDIT-IND                            
LRM011     ELSE                                                                 
LRM011     IF TWA-MBAL05 = 'FULL-'                                              
LRM011        MOVE 'F' TO ACAT03IO-AMT-05-RQST-CD                               
LRM011        MOVE 'C' TO ACAT03IO-AMT-05-CREDIT-IND                            
LRM011     ELSE                                                                 
LRM011        MOVE 'P' TO ACAT03IO-AMT-05-RQST-CD                               
LRM011     END-IF.                                                              
           IF TWA-MSMA-9 < ZERO                                                 
              SET ACAT03IO-AMT-SMA-CREDIT TO TRUE                               
              COMPUTE WS-MQTY-9-UNSIGNED =  TWA-MSMA-9 * -1                     
              END-COMPUTE                                                       
              MOVE WS-MQTY-9-UNSIGNED TO ACAT03IO-AMT-SMA                       
           ELSE                                                                 
              MOVE SPACES TO ACAT03IO-AMT-SMA-CREDIT-IND                        
              MOVE TWA-MSMA-9      TO ACAT03IO-AMT-SMA                          
           END-IF.                                                              
                                                                                
           MOVE TWA-MSCMNT-X120 TO ACAT03IO-ASSET-CMNT-TXT.                     
           MOVE TWA-CONTROL-NBR TO ACAT03IO-CONTROL-NBR.                        
           MOVE TWA-UPDT-TMSTP  TO ACAT03IO-UPDT-TMSTP.                         
LRM013     MOVE ACAT-CICS-NETNAME    TO ACAT03IO-NETNAME                        
LRM013     MOVE ACAT-CICS-USER-ID    TO ACAT03IO-USER-ID                        
LRM013     MOVE ACAT-CICS-USER-NAME  TO ACAT03IO-USER-NAME                      
                                                                                
           PERFORM LINK-TO-ACAT03IO-RTN.                                        
           IF ACAT03IO-GOOD-RESP                                                
              MOVE ACAT03IO-UPDT-TMSTP TO TWA-UPDT-TMSTP                        
              IF (TWA-MSECR > SPACES OR TWA-MDESC(1 : 1) > SPACES)              
              AND (TWA-SECR-ACTION = 'A' OR 'C' OR 'D')                         
                 PERFORM UPDATE-ASSET-RTN                                       
              END-IF                                                            
              IF TWA-MSUBM = 'Y'                                                
                 MOVE -1 TO MBRL                                                
                 MOVE 'RECORD UPDATED SUCCESSFULLY / AWAITING NSCC XMIT'        
                      TO SYSTEM-MSG                                             
              ELSE                                                              
              IF LAST-ASSET-JUST-DELETED                                        
                 MOVE 'LAST ASSET DELETED; SUBMIT IND RESET TO NULL'            
                    TO SYSTEM-MSG                                               
                 MOVE -1 TO MSUBML                                              
              ELSE                                                              
                 MOVE 'UPDATE RETAINED / SUBMIT PENDING' TO SYSTEM-MSG          
              END-IF END-IF                                                     
              PERFORM  ERROR-RTN                                        03650002
           ELSE                                                                 
           IF ACAT03IO-UPDT-TMSTP-NG                                            
           OR ACAT03IO-NSCC-PEND-NG                                             
           OR ACAT03IO-NOT-FOUND                                                
              PERFORM UPDATE-FAIL-RTN                                           
           ELSE                                                                 
              MOVE LOW-VALUE TO ACAT03MO                                03620002
              MOVE 'REPL '           TO WS-DB2-PROBLEM-FUNCTION                 
              MOVE ACAT03IO-SQLCAID  TO WS-DB2-PROBLEM-TABLE                    
              MOVE ACAT03IO-SQLCODE  TO WS-DB2-PROBLEM-ID                       
              MOVE WS-DB2-PROBLEM-MSG TO SYSTEM-MSG                             
              PERFORM DB2-ERROR-RTN.                                            
           MOVE ATT-UNPROT TO MDELA.                                            
                                                                                
                                                                                
       UPDATE-FAIL-RTN.                                                         
           IF ACAT03IO-NOT-FOUND                                                
              MOVE                                                              
             'UPDATE REJECTED; THIS TIF WAS DELETED BY SOMEONE ELSE'            
                TO SYSTEM-MSG                                                   
              MOVE ' ' TO TWA-ACTION                                            
              MOVE SPACES TO TWA-MAP-TABLE                              02000002
              MOVE LOW-VALUES TO ACAT03MO                                       
              MOVE -1 TO MBRL                                                   
              MOVE ACAT03IO-DLVR-NBR   TO TWA-MCBRKR                            
              MOVE ACAT03IO-DLVR-ACCT  TO TWA-MCACCT                            
              MOVE ACAT03IO-RCV-ACCT   TO TWA-MBR                               
              MOVE ACAT03IO-RCV-ACCT(4 : 5)   TO TWA-MAC                        
              SET FIRST-TIME TO TRUE                                            
              PERFORM ERROR-RTN                                         10220002
           END-IF.                                                              
                                                                                
           IF ACAT03IO-UPDT-TMSTP-NG                                            
              MOVE                                                              
             'UPDATE REJECTED; OTHER CHANGE MADE PRIOR TO THIS REQUEST;         
      -      'SCREEN REFRESHED'                                                 
                TO SYSTEM-MSG                                                   
           ELSE                                                                 
           IF ACAT03IO-NSCC-PEND-NG                                             
              MOVE                                                              
             'UPDATE REJECTED; THIS TIF ALREADY SENT TO NSCC; SCREEN REF        
      -      'RESHED'                                                           
                TO SYSTEM-MSG                                                   
           ELSE                                                                 
              MOVE  'UPDATE REJECTED; SCREEN REFRESHED'  TO SYSTEM-MSG          
           END-IF.                                                              
                                                                                
   ***** REREAD RECORD, MOVE TO TWA AND SCREEN, DISPLAY:                        
           PERFORM READ-ACAT-RTN.                                               
           PERFORM MOVE-ACAT03IO-TO-TWA-RTN.                                    
           PERFORM REFORMAT-SCREEN-DETAIL.                                      
           PERFORM ERROR-RTN.                                           10220002
                                                                                
           SKIP3                                                                
       UPDATE-ASSET-RTN.                                                        
           IF TWA-SECR-ACTION = 'A'                                             
              SET ACAT03IO-IT-ISRT-ASSET TO TRUE                                
              PERFORM LINK-TO-ACAT03IO-RTN                                      
              MOVE 'C' TO TWA-SECR-ACTION                                       
              MOVE 'ADD AS'          TO WS-DB2-PROBLEM-FUNCTION                 
           ELSE                                                                 
           IF TWA-SECR-ACTION = 'C'                                             
              IF TWA-MCD NOT = 'D'                                              
                 SET ACAT03IO-IT-UPD-ASSET TO TRUE                              
                 PERFORM LINK-TO-ACAT03IO-RTN                                   
                 MOVE 'REPL A'          TO WS-DB2-PROBLEM-FUNCTION              
              ELSE                                                              
                 SET ACAT03IO-IT-DEL-ASSET TO TRUE                              
                 PERFORM LINK-TO-ACAT03IO-RTN                                   
                 MOVE 'DELT A'          TO WS-DB2-PROBLEM-FUNCTION              
                 MOVE ' ' TO TWA-SECR-ACTION                                    
           END-IF.                                                              
           MOVE TWA-MSECR TO  TWA-ORIG-MSECR                                    
LRM030*********               TWA-CURRENT-ASSET-KEY                             
           MOVE TWA-MSLOC TO  TWA-ORIG-SLOC                                     
           MOVE TWA-MTYPE TO  TWA-ORIG-MTYPE.                                   
           MOVE ACAT03IO-CSH-MGN-SHRT-CD TO TWA-ORIG-TYPE.                      
           IF NOT ACAT03IO-GOOD-RESP                                            
              MOVE LOW-VALUE TO ACAT03MO                                03620002
              MOVE ACAT03IO-SQLCAID  TO WS-DB2-PROBLEM-TABLE                    
              MOVE ACAT03IO-SQLCODE  TO WS-DB2-PROBLEM-ID                       
              MOVE WS-DB2-PROBLEM-MSG TO SYSTEM-MSG                             
              PERFORM DB2-ERROR-RTN.                                            
                                                                                
           IF TWA-MCD = 'D'                                                     
              MOVE SPACES TO TWA-ASSET-AREA                                     
              PERFORM REFORMAT-SCREEN-ASSET                                     
              MOVE 'ASSET DELETED' TO SYSTEM-MSG                                
              SET ASSET-JUST-DELETED TO TRUE                                    
              PERFORM READ-NEXT-ASSET-RTN.                                      
                                                                                
           EJECT                                                                
       READ-ACAT-RTN.                                                           
           MOVE SPACES TO ACAT03IO-CALL-AREA.                                   
           SET ACAT03IO-IT-READ TO TRUE.                                        
           MOVE TWA-CLIENT-NO-X   TO ACAT03IO-CLIENT-NBR.                       
           MOVE TWA-MCBRKR        TO ACAT03IO-DLVR-NBR.                         
           MOVE TWA-MCACCT        TO ACAT03IO-DLVR-ACCT.                        
           MOVE ACAT-ADP-BROKER   TO ACAT03IO-RCV-NBR.                          
           MOVE TWA-MBR           TO ACAT03IO-RCV-ACCT.                         
           MOVE TWA-MAC           TO ACAT03IO-RCV-ACCT(4 : 5).                  
LRM029     IF  TWA-INP-TFR-TYP   = 'PTF'                                        
LRM021        MOVE 'PTF'             TO ACAT03IO-TRNFR-TYPE-CD                  
LRM021     ELSE                                                                 
              MOVE 'PTR'             TO ACAT03IO-TRNFR-TYPE-CD.                 
           PERFORM LINK-TO-ACAT03IO-RTN.                                        
           IF ACAT03IO-DB2-ERROR                                                
              MOVE 'READ'            TO WS-DB2-PROBLEM-FUNCTION                 
              MOVE ACAT03IO-SQLCAID  TO WS-DB2-PROBLEM-TABLE                    
              MOVE ACAT03IO-SQLCODE  TO WS-DB2-PROBLEM-ID                       
              MOVE WS-DB2-PROBLEM-MSG TO SYSTEM-MSG                             
              PERFORM DB2-ERROR-RTN.                                            
                                                                                
       READ-NEXT-ASSET-RTN.                                                     
           SET ACAT03IO-IT-READ-NEXTS TO TRUE.                                  
           PERFORM LINK-TO-ACAT03IO-RTN.                                        
                                                                                
           IF ACAT03IO-FOUND                                                    
              PERFORM MOVE-ACAT03IO-ASSET-TO-TWA                                
              PERFORM REFORMAT-SCREEN-ASSET                                     
              MOVE 'C' TO TWA-SECR-ACTION                                       
           ELSE                                                                 
              MOVE ' ' TO TWA-SECR-ACTION                                       
           END-IF.                                                              
                                                                                
           IF ACAT03IO-DB2-ERROR                                                
              MOVE LOW-VALUE TO ACAT03MO                                03620002
              MOVE 'NXT-A'           TO WS-DB2-PROBLEM-FUNCTION                 
              MOVE ACAT03IO-SQLCAID  TO WS-DB2-PROBLEM-TABLE                    
              MOVE ACAT03IO-SQLCODE  TO WS-DB2-PROBLEM-ID                       
              MOVE WS-DB2-PROBLEM-MSG TO SYSTEM-MSG                             
              PERFORM DB2-ERROR-RTN.                                            
                                                                                
********* SPECIAL PROBLEM...                                                    
           IF NOT ACAT03IO-FOUND                                                
           AND ASSET-JUST-DELETED                                               
           AND TWA-MBAL01 NOT > SPACES                                          
           AND TWA-MBAL02 NOT > SPACES                                          
           AND TWA-MBAL05 NOT > SPACES                                          
           AND TWA-MSMA NOT > SPACES                                            
           AND TWA-MSUBM = 'Y'                                          02030002
              SET LAST-ASSET-JUST-DELETED TO TRUE                               
              MOVE ' '   TO TWA-MSUBM MSUBMO                            02030002
              PERFORM UPDATE-ACAT-IT-RECORD                                     
           END-IF.                                                              
       READ-ASSET-RTN.                                                          
           MOVE TWA-CLIENT-NO-X   TO ACAT03IO-CLIENT-NBR.                       
           MOVE TWA-MCBRKR        TO ACAT03IO-DLVR-NBR.                         
           MOVE TWA-MCACCT        TO ACAT03IO-DLVR-ACCT.                        
           MOVE ACAT-ADP-BROKER   TO ACAT03IO-RCV-NBR.                          
           MOVE TWA-MBR           TO ACAT03IO-RCV-ACCT.                         
           MOVE TWA-MAC           TO ACAT03IO-RCV-ACCT(4 : 5).                  
           MOVE TWA-MCTYPE        TO ACAT03IO-RCV-ACCT-TYPE-CD.         02030002
LRM029     IF  TWA-INP-TFR-TYP   = 'PTF'                                        
LRM021        MOVE 'PTF' TO ACAT03IO-TRNFR-TYPE-CD                              
LRM021     ELSE                                                                 
              MOVE 'PTR' TO ACAT03IO-TRNFR-TYPE-CD.                             
                                                                                
           MOVE TWA-ORIG-DLVR-NBR  TO ACAT03IO-ORIG-DLVR-NBR.                   
           MOVE TWA-ORIG-DLVR-ACCT TO ACAT03IO-ORIG-DLVR-ACCT.                  
                                                                                
LRM030     IF TWA-ISIN-USED = 'I'                                               
LRM030        MOVE TWA-MSECR(1:2) TO ACAT03IO-ISIN-CNTRY-CD                     
LRM030        MOVE TWA-MSECR(3:9) TO ACAT03IO-ISIN-SEC-ISSUE-CD                 
LRM030        MOVE TWA-MSECR(12:1) TO ACAT03IO-ISIN-SEC-CDG-CD                  
LRM030     ELSE                                                                 
              MOVE 'US' TO ACAT03IO-ISIN-CNTRY-CD                               
              MOVE TWA-MSECR TO ACAT03IO-ISIN-SEC-ISSUE-CD                      
              MOVE SPACES TO ACAT03IO-ISIN-SEC-CDG-CD                           
LRM030     END-IF.                                                              
           MOVE TWA-MSLOC  TO ACAT03IO-STTLM-LCTN-CD                            
LRM030                        ACAT03IO-CURRENT-SLOC.                            
           MOVE TWA-ADP-NBR TO ACAT03IO-ADP-NBR.                                
    **** SET ACAT03IO-PSTN-CD BASED ON POSITIVE OR NEGATIVE QTY BELOW.          
           IF TWA-MQTY-9 < ZERO                                                 
              SET ACAT03IO-SHORT-ASSET-QTY TO TRUE                              
           ELSE                                                                 
           IF TWA-MQTY-9 > ZERO                                                 
LRM009     OR TWA-MCD = 'F'                                                     
              SET ACAT03IO-LONG-ASSET-QTY TO TRUE                               
           ELSE                                                                 
              SET ACAT03IO-NA-ASSET-QTY TO TRUE                                 
           END-IF.                                                              
                                                                                
           IF TWA-MTYPE = '1'                                                   
              SET ACAT03IO-CASH-ASSET TO TRUE                                   
           ELSE                                                                 
           IF TWA-MTYPE = '2'                                                   
              SET ACAT03IO-MARGIN-ASSET TO TRUE                                 
           ELSE                                                                 
           IF TWA-MTYPE = '5'                                                   
              SET ACAT03IO-SHORT-ASSET TO TRUE                                  
           ELSE                                                                 
              MOVE SPACES TO ACAT03IO-CSH-MGN-SHRT-CD                           
           END-IF.                                                              
LRM007     MOVE TWA-CONTROL-NBR   TO ACAT03IO-CONTROL-NBR.                      
                                                                                
           SET ACAT03IO-IT-READ-ASSET TO TRUE                                   
           PERFORM LINK-TO-ACAT03IO-RTN                                         
           IF ACAT03IO-DB2-ERROR                                                
              MOVE LOW-VALUE TO ACAT03MO                                03620002
              MOVE 'GET-A'           TO WS-DB2-PROBLEM-FUNCTION                 
              MOVE ACAT03IO-SQLCAID  TO WS-DB2-PROBLEM-TABLE                    
              MOVE ACAT03IO-SQLCODE  TO WS-DB2-PROBLEM-ID                       
              MOVE WS-DB2-PROBLEM-MSG TO SYSTEM-MSG                             
              PERFORM DB2-ERROR-RTN.                                            
                                                                                
                                                                                
       FORMAT-FROM-ACTIVE-RTN.                                                  
           SET ACAT03IO-IT-GET-ACTIVE TO TRUE.                                  
           MOVE TWA-CLIENT-NO-X   TO ACAT03IO-CLIENT-NBR.                       
           MOVE ACAT-CONTROL-NBR  TO ACAT03IO-CONTROL-NBR.                      
           PERFORM LINK-TO-ACAT03IO-RTN.                                        
                                                                                
           IF ACAT03IO-ACTIVE-FOUND                                             
              PERFORM MOVE-ACAT03IO-TO-TWA-RTN                                  
              PERFORM REFORMAT-SCREEN-DETAIL                                    
              PERFORM REFORMAT-SCREEN-ASSET                                     
              MOVE 'A' TO TWA-ACTION.                                           
                                                                                
           IF ACAT03IO-FUL-HISTORY                                              
              SET INPUT-ERROR TO TRUE                                           
              MOVE -1             TO MACATL                                     
              MOVE ATT-UNPROT-BRT TO MACATA                                     
              MOVE 'TIF NOT ALLOWED; TIF HISTORY FOUND WITH FUL DLVRY'          
                   TO WS-DUPE-MSG-TEXT                                          
              MOVE ACAT03IO-DUPE-CONTROL-NBR TO WS-DUPE-CONTROL-NBR             
              MOVE WS-DUPE-MSG TO SYSTEM-MSG                                    
              PERFORM ERROR-RTN.                                                
                                                                                
           IF ACAT03IO-OTHER-ACTIVE                                             
              SET INPUT-ERROR TO TRUE                                           
              MOVE -1             TO MACATL                                     
              MOVE ATT-UNPROT-BRT TO MACATA                                     
              MOVE 'TIF NOT ALLOWED - OTHER ACTIVE TRANSFER FOUND'              
                   TO WS-DUPE-MSG-TEXT                                          
              MOVE ACAT03IO-DUPE-CONTROL-NBR TO WS-DUPE-CONTROL-NBR             
              MOVE WS-DUPE-MSG TO SYSTEM-MSG                                    
              PERFORM ERROR-RTN.                                                
                                                                                
           SKIP3                                                                
       DELETE-ACAT-IT-RECORD.                                                   
           SET ACAT03IO-IT-DEL TO TRUE.                                         
           MOVE TWA-CLIENT-NO-X   TO ACAT03IO-CLIENT-NBR.                       
           MOVE TWA-MCBRKR        TO ACAT03IO-DLVR-NBR.                         
           MOVE TWA-MCACCT        TO ACAT03IO-DLVR-ACCT.                        
           MOVE ACAT-ADP-BROKER   TO ACAT03IO-RCV-NBR.                          
           MOVE TWA-MBR           TO ACAT03IO-RCV-ACCT.                         
           MOVE TWA-MAC           TO ACAT03IO-RCV-ACCT(4 : 5).                  
LRM021     IF TWA-INP-TFR-TYP = 'PTF'                                           
LRM021        MOVE TWA-INP-TFR-TYP TO ACAT03IO-TRNFR-TYPE-CD                    
LRM021     ELSE                                                                 
              MOVE 'PTR'           TO ACAT03IO-TRNFR-TYPE-CD.                   
           MOVE TWA-ORIG-DLVR-NBR  TO ACAT03IO-ORIG-DLVR-NBR.                   
           MOVE TWA-ORIG-DLVR-ACCT TO ACAT03IO-ORIG-DLVR-ACCT.                  
LRM007     MOVE TWA-CONTROL-NBR   TO ACAT03IO-CONTROL-NBR.                      
           PERFORM LINK-TO-ACAT03IO-RTN.                                        
                                                                                
           IF ACAT03IO-DB2-ERROR                                                
              MOVE 'DELETE'          TO WS-DB2-PROBLEM-FUNCTION                 
              MOVE ACAT03IO-SQLCAID  TO WS-DB2-PROBLEM-TABLE                    
              MOVE ACAT03IO-SQLCODE  TO WS-DB2-PROBLEM-ID                       
              MOVE WS-DB2-PROBLEM-MSG TO SYSTEM-MSG                             
              PERFORM DB2-ERROR-RTN.                                            
           MOVE SPACES TO TWA-MAP-TABLE.                                02000002
           MOVE ZEROS TO TWA-MBAL01-9                                           
                         TWA-MBAL02-9                                           
                         TWA-MBAL05-9                                           
                         TWA-MSMA-9.                                            
           MOVE 'A' TO TWA-ACTION                                               
           PERFORM REFORMAT-SCREEN-DETAIL.                                      
           PERFORM REFORMAT-SCREEN-ASSET                                        
           PERFORM PROCESS-MAP-ITEMS THRU PROCESS-MAP-ITEMS-EXIT.               
           MOVE 'TIF DELETED' TO SYSTEM-MSG.                                    
           PERFORM SEND-MAP-ERASE.                                              
           PERFORM WRITE-TSQ-RTN.                                       10790002
           PERFORM RETURN-TO-CICS.                                      08350002
120800                                                                  10041009
       EJECT                                                                    
120800                                                                  10130002
120900 NOT-OPEN.                                                        10140002
           IF FIRST-TIME                                                        
              MOVE 'ACAT03IP' TO ACAT-PROGRAM-NAME                      08340002
              MOVE LOW-VALUES TO ACAT03MO.                                      
                                                                                
           PERFORM INIT-MAP-RTN.                                        07650005
           MOVE 'ACATVR FILE IS NOT AVAILABLE.' TO TRLMSGO.             10150002
           MOVE  ATT-ASKIP-BRT                TO TRLMSGA.               10160002
           MOVE -1 TO MNEXTL.                                           04773110
127200     PERFORM WRITE-TSQ-RTN.                                       10790002
121200     PERFORM SEND-MAP-ERASE.                                      10170002
121300     PERFORM RETURN-TO-CICS.                                      10180002
120800                                                                  10181004
120700     EJECT                                                        10182004
                                                                                
       DB2-ERROR-RTN.                                                           
           PERFORM ERROR-RTN.                                                   
121400                                                                  10190002
121700 ERROR-RTN.                                                       10220002
           MOVE TWA-CLIENT-NO-X(2 : 3) TO MCLINBO.                              
029700     MOVE WSTIME         TO  MTIMEO.                              02740002
029800     MOVE WSMMDDYY       TO  MDATEO.                              02750002
   800     MOVE SYSTEM-MSG     TO  TRLMSGO.                             10230002
121900     MOVE ATT-ASKIP-BRT  TO  TRLMSGA.                             10240002
           IF FIRST-TIME                                                        
              PERFORM SEND-MAP-ERASE                                    08330002
           ELSE                                                                 
              PERFORM SEND-MAP-DATA-ONLY.                               10250002
127200     PERFORM WRITE-TSQ-RTN.                                       10790002
122100     PERFORM RETURN-TO-CICS.                                      10260002
122200                                                                  10270002
122300     EJECT                                                        10288002
122400                                                                  10290002
123600 READ-TSQ-RTN.                                                    10350002
123700     EXEC CICS READQ TS QUEUE(TSQ-NAME)                           10360002
123800                        INTO(TWA-AREA)                            10370002
123900                        LENGTH(LENGTH OF TWA-AREA)                10380002
                              ITEM(ITEM-NUM)                            10390002
124000     END-EXEC.                                                    10400002
125100     IF (EIBRESP NOT = +0)                                        10410002
           AND (NOT FIRST-TIME)                                         10420002
              MOVE LOW-VALUE TO ACAT03MO                                        
125200        MOVE 'ACAT03 READ TSQ ERROR.'                             10430002
125300          TO SYSTEM-MSG                                           10440002
125400        PERFORM ERROR-RTN                                         10450002
125500     END-IF.                                                      10460002
124100                                                                  10470002
124200 DELETE-TSQ-RTN.                                                  10480002
124300     EXEC CICS DELETEQ TS QUEUE(TSQ-NAME)                         10490002
124400     END-EXEC.                                                    10500002
124500                                                                  10510002
124600 WRITE-TSQ-RTN.                                                   10520002
124700     EXEC CICS WRITEQ TS QUEUE(TSQ-NAME)                          10530002
124800                         FROM(TWA-AREA)                           10540002
124900                         LENGTH(LENGTH OF TWA-AREA)               10550002
                               ITEM(ITEM-NUM)                           10560002
125000     END-EXEC.                                                    10570002
125100     IF EIBRESP NOT = +0                                          10580002
              MOVE LOW-VALUE TO ACAT03MO                                        
125200        MOVE 'ACAT03 WRITE TSQ ERROR.'                            10590002
125300          TO SYSTEM-MSG                                           10600002
125500     END-IF.                                                      10620002
125600                                                                  10630002
136400     EJECT                                                        00110040
125800                                                                  10650002
125900 RETURN-CONTROL-RTN.                                              10660002
126000     EXEC CICS SEND CONTROL                                       10670002
126100                      ERASE                                       10680002
126200                     FREEKB                                       10690002
126300     END-EXEC.                                                    10700002
126400     EXEC CICS XCTL PROGRAM ('RATT01')                            10710002
126500     END-EXEC.                                                    10720002
126600     EXEC CICS RETURN                                             10730002
126700     END-EXEC.                                                    10740002
126800                                                                  10750002
126900     EJECT                                                        10760002
127000                                                                  10770002
127100 RETURN-TO-CICS.                                                  10780002
127300     EXEC CICS RETURN                                             10800002
127400               TRANSID('ACAX')                                    10810002
127500               COMMAREA(ACATCOMM-COMMAREA)                        10820002
127600     END-EXEC.                                                    10830002
127700                                                                  10840002
127800 HANG-CICS.                                                       10850002
127900     GOBACK.                                                      10860002
