  SORT FIELDS=(1,23,CH,A),EQUALS                                                
  END                                                                           
