  INCLUDE COND=((5,3,EQ,C'HDR'),OR,                                     00001   
                (5,2,EQ,C'AT')),FORMAT=CH                               00001   
  SORT FIELDS=(5,1,D,53,4,A,45,4,A,16,14,A),FORMAT=CH                           
  END                                                                   00002   
