  INCLUDE COND=((5,3,EQ,C'HDR'),OR,                                     00001   
                (5,2,EQ,C'FR')),FORMAT=CH                               00001   
  SORT FIELDS=(5,1,D,37,4,A,16,14,A,57,6,A),FORMAT=CH                           
  END                                                                   00002   
