 RECORD TYPE=V                                                          00010000
 SORT FIELDS=(5,60,CH,A)                                                00020000
