 RECORD TYPE=V                                                                  
 SORT FIELDS=(05,3,CH,A,16,14,CH,A)                                             
