 SORT FIELDS=(1,21,CH,A)                                                00010000
 SUM FIELDS=NONE                                                        00220000
 END                                                                    00230000
