 INCLUDE COND=(17,4,CH,EQ,C'0740',OR,                                           
               03,4,CH,EQ,C'0740')                                              
 SORT FIELDS=COPY                                                               
 END                                                                            
