 RECORD TYPE=F                                                                  
 SORT FIELDS=(04,03,CH,A,31,08,CH,A)                                            
 OMIT COND=(01,01,CH,NE,C'M')                                                   
 SUM FIELDS=NONE                                                                
