 RECORD TYPE=V                                                          00010000
 OMIT COND=(47,1,CH,EQ,C'D')                                            00011000
 SORT FIELDS=(5,60,CH,A)                                                00012000
