 OMIT COND=(167,1,CH,EQ,C'R')                                           00010000
 SORT FIELDS=COPY                                                               
 END                                                                            
