 SORT FIELDS=(1,29,CH,A)                                                        
 SUM FIELDS=NONE                                                                
