  SORT FIELDS=(03,19,CH,A)                                                      
  SUM FIELDS=NONE                                                               
