  RECORD TYPE=F                                                         00010000
  SORT FIELDS=(1,4,A,5,1,A,6,03,A,9,5,A),FORMAT=BI                      00020001
  SUM FIELDS=NONE                                                       00030001
