 SORT FIELDS=(01,30,CH,A)                                                       
 SUM FIELDS=(50,9,59,9,68,9),FORMAT=PD                                          
 END                                                                            
