 RECORD TYPE=V                                                                  
 SORT FIELDS=(05,3,CH,A,16,14,CH,A,62,9,CH,A,84,27,CH,A)                        
 SUM FIELDS=NONE                                                                
