 SORT FIELDS=(1,1,CH,D,11,4,CH,A)                                               
 SUM FIELDS=NONE                                                                
