//CAT511TX JOB (BX0P,DY00),'ACAT INTRA-DAY RPT  ',CLASS=U,MSGCLASS=W,           
//         USER=BX0P,SECLABEL=BISG                                              
//*NODAFF BALANCEU                                                              
//*JOBAFF BALANCEU                                                              
//**NON-CA11-JOB BTR004/BTR06                                                   
//BTR0410  EXEC BTR004,                                                         
//         PARAM='AUTO,REPLACE',                                                
//         DSN='BXXX.CAT820.ID.LQRPI(0)'                                        
