//CAT511TB JOB (BB0P,DY00),'ACAT INTRA-DAY RPT  ',CLASS=U,MSGCLASS=W,           
//         USER=BB0P,SECLABEL=BISG,SCHENV=STREAMB                               
//*NODAFF BALANCEU                                                              
//*JOBAFF BALANCEU                                                              
//**NON-CA11-JOB BTR004/BTR06                                                   
//BTR0410  EXEC BTR004,                                                         
//         PARAM='AUTO,REPLACE',                                                
//         DSN='BBBB.CAT820.ID.LQRPI(0)'                                        
