//CAT511TL JOB (BL0P,DY00),'ACAT INTRA-DAY RPT  ',CLASS=U,MSGCLASS=W,           
//         USER=BL0P,SECLABEL=BISG                                              
//*NODAFF BALANCEU                                                              
//*JOBAFF BALANCEU                                                              
//**NON-CA11-JOB BTR004/BTR06                                                   
//BTR0410  EXEC BTR004,                                                         
//         PARAM='AUTO,REPLACE',                                                
//         DSN='BLLL.CAT820.ID.LQRPI(0)'                                        
