//CAT511TF JOB (BF0P,DY00),'ACAT INTRA-DAY RPT  ',CLASS=U,MSGCLASS=W,           
//         USER=BF0P,SECLABEL=BISG,SCHENV=STREAMF                               
//*NODAFF BALANCEU                                                              
//*JOBAFF BALANCEU                                                              
//**NON-CA11-JOB BTR004/BTR06                                                   
//BTR0410  EXEC BTR004,                                                         
//         PARAM='AUTO,REPLACE',                                                
//         DSN='BFFF.CAT820.ID.LQRPI(0)'                                        
