//CAT511TR JOB (BR0P,0000),'ACAT INTRA-DAY RPT  ',CLASS=U,MSGCLASS=W,           
//         SECLABEL=BISG,                                                       
//             USER=BR0P                                                        
//*NODAFF BALANCEU                                                              
//*JOBAFF BALANCEU                                                              
//**NON-CA11-JOB BTR004/BTR06                                                   
//BTR0410  EXEC BTR004,                                                         
//         PARAM='AUTO,REPLACE',                                                
//         DSN='BRRR.CAT820.ID.LQRPI(0)'                                        
