//CAT6600X JOB (BX0P,DY00),'ACATS MFRS MF TRAN',USER=BX0P,CLASS=1,              
//         SCHENV=STREAMX,                                                      
//             MSGCLASS=W,                                                      
//         PRTY=15,                                                             
//  SECLABEL=BISG                                                               
//*NODAFF BALANCE1                                                              
//*JOBAFF BALANCE1                                                              
//CA11    EXEC CA11                                                             
//BR14    EXEC IEFBR14                                                          
