//CAT7700Z JOB (BZ0P,0000),'MUTUAL FUND ADJUSTMT',CLASS=1,MSGCLASS=W,           
//         USER=BZ0P,SECLABEL=BISG,SCHENV=STREAMZ                               
//*NODAFF BALANCE1                                                              
//*JOBAFF BALANCE1                                                              
//CA11    EXEC CA11                                                             
//STEP10  EXEC CAT770                                                           
