//CAT95OPJ JOB (BJ0P,0000),'POST: CAT9501J',CLASS=O,MSGCLASS=W,                 
//         SCHENV=STREAMJ,                                                      
//        USER=BJ0P,SECLABEL=BISG                                               
//*                                                                             
//*                                                                             
//**NON-CA11-JOB   **                                                           
//STEP1  EXEC CSYUEV2,                                                  00250000
//             PARMS='NDM1,CAT9501J,C'                                  00260000
//*                                                                     00280000
