000001* PDX    - CAT501   C0353648 04/25/14 10:35:46 TBLAMUR            00001008
000001* LRM029 SSR 100417 DST/SCHWAB FUND AGENT NEW COL.                00001103
000001* PDX    - CAT501   C0344128 09/16/13 09:57:33 TBLAMUR            00001200
000001* LRM028 SSR 94296 RECOMPILE FOR EXPANDED BNWMASTW AND CHANGE FD. 00001300
000001* PDX    - CAT501   C0336625 06/26/13 11:18:08 TBLAMUR            00001400
000001* LRM027 SSR 85742 DST/SCHWAB SUPER OMNI FUNDS.                   00001500
000001*   POPULATE SHARE-AGING AND PROCESSING-AGENT ON DELIVERY AT,     00001600
000001*   AND AGENT OF RECEIVER F/R.                                    00001700
000001* PDX    - CAT501   C0334180 11/27/12 09:47:45 TBLAMUR            00001800
000001* LRM026 SSR 89315 PASS ALL "W" ASSETS TO ASCENDIS WITH TRANS=W   00001900
000001* PDX    - CAT501   C0332311 10/29/12 13:52:03 TBLAMUR            00002000
000001* LRM025 SSR 84377 SUBMIT ALL "W" ASSETS AS "45" MEMOS.           00002100
000001*   CAT500 FORCED CYCLE NUMBER AND PEND = Y ON THESE, CHANGE      00002200
000001*   SETTLE-LOC TO 45 AND RSN TO 'COMT' ON NSCC FEED.              00002300
000001* PDX    - CAT501   C0325640 06/18/12 11:28:29 TBLAMUR            00002400
000001* LRM024 SSR 82930 SPLIT-UP POSITION > 1 BILLION DOLLAR VALUE     00002500
000001*   INTO MULTIPLE POSITIONS DUE TO DTCC LIMITATION.  THIS IS      00002600
000001*   DONE WHEN NOT IN ASCENDIS MODE.                               00002700
000001* PDX    - CAT501   C0317552 10/10/11 11:10:25 TBLAMUR            00002800
000001* LRM023 SSR 80596 CAUSE TYPE4 POSN TO GO OUT AS TYPE1            00002900
000001* PDX    - CAT501   C0288347 01/07/10 14:18:35 TBLAMUR            00003000
000001* PDX    - CAT501   C0290020 12/28/09 12:00:43 TBLAMUR            00003100
000001* LRM022 SSR 59603 CONT. REMOVE Q STREAM HARD CODING              00003200
000001* PDX    - CAT501   C0286877 10/23/09 14:15:30 TBLAMUR            00003300
000001* LRM021 SSR 59603 CONT. REMOVE ASCENDIS BYPASS OPTION SYMBOLOGY  00003400
000001* PDX    - CAT501   C0286143 09/29/09 14:55:07 TBLAMUR            00003500
000001* LRM021 SSR 59603 OPTION SYMBOLOGY CHANGES, PHASE I. HARD CODE   00003600
000001*   Q STREAM ONLY TO FORMAT TO NEW OPTION ASSET INPUT TO NSCC.    00003700
000001*   ALSO HARD CODE NOT ASCENDIS RUN UNTIL NOV 2009 QA.            00003800
000001* PDX    - CAT501   C0284023 09/14/09 10:18:44 TBLAMUR            00003900
000001* LRM020 SSR 64156 OVERRIDE CYCLE CUTOFF TIMES BY TABL VALUES     00004000
000001* PDX    - CAT501   C0285542 09/08/09 08:18:51 TBLAMUR            00004100
000001* LRM019 - SSR 67003 CORRECT ASCENDIS EXTRACT ASSETS 2X,          00004200
000001* LRM019 - QUALITY CURSORS BY CYCLE NUMBER.                       00004300
000001* PDX    - CAT501   C0272583 02/10/09 12:04:43 TBLAMUR            00004400
000001* LRM018 - SSR 61164 PTF CHANGES.                                 00004500
000001* PDX    - CAT501   C0273186 11/21/08 08:47:03 TBLAMUR            00004600
000001* LRM017 - ASCENDIS CONTINUED. PARALLEL MODE, IGNORE ACK-IND      00004700
000001* LRM017   WHEN PULLING PARALLEL CLIENT TO SEND TO NSCC.          00004800
000001* PDX    - CAT501   C0270214 10/20/08 13:16:01 TBLAMUR            00004900
000001* PDX    - CAT501   C0271105 09/30/08 14:34:25 TBLAMUR            00005000
000001* LRM016 - CONVERSION RELATED - BYPASS CLIENT 12.                 00005100
000001* PDX    - CAT501   C0260091 05/28/08 12:25:33 TBLAMUR            00005200
000001* LRM015 - SSR# 55766 ASCENDIS INTEGRATION ADD PARM TO DEPICT     00005300
000001* LRM015 -    ASCENDIS NSCC FEED VS. ASCENDIS FEED. ALSO EOD PARM.00005400
000001* PDX    - CAT501   C0254022 09/10/07 10:31:48 TBLAMUR            00005500
000001* LRM014 TSK 54242 QUALIFY TRNFR-TYPE ON ACTIOPN TO PREVENT -811  00005600
000001* LRM014 - ALSO ACTIMF.                                           00005700
000001* PDX    - CAT501   C0240752 11/15/06 10:35:46 TBLAMUR            00005800
000001* LRM013 SSR 49202 ADD GIFT IND FOR PTD                           00005900
000001* PDX    - CAT501   C0230622 02/07/06 14:44:14 TBLAMUR            00006000
000001* LRM012 SSR 45780 REMOVE CDSC FROM RECEIVER SIDE.                00006100
000001* PDX    - CAT501   C0227519 11/08/05 16:09:07 TBLAMUR            00006200
000001* LRM011 - EXTRACT PTR REQUEST CASH ASSETS WITH REQ=F, CASH=0     00006300
000001* PDX    - CAT501   C0227434 11/07/05 11:04:42 TBLAMUR            00006400
000001* DJ0002 - TASK43083 POPULATE MF FOR PTR DELIVERER SIDE           00006500
000001* PDX    - CAT501   C0224749 10/06/05 15:14:38 TBLAMUR            00006600
000001* DJ0001 - SSR 43083 DO NOT POPULATE MF AREA ON PTR REQUESTS.     00006700
000001* PDX    - CAT501   C0222782 06/27/05 09:23:03 TBLAMUR            00006800
000001* PDX    - CAT501   C0218852 06/06/05 15:44:33 TBLAMUR            00006900
000001* LRM010 - SSR 39561 PHASE-II SPACE OUT DUMMY AT,FR CONTROL NBR   00007000
000001* PDX    - CAT501   C0218155 03/17/05 11:17:22 TBLAMUR            00007100
000001* LRM009 - SSR 39561 PHASE-II USE TRANS REF ID FUL AT MOVE        00007200
000001* PDX    - CAT501   C0215263 01/14/05 14:23:20 TBLAMUR            00007300
000001* LRM008 - SSR 40042 REPLACE DB2 INIT TBL WITH ACTI*** NEW KEYS.  00007400
000001* PDX    - CAT501   C0214771 12/15/04 08:24:32 TBLAMUR            00007500
000001* PDX    - CAT501   C0211143 09/15/04 14:42:17 TBLAMUR            00007600
000001* LRM007 - PMR 2291656 TO EXTRACT CASH ASSETS W/PCT AND 0 AMT.    00007700
000001* PDX    - CAT501   C0207884 07/09/04 15:35:26 TBLAMUR            00007800
000001* LRM006 - SSR# 0028232 EXTRACT PTR DELIVERY ASSETS               00007900
000001* PDX    - CAT501   C0206073 05/17/04 15:31:34 TBLAMUR            00008000
000001* PDX    - CAT501   C0197067 10/17/03 14:51:38 TBEDTAK            00008100
000001* ET0001 - SSR 0035576  ADD RE-REGISTRATION DATE FIELD TO NSCC FL.00008200
000001* PDX    - CAT501   C0196253 09/26/03 12:37:38 TBLAMUR            00008300
000001* PDX    - CAT501   C0184397 12/26/02 09:46:25 TBLAMUR            00008400
000001* PDX    - CAT501   C0179727 10/16/02 09:26:53 TBLAMUR            00008500
000001* LRM005 - NEVER TRANSMIT TEST DATA CONTRA BROKER 0969 TO NSCC    00008600
000001* PDX    - CAT501   C0179270 10/04/02 13:55:48 TBLAMUR            00008700
000001* LRM004 - SSR 0029440 MUTUAL FUND DST/MFE CHANGE                 00008800
000001* PDX    - CAT501   C0168254 01/07/02 13:31:33 TBLAMUR            00008900
000001* PDX    - CAT501   C0160782 08/22/01 09:55:37 TBLAMUR            00009000
000001* LRM001 POPULATE MFC CUST FUND ACCT NBR ON EXTRACT.              00010000
000001*   NEW CUTOFF TIME PARM FOR RECEIVER ASSET DELETES.              00020000
000001* PDX    - CAT501   C0155175 03/01/01 16:19:05 TBLAMUR            00030000
000001* PDX    - CAT501   C0152145 02/20/01 18:16:22 TBLAMUR            00040000
000001* PDX    - CAT501   C0150927 12/19/00 09:45:20 TBLAMUR            00050000
000001* PDX    - CAT501   C0127153 06/21/99 10:34:05 TBLAMUR            00060000
000001* PDX    - CAT501   C0125192 05/27/99 11:35:44 TBLAMUR            00070000
000001* PDX    - CAT501   C0122958 04/12/99 10:39:59 TBTIKUO            00080000
000001* PDX    - CAT501   C0122721 03/10/99 17:28:44 TBTIKUO            00090000
       IDENTIFICATION DIVISION.                                         00100000
       PROGRAM-ID.  CAT501.                                             00110000
       DATE-WRITTEN.  JUNE 1998.                                        00120000
                                                                        00130000
      ***************************************************************** 00140000
      *                         REMARKS                               * 00150000
      ***************************************************************** 00160000
      * THIS PROGRAM SELECTS RECORDS FROM ACTITRF, ACTIAST, ACTIMF,   * 00170000
      * ACTIOPN, VFNDRGST, VFNDNA, VFNDPYBL, VFNDPYNA TABLES AND      * 00180000
      * CREATES NSCC INBOUND FILE WITH TI, AT AND FR RECORDS.         * 00190000
      ***************************************************************** 00200000
                                                                        00210000
           EJECT                                                        00220000
      ***************************************************************** 00230000
       ENVIRONMENT DIVISION.                                            00240000
      ***************************************************************** 00250000
LRM002* 12/14/01 LRM SSR R3550300 O-NSCC PHASE II. PASS LOT INDICATOR.* 00260000
      ***************************************************************** 00270000
       INPUT-OUTPUT SECTION.                                            00280000
       FILE-CONTROL.                                                    00290000
                                                                        00300000
           SELECT NSCC-IN-FILE                  ASSIGN  TO  NSCCIN.     00310000
                                                                        00320000
           SELECT CYCLE-LOG                     ASSIGN  TO  CYCLELOG    00330000
                  ORGANIZATION IS INDEXED                               00340000
                  ACCESS MODE  IS DYNAMIC                               00350000
                  RECORD KEY   IS CYCLE-LOG-KEY                         00360000
                  FILE STATUS  IS CYCLE-LOG-STATUS.                     00370000
                                                                        00380000
           SELECT NTWREG-FILE                   ASSIGN  TO  NTWREGOP    00390000
                  ORGANIZATION IS  INDEXED                              00400000
                  ACCESS       IS  DYNAMIC                              00410000
                  RECORD KEY   IS  NTWREG-KEY-IN                        00420000
                  FILE STATUS  IS  NTWREG-FILE-STATUS.                  00430000
                                                                        00440000
           SELECT NTWMAST-FILE                  ASSIGN TO   NTWMAST     00450000
                  ACCESS       IS  DYNAMIC                              00460000
                  ORGANIZATION IS  INDEXED                              00470000
                  RECORD KEY   IS  NTWMAST-KEY-IN                       00480000
                  FILE STATUS  IS  NTWMAST-FILE-STATUS.                 00490000
                                                                        00500000
      ***************************************************************** 00510000
       DATA DIVISION.                                                   00520000
      ***************************************************************** 00530000
                                                                        00540000
       FILE SECTION.                                                    00550000
                                                                        00560000
       FD  NSCC-IN-FILE                                                 00570000
           RECORDING MODE IS V                                          00580000
           RECORD CONTAINS 80 TO 2991                                   00590000
           DATA RECORDS ARE NSCC-HEADER-TRAILER                         00600000
           NSCC-TI-REC                                                  00610000
           NSCC-AT-REC NSCC-AT-OPTN-REC NSCC-AT-MF-REC                  00620000
           NSCC-FR-0-PYBL-REC  NSCC-FR-1-PYBL-REC NSCC-FR-2-PYBL-REC    00630000
           NSCC-FR-3-PYBL-REC  NSCC-FR-4-PYBL-REC NSCC-FR-5-PYBL-REC    00640000
           NSCC-FR-6-PYBL-REC                                           00650000
           BLOCK CONTAINS 0 RECORDS.                                    00660000
                                                                        00670000
       01  NSCC-HEADER-TRAILER                    PIC  X(080).          00680000
                                                                        00690000
       01  NSCC-TI-REC                            PIC  X(356).          00700000
                                                                        00710000
       01  NSCC-AT-REC                            PIC  X(431).          00720000
                                                                        00730000
       01  NSCC-AT-OPTN-REC.                                            00740000
           05  NSCC-AT-BASIC1                     PIC  X(431).          00750000
           05  NSCC-AT-OPTN                       PIC  X(066).          00760000
                                                                        00770000
       01  NSCC-AT-MF-REC.                                              00780000
           05  NSCC-AT-BASIC2                     PIC  X(431).          00790000
           05  NSCC-AT-MF                         PIC  X(119).          00800000
                                                                        00810000
       01  NSCC-FR-0-PYBL-REC                     PIC  X(759).          00820000
                                                                        00830000
       01  NSCC-FR-1-PYBL-REC.                                          00840000
           05  NSCC-FR-BASIC1                     PIC  X(759).          00850000
           05  NSCC-FR-PYBL-1                     PIC  X(372).          00860000
                                                                        00870000
       01  NSCC-FR-2-PYBL-REC.                                          00880000
           05  NSCC-FR-BASIC2                     PIC  X(759).          00890000
           05  NSCC-FR-PYBL-2 OCCURS 2 TIMES      PIC  X(372).          00900000
                                                                        00910000
       01  NSCC-FR-3-PYBL-REC.                                          00920000
           05  NSCC-FR-BASIC3                     PIC  X(759).          00930000
           05  NSCC-FR-PYBL-3 OCCURS 3 TIMES      PIC  X(372).          00940000
                                                                        00950000
       01  NSCC-FR-4-PYBL-REC.                                          00960000
           05  NSCC-FR-BASIC4                     PIC  X(759).          00970000
           05  NSCC-FR-PYBL-4 OCCURS 4 TIMES      PIC  X(372).          00980000
                                                                        00990000
       01  NSCC-FR-5-PYBL-REC.                                          01000000
           05  NSCC-FR-BASIC5                     PIC  X(759).          01010000
           05  NSCC-FR-PYBL-5 OCCURS 5 TIMES      PIC  X(372).          01020000
                                                                        01030000
       01  NSCC-FR-6-PYBL-REC.                                          01040000
           05  NSCC-FR-BASIC6                     PIC  X(759).          01050000
           05  NSCC-FR-PYBL-6 OCCURS 6 TIMES      PIC  X(372).          01060000
                                                                        01070000
       FD  CYCLE-LOG.                                                   01080000
       01  CYCLE-LOG-REC.                                               01090000
           05  CYCLE-LOG-KEY                      PIC X(25).            01100000
           05  FILLER                             PIC X(175).           01110000
                                                                        01120000
       FD  NTWREG-FILE.                                                 01130000
       01  NTWREG-RECORD.                                               01140000
           05  NTWREG-KEY-IN                PIC  X(18).                 01150000
           05  FILLER                       PIC  X(262).                01160000
                                                                        01170000
       FD  NTWMAST-FILE.                                                01180000
       01  NTWMAST-RECORD.                                              01190000
           05  NTWMAST-KEY-IN               PIC  X(39).                 01200000
LRM028     05  FILLER                       PIC  X(1121).               01210000
                                                                        01220000
           EJECT                                                        01230000
      ******************************************************************01240000
       WORKING-STORAGE SECTION.                                         01250000
      ******************************************************************01260000
                                                                        01270000
       77  CYCLE-LOG-STATUS              PIC  X(02)  VALUE '00'.        01280000
       77  NTWREG-FILE-STATUS            PIC  X(02)  VALUE '00'.        01290000
       77  NTWMAST-FILE-STATUS           PIC  X(02)  VALUE '00'.        01300000
       77  ABEND-CODE              COMP  PIC S9(4)   VALUE +9999.       01310000
       77  LENGTH-KEY                    PIC  9(02)  VALUE 9.           01320000
       77  WS-STREAM-IND                 PIC  X(01)  VALUE SPACES.      01330000
       77  WS-CLIENT                     PIC  X(04)  VALUE SPACES.      01340000
LRM006 77  WS-ADP-BROKER                 PIC  X(04)  VALUE SPACES.      01350000
       77  WS-RCRD-STTS-CD               PIC  X(01)  VALUE SPACE.       01360000
LRM019 77  WS-ASCENDIS-RCRD-STTS-CD      PIC  X(01)  VALUE SPACE.       01370000
       77  WS-CYCLE-CD                   PIC  X(02)  VALUE SPACE.       01380000
       77  WS-LAST-PROC-DATE             PIC  9(08)  VALUE 0.           01390000
       77  WS-LAST-CYCLE-NBR             PIC  9(04)  VALUE 0.           01400000
       77  WS-PYBL-NBR             COMP  PIC S9(04)  VALUE ZEROES.      01410000
       77  WS-TO-TMSTMP                  PIC  X(26)  VALUE SPACES.      01420000
       77  WS-FROM-TMSTMP                PIC  X(26)  VALUE SPACES.      01430000
       77  WS-MULTI-BATCH-NBR            PIC  9(04).                    01440000
       77  WS-MULTI-BATCH-NBR-ALPHA                                     01450000
           REDEFINES WS-MULTI-BATCH-NBR  PIC  X(04).                    01460000
       77  WS-REC-CNTR           COMP-3  PIC  9(09)  VALUE ZEROES.      01470000
       77  WS-IN-TI-REC-CNTR     COMP-3  PIC  9(09)  VALUE ZEROES.      01480000
       77  WS-IN-AT-REC-CNTR     COMP-3  PIC  9(09)  VALUE ZEROES.      01490000
       77  WS-IN-AT1-REC-CNTR    COMP-3  PIC  9(09)  VALUE ZEROES.      01500000
       77  WS-IN-AT2-REC-CNTR    COMP-3  PIC  9(09)  VALUE ZEROES.      01510000
       77  WS-IN-AT-OPTN-CNTR    COMP-3  PIC  9(09)  VALUE ZEROES.      01520000
       77  WS-IN-AT-MF-CNTR      COMP-3  PIC  9(09)  VALUE ZEROES.      01530000
       77  WS-IN-FR-REC-CNTR     COMP-3  PIC  9(09)  VALUE ZEROES.      01540000
       77  WS-IN-TOTAL-REC-CNTR  COMP-3  PIC  9(09)  VALUE ZEROES.      01550000
       77  WS-TOTAL-TI-REC-CNTR  COMP-3  PIC  9(09)  VALUE ZEROES.      01560000
       77  WS-TOTAL-AT-REC-CNTR  COMP-3  PIC  9(09)  VALUE ZEROES.      01570000
       77  WS-TOTAL-FR-REC-CNTR  COMP-3  PIC  9(09)  VALUE ZEROES.      01580000
       77  NSCCI-TOTAL-REC-CNTR  COMP-3  PIC  9(09)  VALUE ZEROES.      01590000
       77  WS-AT-ASSET-AMT-9     COMP-3  PIC  S9(17) VALUE ZEROES.      01600000
       77  WS-PAYABLE-NBR          COMP  PIC S9(04)  VALUE ZEROES.      01610000
       77  NA-LINE-CNTR                  PIC  9(01)  VALUE ZEROES.      01620000
       77  WS-COMP-2             COMP-2              VALUE ZEROES.      01630000
      *77  S1                            PIC  9(04)  VALUE ZEROES.      01640000
       77  B1-SUB                        PIC  9(03)  VALUE ZEROES.      01650000
       77  S1                            PIC  9(03)  VALUE ZEROES.      01660000
       77  S2                            PIC  9(01)  VALUE ZEROES.      01670000
       77  S3                            PIC  9(01)  VALUE ZEROES.      01680000
       77  S4                            PIC  9(03)  VALUE ZEROES.      01690000
       77  NTW-HOUSE-ACCOUNT             PIC  X(20)  VALUE SPACES.      01700000
LRM015 77  WS-ASCENDIS-ELIGIBLE          PIC  X(01)  VALUE SPACES.      01710000
LRM015 77  WS-NON-ASCENDIS-ENTRY         PIC  X(01)  VALUE SPACES.      01720000
LRM017 77  WS-ACK-IND-NON-ASCENDIS       PIC  X(01)  VALUE SPACES.      01730000
                                                                        01740000
           COPY STUBCPY.                                                01750000
           03  CKDIGIT                   PIC X(08)   VALUE 'CKDIGIT'.   01760000
LRM002     03  BMFSEC                    PIC X(08)   VALUE 'BMFSEC  '.  01770000
LRM020     03  TABLGET                   PIC X(08)   VALUE 'TABLGET '.  01780000
                                                                        01790000
       01  WS-BRCH-ACCT-TC.                                             01800000
           05  WS-BRHC-ACCT-TC.                                         01810000
               10  WS-BRCH               PIC  X(03)  VALUE SPACES.      01820000
               10  WS-ACCT               PIC  X(05)  VALUE SPACES.      01830000
               10  WS-T                  PIC  X(01)  VALUE SPACES.      01840000
           05  WS-C                      PIC  X(01)  VALUE SPACES.      01850000
                                                                        01860000
       01  WS-TC                         PIC  X(02)  VALUE SPACES.      01870000
                                                                        01880000
       01  FILLER                        PIC  X(20)  VALUE              01890000
           'TIME PLAYGROUND'.                                           01900000
                                                                        01910000
       01  FILLER.                                                      01920000
           05  WS-TMSTMP-TIME                PIC  X(26).                01930000
           05  WS-TMSTMP-AREA REDEFINES                                 01940000
               WS-TMSTMP-TIME.                                          01950000
               10  FILLER                    PIC  X(11).                01960000
               10  WS-TMSTMP-HH              PIC  9(02).                01970000
               10  FILLER                    PIC  X(01).                01980000
               10  WS-TMSTMP-MM              PIC  9(02).                01990000
               10  FILLER                    PIC  X(01).                02000000
               10  WS-TMSTMP-SS              PIC  9(02).                02010000
               10  FILLER                    PIC  X(01).                02020000
               10  WS-TMSTMP-NNS             PIC  9(06).                02030000
                                                                        02040000
           05  WS-CURRENT-AREA.                                         02050000
               10  WS-CURRENT-HH             PIC  9(02).                02060000
               10  WS-CURRENT-MM             PIC  9(02).                02070000
               10  WS-CURRENT-SS             PIC  9(02).                02080000
               10  WS-CURRENT-NNS            PIC  9(06).                02090000
           05  WS-CURRENT-TIME REDEFINES                                02100000
               WS-CURRENT-AREA               PIC  9(12).                02110000
                                                                        02120000
           05  WS-TIA-TIME-AREA.                                        02130000
               10  WS-TIA-HHMM               PIC  9(04).                02140000
               10  WS-TIA-SS                 PIC  9(08).                02150000
           05  WS-TIA-TIME REDEFINES                                    02160000
               WS-TIA-TIME-AREA              PIC  9(12).                02170000
                                                                        02180000
           05  WS-TIC-TIME-AREA.                                        02190000
               10  WS-TIC-HHMM               PIC  9(04).                02200000
               10  WS-TIC-SS                 PIC  9(08).                02210000
           05  WS-TIC-TIME REDEFINES                                    02220000
               WS-TIC-TIME-AREA              PIC  9(12).                02230000
                                                                        02240000
           05  WS-TIRD-TIME-AREA.                                       02250000
               10  WS-TIRD-HHMM              PIC  9(04).                02260000
               10  WS-TIRD-SS                PIC  9(08).                02270000
           05  WS-TIRD-TIME REDEFINES                                   02280000
               WS-TIRD-TIME-AREA             PIC  9(12).                02290000
                                                                        02300000
           05  WS-TIRR-TIME-AREA.                                       02310000
               10  WS-TIRR-HHMM              PIC  9(04).                02320000
               10  WS-TIRR-SS                PIC  9(08).                02330000
           05  WS-TIRR-TIME REDEFINES                                   02340000
               WS-TIRR-TIME-AREA             PIC  9(12).                02350000
                                                                        02360000
           05  WS-TIX-TIME-AREA.                                        02370000
               10  WS-TIX-HHMM               PIC  9(04).                02380000
               10  WS-TIX-SS                 PIC  9(08).                02390000
           05  WS-TIX-TIME REDEFINES                                    02400000
               WS-TIX-TIME-AREA              PIC  9(12).                02410000
                                                                        02420000
           05  WS-ATA-TIME-AREA.                                        02430000
               10  WS-ATA-HHMM               PIC  9(04).                02440000
               10  WS-ATA-SS                 PIC  9(08).                02450000
           05  WS-ATA-TIME REDEFINES                                    02460000
               WS-ATA-TIME-AREA              PIC  9(12).                02470000
                                                                        02480000
           05  WS-ATCD-TIME-AREA.                                       02490000
               10  WS-ATCD-HHMM              PIC  9(04).                02500000
               10  WS-ATCD-SS                PIC  9(08).                02510000
           05  WS-ATCD-TIME REDEFINES                                   02520000
               WS-ATCD-TIME-AREA             PIC  9(12).                02530000
                                                                        02540000
           05  WS-ATRD-TIME-AREA.                                       02550000
               10  WS-ATRD-HHMM              PIC  9(04).                02560000
               10  WS-ATRD-SS                PIC  9(08).                02570000
           05  WS-ATRD-TIME REDEFINES                                   02580000
               WS-ATRD-TIME-AREA             PIC  9(12).                02590000
                                                                        02600000
           05  WS-FRA-TIME-AREA.                                        02610000
               10  WS-FRA-HHMM               PIC  9(04).                02620000
               10  WS-FRA-SS                 PIC  9(08).                02630000
           05  WS-FRA-TIME REDEFINES                                    02640000
               WS-FRA-TIME-AREA              PIC  9(12).                02650000
LRM024     05  WS-PRICE                      PIC 9(12)V9(5) COMP-3.     02660000
LRM024     05  WS-TOTAL-ASSET-AMT            PIC 9(15)V99   COMP-3.     02670000
LRM024     05  WS-THIS-ASSET-AMT             PIC 9(15)V99   COMP-3.     02680000
LRM024     05  WS-TOTAL-ASSET-QTY            PIC 9(12)V9(5) COMP-3.     02690000
LRM024     05  WS-THIS-ASSET-QTY             PIC 9(12)V9(5).            02700000
LRM024     05  FILLER REDEFINES WS-THIS-ASSET-QTY.                      02710000
LRM024         10  WS-THIS-ASSET-QTY-DECIMAL PIC 9(12).                 02720000
LRM024         10  WS-THIS-ASSET-QTY-FRACT   PIC 9(05).                 02730000
LRM024     05  WS-WHOLE-OR-FRACT-QTY-SW      PIC X.                     02740000
LRM024         88  WHOLE-QTY-ONLY            VALUE 'W'.                 02741000
LRM024         88  FRACTIONAL-QTY-ALLOWED    VALUE 'F'.                 02741100
                                                                        02741200
LRM020     COPY TABCOBCM.                                               02741300
                                                                        02741400
       01  CLIENT-TABLE-CNTR             PIC  9(04)  VALUE 0.           02741500
                                                                        02741600
       01  CLIENT-TABLE-AREA.                                           02741700
           05  CLIENT-TABLE OCCURS 500 TIMES.                           02741800
               10  CLIENT-NUM            PIC  9(04)  VALUE ZEROES.      02741900
LRM006         10  CLIENT-ADP-BROKER     PIC  X(04)  VALUE SPACES.      02742000
LRM015         10  CLIENT-B1-ASCENDIS    PIC  X(01)  VALUE SPACES.      02743000
               10  CLIENT-B1-434503      PIC  X(01)  VALUE SPACES.      02744000
               10  CLIENT-B1-434619      PIC  X(01)  VALUE SPACES.      02745000
               10  CLIENT-B1-434636      PIC  X(04)  VALUE SPACES.      02746000
               10  CLIENT-B1-540167.                                    02747000
                   15 CLIENT-B1-EXEC-BKR-REC-NO  PIC 9(03) COMP-3.      02748000
                   15 CLIENT-B1-EXEC-BKR-REC.                           02749000
                      20  CLIENT-B1-EXEC-BKR-ENTRY OCCURS 200 TIMES.    02750000
                          25  CLIENT-B1-EXEC-BKR-LO    PIC  X(03).      02760000
                          25  CLIENT-B1-EXEC-BKR-HI    PIC  X(03).      02770000
                          25  CLIENT-B1-EXEC-BKR-CLEAR PIC  X(04).      02780000
               10  CLIENT-TI-REC-CNTR    PIC  9(09)  COMP-3  VALUE 0.   02790000
               10  CLIENT-AT-REC-CNTR    PIC  9(09)  COMP-3  VALUE 0.   02800000
               10  CLIENT-FR-REC-CNTR    PIC  9(09)  COMP-3  VALUE 0.   02810000
               10  CLIENT-ALL-REC-CNTR   PIC  9(09)  COMP-3  VALUE 0.   02820000
                                                                        02830000
       01  WS-CUST-NA-AREA.                                             02840000
           05  WS-CUST-NA-TABLE OCCURS 3 TIMES.                         02850000
               10  WS-CUST-NA-1          PIC  X(35)  VALUE SPACES.      02860000
               10  WS-CUST-NA-2          PIC  X(35)  VALUE SPACES.      02870000
               10  FILLER                PIC  X(23)  VALUE SPACES.      02880000
                                                                        02890000
       01  WS-ORIGINATOR.                                               02900000
           05  FILLER                    PIC  X(03)  VALUE 'ADP'.       02910000
           05  WS-ORIGINATOR-STREAM      PIC  X(01)  VALUE ' '.         02920000
                                                                        02930000
       01  WS-BPD-PROC-DATE.                                            02940000
           05  WS-BPD-CC                 PIC  X(02).                    02950000
           05  WS-BPD-YY                 PIC  X(02).                    02960000
           05  WS-BPD-MM                 PIC  X(02).                    02970000
           05  WS-BPD-DD                 PIC  X(02).                    02980000
                                                                        02990000
       01  WS-DATE-MMDDCCYY.                                            03000000
           05  WS-DATE-MM                PIC  X(02).                    03010000
           05  WS-DATE-DD                PIC  X(02).                    03020000
           05  WS-DATE-CC                PIC  X(02).                    03030000
           05  WS-DATE-YY                PIC  X(02).                    03040000
                                                                        03050000
       01  FILLER                        PIC  X(12)  VALUE              03060000
           'SWITCHES'.                                                  03070000
                                                                        03080000
       01  NTW-HOUSE-ACCT-SW             PIC  X(01)  VALUE 'N'.         03090000
           88  NTW-HOUSE-ACCT                        VALUE 'Y'.         03100000
                                                                        03110000
       01  NTW-OMNIBUS-ACCT-SW           PIC  X(01)  VALUE 'N'.         03120000
           88  NTW-OMNIBUS-ACCT                      VALUE 'Y'.         03130000
LRM004     88  NTW-DST-MFE-ACCT                      VALUE 'D'.         03140000
                                                                        03150000
       01  IO-SUCCESSFUL-SW              PIC  X(01)  VALUE 'N'.         03160000
           88  IO-SUCCESSFUL                         VALUE 'Y'.         03170000
                                                                        03180000
       01  RANGE-FOUND                   PIC  X(01)  VALUE 'N'.         03190000
                                                                        03200000
       01  FILLER.                                                      03210000
           05  FETCH-IND                 PIC  X(01)  VALUE '1'.         03220000
TCK  ***** 05  CUTOFF-IND                PIC  X(01).                    03230000
TCK  *****     88  BEFORE-CUTOFF                     VALUE 'B'.         03240000
TCK  *****     88  AFTER-CUTOFF                      VALUE 'A'.         03250000
TCK        05  TI-CUTOFF-IND             PIC  X(01).                    03260000
TCK            88  BEFORE-CUTOFF-TI                  VALUE 'B'.         03270000
TCK            88  AFTER-CUTOFF-TI                   VALUE 'A'.         03280000
TCK        05  AT-CUTOFF-IND             PIC  X(01).                    03290000
TCK            88  BEFORE-CUTOFF-AT                  VALUE 'B'.         03300000
TCK            88  AFTER-CUTOFF-AT                   VALUE 'A'.         03310000
TCK        05  FR-CUTOFF-IND             PIC  X(01).                    03320000
TCK            88  BEFORE-CUTOFF-FR                  VALUE 'B'.         03330000
TCK            88  AFTER-CUTOFF-FR                   VALUE 'A'.         03340000
           05  SQL-ERROR-IND             PIC  X(01)  VALUE ' '.         03350000
               88  BAD-UPDATE                            VALUE 'U'.     03360000
               88  BAD-FETCH                             VALUE 'F'.     03370000
               88  BAD-OPEN                              VALUE 'O'.     03380000
               88  BAD-CLOSE                             VALUE 'L'.     03390000
               88  BAD-SELECT                            VALUE 'S'.     03400000
               88  BAD-COMMIT                            VALUE 'M'.     03410000
               88  BAD-ROLLBACK                          VALUE 'R'.     03420000
               88  BAD-B1-CALL                           VALUE 'B'.     03430000
               88  BAD-INSERT                            VALUE 'I'.     03440000
           05  TROUBLE-DB2-OBJECT        PIC  X(15)      VALUE SPACES.  03450000
                                                                        03460000
       01  WS-FILE-DESC.                                                03470000
           05  FILLER                    PIC  X(03)  VALUE 'ADP'.       03480000
           05  WS-DESC-STREAM-IND        PIC  X(01)  VALUE ' '.         03490000
           05  FILLER                    PIC  X(16)                     03500000
               VALUE ' NSCC INPUT FILE'.                                03510000
                                                                        03520000
       01  WS-NM-END-LN-QTY-LONG         PIC  9(04).                    03530000
       01  FILLER                                                       03540000
           REDEFINES WS-NM-END-LN-QTY-LONG.                             03550000
           05  FILLER                    PIC  X(03).                    03560000
           05  WS-NM-END-LN-QTY          PIC  X(01).                    03570000
                                                                        03580000
       01  WS-FLOATING-AREA.                                            03590000
                                                                        03600000
           05  WS-INTEGER-AREA           PIC  9(12)V9(05).              03610000
           05  FILLER REDEFINES                                         03620000
               WS-INTEGER-AREA.                                         03630000
               10  WS-INTEGER            PIC  9(12).                    03640000
               10  FILLER                PIC V9(05).                    03650000
                                                                        03660000
           05  WS-DECIMAL                PIC V9(06).                    03670000
           05  WS-DECIMAL-ALPHA REDEFINES                               03680000
               WS-DECIMAL                PIC  X(06).                    03690000
           05  WS-DECIMAL-CNTR           PIC  9(01)  VALUE ZEROES.      03700000
                                                                        03710000
           05  WS-FIELD1.                                               03720000
               10  WS-FIELD1-INT         PIC  9(15).                    03730000
               10  WS-FIELD1-DEC         PIC  V9(01).                   03740000
           05  WS-FIELD-1 REDEFINES                                     03750000
               WS-FIELD1                 PIC  9(15)V9(01).              03760000
                                                                        03770000
           05  WS-FIELD2.                                               03780000
               10  WS-FIELD2-INT         PIC  9(14).                    03790000
               10  WS-FIELD2-DEC         PIC V9(02).                    03800000
           05  WS-FIELD-2 REDEFINES                                     03810000
               WS-FIELD2                 PIC  9(14)V9(02).              03820000
                                                                        03830000
           05  WS-FIELD3.                                               03840000
               10  WS-FIELD3-INT         PIC  9(13).                    03850000
               10  WS-FIELD3-DEC         PIC V9(03).                    03860000
           05  WS-FIELD-3 REDEFINES                                     03870000
               WS-FIELD3                 PIC  9(13)V9(03).              03880000
                                                                        03890000
           05  WS-FIELD4.                                               03900000
               10  WS-FIELD4-INT         PIC  9(12).                    03910000
               10  WS-FIELD4-DEC         PIC V9(04).                    03920000
           05  WS-FIELD-4 REDEFINES                                     03930000
               WS-FIELD4                 PIC  9(12)V9(04).              03940000
                                                                        03950000
           05  WS-MASK-0                 PIC  99999999999999999.        03960000
           05  WS-MASK-1                 PIC  999999999999999.9.        03970000
           05  WS-MASK-2                 PIC  99999999999999.99.        03980000
           05  WS-MASK-3                 PIC  9999999999999.999.        03990000
           05  WS-MASK-4                 PIC  999999999999.9999.        04000000
           05  WS-MASK-5                 PIC  99999999999.99999.        04010000
                                                                        04020000
           05  WS-FIELD5.                                               04030000
               10  WS-FIELD5-INT         PIC  9(11).                    04040000
               10  WS-FIELD5-DEC         PIC V9(05).                    04050000
           05  WS-FIELD-5 REDEFINES                                     04060000
               WS-FIELD5                 PIC  9(11)V9(05).              04070000
           05  WS-MASK-0-PCT             PIC  999999999999999.          04080000
           05  WS-MASK-1-PCT             PIC  9999999999999.9.          04090000
           05  WS-MASK-2-PCT             PIC  999999999999.99.          04100000
           05  WS-MASK-3-PCT             PIC  99999999999.999.          04110000
           05  WS-MASK-4-PCT             PIC  9999999999.9999.          04120000
           05  WS-MASK-5-PCT             PIC  999999999.99999.          04130000
           05  WS-DISBURS-AMT-0          PIC  9(14)V9(02).              04140000
           05  WS-DISBURS-AMT-1 REDEFINES                               04150000
               WS-DISBURS-AMT-0          PIC  9(06)V9(10).              04160000
           05  WS-DISBURS-AMT-2 REDEFINES                               04170000
               WS-DISBURS-AMT-0          PIC  9(12)V9(04).              04180000
                                                                        04190000
           EJECT                                                        04200000
           COPY BHINFO.                                                 04210000
                                                                        04220000
           EJECT                                                        04230000
           COPY BHACAT.                                                 04240000
                                                                        04250000
           EJECT                                                        04260000
           COPY BHMF3.                                                  04270000
                                                                        04280000
           EJECT                                                        04290000
           COPY ZCATB1 REPLACING ==:ZCATB1:==  BY  ==ZCATB1==.          04300000
                                                                        04310000
           EJECT                                                        04320000
           COPY ACATLOG REPLACING ==:LOG:== BY ==CLOG==.                04330000
                                                                        04340000
           EJECT                                                        04350000
           COPY BPDATESC.                                               04360000
                                                                        04370000
           EJECT                                                        04380000
           COPY NSCCDHDR.                                               04390000
                                                                        04400000
           EJECT                                                        04410000
           COPY NSCCDTI.                                                04420000
                                                                        04430000
           EJECT                                                        04440000
           COPY NSCCDAT.                                                04450000
                                                                        04460000
           EJECT                                                        04470000
           COPY NSCCDFR.                                                04480000
                                                                        04490000
           EJECT                                                        04500000
           COPY NSCCDTRL.                                               04510000
                                                                        04520000
           EJECT                                                        04530000
       01  NTWREG-REC.                                                  04540000
           COPY BNWREGOP.                                               04550000
                                                                        04560000
           EJECT                                                        04570000
       01  NTWMAST-REC.                                                 04580000
           COPY BNWMASTW.                                               04590000
                                                                        04600000
       01  DSNTIAR                       PIC X(08)  VALUE 'DSNTIAR'.    04610000
       01  WS-DB2-MESSAGE-AREA.                                         04620000
           05  WS-DB2-MSG-LEN            PIC S9(04) COMP VALUE +960.    04630000
           05  WS-ERROR-MSG              PIC X(80)  OCCURS 12 TIMES     04640000
               INDEXED BY WS-ERROR-INDEX.                               04650000
       01  WS-ERR-LINE-LEN               PIC S9(09) COMP VALUE +80.     04660000
TCK    01  WS-SQLCODE                    PIC Z(8)9-.                    04670000
TCK    01  WS-TI-SQLCODE                 PIC S9(9)  COMP-4.             04680000
TCK    01  WS-AT-SQLCODE                 PIC S9(9)  COMP-4.             04690000
TCK    01  WS-FR-SQLCODE                 PIC S9(9)  COMP-4.             04700000
       01  FILLER                        PIC  X(12)      VALUE          04710000
           'TI FIELDS'.                                                 04720000
                                                                        04730000
       01  TI-AREA.                                                     04740000
           05  TI-TRANS-TYPE-CD          PIC  X(01).                    04750000
           05  TI-ACAT-CONTROL-NBR       PIC  X(14).                    04760000
           05  TI-TRNFR-TYPE-CD          PIC  X(03).                    04770000
           05  TI-SBMTG-PRTCP-NBR        PIC  X(04).                    04780000
           05  TI-RCV-NBR                PIC  X(04).                    04790000
           05  TI-DLVR-NBR               PIC  X(04).                    04800000
           05  TI-ACCT-RCV-NBR           PIC  X(20).                    04810000
           05  TI-RCV-CUST-NM            PIC  X(60).                    04820000
           05  TI-RCV-SS-PRIM-NBR        PIC  X(09).                    04830000
           05  TI-RCV-SS-SCNDY-NBR       PIC  X(09).                    04840000
           05  TI-RCV-ACCT-TYPE-CD       PIC  X(02).                    04850000
           05  TI-RCV-OCC-BRKR-NBR       PIC  X(05).                    04860000
           05  TI-RCV-CRSPN-NBR          PIC  X(04).                    04870000
           05  TI-ACCT-DLVR-NBR          PIC  X(20).                    04880000
           05  TI-TRNFR-TYPE-RJCT-CD     PIC  X(02).                    04890000
           05  TI-ACAT-CNTL-ASTD-NBR     PIC  X(14).                    04900000
           05  TI-STTLM-ASCTD-DT         PIC  X(10).                    04910000
           05  TI-TRANS-RFRN-ID-CD       PIC  X(20).                    04920000
           05  TI-NSCC-PEND-CD           PIC  X(01).                    04930000
           05  TI-CMNT-TXT               PIC  X(120).                   04940000
           05  TI-CYCLE-CD               PIC  X(02).                    04950000
           05  TI-UPDT-TMSTP             PIC  X(26).                    04960000
LRM013     05  TI-GIFT-IND               PIC  X(01).                    04970000
                                                                        04980000
       01  FILLER                        PIC  X(12)      VALUE          04990000
           'AT AREA'.                                                   05000000
                                                                        05010000
       01  AT-AREA.                                                     05020000
           05  AT-TRANS-TYPE-CD      PIC  X(01).                        05030000
           05  AT-ACAT-CONTROL-NBR   PIC  X(14).                        05040000
           05  AT-TRNFR-TYPE-CD      PIC  X(03).                        05050000
           05  AT-SBMTG-PRTCP-NBR    PIC  X(04).                        05060000
           05  AT-RCV-NBR            PIC  X(04).                        05070000
           05  AT-DLVR-NBR           PIC  X(04).                        05080000
           05  AT-TRANS-RFRN-ID-CD   PIC  X(20).                        05090000
           05  AT-ASSET-SEQ-NBR      PIC S9(04)  COMP.                  05100000
           05  AT-ASSET-PRC-CTGY-CD  PIC  X(04).                        05110000
           05  AT-OPTN-CTGY-CD       PIC  X(02).                        05120000
           05  AT-STTLM-LCTN-CD      PIC  X(02).                        05130000
           05  AT-STTLM-RSN-CD       PIC  X(04).                        05140000
           05  AT-ISIN-CNTRY-CD      PIC  X(02).                        05150000
           05  AT-ISIN-SEC-ISSUE-CD  PIC  X(09).                        05160000
           05  AT-ISIN-SEC-CDG-CD    PIC  X(01).                        05170000
           05  AT-ASSET-DESC-TXT     PIC  X(140).                       05180000
           05  AT-ASSET-RQST-QTY-CD  PIC  X(01).                        05190000
           05  AT-AST-RQST-TRANS-CD  PIC  X(01).                        05200000
           05  AT-ASSET-QTY                      COMP-2.                05210000
           05  AT-ASSET-PCT                      COMP-2.                05220000
           05  AT-PSTN-CD            PIC  X(01).                        05230000
           05  AT-ISO-CRNCY-CD       PIC  X(03).                        05240000
           05  AT-ASSET-AMT                      COMP-2.                05250000
           05  AT-BEARER-BOND-CD     PIC  X(01).                        05260000
           05  AT-CSH-MGN-SHRT-CD    PIC  X(01).                        05270000
           05  AT-WHI-CD             PIC  X(01).                        05280000
           05  AT-TRNFR-TYPE-RSN-CD  PIC  X(02).                        05290000
           05  AT-MBS-SERIAL-NBR     PIC  X(03).                        05300000
           05  AT-ASSET-CMNT-TXT     PIC  X(120).                       05310000
           05  AT-ACCT-RCV-NBR       PIC  X(20).                        05320000
           05  AT-ACCT-DLVR-NBR      PIC  X(20).                        05330000
           05  AT-NSCC-PEND-CD       PIC  X(01).                        05340000
  ***** /* FOR CYCLE # */                                               05350000
           05  AT-RCRD-STTS-CD       PIC  X(01).                        05360000
           05  AT-UPDT-TMSTP             PIC  X(26).                    05370000
           05  AT-PRGM-NM            PIC X(08).                         05380000
LRM025     05  AT-NSCC-WTHLD-CD      PIC  X(01).                        05390000
      *                                                                 05400000
       01  FILLER                    PIC  X(12)        VALUE            05410000
           'AT-OPTN AREA'.                                              05420000
                                                                        05430000
       01  ATO-AREA.                                                    05440000
           05  ATO-BS-CD             PIC  X(01).                        05450000
           05  ATO-PTCL-CD           PIC  X(01).                        05460000
           05  ATO-OPTN-OPN-CLSD-CD  PIC  X(01).                        05470000
           05  ATO-SYM-CD            PIC  X(06).                        05480000
           05  ATO-EXPTN-DT          PIC  X(10).                        05490000
           05  ATO-STPRC-INTEGER-AMT PIC S9(04)  COMP.                  05500000
           05  ATO-STPRC-FRCTN-AMT   PIC S9(04)  COMP.                  05510000
           05  ATO-DLVR-OCC-NBR      PIC  X(10).                        05520000
           05  ATO-OPTN-ACCT-TYPE-CD PIC  X(01).                        05530000
           05  ATO-ACCT-SUB-CD       PIC  X(04).                        05540000
           05  ATO-OPTN-CMNT-TXT     PIC  X(16).                        05550000
                                                                        05560000
       01  FILLER                        PIC  X(12)      VALUE          05570000
           'AT-FUND AREA'.                                              05580000
                                                                        05590000
       01  ATF-AREA.                                                    05600000
           05  ATF-FNBR                  PIC  X(20).                    05610000
           05  ATF-BK-PHSCL-SHR-CD       PIC  X(01).                    05620000
           05  ATF-NTWRK-CNTL-CD         PIC  X(01).                    05630000
           05  ATF-ACCT-TYPE-CD          PIC  X(01).                    05640000
           05  ATF-DVDND-CD              PIC  X(01).                    05650000
           05  ATF-LTCG-CD               PIC  X(01).                    05660000
           05  ATF-STCG-CD               PIC  X(01).                    05670000
           05  ATF-DVDND-PAYEE-CD        PIC  X(01).                    05680000
           05  ATF-BRKR-EXCTG-NBR        PIC  X(04).                    05690000
           05  ATF-MF-FULL-PRTL-CD       PIC  X(01).                    05700000
           05  ATF-BK-PHSC-SHR-STS-CD    PIC  X(01).                    05710000
ET0001     05  ATF-RE-REGIST-DATE        PIC  X(10).                    05720000
           05  ATF-FCST-ACCT-RCVR-NBR    PIC  X(20).                    05730000
LRM027     05  ATF-ACCT-TYPE-STTS-CD     PIC  X(01).                    05731000
                                                                        05740000
       01  FILLER                        PIC  X(12)      VALUE          05750000
           'FR-AREA'.                                                   05760000
                                                                        05770000
       01  FR-AREA.                                                     05780000
           05  FR-ACAT-CONTROL-NBR     PIC  X(14).                      05790000
           05  FR-TRNFR-TYPE-CD        PIC  X(03).                      05800000
           05  FR-SBMTG-PRTCP-NBR      PIC  X(04).                      05810000
           05  FR-DLVR-NBR             PIC  X(04).                      05820000
           05  FR-ASSET-SEQ-NBR        PIC S9(04)  COMP.                05830000
           05  FR-ISIN-CNTRY-CD        PIC  X(02).                      05840000
           05  FR-ISIN-SEC-ISSUE-CD    PIC  X(09).                      05850000
           05  FR-ISIN-SEC-CDG-CD      PIC  X(01).                      05860000
           05  FR-MF-TRANS-TYPE-CD     PIC  X(01).                      05870000
           05  FR-FRCTN-CD             PIC  X(01).                      05880000
           05  FR-NRA-TAX-PCT          PIC SV9(2)  COMP-3.              05890000
           05  FR-DSBMT-ACCRL-CD       PIC  X(01).                      05900000
           05  FR-DSBMT-FRCTN-CSH-CD   PIC  X(01).                      05910000
           05  FR-DSBMT-RSDL-CD        PIC  X(01).                      05920000
           05  FR-BK-PHSCL-SHR-CD      PIC  X(01).                      05930000
           05  FR-DLRVY-CD             PIC  X(01).                      05940000
           05  FR-TPA-NBR              PIC  X(04).                      05950000
           05  FR-CUST-NM              PIC  X(20).                      05960000
           05  FR-FUND-ACCT-CD         PIC  X(01).                      05970000
           05  FR-FNBR                 PIC  X(20).                      05980000
           05  FR-BRKR-EXCTG-NBR       PIC  X(04).                      05990000
           05  FR-NTWRK-CNTL-CD        PIC  X(01).                      06000000
           05  FR-SS-TIN-CD            PIC  X(01).                      06010000
           05  FR-SS-TIN-NBR           PIC  X(09).                      06020000
           05  FR-NM-END-LN-QTY        PIC S9(04)  COMP.                06030000
           05  FR-LTCG-CD              PIC  X(01).                      06040000
           05  FR-STCG-CD              PIC  X(01).                      06050000
           05  FR-DVDND-CD             PIC  X(01).                      06060000
           05  FR-WTHLD-CD             PIC  X(01).                      06070000
           05  FR-PYBL-INFO-CD         PIC  X(01).                      06080000
           05  FR-ZIP5-CD              PIC  X(05).                      06090000
           05  FR-ZIP4-CD              PIC  X(04).                      06100000
           05  FR-SOC-CD               PIC  X(02).                      06110000
           05  FR-NAV-ACCT-IND         PIC  X(01).                      06120000
           05  FR-MRGN-ACCT-IND        PIC  X(01).                      06130000
           05  FR-CHCK-WRTNG-IND       PIC  X(01).                      06140000
           05  FR-SL-ST-CD             PIC  X(02).                      06150000
           05  FR-CNTRY-ORGN-CD        PIC  X(02).                      06160000
           05  FR-ACCT-RR-NM           PIC  X(15).                      06170000
           05  FR-ACCT-RR-CD           PIC  X(09).                      06180000
           05  FR-BRCH-NBR             PIC  X(09).                      06190000
           05  FR-PYBL-QTY             PIC S9(04)  COMP.                06200000
           05  FR-MEMO-TXT             PIC  X(12).                      06210000
           05  FR-ACH-IND              PIC  X(01).                      06220000
           05  FR-PAC-IND              PIC  X(01).                      06230000
           05  FR-SWP-IND              PIC  X(01).                      06240000
           05  FR-ROA-LOI-AMT          PIC S9(14)V9(2) COMP-3.          06250000
           05  FR-LOI-DT               PIC  X(10).                      06260000
           05  FR-TRD-RLTD-IND         PIC  X(01).                      06270000
           05  FR-ACCT-RLTD-NBR        PIC  X(20).                      06280000
           05  FR-ACCT-RLTD-CD         PIC  X(01).                      06290000
           05  FR-SWP-PAC-EFFCT-DT     PIC  X(10).                      06300000
           05  FR-CDSC-PYMNT-CD        PIC  X(01).                      06310000
           05  FR-DSBMT-OPTN-CD        PIC  X(01).                      06320000
           05  FR-DSBMT-AMT                        COMP-2.              06330000
           05  FR-PYMNT-JAN-IND         PIC  X(01).                     06340000
           05  FR-PYMNT-FEB-IND        PIC  X(01).                      06350000
           05  FR-PYMNT-MAR-IND        PIC  X(01).                      06360000
           05  FR-PYMNT-APR-IND        PIC  X(01).                      06370000
           05  FR-PYMNT-MAY-IND        PIC  X(01).                      06380000
           05  FR-PYMNT-JUN-IND        PIC  X(01).                      06390000
           05  FR-PYMNT-JUL-IND        PIC  X(01).                      06400000
           05  FR-PYMNT-AUG-IND        PIC  X(01).                      06410000
           05  FR-PYMNT-SEP-IND        PIC  X(01).                      06420000
           05  FR-PYMNT-OCT-IND        PIC  X(01).                      06430000
           05  FR-PYMNT-NOV-IND        PIC  X(01).                      06440000
           05  FR-PYMNT-DEC-IND        PIC  X(01).                      06450000
           05  FR-PYMNT-DT-CD          PIC  X(02).                      06460000
           05  FR-RTRMT-TAX-CD         PIC  X(02).                      06470000
           05  FR-SHRHR-BNK-ACCT-NBR   PIC  X(20).                      06480000
           05  FR-SHRHR-BNK-TYPE-CD    PIC  X(01).                      06490000
           05  FR-CHCK-FRST-DT         PIC  X(10).                      06500000
           05  FR-ABA-ROUTING-NBR      PIC  X(09).                      06510000
           05  FR-COST-BSS-CD          PIC  X(01).                      06520000
           05  FR-NSCC-PEND-CD         PIC  X(01).                      06530000
  ***** /* FOR CYCLE # */                                               06540000
           05  FR-RCRD-STTS-CD       PIC  X(01).                        06550000
           05  FR-UPDT-TMSTP         PIC  X(26).                        06560000
           05  FR-W8-WTHLD-CD        PIC X.                             06570000
           05  FR-W8-CERT-DT         PIC X(10).                         06580000
           05  FR-W8-EXPTN-DT        PIC X(10).                         06590000
           05  FR-W8-OVRD-NRA-SPC-RT PIC S9(2)V9(3) COMP-3.             06600000
           05  FR-W8-QULFD-INTRM-IND PIC X.                             06610000
           05  FR-W8-OVRD-CNTRY-CD   PIC X.                             06620000
           05  FR-W8-OVRD-CNTRY-CD-STTS PIC X.                          06630000
LRM027     05  FR-FUND-ACCT-STTS-CD  PIC X.                             06631000
LRM029     05  FR-FND-AGNT-CD        PIC X.                             06632000
                                                                        06640000
       01  FR-NA-LINE-AREA.                                             06650000
           05 FR-NA-LINE-NBR           PIC  S9(4)  COMP.                06660000
           05 FR-CUST-NA-LINE-TXT      PIC  X(35).                      06670000
                                                                        06680000
       01  FILLER                      PIC  X(12)     VALUE             06690000
           'FR-PBL-AREA'.                                               06700000
                                                                        06710000
       01  FRP-AREA.                                                    06720000
           05  FRP-ACCT-NBR            PIC  X(20).                      06730000
           05  FRP-ZIP5-CD             PIC  X(05).                      06740000
           05  FRP-ZIP4-CD             PIC  X(04).                      06750000
           05  FRP-ACCT-PYBL-CD        PIC  X(01).                      06760000
           05  FRP-ISIN-CNTRY-CD       PIC  X(02).                      06770000
           05  FRP-ISIN-SEC-ISSUE-CD   PIC  X(09).                      06780000
           05  FRP-ISIN-SEC-CDG-CD     PIC  X(01).                      06790000
           05  FRP-PYBL-ALTNT-CD       PIC  X(01).                      06800000
           05  FRP-PYBL-ALTNT-RSN-TXT  PIC  X(20).                      06810000
           05  FRP-ADDRS-DVDND-IND     PIC  X(01).                      06820000
           05  FRP-ADDRS-SYSWL-IND     PIC  X(01).                      06830000
           05  FRP-ADDRS-ATMDF-IND     PIC  X(01).                      06840000
           05  FRP-CRSS-FND-RNVST-IND  PIC  X(01).                      06850000
           05  FRP-ALTNT-PYBL-IND      PIC  X(01).                      06860000
                                                                        06870000
       01  FRP-NA-LINE-AREA.                                            06880000
           05  FRP-NA-LINE-NBR         PIC  S9(4) COMP.                 06890000
           05  FRP-PYBL-NA-LINE-TXT    PIC  X(35).                      06900000
                                                                        06910000
      *DB2 COMMUNICATION AREA                                           06920000
           EJECT                                                        06930000
           EXEC SQL                                                     06940000
              INCLUDE SQLCA                                             06950000
           END-EXEC.                                                    06960000
                                                                        06970000
           EJECT                                                        06980000
           EXEC SQL                                                     06990000
              INCLUDE ACTITRF                                           07000000
           END-EXEC.                                                    07010000
                                                                        07020000
           EJECT                                                        07030000
           EXEC SQL                                                     07040000
              INCLUDE ACTIAST                                           07050000
           END-EXEC.                                                    07060000
                                                                        07070000
           EJECT                                                        07080000
           EXEC SQL                                                     07090000
              INCLUDE ACTIOPN                                           07100000
           END-EXEC.                                                    07110000
                                                                        07120000
           EJECT                                                        07130000
           EXEC SQL                                                     07140000
              INCLUDE ACTIMF                                            07150000
           END-EXEC.                                                    07160000
                                                                        07170000
           EJECT                                                        07180000
           EXEC SQL                                                     07190000
              INCLUDE VMF                                               07200000
           END-EXEC.                                                    07210000
                                                                        07220000
           EJECT                                                        07230000
           EXEC SQL                                                     07240000
              INCLUDE VFNDRGST                                          07250000
           END-EXEC.                                                    07260000
                                                                        07270000
           EJECT                                                        07280000
           EXEC SQL                                                     07290000
              INCLUDE VFNDNA                                            07300000
           END-EXEC.                                                    07310000
                                                                        07320000
           EJECT                                                        07330000
           EXEC SQL                                                     07340000
              INCLUDE VFNDPYBL                                          07350000
           END-EXEC.                                                    07360000
                                                                        07370000
           EJECT                                                        07380000
           EXEC SQL                                                     07390000
              INCLUDE VFNDPYNA                                          07400000
           END-EXEC.                                                    07410000
                                                                        07420000
      *DECLARE CURSOR TO OBTAIN ALL TI RECORDS FOR THE CLIENT           07430000
           EXEC SQL                                                     07440000
              DECLARE NSCC_TI_CRSR CURSOR FOR                           07450000
                 SELECT                                                 07460000
                    TRANS_TYPE_CD,                                      07470000
                    ACAT_CONTROL_NBR,                                   07480000
                    TRNFR_TYPE_CD,                                      07490000
                    SBMTG_PRTCP_NBR,                                    07500000
                    RCV_NBR,                                            07510000
                    DLVR_NBR,                                           07520000
                    ACCT_RCV_NBR,                                       07530000
                    RCV_CUST_NM,                                        07540000
                    RCV_SS_PRIM_NBR,                                    07550000
                    RCV_SS_SCNDY_NBR,                                   07560000
                    RCV_ACCT_TYPE_CD,                                   07570000
                    RCV_OCC_BRKR_NBR,                                   07580000
                    RCV_CRSPN_NBR,                                      07590000
                    ACCT_DLVR_NBR,                                      07600000
                    TRNFR_TYPE_RJCT_CD,                                 07610000
                    ACAT_CNTL_ASTD_NBR,                                 07620000
                    STTLM_ASCTD_DT,                                     07630000
                    TRANS_RFRN_ID_CD,                                   07640000
                    NSCC_PEND_CD,                                       07650000
TCK                 CMNT_TXT,                                           07660000
TCK                 CYCLE_CD,                                           07670000
TCK                 UPDT_TMSTP,                                         07680000
LRM013              GIFT_IND                                            07690000
                 FROM ACTITRF                                           07700000
                 WHERE (CLIENT_NBR   =  :WS-CLIENT          AND         07710000
                       NSCC_PEND_CD =  'Y'                  AND         07720000
                       CYCLE_CD = :WS-CYCLE-CD              AND         07730000
LRM015                (NSCC_ACK_IND =  :WS-ASCENDIS-ELIGIBLE OR         07740000
LRM015                 NSCC_ACK_IND =  :WS-NON-ASCENDIS-ENTRY OR        07750000
LRM017                 NSCC_ACK_IND LIKE :WS-ACK-IND-NON-ASCENDIS))     07760000
LRM016           OR   (CLIENT_NBR   =  :WS-CLIENT                       07770000
LRM019           AND   RCRD_STTS_CD LIKE :WS-ASCENDIS-RCRD-STTS-CD      07780000
LRM016           AND   NSCC_ACK_IND =  :WS-ASCENDIS-ELIGIBLE)           07790000
           END-EXEC.                                                    07800000
                                                                        07810000
                                                                        07820000
      * DECLARE CURSOR TO OBTAIN ALL AT RECORDS FOR "FUL" REQUESTS      07830000
           EXEC SQL                                                     07840000
              DECLARE NSCC_AT1_CRSR CURSOR FOR                          07850000
                 SELECT                                                 07860000
                    TRANS_TYPE_CD,                                      07870000
                    ACAT_CONTROL_NBR,                                   07880000
                    TRNFR_TYPE_CD,                                      07890000
                    SBMTG_PRTCP_NBR,                                    07900000
                    RCV_NBR,                                            07910000
                    DLVR_NBR,                                           07920000
                    TRANS_RFRN_ID_CD,                                   07930000
                    ASSET_SEQ_NBR,                                      07940000
                    ASSET_PRC_CTGY_CD,                                  07950000
                    OPTN_CTGY_CD,                                       07960000
                    STTLM_LCTN_CD,                                      07970000
                    STTLM_RSN_CD,                                       07980000
                    ISIN_CNTRY_CD,                                      07990000
                    ISIN_SEC_ISSUE_CD,                                  08000000
                    ISIN_SEC_CDG_CD,                                    08010000
                    ASSET_DESC_TXT,                                     08020000
                    ASSET_RQST_QTY_CD,                                  08030000
                    AST_RQST_TRANS_CD,                                  08040000
                    ASSET_QTY,                                          08050000
                    ASSET_PCT,                                          08060000
                    PSTN_CD,                                            08070000
                    ISO_CRNCY_CD,                                       08080000
                    ASSET_AMT,                                          08090000
                    BEARER_BOND_CD,                                     08100000
                    CSH_MGN_SHRT_CD,                                    08110000
                    WHI_CD,                                             08120000
                    TRNFR_TYPE_RSN_CD,                                  08130000
                    MBS_SERIAL_NBR,                                     08140000
                    ASSET_CMNT_TXT,                                     08150000
                    ACCT_RCV_NBR,                                       08160000
                    ACCT_DLVR_NBR,                                      08170000
                    NSCC_PEND_CD,                                       08180000
                    RCRD_STTS_CD,                                       08190000
TCK                 UPDT_TMSTP,                                         08200000
                    PRGM_NM,                                            08210000
LRM025              NSCC_WTHLD_CD                                       08220000
                 FROM ACTIAST                                           08230000
                 WHERE (CLIENT_NBR   =  :WS-CLIENT  AND                 08240000
LRM015                (NSCC_ACK_IND =  :WS-ASCENDIS-ELIGIBLE  OR        08250000
LRM015                 NSCC_ACK_IND =  :WS-NON-ASCENDIS-ENTRY OR        08260000
LRM017                 NSCC_ACK_IND LIKE :WS-ACK-IND-NON-ASCENDIS) AND  08270000
                      (TRNFR_TYPE_CD = 'FUL'       AND                  08280000
                       NSCC_PEND_CD =  'Y'         AND                  08290000
                       RCRD_STTS_CD = :WS-RCRD-STTS-CD)  OR             08300000
                      (TRNFR_TYPE_CD = 'PTR'       AND                  08310000
                       NOT RCV_NBR      = :WS-ADP-BROKER  AND           08320000
                       SBMTG_PRTCP_NBR  = :WS-ADP-BROKER  AND           08330000
                       NSCC_PEND_CD =  'Y'                AND           08340000
                       RCRD_STTS_CD = :WS-RCRD-STTS-CD))                08350000
LRM016             OR ((CLIENT_NBR   =  :WS-CLIENT  AND                 08360000
LRM016                 NSCC_ACK_IND =  :WS-ASCENDIS-ELIGIBLE  AND       08370000
LRM019                 RCRD_STTS_CD LIKE :WS-ASCENDIS-RCRD-STTS-CD AND  08380000
LRM016                 TRNFR_TYPE_CD = 'FUL')  OR                       08390000
LRM016                (TRNFR_TYPE_CD = 'PTR'       AND                  08400000
LRM016                 NSCC_ACK_IND =  :WS-ASCENDIS-ELIGIBLE  AND       08410000
LRM019                 RCRD_STTS_CD LIKE :WS-ASCENDIS-RCRD-STTS-CD AND  08420000
LRM016                 NOT RCV_NBR      = :WS-ADP-BROKER  AND           08430000
LRM016                 SBMTG_PRTCP_NBR  = :WS-ADP-BROKER))              08440000
LRM010        ORDER BY                                                  08450000
LRM010           ACAT_CONTROL_NBR                                       08460000
LRM010          ,TRNFR_TYPE_CD                                          08470000
LRM010          ,ACCT_DLVR_NBR                                          08480000
LRM010          ,RCV_NBR                                                08490000
LRM010          ,ACCT_RCV_NBR                                           08500000
                                                                        08510000
           END-EXEC.                                                    08520000
                                                                        08530000
      * DECLARE CURSOR TO OBTAIN ALL AT RECORDS FOR NON-STANDARD REQUEST08540000
           EXEC SQL                                                     08550000
              DECLARE NSCC_AT2_CRSR CURSOR FOR                          08560000
                 SELECT                                                 08570000
                    TRANS_TYPE_CD,                                      08580000
                    ACAT_CONTROL_NBR,                                   08590000
                    TRNFR_TYPE_CD,                                      08600000
                    SBMTG_PRTCP_NBR,                                    08610000
                    RCV_NBR,                                            08620000
                    DLVR_NBR,                                           08630000
                    TRANS_RFRN_ID_CD,                                   08640000
                    ASSET_SEQ_NBR,                                      08650000
                    ASSET_PRC_CTGY_CD,                                  08660000
                    OPTN_CTGY_CD,                                       08661000
                    STTLM_LCTN_CD,                                      08662000
                    STTLM_RSN_CD,                                       08663000
                    ISIN_CNTRY_CD,                                      08664000
                    ISIN_SEC_ISSUE_CD,                                  08665000
                    ISIN_SEC_CDG_CD,                                    08666000
                    ASSET_DESC_TXT,                                     08667000
                    ASSET_RQST_QTY_CD,                                  08668000
                    AST_RQST_TRANS_CD,                                  08669000
                    ASSET_QTY,                                          08670000
                    ASSET_PCT,                                          08680000
                    PSTN_CD,                                            08690000
                    ISO_CRNCY_CD,                                       08700000
                    ASSET_AMT,                                          08710000
                    BEARER_BOND_CD,                                     08720000
                    CSH_MGN_SHRT_CD,                                    08730000
                    WHI_CD,                                             08740000
                    TRNFR_TYPE_RSN_CD,                                  08750000
                    MBS_SERIAL_NBR,                                     08760000
                    ASSET_CMNT_TXT,                                     08770000
                    ACCT_RCV_NBR,                                       08780000
                    ACCT_DLVR_NBR,                                      08790000
                    NSCC_PEND_CD,                                       08800000
                    RCRD_STTS_CD,                                       08810000
TCK                 UPDT_TMSTP,                                         08820000
                    PRGM_NM                                             08830000
                 FROM ACTIAST                                           08840000
                 WHERE (CLIENT_NBR   =  :WS-CLIENT              AND     08850000
LRM015                (NSCC_ACK_IND  =  :WS-ASCENDIS-ELIGIBLE  OR       08860000
LRM015                 NSCC_ACK_IND =  :WS-NON-ASCENDIS-ENTRY  OR       08870000
LRM017                 NSCC_ACK_IND LIKE :WS-ACK-IND-NON-ASCENDIS) AND  08880000
                       DLVR_NBR      =  :TI-DLVR-NBR            AND     08890000
                       RCV_NBR       =  :TI-RCV-NBR             AND     08900000
                       ACCT_DLVR_NBR =  :TI-ACCT-DLVR-NBR       AND     08910000
                       ACCT_RCV_NBR  =  :TI-ACCT-RCV-NBR        AND     08920000
                       TRNFR_TYPE_CD =  :TI-TRNFR-TYPE-CD       AND     08930000
                       NSCC_PEND_CD  =  'Y'                     AND     08940000
                       RCRD_STTS_CD =   :WS-RCRD-STTS-CD        AND     08950000
LRM008                 ACAT_CONTROL_NBR = :TI-ACAT-CONTROL-NBR)         08960000
LRM017             OR  (CLIENT_NBR   =  :WS-CLIENT              AND     08970000
LRM017                 NSCC_ACK_IND  =  :WS-ASCENDIS-ELIGIBLE   AND     08980000
LRM017                 DLVR_NBR      =  :TI-DLVR-NBR            AND     08990000
LRM017                 RCV_NBR       =  :TI-RCV-NBR             AND     09000000
LRM017                 ACCT_DLVR_NBR =  :TI-ACCT-DLVR-NBR       AND     09010000
LRM017                 ACCT_RCV_NBR  =  :TI-ACCT-RCV-NBR        AND     09020000
LRM017                 TRNFR_TYPE_CD =  :TI-TRNFR-TYPE-CD       AND     09030000
LRM017                 RCRD_STTS_CD =   :WS-RCRD-STTS-CD        AND     09040000
LRM017                 ACAT_CONTROL_NBR = :TI-ACAT-CONTROL-NBR)         09050000
           END-EXEC.                                                    09060000
                                                                        09070000
      * DECLARE CURSOR TO OBTAIN ALL FR RECORDS                         09080000
           EXEC SQL                                                     09090000
              DECLARE NSCC_FR_CRSR CURSOR FOR                           09100000
              SELECT                                                    09110000
                 ACAT_CONTROL_NBR,                                      09120000
                 TRNFR_TYPE_CD,                                         09130000
                 SBMTG_PRTCP_NBR,                                       09140000
                 DLVR_NBR,                                              09150000
                 ASSET_SEQ_NBR,                                         09160000
                 ISIN_CNTRY_CD,                                         09170000
                 ISIN_SEC_ISSUE_CD,                                     09180000
                 ISIN_SEC_CDG_CD,                                       09190000
                 MF_TRANS_TYPE_CD,                                      09200000
                 FRCTN_CD,                                              09210000
                 NRA_TAX_PCT,                                           09220000
                 DSBMT_ACCRL_CD,                                        09230000
                 DSBMT_FRCTN_CSH_CD,                                    09240000
                 DSBMT_RSDL_CD,                                         09250000
                 BK_PHSCL_SHR_CD,                                       09251000
                 DLRVY_CD,                                              09252000
                 TPA_NBR,                                               09253000
                 CUST_NM,                                               09254000
                 FUND_ACCT_CD,                                          09255000
                 FNBR,                                                  09256000
                 BRKR_EXCTG_NBR,                                        09257000
                 NTWRK_CNTL_CD,                                         09258000
                 SS_TIN_CD,                                             09259000
                 SS_TIN_NBR,                                            09260000
                 NM_END_LN_QTY,                                         09270000
                 LTCG_CD,                                               09280000
                 STCG_CD,                                               09290000
                 DVDND_CD,                                              09300000
                 WTHLD_CD,                                              09310000
                 PYBL_INFO_CD,                                          09320000
                 ZIP5_CD,                                               09330000
                 ZIP4_CD,                                               09340000
                 SOC_CD,                                                09350000
                 NAV_ACCT_IND,                                          09360000
                 MRGN_ACCT_IND,                                         09370000
                 CHCK_WRTNG_IND,                                        09380000
                 SL_ST_CD,                                              09390000
                 CNTRY_ORGN_CD,                                         09400000
                 ACCT_RR_NM,                                            09410000
                 ACCT_RR_CD,                                            09420000
                 BRCH_NBR,                                              09430000
                 PYBL_QTY,                                              09440000
                 MEMO_TXT,                                              09450000
                 ACH_IND,                                               09460000
                 PAC_IND,                                               09470000
                 SWP_IND,                                               09480000
                 ROA_LOI_AMT,                                           09490000
                 LOI_DT,                                                09500000
                 TRD_RLTD_IND,                                          09510000
                 ACCT_RLTD_NBR,                                         09520000
                 ACCT_RLTD_CD,                                          09530000
                 SWP_PAC_EFFCT_DT,                                      09540000
                 CDSC_PYMNT_CD,                                         09550000
                 DSBMT_OPTN_CD,                                         09560000
                 DSBMT_AMT,                                             09570000
                 PYMNT_JAN_IND,                                         09580000
                 PYMNT_FEB_IND,                                         09590000
                 PYMNT_MAR_IND,                                         09600000
                 PYMNT_APR_IND,                                         09610000
                 PYMNT_MAY_IND,                                         09620000
                 PYMNT_JUN_IND,                                         09630000
                 PYMNT_JUL_IND,                                         09640000
                 PYMNT_AUG_IND,                                         09650000
                 PYMNT_SEP_IND,                                         09660000
                 PYMNT_OCT_IND,                                         09670000
                 PYMNT_NOV_IND,                                         09680000
                 PYMNT_DEC_IND,                                         09690000
                 PYMNT_DT_CD,                                           09700000
                 RTRMT_TAX_CD,                                          09710000
                 SHRHR_BNK_ACCT_NBR,                                    09720000
                 SHRHR_BNK_TYPE_CD,                                     09730000
                 CHCK_FRST_DT,                                          09740000
                 ABA_ROUTING_NBR,                                       09750000
                 COST_BSS_CD,                                           09760000
                 NSCC_PEND_CD,                                          09770000
                 RCRD_STTS_CD,                                          09780000
TCK              UPDT_TMSTP,                                            09790000
                 W8_WTHLD_CD,                                           09800000
                 W8_CERT_DT,                                            09810000
                 W8_EXPTN_DT,                                           09820000
                 W8_OVRD_NRA_SPC_RT,                                    09830000
                 W8_QULFD_INTRM_IND,                                    09840000
                 W8_OVRD_CNTRY_CD,                                      09850000
                 W8_ORD_CTRY_STS_CD,                                    09860000
LRM027           FUND_ACCT_STTS_CD,                                     09861001
LRM029           FND_AGNT_CD                                            09862000
              FROM VFNDRGST                                             09870000
              WHERE CLIENT_NBR      = :WS-CLIENT             AND        09880000
                     NSCC_PEND_CD   =  'Y'                   AND        09890000
                     RCRD_STTS_CD =   :WS-RCRD-STTS-CD                  09900000
           END-EXEC.                                                    09910000
LRM015**********     NSCC_ACK_IND =  :WS-ASCENDIS-ELIGIBLE              09920000
                                                                        09930000
      * DECLARE CURSOR TO OBTAIN ALL NAME-AND-ADDRESS LINES             09940000
           EXEC SQL                                                     09950000
              DECLARE NSCC_NA_CRSR CURSOR FOR                           09960000
              SELECT                                                    09970000
                 NA_LINE_NBR,                                           09980000
                 CUST_NA_LINE_TXT                                       09990000
              FROM VFNDNA                                               10000000
              WHERE CLIENT_NBR       = :WS-CLIENT               AND     10010000
                    ACAT_CONTROL_NBR = :FR-ACAT-CONTROL-NBR     AND     10020000
                    ASSET_SEQ_NBR    = :FR-ASSET-SEQ-NBR                10030000
              ORDER BY NA_LINE_NBR                                      10040000
           END-EXEC.                                                    10050000
                                                                        10060000
      * DECLARE CURSOR TO OBTAIN ALL PYABLE NA LINES                    10070000
           EXEC SQL                                                     10080000
              DECLARE NSCC_PY_NA_CRSR CURSOR FOR                        10090000
              SELECT                                                    10100000
                 NA_LINE_NBR,                                           10110000
                 PYBL_NA_LINE_TXT                                       10120000
              FROM VFNDPYNA                                             10130000
              WHERE CLIENT_NBR       = :WS-CLIENT               AND     10140000
                    ACAT_CONTROL_NBR = :FR-ACAT-CONTROL-NBR     AND     10150000
                    ASSET_SEQ_NBR    = :FR-ASSET-SEQ-NBR        AND     10160000
                    PYBL_NBR         = :WS-PYBL-NBR                     10170000
              ORDER BY NA_LINE_NBR                                      10180000
           END-EXEC.                                                    10190000
                                                                        10200000
           EJECT                                                        10210000
LRM002 01  BMFSECIO-CALLING-AREA.                                       10220000
LRM002     COPY BMFSECIO.                                               10230000
           SKIP3                                                        10240000
LRM002 01  MF-MSD-REC.                                                  10250000
LRM002     COPY MFMSDREC.                                               10260000
           EJECT                                                        10270000
      ******************************************************************10280000
       LINKAGE SECTION.                                                 10290000
      ******************************************************************10300000
                                                                        10310000
       01  PARM-AREA.                                                   10320000
           05  PARM-LENGTH              PIC  S9(4) COMP.                10330000
           05  LS-STREAM-IND            PIC  X(01).                     10340000
           05  FILLER                   PIC  X(01).                     10350000
           05  LS-TIA-LIT               PIC  X(04).                     10360000
           05  LS-TIA-TIME              PIC  9(04).                     10370000
           05  FILLER                   PIC  X(01).                     10380000
           05  LS-TIC-LIT               PIC  X(04).                     10390000
           05  LS-TIC-TIME              PIC  9(04).                     10400000
           05  FILLER                   PIC  X(01).                     10410000
           05  LS-TIRD-LIT              PIC  X(05).                     10420000
           05  LS-TIRD-TIME             PIC  9(04).                     10430000
           05  FILLER                   PIC  X(01).                     10440000
           05  LS-TIRR-LIT              PIC  X(05).                     10450000
           05  LS-TIRR-TIME             PIC  9(04).                     10460000
           05  FILLER                   PIC  X(01).                     10470000
           05  LS-TIX-LIT               PIC  X(04).                     10480000
           05  LS-TIX-TIME              PIC  9(04).                     10490000
           05  FILLER                   PIC  X(01).                     10500000
           05  LS-ATA-LIT               PIC  X(04).                     10510000
           05  LS-ATA-TIME              PIC  9(04).                     10520000
           05  FILLER                   PIC  X(01).                     10530000
           05  LS-ATCD-LIT              PIC  X(05).                     10540000
           05  LS-ATCD-TIME             PIC  9(04).                     10550000
LRM001     05  FILLER                   PIC  X(01).                     10560000
LRM001     05  LS-ATRD-LIT              PIC  X(05).                     10570000
LRM001     05  LS-ATRD-TIME             PIC  9(04).                     10580000
           05  FILLER                   PIC  X(01).                     10590000
           05  LS-FRA-LIT               PIC  X(04).                     10600000
           05  LS-FRA-TIME              PIC  9(04).                     10610000
LRM015     05  FILLER                   PIC  X(01).                     10620000
LRM015     05  LS-ASCENDIS-RUN          PIC  X(08).                     10630000
LRM015         88  LS-ASCENDIS-RUN-YES  VALUE 'ASCENDIS'.               10640000
LRM015     05  LS-ASCENDIS-EOD          PIC  X(03).                     10650000
LRM015         88  LS-ASCENDIS-EOD-YES  VALUE 'EOD'.                    10660000
LRM015         88  LS-ASCENDIS-CYC-YES  VALUE 'CYC'.                    10670000
                                                                        10680000
           EJECT                                                        10690000
      ***************************************************************** 10700000
       PROCEDURE DIVISION USING PARM-AREA.                              10710000
      ***************************************************************** 10720000
                                                                        10730000
           COPY MSGCOBO.                                                10740000
                                                                        10750000
           PERFORM INITIAL-ROUTINE.                                     10760000
                                                                        10770000
           PERFORM PROCESS-ROUTINE.                                     10780000
                                                                        10790000
           PERFORM ENDJOB-ROUTINE.                                      10800000
                                                                        10810000
           GOBACK.                                                      10820000
                                                                        10830000
           EJECT                                                        10840000
      *****************                                                 10850000
       PROCESS-ROUTINE.                                                 10860000
      *****************                                                 10870000
                                                                        10880000
           PERFORM BUILD-CLIENT-TABLE                                   10890000
                                                                        10900000
LRM015*****IF LS-ASCENDIS-EOD NOT = 'EOD'                               10910000
              PERFORM READ-CYCLE-LOG-HEADER                             10920000
LRM015*****END-IF.                                                      10930000
                                                                        10940000
           PERFORM WRITE-DATATRK-HEADER                                 10950000
                                                                        10960000
LRM020     IF CLIENT-TABLE-CNTR > ZERO                                  10970000
LRM020        PERFORM OPEN-TABL-FILE                                    10980000
LRM020        PERFORM APPLY-TABL-CUTOFF-OVERRIDES                       10990000
LRM020        PERFORM CLOSE-TABL-FILE                                   11000000
LRM020     END-IF.                                                      11010000
                                                                        11020000
           DISPLAY 'CLIENTS LOADED IN B1 TABLE ' CLIENT-TABLE-CNTR.     11030000
*******                                                                 11040000
           PERFORM VARYING S1 FROM 1 BY 1                               11050000
                              UNTIL S1 > CLIENT-TABLE-CNTR              11060000
              MOVE CLIENT-NUM (S1)          TO  WS-CLIENT               11070000
                                                CLOG-KEY-ADP-CLNT-NBR   11080000
LRM006        MOVE CLIENT-ADP-BROKER (S1)   TO  WS-ADP-BROKER           11090000
LRM016        IF CLIENT-B1-ASCENDIS (S1) = '2'                          11100000
LRM016           IF LS-ASCENDIS-RUN = 'ASCENDIS'                        11110000
LRM015              MOVE 'S' TO WS-ASCENDIS-ELIGIBLE                    11120000
LRM015              MOVE 'N' TO WS-NON-ASCENDIS-ENTRY                   11130000
LRM017              MOVE 'N' TO WS-ACK-IND-NON-ASCENDIS                 11140000
LRM016              DISPLAY 'SENDING TO PARALLEL ASCENDIS MODE'         11150000
LRM017           ELSE                                                   11160000
LRM015              MOVE 'N' TO WS-ASCENDIS-ELIGIBLE                    11170000
LRM015              MOVE 'N' TO WS-NON-ASCENDIS-ENTRY                   11180000
LRM017              MOVE '%' TO WS-ACK-IND-NON-ASCENDIS                 11190000
LRM017              DISPLAY 'SENDING TO PARALLEL TO NSCC MODE'          11200000
LRM017           END-IF                                                 11201000
LRM016        ELSE                                                      11202000
LRM015        IF CLIENT-B1-ASCENDIS (S1) = '1'                          11203000
LRM015           DISPLAY 'FOUND ASCENDIS CLIENT ' WS-ADP-BROKER         11204000
LRM015           IF LS-ASCENDIS-RUN = 'ASCENDIS'                        11205000
LRM015              MOVE 'U' TO WS-ASCENDIS-ELIGIBLE                    11206000
LRM015              MOVE 'N' TO WS-NON-ASCENDIS-ENTRY                   11207000
LRM017              MOVE 'N' TO WS-ACK-IND-NON-ASCENDIS                 11208000
LRM015              DISPLAY 'SENDING TO ASCENDIS MODE'                  11209000
LRM015           ELSE                                                   11210000
LRM015              MOVE 'R' TO WS-ASCENDIS-ELIGIBLE                    11220000
LRM015              MOVE ' ' TO WS-NON-ASCENDIS-ENTRY                   11230000
LRM017              MOVE 'N' TO WS-ACK-IND-NON-ASCENDIS                 11240000
LRM015              DISPLAY 'SENDING TO NSCC MODE'                      11250000
LRM017           END-IF                                                 11260000
LRM015        ELSE                                                      11270000
LRM015           MOVE 'N' TO WS-ASCENDIS-ELIGIBLE                       11280000
LRM015           MOVE 'N' TO WS-NON-ASCENDIS-ENTRY                      11290000
LRM017           MOVE '%' TO WS-ACK-IND-NON-ASCENDIS                    11300000
LRM016        END-IF END-IF                                             11310000
              DISPLAY '**** STARTS PROCESSING CLIENT ' CLIENT-NUM (S1)  11320000
                                                                        11330000
              PERFORM FETCH-TI-RECORDS                                  11340000
              MOVE '1'                      TO  FETCH-IND               11340100
              PERFORM FETCH-AT-RECORDS                                  11340200
              IF CLIENT-B1-434503 (S1) = '1'                            11340300
                 PERFORM FETCH-FR-RECORDS                               11340400
              END-IF                                                    11340500
           END-PERFORM                                                  11340600
                                                                        11340700
           PERFORM WRITE-DATATRK-TRAILER                                11340800
                                                                        11340900
           PERFORM REWRITE-CYCLE-LOG-HEADER                             11341000
           .                                                            11342000
                                                                        11343000
           EJECT                                                        11344000
      ********************                                              11345000
       BUILD-CLIENT-TABLE.                                              11346000
      ********************                                              11347000
                                                                        11348000
           PERFORM VARYING B1-SUB FROM 1 BY 1 UNTIL B1-SUB > 500        11349000
              MOVE SPACES                   TO  BH-BROKER-HEADER-INFO   11350000
                                                BH-ACAT-INFO            11360000
              MOVE B1-SUB                   TO  BH-BROKER-NUMBER        11370000
              MOVE '015'                    TO  BH-LOGICAL-RECORD-CODE  11380000
              MOVE '434500'                 TO  BH-B2-INFO-ID           11390000
              CALL  GETB1V               USING  BH-BROKER-HEADER-INFO   11400000
                                                BH-ACAT-INFO            11410000
              IF BH-BROKER-ACTIVE AND BH-ACAT-ACTIVE                    11420000
LRM016        AND B1-SUB NOT = 12                                       11430000
                 IF BH-BROKER-MINI-MAXI-SUBGROUP NOT = SPACES           11440000
                    MOVE BH-BROKER-MINI-MAXI-SUBGROUP                   11450000
                                            TO  WS-STREAM-IND           11460000
                 ELSE                                                   11470000
                    MOVE BH-BROKER-MINI-MAXI-INDICATOR                  11480000
                                            TO  WS-STREAM-IND           11490000
                 END-IF                                                 11500000
                 IF (LS-STREAM-IND  = WS-STREAM-IND                     11510000
LRM                AND B1-SUB NOT = 063)                                11520000
LRM              OR (LS-STREAM-IND = 'Q'                                11530000
LRM                AND B1-SUB NOT = 063)                                11540000
LRM              OR (LS-STREAM-IND = 'J'                                11550000
LRM                AND B1-SUB = 063)                                    11560000
                    ADD 1                   TO  S1                      11570000
                    MOVE B1-SUB             TO  CLIENT-NUM (S1)         11580000
LRM006              MOVE BH-BROKER-OLD-CLEARING-HOUSE(2 : 4)            11590000
LRM006                                      TO  CLIENT-ADP-BROKER (S1)  11600000
                    IF BH-ACAT-FUND-REGISTRATION = '1'                  11610000
                       MOVE '1'             TO  CLIENT-B1-434503 (S1)   11620000
                    ELSE                                                11630000
                       MOVE '0'             TO  CLIENT-B1-434503 (S1)   11640000
                    END-IF                                              11650000
                    MOVE BH-ACAT-MF-REGIST-RECEIVE-BKR                  11660000
                                            TO  CLIENT-B1-434636 (S1)   11670000
                    MOVE BH-ACAT-MF-REG-DIVD-PAYEE-IND                  11680000
                                            TO  CLIENT-B1-434619 (S1)   11690000
LRM015              MOVE BH-ACAT-ASCENDIS-USER TO CLIENT-B1-ASCENDIS(S1)11700000
                    MOVE  ' '               TO  BH-MF3-INFO             11710000
                    MOVE CLIENT-NUM (S1)    TO  BH-BROKER-NUMBER-N      11720000
                    MOVE  '015'             TO  BH-LOGICAL-RECORD-CODE  11730000
                    MOVE  '540000'          TO  BH-B2-INFO-ID           11731000
                    CALL   GETB1V        USING  BH-BROKER-HEADER-INFO   11732000
                                                BH-MF3-INFO             11733000
                    IF BH-MF3-ACTIVE AND                                11734000
                       BH-MF3-SUB-EXEC-BKR-REC-NO NUMERIC               11735000
                       MOVE BH-MF3-SUB-EXEC-BKR-REC-NO                  11736000
                            TO  CLIENT-B1-EXEC-BKR-REC-NO (S1)          11737000
                       MOVE BH-MF3-SUB-EXEC-BKR-REC                     11738000
                            TO  CLIENT-B1-EXEC-BKR-REC (S1)             11739000
                    ELSE                                                11740000
                       MOVE 0 TO CLIENT-B1-EXEC-BKR-REC-NO (S1)         11750000
                    END-IF                                              11760000
                 END-IF                                                 11770000
              END-IF                                                    11780000
           END-PERFORM                                                  11790000
                                                                        11800000
           IF S1 = 0                                                    11810000
              DISPLAY ' '                                               11820000
              DISPLAY '****************************************'        11830000
              DISPLAY '* THERE ARE NOT ACAT ACTIVE CLIENTS ON *'        11840000
              DISPLAY '* THIS STREAM: ' LS-STREAM-IND                   11850000
                      '                       *'                        11860000
              DISPLAY '****************************************'        11870000
           ELSE                                                         11880000
              MOVE S1                       TO  CLIENT-TABLE-CNTR       11890000
           END-IF                                                       11900000
                                                                        11910000
           .                                                            11920000
                                                                        11930000
           EJECT                                                        11940000
      ***********************                                           11950000
       READ-CYCLE-LOG-HEADER.                                           11960000
      ***********************                                           11970000
                                                                        11980000
           MOVE LOW-VALUES                  TO  CLOG-KEY                11990000
           MOVE LS-STREAM-IND               TO  CLOG-KEY-STREAM-IND     12000000
           MOVE 'I'                         TO  CLOG-KEY-INOUT-IND      12010000
           MOVE '1'                         TO  CLOG-KEY-CONFIRM-IND    12020000
           MOVE CLOG-KEY                    TO  CYCLE-LOG-KEY           12030000
                                                                        12040000
           READ CYCLE-LOG                 INTO  CLOG-RECORD             12050000
                                                                        12060000
           EVALUATE CYCLE-LOG-STATUS                                    12070000
              WHEN '00'                                                 12080000
                 MOVE CLOG-LAST-SENT-PROC-DATE  TO  WS-LAST-PROC-DATE   12090000
                 MOVE CLOG-LAST-SENT-CYCLE-NBR  TO  WS-LAST-CYCLE-NBR   12100000
                 MOVE CLOG-LAST-TO-TMSTMP       TO  WS-FROM-TMSTMP      12110000
              WHEN '23'                                                 12120000
                 DISPLAY ' '                                            12130000
                 DISPLAY '*********************************************'12140000
                 DISPLAY '* CLOG HEADER REC. FOR NSCC INPUT OUTBOUND  *'12150000
                 DISPLAY '* IS NOT FOUND - ONE WILL BE CREATED        *'12160000
                 DISPLAY '*********************************************'12170000
                 MOVE '19950101'                TO  WS-LAST-PROC-DATE   12180000
                 MOVE 9                         TO  WS-LAST-CYCLE-NBR   12190000
                 MOVE '1995-01-01-01.01.01.000001' TO WS-FROM-TMSTMP    12200000
              WHEN OTHER                                                12210000
                 DISPLAY ' '                                            12220000
                 DISPLAY '*********************************************'12230000
                 DISPLAY '* UNABLE TO READ CYCLE LOG HEADER RECORD FOR*'12240000
                 DISPLAY '* INPUT OUTBOUND, STATUS = ' CYCLE-LOG-STATUS 12250000
                         '                 *'                           12260000
                 DISPLAY '* PROGRAM IS ABENDING!                      *'12270000
                 DISPLAY '*********************************************'12280000
                 DISPLAY ' '                                            12290000
                 CALL ABEND              USING  ABEND-CODE              12300000
           END-EVALUATE                                                 12310000
                                                                        12320000
           DISPLAY ' '                                                  12330000
           DISPLAY '***********************************************'    12340000
           DISPLAY '* FROM TIMESTAMP = ' WS-FROM-TMSTMP ' *'            12350000
           DISPLAY '*---------------------------------------------*'    12360000
           DISPLAY '* TO   TIMESTAMP = ' WS-TO-TMSTMP ' *'              12370000
           DISPLAY '***********************************************'    12380000
                                                                        12390000
           .                                                            12400000
                                                                        12410000
           EJECT                                                        12420000
      **********************                                            12430000
       WRITE-DATATRK-HEADER.                                            12440000
      **********************                                            12450000
                                                                        12460000
           IF LS-STREAM-IND = 'Q'                                       12470000
              SET VARIABLE-LENGTH-RECORD-TEST  OF NSCC-HDR-RECORD       12480000
                                            TO  TRUE                    12490000
           ELSE                                                         12500000
              SET VARIABLE-LENGTH-RECORD  OF NSCC-HDR-RECORD            12510000
                                            TO  TRUE                    12520000
           END-IF.                                                      12530000
           MOVE LS-STREAM-IND               TO  WS-ORIGINATOR-STREAM    12540000
                                                WS-DESC-STREAM-IND      12550000
           MOVE WS-ORIGINATOR               TO  NSCCDHDR-ORIGINATOR     12560000
           MOVE ZEROES                      TO  NSCCDHDR-SUB-ORIGINATOR 12570000
           MOVE BPD-PROC-DATE               TO  WS-BPD-PROC-DATE        12580000
           MOVE WS-BPD-MM                   TO  WS-DATE-MM              12590000
           MOVE WS-BPD-DD                   TO  WS-DATE-DD              12600000
           MOVE WS-BPD-CC                   TO  WS-DATE-CC              12610000
           MOVE WS-BPD-YY                   TO  WS-DATE-YY              12620000
           MOVE WS-DATE-MMDDCCYY            TO  NSCCDHDR-SUBMIT-DATE    12630000
           MOVE LS-STREAM-IND               TO  WS-DESC-STREAM-IND      12640000
           MOVE WS-FILE-DESC                TO  NSCCDHDR-FILE-DESC      12650000
           SET MULTI-BATCH                  TO  TRUE                    12660000
           MOVE WS-LAST-CYCLE-NBR           TO  WS-MULTI-BATCH-NBR      12670000
           MOVE WS-MULTI-BATCH-NBR-ALPHA (2:3)                          12680000
                                            TO  NSCCDHDR-MULTI-BATCH-NBR12690000
           SET VARIABLE-LENGTH              TO  TRUE                    12700000
                                                                        12710000
           WRITE NSCC-HEADER-TRAILER      FROM  NSCC-HDR-RECORD         12720000
                                                                        12730000
           MOVE WS-MULTI-BATCH-NBR-ALPHA (3:2) TO WS-CYCLE-CD           12740000
           MOVE WS-MULTI-BATCH-NBR-ALPHA (4:1) TO WS-RCRD-STTS-CD       12750000
LRM019*--------------------------------------------------------------   12760000
LRM019*  NOTE THAT WS-RCRD-STTS-CD IS ACTUALLY THE CYCLE NUMBER, SET    12770000
LRM019*  BY CAT500. IN THE ASCENDIS FULFILL OR EOD FILE EXTRACTS        12780000
LRM019*  (CAT525 AND CAT825), SEND THE ASSETS ON EVERY CYCLE,           12790000
LRM019*  OTHERWISE FOR NON ASCENDIS CLIENT OR RUN NSCC RUN, THIS        12800000
LRM019*  IS NOT USED.                                                   12810000
LRM019*--------------------------------------------------------------   12820000
LRM019     IF LS-ASCENDIS-RUN-YES                                       12830000
LRM019         MOVE '%' TO                                              12840000
LRM019*********MOVE WS-MULTI-BATCH-NBR-ALPHA (4:1) TO                   12850000
LRM019                                      WS-ASCENDIS-RCRD-STTS-CD    12860000
LRM019     ELSE                                                         12870000
LRM019         MOVE 'N' TO                  WS-ASCENDIS-RCRD-STTS-CD    12880000
LRM019     END-IF.                                                      12890000
            DISPLAY '*************************'                         12900000
            DISPLAY '* CURRENT CYCLE IS ' WS-MULTI-BATCH-NBR ' *'       12910000
            DISPLAY '*************************'                         12920000
            DISPLAY ' WS-MULTI-BATCH-NBR-ALPHA (3:2)  = '               12930000
                                    WS-MULTI-BATCH-NBR-ALPHA (3:2)      12940000
           .                                                            12950000
                                                                        12960000
           EJECT                                                        12970000
      ***********************                                           12980000
       WRITE-DATATRK-TRAILER.                                           12990000
      ***********************                                           13000000
                                                                        13010000
           IF LS-STREAM-IND = 'Q'                                       13020000
              SET VARIABLE-LENGTH-RECORD-TEST OF NSCC-TRL-RECORD        13030000
                                           TO  TRUE                     13040000
           ELSE                                                         13050000
              SET VARIABLE-LENGTH-RECORD  OF NSCC-TRL-RECORD            13060000
                                           TO  TRUE                     13061000
           END-IF.                                                      13062000
           MOVE WS-ORIGINATOR              TO  NSCCDTRL-ORIGINATOR      13063000
           MOVE ZEROES                     TO  NSCCDTRL-SUB-ORIGINATOR  13064000
           MOVE NSCCI-TOTAL-REC-CNTR       TO  NSCCDTRL-REC-COUNT       13065000
                                                                        13066000
           WRITE NSCC-HEADER-TRAILER      FROM  NSCC-TRL-RECORD         13067000
                                                                        13068000
           .                                                            13069000
                                                                        13070000
           EJECT                                                        13080000
      ******************                                                13090000
       FETCH-TI-RECORDS.                                                13100000
      ******************                                                13110000
      *    DISPLAY '   FETCH-TI-RECORDS    '.                           13120000
                                                                        13130000
           EXEC SQL OPEN NSCC_TI_CRSR END-EXEC                          13140000
           IF SQLCODE NOT = +0                                          13150000
              MOVE SQLCODE TO WS-SQLCODE                                13160000
              SET BAD-OPEN                  TO  TRUE                    13170000
              MOVE 'TI CURSOR OPEN'         TO  TROUBLE-DB2-OBJECT      13180000
              PERFORM SQL-ERROR-ROUTINE                                 13190000
           END-IF                                                       13200000
                                                                        13210000
TCK        PERFORM UNTIL WS-TI-SQLCODE NOT = +0                         13220000
              EXEC SQL                                                  13230000
                 FETCH NSCC_TI_CRSR       INTO :TI-AREA                 13240000
              END-EXEC                                                  13250000
                                                                        13260000
TCK           MOVE SQLCODE TO WS-TI-SQLCODE                             13270000
                                                                        13280000
              EVALUATE SQLCODE                                          13290000
                 WHEN +100                                              13300000
                    CONTINUE                                            13310000
                 WHEN +0                                                13320000
                    ADD +1 TO WS-IN-TI-REC-CNTR                         13330000
                    ADD +1 TO WS-IN-TOTAL-REC-CNTR                      13340000
                       PERFORM CHECK-TI-CUTOFF                          13350000
TCK                    IF BEFORE-CUTOFF-TI                              13360000
                          PERFORM WRITE-TI-RECORD                       13370000
                          IF TI-TRNFR-TYPE-CD NOT = 'FUL' AND           13380000
                             TI-TRANS-RFRN-ID-CD > SPACES               13390000
                             MOVE '2'       TO  FETCH-IND               13400000
TCK                          PERFORM FETCH-AT-RECORDS                   13410000
                          END-IF                                        13420000
                       END-IF                                           13430000
                 WHEN OTHER                                             13440000
                    MOVE SQLCODE TO WS-SQLCODE                          13450000
                    SET BAD-FETCH           TO  TRUE                    13460000
                    MOVE 'TI CURSOR FETCH'  TO  TROUBLE-DB2-OBJECT      13470000
                    PERFORM SQL-ERROR-ROUTINE                           13480000
              END-EVALUATE                                              13490000
           END-PERFORM                                                  13500000
                                                                        13510000
                                                                        13520000
           EXEC SQL                                                     13530000
              CLOSE NSCC_TI_CRSR                                        13540000
           END-EXEC                                                     13550000
                                                                        13560000
           IF SQLCODE NOT = +0                                          13570000
              MOVE SQLCODE TO WS-SQLCODE                                13580000
              SET BAD-CLOSE                 TO  TRUE                    13590000
              MOVE 'TI CURSOR CLOSE'        TO  TROUBLE-DB2-OBJECT      13600000
              PERFORM SQL-ERROR-ROUTINE                                 13610000
           ELSE                                                         13620000
              MOVE +0                       TO  SQLCODE                 13630000
                                                WS-TI-SQLCODE           13640000
           END-IF                                                       13650000
                                                                        13660000
           .                                                            13670000
                                                                        13680000
           EJECT                                                        13690000
      ******************                                                13700000
       FETCH-AT-RECORDS.                                                13710000
      ******************                                                13720000
                                                                        13730000
           IF FETCH-IND = '1'                                           13740000
             EXEC SQL                                                   13750000
                OPEN NSCC_AT1_CRSR                                      13760000
             END-EXEC                                                   13770000
           ELSE                                                         13780000
             EXEC SQL                                                   13790000
                OPEN NSCC_AT2_CRSR                                      13800000
             END-EXEC                                                   13810000
           END-IF                                                       13820000
                                                                        13830000
           IF SQLCODE NOT = +0                                          13840000
              MOVE SQLCODE TO WS-SQLCODE                                13850000
              SET BAD-OPEN                  TO  TRUE                    13860000
              MOVE 'AT CURSOR OPEN'         TO  TROUBLE-DB2-OBJECT      13870000
              PERFORM SQL-ERROR-ROUTINE                                 13880000
           END-IF                                                       13890000
                                                                        13900000
           PERFORM UNTIL SQLCODE NOT = +0                               13910000
              IF FETCH-IND = '1'                                        13920000
                 EXEC SQL                                               13930000
                    FETCH NSCC_AT1_CRSR  INTO  :AT-AREA                 13940000
                 END-EXEC                                               13950000
              ELSE                                                      13960000
                 EXEC SQL                                               13970000
                    FETCH NSCC_AT2_CRSR  INTO  :AT-AREA                 13980000
                 END-EXEC                                               13990000
              END-IF                                                    14000000
                                                                        14010000
TCK           MOVE SQLCODE TO WS-AT-SQLCODE                             14020000
                                                                        14030000
              EVALUATE SQLCODE                                          14040000
                 WHEN +100                                              14050000
                   CONTINUE                                             14060000
                 WHEN +0                                                14070000
                   IF FETCH-IND = '1'                                   14080000
                      ADD +1    TO    WS-IN-AT1-REC-CNTR                14090000
                                      WS-IN-AT-REC-CNTR                 14100000
                                      WS-IN-TOTAL-REC-CNTR              14110000
                   ELSE                                                 14120000
                      ADD +1    TO    WS-IN-AT2-REC-CNTR                14130000
                                      WS-IN-AT-REC-CNTR                 14140000
                                      WS-IN-TOTAL-REC-CNTR              14150000
TMP   ***             MOVE AT-ASSET-AMT TO WS-AT-ASSET-AMT-9            14160000
      *               DISPLAY ' FETCH-IND = ' FETCH-IND                 14170000
      *               DISPLAY ' AT-RCV-NBR = ' AT-RCV-NBR,              14180000
      *                       ' AT-DLVR-NBR = ' AT-DLVR-NBR,            14190000
      *                       ' AT-STTLM-LCTN-CD = ' AT-STTLM-LCTN-CD   14200000
      *                       ' AT-STTLM-RSN-CD = ' AT-STTLM-RSN-CD     14210000
TMP   ***                     ' AT-ASSET-AMT = ' WS-AT-ASSET-AMT-9      14220000
                   END-IF                                               14230000
                   IF AT-ASSET-SEQ-NBR = 0                              14240000
                     MOVE 'A'     TO  AT-TRANS-TYPE-CD                  14250000
                   END-IF                                               14260000
                   PERFORM CHECK-AT-CUTOFF                              14270000
                   IF BEFORE-CUTOFF-AT                                  14280000
                      PERFORM WRITE-AT-RECORD                           14290000
LRM025                   THRU WRITE-AT-RECORD-EXIT                      14300000
                      MOVE 0 TO SQLCODE                                 14310000
                   END-IF                                               14320000
                 WHEN OTHER                                             14330000
                    MOVE SQLCODE TO WS-SQLCODE                          14340000
                   SET BAD-FETCH          TO  TRUE                      14350000
                    IF FETCH-IND = '1'                                  14360000
                       MOVE 'AT1 CURSR FETCH' TO TROUBLE-DB2-OBJECT     14370000
                    ELSE                                                14380000
                       MOVE 'AT2 CURSR FETCH' TO TROUBLE-DB2-OBJECT     14390000
                    END-IF                                              14400000
                    PERFORM SQL-ERROR-ROUTINE                           14410000
              END-EVALUATE                                              14420000
           END-PERFORM                                                  14430000
                                                                        14440000
           IF FETCH-IND = '1'                                           14450000
              EXEC SQL                                                  14460000
                 CLOSE NSCC_AT1_CRSR                                    14470000
              END-EXEC                                                  14480000
           ELSE                                                         14490000
              EXEC SQL                                                  14500000
                 CLOSE NSCC_AT2_CRSR                                    14510000
              END-EXEC                                                  14520000
           END-IF                                                       14530000
                                                                        14540000
           IF SQLCODE NOT = +0                                          14550000
              MOVE SQLCODE TO WS-SQLCODE                                14560000
              SET BAD-CLOSE                 TO  TRUE                    14570000
              IF FETCH-IND = '1'                                        14580000
                 MOVE 'AT1 CURSOR CLOSE'    TO  TROUBLE-DB2-OBJECT      14590000
              ELSE                                                      14600000
                 MOVE 'AT2 CURSOR'          TO  TROUBLE-DB2-OBJECT      14610000
              END-IF                                                    14620000
              PERFORM SQL-ERROR-ROUTINE                                 14630000
           ELSE                                                         14640000
              MOVE +0                       TO  SQLCODE                 14650000
                                                WS-AT-SQLCODE           14660000
           END-IF                                                       14670000
                                                                        14680000
           .                                                            14690000
                                                                        14700000
           EJECT                                                        14710000
      ******************                                                14720000
       FETCH-FR-RECORDS.                                                14730000
      ******************                                                14740000
                                                                        14750000
           EXEC SQL OPEN NSCC_FR_CRSR END-EXEC                          14760000
           IF SQLCODE NOT = +0                                          14770000
              MOVE SQLCODE TO WS-SQLCODE                                14780000
              SET BAD-OPEN                  TO  TRUE                    14790000
              MOVE 'FR CURSOR OPEN'         TO  TROUBLE-DB2-OBJECT      14800000
              PERFORM SQL-ERROR-ROUTINE                                 14810000
           END-IF                                                       14820000
                                                                        14830000
TCK        PERFORM UNTIL WS-FR-SQLCODE NOT = +0                         14840000
              EXEC SQL                                                  14850000
                 FETCH NSCC_FR_CRSR INTO                                14860000
               :FR-ACAT-CONTROL-NBR                                     14870000
              ,:FR-TRNFR-TYPE-CD                                        14880000
              ,:FR-SBMTG-PRTCP-NBR                                      14890000
              ,:FR-DLVR-NBR                                             14900000
              ,:FR-ASSET-SEQ-NBR                                        14910000
              ,:FR-ISIN-CNTRY-CD                                        14920000
              ,:FR-ISIN-SEC-ISSUE-CD                                    14930000
              ,:FR-ISIN-SEC-CDG-CD                                      14940000
              ,:FR-MF-TRANS-TYPE-CD                                     14950000
              ,:FR-FRCTN-CD                                             14960000
              ,:FR-NRA-TAX-PCT                                          14970000
              ,:FR-DSBMT-ACCRL-CD                                       14980000
              ,:FR-DSBMT-FRCTN-CSH-CD                                   14990000
              ,:FR-DSBMT-RSDL-CD                                        15000000
              ,:FR-BK-PHSCL-SHR-CD                                      15010000
              ,:FR-DLRVY-CD                                             15020000
              ,:FR-TPA-NBR                                              15030000
              ,:FR-CUST-NM                                              15040000
              ,:FR-FUND-ACCT-CD                                         15050000
              ,:FR-FNBR                                                 15060000
              ,:FR-BRKR-EXCTG-NBR                                       15070000
              ,:FR-NTWRK-CNTL-CD                                        15080000
              ,:FR-SS-TIN-CD                                            15090000
              ,:FR-SS-TIN-NBR                                           15100000
              ,:FR-NM-END-LN-QTY                                        15110000
              ,:FR-LTCG-CD                                              15120000
              ,:FR-STCG-CD                                              15130000
              ,:FR-DVDND-CD                                             15140000
              ,:FR-WTHLD-CD                                             15150000
              ,:FR-PYBL-INFO-CD                                         15160000
              ,:FR-ZIP5-CD                                              15170000
              ,:FR-ZIP4-CD                                              15180000
              ,:FR-SOC-CD                                               15190000
              ,:FR-NAV-ACCT-IND                                         15200000
              ,:FR-MRGN-ACCT-IND                                        15210000
              ,:FR-CHCK-WRTNG-IND                                       15220000
              ,:FR-SL-ST-CD                                             15230000
              ,:FR-CNTRY-ORGN-CD                                        15240000
              ,:FR-ACCT-RR-NM                                           15250000
              ,:FR-ACCT-RR-CD                                           15260000
              ,:FR-BRCH-NBR                                             15270000
              ,:FR-PYBL-QTY                                             15280000
              ,:FR-MEMO-TXT                                             15290000
              ,:FR-ACH-IND                                              15300000
              ,:FR-PAC-IND                                              15310000
              ,:FR-SWP-IND                                              15320000
              ,:FR-ROA-LOI-AMT                                          15330000
              ,:FR-LOI-DT                                               15340000
              ,:FR-TRD-RLTD-IND                                         15350000
              ,:FR-ACCT-RLTD-NBR                                        15360000
              ,:FR-ACCT-RLTD-CD                                         15370000
              ,:FR-SWP-PAC-EFFCT-DT                                     15380000
              ,:FR-CDSC-PYMNT-CD                                        15390000
              ,:FR-DSBMT-OPTN-CD                                        15400000
              ,:FR-DSBMT-AMT                                            15410000
              ,:FR-PYMNT-JAN-IND                                        15420000
              ,:FR-PYMNT-FEB-IND                                        15430000
              ,:FR-PYMNT-MAR-IND                                        15440000
              ,:FR-PYMNT-APR-IND                                        15450000
              ,:FR-PYMNT-MAY-IND                                        15460000
              ,:FR-PYMNT-JUN-IND                                        15470000
              ,:FR-PYMNT-JUL-IND                                        15480000
              ,:FR-PYMNT-AUG-IND                                        15490000
              ,:FR-PYMNT-SEP-IND                                        15500000
              ,:FR-PYMNT-OCT-IND                                        15510000
              ,:FR-PYMNT-NOV-IND                                        15520000
              ,:FR-PYMNT-DEC-IND                                        15530000
              ,:FR-PYMNT-DT-CD                                          15540000
              ,:FR-RTRMT-TAX-CD                                         15550000
              ,:FR-SHRHR-BNK-ACCT-NBR                                   15560000
              ,:FR-SHRHR-BNK-TYPE-CD                                    15570000
              ,:FR-CHCK-FRST-DT                                         15580000
              ,:FR-ABA-ROUTING-NBR                                      15590000
              ,:FR-COST-BSS-CD                                          15600000
              ,:FR-NSCC-PEND-CD                                         15610000
              ,:FR-RCRD-STTS-CD                                         15620000
              ,:FR-UPDT-TMSTP                                           15630000
              ,:FR-W8-WTHLD-CD                                          15640000
              ,:FR-W8-CERT-DT                                           15650000
              ,:FR-W8-EXPTN-DT                                          15660000
              ,:FR-W8-OVRD-NRA-SPC-RT                                   15670000
              ,:FR-W8-QULFD-INTRM-IND                                   15680000
              ,:FR-W8-OVRD-CNTRY-CD                                     15690000
              ,:FR-W8-OVRD-CNTRY-CD-STTS                                15700000
LRM027        ,:FR-FUND-ACCT-STTS-CD                                    15701000
LRM029        ,:FR-FND-AGNT-CD                                          15702000
              END-EXEC                                                  15710000
                                                                        15720000
TCK           MOVE SQLCODE TO WS-FR-SQLCODE                             15730000
                                                                        15740000
              EVALUATE SQLCODE                                          15750000
                 WHEN +100                                              15760000
                    CONTINUE                                            15770000
                 WHEN +0                                                15780000
                    ADD +1  TO  WS-IN-FR-REC-CNTR                       15790000
                                WS-IN-TOTAL-REC-CNTR                    15800000
                    PERFORM CHECK-FR-CUTOFF                             15810000
                    IF BEFORE-CUTOFF-FR                                 15820000
                       PERFORM WRITE-FR-RECORD                          15830000
                    END-IF                                              15840000
                 WHEN OTHER                                             15850000
                    MOVE SQLCODE TO WS-SQLCODE                          15860000
                    SET BAD-FETCH           TO  TRUE                    15870000
                    MOVE 'FR CURSOR FETCH'  TO  TROUBLE-DB2-OBJECT      15880000
                    PERFORM SQL-ERROR-ROUTINE                           15890000
              END-EVALUATE                                              15900000
           END-PERFORM                                                  15910000
                                                                        15920000
           EXEC SQL                                                     15930000
              CLOSE NSCC_FR_CRSR                                        15940000
           END-EXEC                                                     15950000
                                                                        15960000
           IF SQLCODE NOT = +0                                          15970000
              MOVE SQLCODE TO WS-SQLCODE                                15980000
              SET BAD-CLOSE                 TO  TRUE                    15990000
              MOVE 'FR CURSOR CLOSE'        TO  TROUBLE-DB2-OBJECT      16000000
              PERFORM SQL-ERROR-ROUTINE                                 16010000
           ELSE                                                         16020000
              MOVE +0                       TO  SQLCODE                 16030000
                                                WS-FR-SQLCODE           16040000
           END-IF                                                       16050000
                                                                        16060000
           .                                                            16070000
                                                                        16080000
           EJECT                                                        16090000
      *****************                                                 16100000
       CHECK-TI-CUTOFF.                                                 16110000
      *****************                                                 16120000
                                                                        16130000
           EXEC SQL                                                     16140000
              SET :WS-TMSTMP-TIME = CURRENT TIMESTAMP                   16150000
           END-EXEC                                                     16160000
                                                                        16170000
           IF SQLCODE NOT = +0                                          16180000
              DISPLAY 'SQLCODE = ' SQLCODE                              16190000
              MOVE 'TI TIMESTAMP'           TO  TROUBLE-DB2-OBJECT      16200000
              PERFORM SQL-ERROR-ROUTINE                                 16210000
           END-IF                                                       16220000
                                                                        16230000
           MOVE WS-TMSTMP-HH                TO  WS-CURRENT-HH           16240000
           MOVE WS-TMSTMP-MM                TO  WS-CURRENT-MM           16250000
           MOVE WS-TMSTMP-SS                TO  WS-CURRENT-SS           16260000
           MOVE WS-TMSTMP-NNS               TO  WS-CURRENT-NNS          16270000
                                                                        16280000
           SET BEFORE-CUTOFF-TI             TO  TRUE                    16290000
                                                                        16300000
           EVALUATE TI-TRANS-TYPE-CD                                    16310000
              WHEN 'A'                                                  16320000
                 IF WS-CURRENT-TIME > WS-TIA-TIME                       16330000
                    SET AFTER-CUTOFF-TI     TO  TRUE                    16340000
                 END-IF                                                 16350000
              WHEN 'C'                                                  16360000
                 IF WS-CURRENT-TIME > WS-TIC-TIME                       16370000
                    SET AFTER-CUTOFF-TI     TO  TRUE                    16380000
                 END-IF                                                 16390000
              WHEN 'R'                                                  16400000
                 IF TI-SBMTG-PRTCP-NBR = TI-DLVR-NBR AND                16410000
                    (TI-TRNFR-TYPE-RJCT-CD >= 01 AND <= 09)             16420000
                    IF WS-CURRENT-TIME > WS-TIRD-TIME                   16430000
                       SET AFTER-CUTOFF-TI     TO  TRUE                 16440000
                    END-IF                                              16450000
                 ELSE                                                   16460000
                    IF TI-SBMTG-PRTCP-NBR = TI-RCV-NBR AND              16470000
                       TI-TRNFR-TYPE-RJCT-CD >= 21 AND <= 26            16480000
                       IF WS-CURRENT-TIME > WS-TIRR-TIME                16490000
                          SET AFTER-CUTOFF-TI  TO  TRUE                 16500000
                       END-IF                                           16510000
                    END-IF                                              16520000
                 END-IF                                                 16530000
              WHEN 'X'                                                  16540000
                 IF WS-CURRENT-TIME > WS-TIX-TIME                       16550000
                    SET AFTER-CUTOFF-TI     TO  TRUE                    16560000
                 END-IF                                                 16570000
              WHEN OTHER                                                16580000
                 CONTINUE                                               16590000
           END-EVALUATE                                                 16600000
                                                                        16610000
           .                                                            16620000
LRM005****  NEVER SEND TEST CONTRA BROKER DATA 0969 TO NSCC.            16630000
LRM005     IF TI-RCV-NBR   = '0969'                                     16640000
LRM005     OR TI-DLVR-NBR  = '0969'                                     16650000
LRM005        SET AFTER-CUTOFF-TI     TO  TRUE                          16660000
LRM005        DISPLAY 'TEST TI NOT SENT TO NSCC ' WS-CLIENT             16670000
LRM005            ' RCV '  TI-RCV-NBR ' '  TI-ACCT-RCV-NBR              16680000
LRM005            ' DLVR ' TI-DLVR-NBR ' ' TI-ACCT-DLVR-NBR             16690000
LRM005     END-IF.                                                      16700000
                                                                        16710000
           EJECT                                                        16720000
      *****************                                                 16730000
       WRITE-TI-RECORD.                                                 16740000
      *****************                                                 16750000
                                                                        16760000
           MOVE SPACES                      TO  NSCCTI-RECORD           16770000
           MOVE 'TI'                        TO  NSCCTI-REC-TYPE         16780000
           MOVE 356                         TO  NSCCTI-REC-LENGTH       16790000
           MOVE 1                           TO  NSCCTI-PHSCL-SEQ-NBR    16800000
           MOVE 1                           TO  NSCCTI-LGCL-SEQ-NBR     16810000
           MOVE TI-TRANS-TYPE-CD            TO  NSCCTI-TRANS-TYPE       16820000
           IF TI-TRANS-TYPE-CD  = 'A'                                   16830000
              MOVE SPACES                   TO  NSCCTI-ACATS-CNTL-NBR   16840000
           ELSE                                                         16850000
              MOVE TI-ACAT-CONTROL-NBR      TO  NSCCTI-ACATS-CNTL-NBR   16860000
           END-IF                                                       16870000
           MOVE TI-TRNFR-TYPE-CD            TO  NSCCTI-TRNFR-TYPE       16880000
           MOVE TI-SBMTG-PRTCP-NBR          TO  NSCCTI-SUB-PART-NBR     16890000
           MOVE TI-RCV-NBR                  TO  NSCCTI-ORG-RCV-NBR      16900000
           MOVE TI-DLVR-NBR                 TO  NSCCTI-ORG-DEL-NBR      16910000
           MOVE TI-ACCT-RCV-NBR             TO  NSCCTI-ORG-RCV-CUS-ACCT 16920000
           MOVE TI-RCV-CUST-NM              TO  NSCCTI-ORG-RCV-CUS-NAME 16930000
DJ         IF  NSCCTI-ORG-RCV-CUS-NAME (1:30) = LOW-VALUES              16940000
DJ             MOVE ' '            TO  NSCCTI-ORG-RCV-CUS-NAME (1:30)   16950000
DJ         END-IF                                                       16960000
DJ         IF  NSCCTI-ORG-RCV-CUS-NAME (31:30) = LOW-VALUES             16970000
DJ             MOVE ' '            TO  NSCCTI-ORG-RCV-CUS-NAME (31:30)  16980000
DJ         END-IF                                                       16990000
           MOVE TI-RCV-SS-PRIM-NBR          TO  NSCCTI-ORG-RCV-SSN-PRM  17000000
           MOVE TI-RCV-SS-SCNDY-NBR         TO  NSCCTI-ORG-RCV-SSN-SEC  17010000
           MOVE TI-RCV-ACCT-TYPE-CD         TO  NSCCTI-ORG-RCV-ACCT-TYP 17020000
           IF TI-RCV-OCC-BRKR-NBR = '00000'                             17030000
              MOVE SPACES                   TO  NSCCTI-ORG-OCC-BRKR-NBR 17040000
           ELSE                                                         17050000
              MOVE TI-RCV-OCC-BRKR-NBR      TO  NSCCTI-ORG-OCC-BRKR-NBR 17060000
           END-IF.                                                      17070000
           MOVE TI-RCV-CRSPN-NBR            TO  NSCCTI-ORG-RCV-CRRSP    17080000
           MOVE TI-ACCT-DLVR-NBR            TO  NSCCTI-ORG-DEL-ACCT-NBR 17090000
           MOVE TI-TRNFR-TYPE-RJCT-CD       TO  NSCCTI-TRNFR-TYPE-REJ   17100000
           MOVE TI-ACAT-CNTL-ASTD-NBR       TO  NSCCTI-ASSC-ACATS-CNTL  17110000
           IF TI-STTLM-ASCTD-DT = '0001-01-01'                          17120000
              MOVE SPACES                   TO  NSCCTI-ASSC-STTLM-DATE  17130000
           ELSE                                                         17140000
              MOVE TI-STTLM-ASCTD-DT (1:4)                              17150000
                                        TO NSCCTI-ASSC-STTLM-DATE (1:4) 17160000
              MOVE TI-STTLM-ASCTD-DT (6:2)                              17170000
                                        TO NSCCTI-ASSC-STTLM-DATE (5:2) 17180000
              MOVE TI-STTLM-ASCTD-DT (9:2)                              17190000
                                        TO NSCCTI-ASSC-STTLM-DATE (7:2) 17200000
           END-IF                                                       17210000
           MOVE TI-TRANS-RFRN-ID-CD         TO  NSCCTI-TRNFR-REF-ID     17220000
                                                                        17230000
TCK        MOVE TI-CMNT-TXT                 TO NSCCTI-COMMENTS          17240000
                                                                        17250000
LRM018     IF  (TI-TRNFR-TYPE-CD = 'PTD' OR 'PTF')                      17260000
LRM013     AND TI-GIFT-IND = '1'                                        17270000
LRM013        MOVE '1' TO NSCCTI-GIFT-IND                               17280000
LRM013     ELSE                                                         17290000
LRM013        MOVE '0' TO NSCCTI-GIFT-IND                               17300000
LRM013     END-IF.                                                      17310000
                                                                        17320000
           WRITE NSCC-TI-REC              FROM  NSCCTI-RECORD           17330000
                                                                        17340000
           ADD 1                            TO  CLIENT-TI-REC-CNTR (S1) 17350000
                                                CLIENT-ALL-REC-CNTR (S1)17360000
                                                WS-TOTAL-TI-REC-CNTR    17370000
                                                NSCCI-TOTAL-REC-CNTR    17380000
                                                                        17390000
           .                                                            17400000
                                                                        17410000
           EJECT                                                        17420000
      *****************                                                 17430000
       CHECK-AT-CUTOFF.                                                 17440000
      *****************                                                 17450000
                                                                        17460000
           EXEC SQL                                                     17470000
              SET :WS-TMSTMP-TIME = CURRENT TIMESTAMP                   17480000
           END-EXEC                                                     17490000
                                                                        17500000
           IF SQLCODE NOT = +0                                          17510000
              MOVE SQLCODE TO WS-SQLCODE                                17520000
              MOVE 'AT TIMESTAMP'           TO  TROUBLE-DB2-OBJECT      17530000
              PERFORM SQL-ERROR-ROUTINE                                 17540000
           END-IF                                                       17550000
                                                                        17560000
           MOVE WS-TMSTMP-HH                TO  WS-CURRENT-HH           17570000
           MOVE WS-TMSTMP-MM                TO  WS-CURRENT-MM           17580000
           MOVE WS-TMSTMP-SS                TO  WS-CURRENT-SS           17590000
           MOVE WS-TMSTMP-NNS               TO  WS-CURRENT-NNS          17600000
                                                                        17610000
TCK        SET BEFORE-CUTOFF-AT             TO  TRUE                    17620000
                                                                        17630000
********* CUTOFF-TIME = PARM TIME SPECIFIED; ATA OR ATCD.               17640000
********* CURRENT TIME = 12 BYTE TIME DERIVED FROM SQL CURR TMSTMP.     17650000
           EVALUATE TRUE                                                17660000
              WHEN AT-TRANS-TYPE-CD = 'A'                               17670000
                 IF WS-CURRENT-TIME > WS-ATA-TIME                       17680000
TCK                 SET AFTER-CUTOFF-AT     TO  TRUE                    17690000
TEST                DISPLAY 'AT ADD CURRENT TIME ' WS-CURRENT-TIME      17700000
TEST                       ' PAST ATA CUTOFF ' WS-ATA-TIME              17710000
                 END-IF                                                 17720000
              WHEN AT-TRANS-TYPE-CD = 'C' OR 'D'                        17730000
LRM001           IF AT-TRANS-TYPE-CD = 'D'                              17740000
LRM001           AND AT-PRGM-NM  = 'CAT500RD'                           17750000
LRM001             IF  WS-CURRENT-TIME > WS-ATRD-TIME                   17760000
LRM001               SET AFTER-CUTOFF-AT     TO  TRUE                   17770000
LRM001                 DISPLAY 'AT RD CURRENT TIME ' WS-CURRENT-TIME    17780000
LRM001                      ' PAST ATRD CUTOFF ' WS-ATRD-TIME           17790000
LRM001             ELSE                                                 17800000
LRM001                 CONTINUE                                         17810000
LRM001           ELSE                                                   17820000
                 IF WS-CURRENT-TIME > WS-ATCD-TIME                      17830000
TCK                 SET AFTER-CUTOFF-AT     TO  TRUE                    17840000
TEST                DISPLAY 'AT C/D CURRENT TIME ' WS-CURRENT-TIME      17850000
TEST                       ' PAST ATCD CUTOFF ' WS-ATCD-TIME            17860000
                 END-IF END-IF                                          17870000
              WHEN OTHER                                                17880000
TEST***          CONTINUE                                               17890000
TEST                DISPLAY 'AT CUTOFF WITH UNKNOWN A/C/D TRANS TYPE '  17900000
TEST                      AT-TRANS-TYPE-CD                              17910000
           END-EVALUATE                                                 17920000
                                                                        17930000
           .                                                            17940000
LRM005****  NEVER SEND TEST CONTRA BROKER DATA 0969 TO NSCC.            17950000
LRM005     IF AT-RCV-NBR   = '0969'                                     17960000
LRM005     OR AT-DLVR-NBR  = '0969'                                     17970000
LRM005        SET AFTER-CUTOFF-AT     TO  TRUE                          17980000
LRM005        DISPLAY 'TEST AT NOT SENT TO NSCC ' WS-CLIENT             17990000
LRM005            ' RCV '  AT-RCV-NBR ' '  AT-ACCT-RCV-NBR              18000000
LRM005            ' DLVR ' AT-DLVR-NBR ' ' AT-ACCT-DLVR-NBR             18010000
LRM005     END-IF.                                                      18020000
                                                                        18030000
           EJECT                                                        18040000
      *****************                                                 18050000
       WRITE-AT-RECORD.                                                 18060000
      *****************                                                 18070000
                                                                        18080000
           MOVE SPACES                      TO  NSCCAT-RECORD.          18130000
           MOVE 'AT'                        TO  NSCCAT-REC-TYPE.        18140000
           MOVE 431                         TO  NSCCAT-REC-LENGTH.      18150000
           MOVE 1                           TO  NSCCAT-PHSCL-SEQ-NBR.   18160000
           MOVE 1                           TO  NSCCAT-LGCL-SEQ-NBR.    18170000
                                                                        18180000
           IF  AT-ASSET-SEQ-NBR =  0                                    18190000
               MOVE 'A'        TO  AT-TRANS-TYPE-CD                     18200000
           ELSE                                                         18210000
               IF  AT-TRANS-TYPE-CD = 'C' AND                           18220000
                   AT-ASSET-AMT     =  0                                18230000
                   MOVE 'D'        TO  AT-TRANS-TYPE-CD                 18240000
               END-IF                                                   18250000
           END-IF.                                                      18260000
                                                                        18270000
           MOVE AT-TRANS-TYPE-CD            TO  NSCCAT-TRANS-TYPE.      18280000
LRM026     IF AT-NSCC-WTHLD-CD = 'W'                                    18281000
LRM026     AND LS-ASCENDIS-RUN = 'ASCENDIS'                             18282000
LRM026        MOVE 'W'                      TO  NSCCAT-TRANS-TYPE       18283000
LRM026     END-IF.                                                      18284000
                                                                        18285000
LRM010     IF AT-ACAT-CONTROL-NBR(1 : 2) = 'XX'                         18290000
LRM010        MOVE SPACES                   TO  NSCCAT-ACATS-CNTL-NBR   18300000
LRM010     ELSE                                                         18310000
              MOVE AT-ACAT-CONTROL-NBR      TO  NSCCAT-ACATS-CNTL-NBR   18320000
LRM010     END-IF.                                                      18330000
           MOVE AT-TRNFR-TYPE-CD            TO  NSCCAT-TRANSFER-TYPE.   18340000
           MOVE AT-SBMTG-PRTCP-NBR          TO  NSCCAT-SUB-PART-NBR.    18350000
           MOVE AT-RCV-NBR                  TO  NSCCAT-ORG-RCV-NBR.     18360000
           MOVE AT-DLVR-NBR                 TO  NSCCAT-ORG-DEL-NBR.     18370000
           IF (AT-TRANS-RFRN-ID-CD = SPACES OR LOW-VALUES)              18380000
LRM009     AND AT-TRNFR-TYPE-CD NOT = 'FUL'                             18390000
              IF AT-SBMTG-PRTCP-NBR = AT-DLVR-NBR                       18400000
                 MOVE AT-ACCT-DLVR-NBR      TO  NSCCAT-TRANS-REF-ID     18410000
              ELSE                                                      18420000
                 IF AT-SBMTG-PRTCP-NBR = AT-RCV-NBR                     18430000
                    MOVE AT-ACCT-RCV-NBR    TO  NSCCAT-TRANS-REF-ID     18440000
                 ELSE                                                   18450000
                    MOVE SPACES             TO  NSCCAT-TRANS-REF-ID     18460000
                 END-IF                                                 18470000
              END-IF                                                    18480000
           ELSE                                                         18490000
              MOVE AT-TRANS-RFRN-ID-CD      TO  NSCCAT-TRANS-REF-ID     18500000
           END-IF.                                                      18510000
                                                                        18520000
           MOVE AT-ASSET-SEQ-NBR            TO  NSCCAT-ASSET-SEQ-NBR.   18530000
                                                                        18540000
           MOVE AT-ASSET-PRC-CTGY-CD        TO  NSCCAT-ASSET-PRICE-CATG.18550000
           MOVE AT-OPTN-CTGY-CD             TO  NSCCAT-OPTION-CAT.      18560000
           MOVE AT-STTLM-LCTN-CD            TO  NSCCAT-REQ-SET-LOCATION.18570000
           MOVE AT-STTLM-RSN-CD             TO  NSCCAT-REQ-SET-REASON.  18580000
           IF   AT-STTLM-RSN-CD  = 'NSET'                               18590000
             MOVE 'XSET'                    TO  NSCCAT-REQ-SET-REASON   18600000
           END-IF.                                                      18610000
LRM025     IF AT-NSCC-WTHLD-CD = 'W'                                    18620000
LRM025     AND FETCH-IND = '1'                                          18630000
LRM025     AND AT-TRANS-TYPE-CD = 'A'                                   18640000
LRM026     AND LS-ASCENDIS-RUN NOT = 'ASCENDIS'                         18641000
LRM025        MOVE '45'                     TO  NSCCAT-REQ-SET-LOCATION 18650000
LRM025        MOVE 'COMT'                   TO  NSCCAT-REQ-SET-REASON   18660000
LRM025        MOVE '00'                     TO  NSCCAT-OPTION-CAT       18670000
LRM025                                          AT-OPTN-CTGY-CD         18680000
LRM025        DISPLAY 'FORCE OUT MEMO FOR ' AT-ACAT-CONTROL-NBR         18690000
LRM025         ' ' AT-ISIN-SEC-ISSUE-CD                                 18700000
LRM025     END-IF.                                                      18701000
********* DO NOT SEND SETTLE LOC AND REASON ON DELETE ASSET:            18701100
           IF  AT-TRANS-TYPE-CD = 'D'                                   18701200
              MOVE SPACES                   TO  NSCCAT-REQ-SET-LOCATION 18701300
                                                NSCCAT-REQ-SET-REASON   18701400
           END-IF.                                                      18701500
                                                                        18701600
           IF AT-ISIN-SEC-ISSUE-CD (1:2) = 'XX'                         18701700
              MOVE SPACES                   TO  NSCCAT-ISIN-SECU-ISSU-ID18701800
           ELSE                                                         18701900
              MOVE AT-ISIN-SEC-ISSUE-CD     TO  NSCCAT-ISIN-SECU-ISSU-ID18702000
           END-IF.                                                      18703000
           IF NSCCAT-ISIN-SECU-ISSU-ID = SPACES                         18704000
              MOVE SPACES                   TO  NSCCAT-ISIN-CNTRY-CODE  18705000
                                                NSCCAT-ISIN-SECU-CHK-DIG18706000
           ELSE                                                         18707000
              MOVE AT-ISIN-CNTRY-CD         TO  NSCCAT-ISIN-CNTRY-CODE  18708000
              MOVE AT-ISIN-SEC-CDG-CD       TO  NSCCAT-ISIN-SECU-CHK-DIG18709000
           END-IF.                                                      18710000
           MOVE AT-ASSET-DESC-TXT           TO  NSCCAT-ASSET-DESC.      18720000
           MOVE AT-ASSET-RQST-QTY-CD        TO  NSCCAT-QTY-REQ-IND.     18730000
           MOVE AT-AST-RQST-TRANS-CD        TO  NSCCAT-REQ-TRAN-CODE.   18740000
           MOVE AT-ASSET-QTY                TO  WS-INTEGER-AREA         18750000
                                                WS-DECIMAL.             18760000
           PERFORM COUNT-DECIMAL-POSITIONS.                             18770000
                                                                        18780000
           EVALUATE TRUE                                                18790000
              WHEN WS-DECIMAL = ZEROES AND WS-INTEGER = ZEROES          18800000
                 MOVE '00000000000000000'   TO  NSCCAT-ASSET-QTY        18810000
LRM           WHEN (WS-DECIMAL = ZEROES OR                              18820000
                    WS-INTEGER >  999999999999999)                      18830000
                 MOVE WS-INTEGER            TO  WS-MASK-0               18840000
                 INSPECT WS-MASK-0 REPLACING FIRST '.' BY ','           18850000
                 MOVE WS-MASK-0             TO  NSCCAT-ASSET-QTY        18860000
              WHEN WS-DECIMAL-CNTR = 1                                  18870000
                 MOVE WS-INTEGER            TO  WS-FIELD1-INT           18880000
                 MOVE WS-DECIMAL            TO  WS-FIELD1-DEC           18890000
                 MOVE WS-FIELD-1            TO  WS-MASK-1               18900000
                 INSPECT WS-MASK-1 REPLACING FIRST '.' BY ','           18910000
                 MOVE WS-MASK-1             TO  NSCCAT-ASSET-QTY        18920000
              WHEN WS-DECIMAL-CNTR = 2                                  18930000
                 MOVE WS-INTEGER            TO  WS-FIELD2-INT           18940000
                 MOVE WS-DECIMAL            TO  WS-FIELD2-DEC           18950000
                 MOVE WS-FIELD-2            TO  WS-MASK-2               18960000
                 INSPECT WS-MASK-2 REPLACING FIRST '.' BY ','           18970000
                 MOVE WS-MASK-2             TO  NSCCAT-ASSET-QTY        18980000
              WHEN WS-DECIMAL-CNTR = 3                                  18990000
                 MOVE WS-INTEGER            TO  WS-FIELD3-INT           19000000
                 MOVE WS-DECIMAL            TO  WS-FIELD3-DEC           19010000
                 MOVE WS-FIELD-3            TO  WS-MASK-3               19020000
                 INSPECT WS-MASK-3 REPLACING FIRST '.' BY ','           19030000
                 MOVE WS-MASK-3             TO  NSCCAT-ASSET-QTY        19040000
              WHEN WS-DECIMAL-CNTR = 4                                  19050000
                 MOVE WS-INTEGER            TO  WS-FIELD4-INT           19060000
                 MOVE WS-DECIMAL            TO  WS-FIELD4-DEC           19070000
                 MOVE WS-FIELD-4            TO  WS-MASK-4               19080000
                 INSPECT WS-MASK-4 REPLACING FIRST '.' BY ','           19090000
                 MOVE WS-MASK-4             TO  NSCCAT-ASSET-QTY        19100000
              WHEN WS-DECIMAL-CNTR > 4                                  19110000
                 MOVE WS-INTEGER            TO  WS-FIELD5-INT           19120000
                 MOVE WS-DECIMAL            TO  WS-FIELD5-DEC           19130000
                 MOVE WS-FIELD-5            TO  WS-MASK-5               19140000
                 INSPECT WS-MASK-5 REPLACING FIRST '.' BY ','           19150000
                 MOVE WS-MASK-5             TO  NSCCAT-ASSET-QTY        19160000
           END-EVALUATE.                                                19170000
           MOVE AT-ASSET-PCT                TO  WS-INTEGER-AREA         19180000
                                                WS-DECIMAL.             19190000
           PERFORM COUNT-DECIMAL-POSITIONS.                             19200000
           EVALUATE TRUE                                                19210000
              WHEN WS-DECIMAL = ZEROES AND WS-INTEGER = ZEROES          19220000
                 MOVE '00000000000000'    TO  NSCCAT-ASSET-PRCNT        19230000
              WHEN (WS-DECIMAL = ZEROES OR                              19240000
                    WS-INTEGER >  99999999999999)                       19250000
                 MOVE WS-INTEGER            TO  WS-MASK-0-PCT           19260000
                 INSPECT WS-MASK-0-PCT REPLACING FIRST '.' BY ','       19270000
                 MOVE WS-MASK-0-PCT        TO  NSCCAT-ASSET-PRCNT       19280000
              WHEN WS-DECIMAL-CNTR = 1                                  19290000
                 MOVE WS-INTEGER            TO  WS-FIELD1-INT           19300000
                 MOVE WS-DECIMAL            TO  WS-FIELD1-DEC           19310000
                 MOVE WS-FIELD-1            TO  WS-MASK-1-PCT           19320000
                 INSPECT WS-MASK-1-PCT REPLACING FIRST '.' BY ','       19330000
                 MOVE WS-MASK-1-PCT         TO  NSCCAT-ASSET-PRCNT      19340000
              WHEN WS-DECIMAL-CNTR = 2                                  19350000
                 MOVE WS-INTEGER            TO  WS-FIELD2-INT           19360000
                 MOVE WS-DECIMAL            TO  WS-FIELD2-DEC           19370000
                 MOVE WS-FIELD-2            TO  WS-MASK-2-PCT           19380000
                 INSPECT WS-MASK-2-PCT REPLACING FIRST '.' BY ','       19390000
                 MOVE WS-MASK-2-PCT         TO  NSCCAT-ASSET-PRCNT      19400000
              WHEN WS-DECIMAL-CNTR = 3                                  19410000
                 MOVE WS-INTEGER            TO  WS-FIELD3-INT           19420000
                 MOVE WS-DECIMAL            TO  WS-FIELD3-DEC           19430000
                 MOVE WS-FIELD-3            TO  WS-MASK-3-PCT           19440000
                 INSPECT WS-MASK-3-PCT REPLACING FIRST '.' BY ','       19450000
                 MOVE WS-MASK-3-PCT         TO  NSCCAT-ASSET-PRCNT      19460000
              WHEN WS-DECIMAL-CNTR = 4                                  19470000
                 MOVE WS-INTEGER            TO  WS-FIELD4-INT           19480000
                 MOVE WS-DECIMAL            TO  WS-FIELD4-DEC           19490000
                 MOVE WS-FIELD-4            TO  WS-MASK-4-PCT           19500000
                 INSPECT WS-MASK-4-PCT REPLACING FIRST '.' BY ','       19510000
                 MOVE WS-MASK-4-PCT         TO  NSCCAT-ASSET-PRCNT      19520000
              WHEN WS-DECIMAL-CNTR > 4                                  19530000
                 MOVE WS-INTEGER            TO  WS-FIELD5-INT           19540000
                 MOVE WS-DECIMAL            TO  WS-FIELD5-DEC           19550000
                 MOVE WS-FIELD-5            TO  WS-MASK-5-PCT           19560000
                 INSPECT WS-MASK-5-PCT REPLACING FIRST '.' BY ','       19570000
                 MOVE WS-MASK-5-PCT         TO  NSCCAT-ASSET-PRCNT      19580000
           END-EVALUATE.                                                19590000
           MOVE AT-PSTN-CD                  TO  NSCCAT-POSITION-CODE.   19600000
           MOVE AT-ISO-CRNCY-CD             TO  NSCCAT-ISO-CRNCY-CD.    19610000
           MOVE AT-ASSET-AMT                TO  WS-INTEGER              19620000
                                                WS-DECIMAL.             19630000
           IF AT-ASSET-AMT = ZEROES                                     19640000
              MOVE '00000000000000000'      TO  NSCCAT-ASSET-AMOUNT     19650000
           ELSE                                                         19660000
              MOVE AT-ASSET-AMT             TO  WS-MASK-2               19670000
              INSPECT WS-MASK-2 REPLACING FIRST '.' BY ','              19680000
              MOVE WS-MASK-2                TO  NSCCAT-ASSET-AMOUNT     19690000
           END-IF.                                                      19700000
                                                                        19710000
           MOVE AT-BEARER-BOND-CD           TO  NSCCAT-BEARER-BOND.     19720000
LRM023     IF   AT-CSH-MGN-SHRT-CD = '4'                                19730000
LRM023         MOVE 'C'                     TO  NSCCAT-CASH-MRG-SHRT-CD 19740000
LRM023     ELSE                                                         19750000
               MOVE AT-CSH-MGN-SHRT-CD      TO  NSCCAT-CASH-MRG-SHRT-CD 19760000
LRM023     END-IF.                                                      19770000
           MOVE AT-WHI-CD                   TO  NSCCAT-WHEN-ISSUED-IND. 19780000
           MOVE AT-TRNFR-TYPE-RSN-CD        TO  NSCCAT-XFER-TYPE-REASN. 19790000
           MOVE AT-MBS-SERIAL-NBR           TO  NSCCAT-MBS-SERIAL-NOTE. 19800000
           MOVE AT-ASSET-CMNT-TXT           TO  NSCCAT-ASSET-COMMENT.   19810000
                                                                        19820000
           IF AT-STTLM-LCTN-CD = '35'  AND                              19830000
              AT-OPTN-CTGY-CD  > ZEROS                                  19840000
              MOVE SPACES                   TO  NSCCAT-OPTION-AREA      19850000
              PERFORM FORMAT-OPTION-PORTION                             19860000
                 THRU FORMAT-OPTION-EXIT                                19870000
              MOVE 497                      TO  NSCCAT-REC-LENGTH       19880000
              MOVE NSCCAT-RECORD            TO  NSCC-AT-BASIC1          19890000
              MOVE NSCCAT-OPTION-AREA       TO  NSCC-AT-OPTN            19900000
              WRITE NSCC-AT-OPTN-REC                                    19910000
OPTN          ADD 1   TO WS-IN-AT-OPTN-CNTR                             19920000
                         CLIENT-AT-REC-CNTR (S1)                        19930000
                         CLIENT-ALL-REC-CNTR (S1)                       19940000
                         WS-TOTAL-AT-REC-CNTR                           19950000
                         NSCCI-TOTAL-REC-CNTR                           19960000
           ELSE                                                         19970000
              IF (AT-STTLM-LCTN-CD = '10'                               19980000
DJ0002            AND NOT (AT-TRNFR-TYPE-CD = 'PTR' AND                 19990000
DJ0002                     AT-SBMTG-PRTCP-NBR = AT-RCV-NBR))            20000000
LRM018        OR (AT-STTLM-LCTN-CD = '10'                               20010000
LRM018            AND NOT (AT-TRNFR-TYPE-CD = 'PTF' AND                 20020000
LRM018                     AT-SBMTG-PRTCP-NBR = AT-RCV-NBR))            20030000
LRM001        OR  AT-TRNFR-TYPE-CD = 'MFC'                              20040000
DJ0001           PERFORM FORMAT-MF-AREA                                 20050000
              ELSE                                                      20060000
               IF      AT-ASSET-AMT = ZEROS                             20070000
LRM007            AND  AT-ASSET-PCT = ZEROS                             20080000
                  AND  AT-STTLM-LCTN-CD  = '40'                         20090000
                  AND  AT-TRANS-TYPE-CD = 'A'                           20100000
LRM011            AND  AT-TRNFR-TYPE-CD NOT = 'PTR'                     20110000
                  CONTINUE                                              20120000
                ELSE                                                    20130000
LRM024             IF LS-ASCENDIS-RUN NOT = 'ASCENDIS'                  20140000
LRM024             AND AT-ASSET-AMT >  999999999.00                     20150000
LRM024                MOVE AT-ASSET-AMT TO WS-TOTAL-ASSET-AMT           20160000
LRM024                MOVE AT-ASSET-QTY TO WS-TOTAL-ASSET-QTY           20170000
LRM024                IF AT-ASSET-QTY > ZERO                            20180000
LRM024                   DISPLAY 'SPLIT ASSET USING QTY'                20190000
LRM024                   PERFORM SPLIT-QTY-BY-AMT-RTN                   20200000
LRM024                      THRU SPLIT-QTY-BY-AMT-EXIT                  20210000
LRM024                ELSE                                              20220000
LRM024                   DISPLAY 'SPLIT ASSET USING AMT, ZERO QTY'      20230000
LRM024                   PERFORM SPLIT-BY-AMT-RTN                       20240000
LRM024                      THRU SPLIT-BY-AMT-EXIT                      20250000
LRM024                END-IF                                            20260000
LRM024             ELSE                                                 20270000
                      WRITE NSCC-AT-REC        FROM  NSCCAT-RECORD      20280000
                      ADD 1                 TO  CLIENT-AT-REC-CNTR (S1) 20290000
                                                CLIENT-ALL-REC-CNTR (S1)20300000
                                                WS-TOTAL-AT-REC-CNTR    20301000
                                                NSCCI-TOTAL-REC-CNTR    20302000
LRM024             END-IF                                               20303000
                END-IF                                                  20304000
              END-IF                                                    20305000
           END-IF.                                                      20306000
                                                                        20307000
       WRITE-AT-RECORD-EXIT. EXIT.                                      20308000
                                                                        20309000
           EJECT                                                        20310000
LRM024 SPLIT-QTY-BY-AMT-RTN.                                            20320000
TEST       DISPLAY 'WS-QTY ' WS-TOTAL-ASSET-QTY                         20330000
TEST              ' WS-AMT ' WS-TOTAL-ASSET-AMT                         20340000
LRM024     COMPUTE WS-PRICE = WS-TOTAL-ASSET-AMT / WS-TOTAL-ASSET-QTY   20350000
LRM024              ON SIZE ERROR MOVE 1 TO WS-PRICE.                   20360000
LRM024     DISPLAY 'PRICE ' WS-PRICE                                    20370000
LRM024     MOVE WS-TOTAL-ASSET-QTY          TO  WS-INTEGER-AREA         20380000
LRM024                                          WS-DECIMAL.             20390000
LRM024     IF WS-DECIMAL = ZEROS                                        20400000
LRM024        SET WHOLE-QTY-ONLY TO TRUE                                20410000
LRM024     ELSE                                                         20410100
LRM024        SET FRACTIONAL-QTY-ALLOWED TO TRUE                        20410200
LRM024     END-IF.                                                      20410300
                                                                        20410400
LRM024 SPLIT-QTY-BY-AMT-LOOP.                                           20410500
LRM024     COMPUTE WS-THIS-ASSET-QTY = 900000000 / WS-PRICE             20410600
LRM024          ON SIZE ERROR                                           20410700
LRM024               MOVE 900000000 TO WS-THIS-ASSET-QTY.               20410800
LRM024     DISPLAY 'THIS QTY ' WS-THIS-ASSET-QTY                        20410900
LRM024     IF WS-TOTAL-ASSET-QTY <= WS-THIS-ASSET-QTY                   20411000
LRM024        MOVE WS-TOTAL-ASSET-QTY TO WS-THIS-ASSET-QTY              20412000
LRM024     ELSE                                                         20413000
LRM024        MOVE ZEROS TO WS-THIS-ASSET-QTY-FRACT                     20414000
LRM024     END-IF.                                                      20415000
LRM024     MULTIPLY WS-THIS-ASSET-QTY BY WS-PRICE                       20416000
LRM024                        GIVING WS-THIS-ASSET-AMT                  20417000
LRM024     MOVE  WS-THIS-ASSET-AMT       TO  WS-MASK-2                  20418000
LRM024     INSPECT WS-MASK-2 REPLACING FIRST '.' BY ','                 20419000
LRM024     MOVE WS-MASK-2        TO  NSCCAT-ASSET-AMOUNT                20419100
LRM024     MOVE WS-THIS-ASSET-QTY           TO  WS-INTEGER-AREA         20419200
LRM024                                          WS-DECIMAL.             20419300
LRM024     PERFORM COUNT-DECIMAL-POSITIONS.                             20419400
LRM024                                                                  20419500
LRM024     EVALUATE TRUE                                                20419600
LRM024        WHEN WS-DECIMAL = ZEROES AND WS-INTEGER = ZEROES          20419700
LRM024           MOVE '00000000000000000'   TO  NSCCAT-ASSET-QTY        20419800
LRM024        WHEN (WS-DECIMAL = ZEROES OR                              20419900
LRM024              WS-INTEGER >  999999999999999)                      20420000
LRM024           MOVE WS-INTEGER            TO  WS-MASK-0               20420100
LRM024           INSPECT WS-MASK-0 REPLACING FIRST '.' BY ','           20420200
LRM024           MOVE WS-MASK-0             TO  NSCCAT-ASSET-QTY        20420300
LRM024        WHEN WS-DECIMAL-CNTR = 1                                  20420400
LRM024           MOVE WS-INTEGER            TO  WS-FIELD1-INT           20420500
LRM024           MOVE WS-DECIMAL            TO  WS-FIELD1-DEC           20420600
LRM024           MOVE WS-FIELD-1            TO  WS-MASK-1               20420700
LRM024           INSPECT WS-MASK-1 REPLACING FIRST '.' BY ','           20420800
LRM024           MOVE WS-MASK-1             TO  NSCCAT-ASSET-QTY        20420900
LRM024        WHEN WS-DECIMAL-CNTR = 2                                  20421000
LRM024           MOVE WS-INTEGER            TO  WS-FIELD2-INT           20421100
LRM024           MOVE WS-DECIMAL            TO  WS-FIELD2-DEC           20421200
LRM024           MOVE WS-FIELD-2            TO  WS-MASK-2               20421300
LRM024           INSPECT WS-MASK-2 REPLACING FIRST '.' BY ','           20421400
LRM024           MOVE WS-MASK-2             TO  NSCCAT-ASSET-QTY        20421500
LRM024        WHEN WS-DECIMAL-CNTR = 3                                  20421600
LRM024           MOVE WS-INTEGER            TO  WS-FIELD3-INT           20421700
LRM024           MOVE WS-DECIMAL            TO  WS-FIELD3-DEC           20421800
LRM024           MOVE WS-FIELD-3            TO  WS-MASK-3               20421900
LRM024           INSPECT WS-MASK-3 REPLACING FIRST '.' BY ','           20422000
LRM024           MOVE WS-MASK-3             TO  NSCCAT-ASSET-QTY        20422100
LRM024        WHEN WS-DECIMAL-CNTR = 4                                  20422200
LRM024           MOVE WS-INTEGER            TO  WS-FIELD4-INT           20422300
LRM024           MOVE WS-DECIMAL            TO  WS-FIELD4-DEC           20422400
LRM024           MOVE WS-FIELD-4            TO  WS-MASK-4               20422500
LRM024           INSPECT WS-MASK-4 REPLACING FIRST '.' BY ','           20422600
LRM024           MOVE WS-MASK-4             TO  NSCCAT-ASSET-QTY        20422700
LRM024        WHEN WS-DECIMAL-CNTR > 4                                  20422800
LRM024           MOVE WS-INTEGER            TO  WS-FIELD5-INT           20422900
LRM024           MOVE WS-DECIMAL            TO  WS-FIELD5-DEC           20423000
LRM024           MOVE WS-FIELD-5            TO  WS-MASK-5               20423100
LRM024           INSPECT WS-MASK-5 REPLACING FIRST '.' BY ','           20423200
LRM024           MOVE WS-MASK-5             TO  NSCCAT-ASSET-QTY        20423300
LRM024     END-EVALUATE.                                                20423400
LRM024     IF (AT-STTLM-LCTN-CD = '10'                                  20423500
LRM024         AND NOT (AT-TRNFR-TYPE-CD = 'PTR' AND                    20423600
LRM024                  AT-SBMTG-PRTCP-NBR = AT-RCV-NBR))               20423700
LRM024     OR (AT-STTLM-LCTN-CD = '10'                                  20423800
LRM024         AND NOT (AT-TRNFR-TYPE-CD = 'PTF' AND                    20423900
LRM024                  AT-SBMTG-PRTCP-NBR = AT-RCV-NBR))               20424000
LRM024     OR  AT-TRNFR-TYPE-CD = 'MFC'                                 20424100
LRM024        MOVE NSCCAT-RECORD         TO  NSCC-AT-BASIC2             20424200
LRM024        WRITE NSCC-AT-MF-REC                                      20424300
LRM024        ADD 1   TO WS-IN-AT-MF-CNTR                               20424400
LRM024                   CLIENT-AT-REC-CNTR (S1)                        20424500
LRM024                   CLIENT-ALL-REC-CNTR (S1)                       20424600
LRM024                   WS-TOTAL-AT-REC-CNTR                           20424700
LRM024                   NSCCI-TOTAL-REC-CNTR                           20424800
LRM024     ELSE                                                         20424900
LRM024        WRITE NSCC-AT-REC     FROM  NSCCAT-RECORD                 20425000
LRM024        ADD 1              TO  CLIENT-AT-REC-CNTR (S1)            20425100
LRM024                               CLIENT-ALL-REC-CNTR (S1)           20425200
LRM024                               WS-TOTAL-AT-REC-CNTR               20425300
LRM024                               NSCCI-TOTAL-REC-CNTR               20425400
LRM024     END-IF.                                                      20425500
LRM024     SUBTRACT WS-THIS-ASSET-QTY FROM                              20425600
LRM024                             WS-TOTAL-ASSET-QTY.                  20425700
LRM024     IF WS-TOTAL-ASSET-QTY > ZERO                                 20425800
LRM024        DISPLAY 'LOOP BACK IN SPLIT QTY RTN ' WS-TOTAL-ASSET-QTY  20425900
LRM024        GO TO SPLIT-QTY-BY-AMT-LOOP.                              20426000
LRM024 SPLIT-QTY-BY-AMT-EXIT. EXIT.                                     20426100
LRM024                                                                  20426200
LRM024                                                                  20426300
LRM024 SPLIT-BY-AMT-RTN.                                                20426400
LRM024     IF WS-TOTAL-ASSET-AMT > 999999999.99                         20426500
LRM024        MOVE 999999999.00       TO WS-THIS-ASSET-AMT              20426600
LRM024     ELSE                                                         20426700
LRM024        MOVE WS-TOTAL-ASSET-AMT TO WS-THIS-ASSET-AMT              20426800
LRM024     END-IF.                                                      20426900
LRM024     MOVE  WS-THIS-ASSET-AMT       TO  WS-MASK-2                  20427000
LRM024     INSPECT WS-MASK-2 REPLACING FIRST '.' BY ','                 20427100
LRM024     MOVE WS-MASK-2        TO  NSCCAT-ASSET-AMOUNT                20427200
LRM024     MOVE '00000000000000000'   TO  NSCCAT-ASSET-QTY              20427300
LRM024     IF (AT-STTLM-LCTN-CD = '10'                                  20427400
LRM024         AND NOT (AT-TRNFR-TYPE-CD = 'PTR' AND                    20427500
LRM024                  AT-SBMTG-PRTCP-NBR = AT-RCV-NBR))               20427600
LRM024     OR (AT-STTLM-LCTN-CD = '10'                                  20427700
LRM024         AND NOT (AT-TRNFR-TYPE-CD = 'PTF' AND                    20427800
LRM024                  AT-SBMTG-PRTCP-NBR = AT-RCV-NBR))               20427900
LRM024     OR  AT-TRNFR-TYPE-CD = 'MFC'                                 20428000
LRM024        MOVE NSCCAT-RECORD         TO  NSCC-AT-BASIC2             20428100
LRM024        WRITE NSCC-AT-MF-REC                                      20428200
LRM024        ADD 1   TO WS-IN-AT-MF-CNTR                               20428300
LRM024                   CLIENT-AT-REC-CNTR (S1)                        20428400
LRM024                   CLIENT-ALL-REC-CNTR (S1)                       20428500
LRM024                   WS-TOTAL-AT-REC-CNTR                           20428600
LRM024                   NSCCI-TOTAL-REC-CNTR                           20428700
LRM024     ELSE                                                         20428800
LRM024        WRITE NSCC-AT-REC     FROM  NSCCAT-RECORD                 20428900
LRM024        ADD 1    TO CLIENT-AT-REC-CNTR (S1)                       20429000
LRM024                    CLIENT-ALL-REC-CNTR (S1)                      20429100
LRM024                    WS-TOTAL-AT-REC-CNTR                          20429200
LRM024                    NSCCI-TOTAL-REC-CNTR                          20429300
LRM024     END-IF.                                                      20429400
LRM024     SUBTRACT WS-THIS-ASSET-AMT FROM                              20429500
LRM024                             WS-TOTAL-ASSET-AMT.                  20429600
LRM024     IF WS-TOTAL-ASSET-AMT > ZERO                                 20429700
LRM024        GO TO SPLIT-BY-AMT-RTN.                                   20429800
LRM024 SPLIT-BY-AMT-EXIT. EXIT.                                         20429900
                                                                        20430000
      *************************                                         20430100
DJ0001 FORMAT-MF-AREA.                                                  20430200
      *************************                                         20430300
                                                                        20430400
                 MOVE SPACES                TO  NSCCAT-OPTION-AREA      20430500
                                                NSCCAT-MF-AREA          20430600
                                                NSCC-AT-MF-REC          20430700
                 PERFORM FORMAT-FUNDS-PORTION                           20430800
                    THRU FORMAT-FUNDS-EXIT                              20430900
                 MOVE 550                   TO  NSCCAT-REC-LENGTH       20431000
                 MOVE NSCCAT-RECORD         TO  NSCC-AT-BASIC2          20432000
                 MOVE NSCCAT-MF-AREA        TO  NSCC-AT-MF              20433000
LRM001           IF AT-TRNFR-TYPE-CD = 'MFC'                            20434000
LRM001           AND NSCCAT-MF-FUND-CUST-ACCT NOT > SPACES              20435000
LRM001              CONTINUE                                            20436000
LRM001           ELSE                                                   20437000
LRM024*** ADD ONE BILLION SPLIT FOR FUNDS                               20438000
LRM024             IF LS-ASCENDIS-RUN NOT = 'ASCENDIS'                  20439000
LRM024             AND AT-ASSET-AMT >  999999999.99                     20440000
LRM024                MOVE AT-ASSET-AMT TO WS-TOTAL-ASSET-AMT           20450000
LRM024                MOVE AT-ASSET-QTY TO WS-TOTAL-ASSET-QTY           20460000
LRM024                IF AT-ASSET-QTY > ZERO                            20470000
LRM024                   DISPLAY 'FUND ASSET SPLIT USING QTY'           20480000
LRM024                   PERFORM SPLIT-QTY-BY-AMT-RTN                   20490000
LRM024                      THRU SPLIT-QTY-BY-AMT-EXIT                  20500000
LRM024                ELSE                                              20510000
LRM024                   DISPLAY 'FUND ASSET SPLIT QTY ZERO'            20520000
LRM024                   PERFORM SPLIT-BY-AMT-RTN                       20530000
LRM024                      THRU SPLIT-BY-AMT-EXIT                      20540000
LRM024                END-IF                                            20550000
LRM024             ELSE                                                 20560000
                    WRITE NSCC-AT-MF-REC                                20570000
ATMF                ADD 1   TO WS-IN-AT-MF-CNTR                         20571000
                               CLIENT-AT-REC-CNTR (S1)                  20572000
                               CLIENT-ALL-REC-CNTR (S1)                 20573000
                               WS-TOTAL-AT-REC-CNTR                     20574000
                               NSCCI-TOTAL-REC-CNTR                     20575000
                 END-IF.                                                20576000
                                                                        20577000
                                                                        20578000
           EJECT                                                        20579000
      *************************                                         20580000
       COUNT-DECIMAL-POSITIONS.                                         20590000
      *************************                                         20600000
                                                                        20610000
                                                                        20620000
           IF WS-DECIMAL-ALPHA (6:1) > 0                                20630000
              MOVE 6                        TO  WS-DECIMAL-CNTR         20640000
           ELSE                                                         20650000
           IF WS-DECIMAL-ALPHA (5:1) > 0                                20660000
              MOVE 5                        TO  WS-DECIMAL-CNTR         20670000
           ELSE                                                         20680000
           IF WS-DECIMAL-ALPHA (4:1) > 0                                20690000
              MOVE 4                        TO  WS-DECIMAL-CNTR         20700000
           ELSE                                                         20710000
              IF WS-DECIMAL-ALPHA (3:1) > 0                             20720000
                 MOVE 3                     TO  WS-DECIMAL-CNTR         20730000
              ELSE                                                      20740000
                 IF WS-DECIMAL-ALPHA (2:1) > 0                          20750000
                    MOVE 2                  TO  WS-DECIMAL-CNTR         20760000
                 ELSE                                                   20770000
                    IF WS-DECIMAL-ALPHA (1:1) > 0                       20780000
                       MOVE 1               TO  WS-DECIMAL-CNTR         20790000
                    ELSE                                                20800000
                       MOVE 0               TO  WS-DECIMAL-CNTR         20810000
                    END-IF                                              20820000
                 END-IF                                                 20830000
              END-IF                                                    20840000
           END-IF                                                       20850000
           END-IF                                                       20860000
           END-IF                                                       20870000
                                                                        20880000
           .                                                            20890000
                                                                        20900000
           EJECT                                                        20910000
      ***********************                                           20920000
       FORMAT-OPTION-PORTION.                                           20930000
      ***********************                                           20940000
                                                                        20950000
           EXEC SQL                                                     20960000
              SELECT                                                    20970000
                 BS_CD,                                                 20980000
                 PTCL_CD,                                               20990000
                 OPTN_OPN_CLSD_CD,                                      21000000
                 SYM_CD,                                                21010000
                 EXPTN_DT,                                              21020000
                 STPRC_INTEGER_AMT,                                     21030000
                 STPRC_FRCTN_AMT,                                       21040000
                 DLVR_OCC_NBR,                                          21050000
                 OPTN_ACCT_TYPE_CD,                                     21060000
                 ACCT_SUB_CD,                                           21070000
                 OPTN_CMNT_TXT                                          21080000
              INTO :ATO-AREA                                            21090000
              FROM ACTIOPN                                              21100000
              WHERE CLIENT_NBR        = :WS-CLIENT             AND      21110000
                    RCV_NBR           = :AT-RCV-NBR            AND      21120000
                    ACCT_DLVR_NBR     = :AT-ACCT-DLVR-NBR      AND      21130000
                    ACCT_RCV_NBR      = :AT-ACCT-RCV-NBR       AND      21140000
                    DLVR_NBR          = :AT-DLVR-NBR           AND      21150000
                    STTLM_LCTN_CD     = :AT-STTLM-LCTN-CD      AND      21160000
                    ISIN_CNTRY_CD     = :AT-ISIN-CNTRY-CD      AND      21170000
                    ISIN_SEC_ISSUE_CD = :AT-ISIN-SEC-ISSUE-CD  AND      21180000
                    ISIN_SEC_CDG_CD   = :AT-ISIN-SEC-CDG-CD    AND      21190000
                    CSH_MGN_SHRT_CD   = :AT-CSH-MGN-SHRT-CD    AND      21200000
LRM008              ACAT_CONTROL_NBR  = :AT-ACAT-CONTROL-NBR   AND      21210000
LRM008              ASSET_SEQ_NBR     = :AT-ASSET-SEQ-NBR      AND      21220000
LRM014              TRNFR_TYPE_CD     = :AT-TRNFR-TYPE-CD               21230000
           END-EXEC                                                     21240000
                                                                        21250000
           IF SQLCODE = +  0                                            21260000
              CONTINUE                                                  21270000
           ELSE                                                         21280000
           IF SQLCODE = + 100                                           21290000
              GO TO FORMAT-OPTION-EXIT                                  21300000
           ELSE                                                         21310000
              IF SQLCODE NOT = +0                                       21320000
                 DISPLAY ' '                                            21330000
                 DISPLAY ' SELECT ACTIOPN ABENDED !!!!!'                21340000
                 DISPLAY 'CLIENT_NBR = ' WS-CLIENT                      21350000
                  ' RCV_NBR  = ' AT-RCV-NBR                             21360000
                  ' ACCT_DLVR_NBR = ' AT-ACCT-DLVR-NBR                  21370000
                  ' ACCT_RCV_NBR  = ' AT-ACCT-RCV-NBR                   21380000
                  ' DLVR_NBR   = ' AT-DLVR-NBR                          21390000
                  ' STTLM_LCTN_CD  = ' AT-STTLM-LCTN-CD                 21400000
                  ' ISIN_CNTRY_CD  = ' AT-ISIN-CNTRY-CD                 21410000
                  ' ISIN_SEC_ISSUE_CD = ' AT-ISIN-SEC-ISSUE-CD          21420000
                  ' ISIN_SEC_CDG_CD  = ' AT-ISIN-SEC-CDG-CD             21430000
                  ' CSH_MGN_SHRT_CD  = ' AT-CSH-MGN-SHRT-CD             21440000
                 MOVE SQLCODE TO WS-SQLCODE                             21450000
                 SET BAD-SELECT             TO  TRUE                    21460000
                 MOVE 'SELECT ACTIOPN'      TO  TROUBLE-DB2-OBJECT      21470000
                 PERFORM SQL-ERROR-ROUTINE                              21480000
           END-IF                                                       21490000
           END-IF                                                       21500000
           END-IF.                                                      21510000
                                                                        21520000
TMP   *    DISPLAY ' '                                                  21530000
TMP   *    DISPLAY ' SELECT ACTIOPN RECORD ----->'                      21540000
TMP   *    DISPLAY ' '  ATO-AREA.                                       21550000
                                                                        21560000
           MOVE ATO-BS-CD                   TO  NSCCAT-OPT-BUY-SELL-IND 21570000
           MOVE ATO-PTCL-CD                 TO  NSCCAT-P-C-IND          21580000
           MOVE ATO-OPTN-OPN-CLSD-CD        TO  NSCCAT-O-C-IND          21590000
           MOVE ATO-SYM-CD                  TO  NSCCAT-OPTION-SYM       21600000
           IF ATO-EXPTN-DT = '0001-01-01'                               21610000
              MOVE SPACES                   TO  NSCCAT-EXP-DATE         21620000
           ELSE                                                         21630000
              MOVE ATO-EXPTN-DT (6:2)       TO  NSCCAT-EXP-DATE (1:2)   21640000
              MOVE ATO-EXPTN-DT (3:2)       TO  NSCCAT-EXP-DATE (3:2)   21650000
              MOVE ATO-EXPTN-DT (1:2)       TO  NSCCAT-EXP-DATE (5:2)   21660000
           END-IF                                                       21670000
           MOVE ATO-STPRC-INTEGER-AMT       TO  NSCCAT-OPT-STPRC-INTR   21680000
           MOVE ATO-STPRC-FRCTN-AMT         TO  NSCCAT-OPT-STRK-FRCTN   21690000
LRM022**** IF LS-STREAM-IND = 'Q'                                       21700000
LRM021        MOVE ATO-EXPTN-DT (1:4)  TO  NSCCAT-EXP-DATE-NEW (1:4)    21710000
LRM021        MOVE ATO-EXPTN-DT (6:2)  TO  NSCCAT-EXP-DATE-NEW (5:2)    21720000
LRM021        MOVE ATO-EXPTN-DT (9:2)  TO  NSCCAT-EXP-DATE-NEW (7:2)    21730000
LRM021        MOVE ATO-STPRC-FRCTN-AMT TO  NSCCAT-OPT-STRK-FRCTN-NEW    21740000
LRM021**** END-IF                                                       21750000
           MOVE ATO-DLVR-OCC-NBR            TO  NSCCAT-OPT-OCC-DEL-NBR  21760000
           MOVE ATO-OPTN-ACCT-TYPE-CD       TO  NSCCAT-OPT-ACCT-TYPE    21770000
           MOVE ATO-ACCT-SUB-CD             TO  NSCCAT-SUB-ACCT-ID      21780000
           MOVE ATO-OPTN-CMNT-TXT           TO  NSCCAT-OPTION-COMMENT   21790000
           MOVE +0                       TO  SQLCODE.                   21800000
                                                                        21810000
        FORMAT-OPTION-EXIT. EXIT.                                       21820000
                                                                        21821000
           EJECT                                                        21822000
      **********************                                            21823000
       FORMAT-FUNDS-PORTION.                                            21824000
      **********************                                            21825000
           IF AT-TRANS-TYPE-CD = 'C'                                    21826000
              EXEC SQL                                                  21827000
              SELECT                                                    21828000
                 FNBR,                                                  21829000
                 BK_PHSCL_SHR_CD,                                       21830000
                 NTWRK_CNTL_CD,                                         21840000
                 ACCT_TYPE_CD,                                          21850000
                 DVDND_CD,                                              21860000
                 LTCG_CD,                                               21870000
                 STCG_CD,                                               21880000
                 DVDND_PAYEE_CD,                                        21890000
                 BRKR_EXCTG_NBR,                                        21900000
                 MF_FULL_PRTL_CD,                                       21910000
                 BK_PHSC_SHR_STS_CD,                                    21920000
ET0001           PRCS_DT,                                               21930000
                 FCST_ACCT_RCVR_NBR                                     21940000
              INTO :ATF-FNBR                                            21950000
                  ,:ATF-BK-PHSCL-SHR-CD                                 21960000
                  ,:ATF-NTWRK-CNTL-CD                                   21970000
                  ,:ATF-ACCT-TYPE-CD                                    21980000
                  ,:ATF-DVDND-CD                                        21990000
                  ,:ATF-LTCG-CD                                         22000000
                  ,:ATF-STCG-CD                                         22010000
                  ,:ATF-DVDND-PAYEE-CD                                  22020000
                  ,:ATF-BRKR-EXCTG-NBR                                  22030000
                  ,:ATF-MF-FULL-PRTL-CD                                 22040000
                  ,:ATF-BK-PHSC-SHR-STS-CD                              22050000
ET0001            ,:ATF-RE-REGIST-DATE                                  22060000
                  ,:ATF-FCST-ACCT-RCVR-NBR                              22070000
              FROM VMF                                                  22080000
              WHERE CLIENT_NBR        = :WS-CLIENT              AND     22090000
                    ACAT_CONTROL_NBR = :AT-ACAT-CONTROL-NBR     AND     22100000
                    ASSET_SEQ_NBR    = :AT-ASSET-SEQ-NBR                22110000
              END-EXEC                                                  22120000
           ELSE                                                         22130000
              EXEC SQL                                                  22140000
              SELECT                                                    22150000
                 FNBR,                                                  22160000
                 BK_PHSCL_SHR_CD,                                       22170000
                 NTWRK_CNTL_CD,                                         22180000
                 ACCT_TYPE_CD,                                          22190000
                 DVDND_CD,                                              22200000
                 LTCG_CD,                                               22210000
                 STCG_CD,                                               22220000
                 DVDND_PAYEE_CD,                                        22230000
                 BRKR_EXCTG_NBR,                                        22240000
                 MF_FULL_PRTL_CD,                                       22250000
                 BK_PHSC_SHR_STS_CD,                                    22260000
ET0001           PRCS_DT,                                               22270000
                 FCST_ACCT_RCVR_NBR,                                    22280000
LRM027           ACCT_TYPE_STTS_CD                                      22281000
              INTO :ATF-FNBR                                            22290000
                  ,:ATF-BK-PHSCL-SHR-CD                                 22300000
                  ,:ATF-NTWRK-CNTL-CD                                   22310000
                  ,:ATF-ACCT-TYPE-CD                                    22320000
                  ,:ATF-DVDND-CD                                        22330000
                  ,:ATF-LTCG-CD                                         22340000
                  ,:ATF-STCG-CD                                         22350000
                  ,:ATF-DVDND-PAYEE-CD                                  22360000
                  ,:ATF-BRKR-EXCTG-NBR                                  22370000
                  ,:ATF-MF-FULL-PRTL-CD                                 22380000
                  ,:ATF-BK-PHSC-SHR-STS-CD                              22390000
ET0001            ,:ATF-RE-REGIST-DATE                                  22400000
                  ,:ATF-FCST-ACCT-RCVR-NBR                              22410000
LRM027            ,:ATF-ACCT-TYPE-STTS-CD                               22411000
              FROM ACTIMF                                               22420000
              WHERE CLIENT_NBR        = :WS-CLIENT             AND      22430000
                    RCV_NBR           = :AT-RCV-NBR            AND      22440000
                    ACCT_DLVR_NBR     = :AT-ACCT-DLVR-NBR      AND      22450000
                    ACCT_RCV_NBR      = :AT-ACCT-RCV-NBR       AND      22460000
                    DLVR_NBR          = :AT-DLVR-NBR           AND      22470000
                    STTLM_LCTN_CD     = :AT-STTLM-LCTN-CD      AND      22480000
                    ISIN_CNTRY_CD     = :AT-ISIN-CNTRY-CD      AND      22490000
                    ISIN_SEC_ISSUE_CD = :AT-ISIN-SEC-ISSUE-CD  AND      22500000
                    ISIN_SEC_CDG_CD   = :AT-ISIN-SEC-CDG-CD    AND      22510000
                    CSH_MGN_SHRT_CD   = :AT-CSH-MGN-SHRT-CD    AND      22520000
LRM008              ACAT_CONTROL_NBR  = :AT-ACAT-CONTROL-NBR   AND      22530000
LRM008              ASSET_SEQ_NBR     = :AT-ASSET-SEQ-NBR      AND      22540000
LRM014              TRNFR_TYPE_CD     = :AT-TRNFR-TYPE-CD               22550000
           END-EXEC                                                     22560000
           END-IF.                                                      22570000
                                                                        22580000
           EVALUATE SQLCODE                                             22590000
              WHEN 0                                                    22600000
                 PERFORM MOVE-FUND-DATA                                 22610000
              WHEN +100                                                 22620000
                 DISPLAY 'ACTIMF MISSING '                              22630000
                ' CLIENT '               WS-CLIENT                      22640000
                ' RCV-NBR '              AT-RCV-NBR                     22650000
                ' ACCT-DLVR-NBR '        AT-ACCT-DLVR-NBR               22660000
                ' ACCT-RCV-NBR  '        AT-ACCT-RCV-NBR                22670000
                ' DLVR-NBR '             AT-DLVR-NBR                    22680000
                ' STTLM-LCTN-CD '        AT-STTLM-LCTN-CD               22690000
                ' ISIN-CNTRY-CD '        AT-ISIN-CNTRY-CD               22700000
                ' ISIN-SEC-ISSUE-CD '    AT-ISIN-SEC-ISSUE-CD           22710000
                ' ISIN-SEC-CDG-CD '      AT-ISIN-SEC-CDG-CD             22720000
                ' CSH-MGN-SHRT-CD '      AT-CSH-MGN-SHRT-CD             22730000
DJ0001          ' TRNFR-TYPE-CD '        AT-TRNFR-TYPE-CD               22740000
DJ0001          ' ACAT-CONTROL-NBR '     AT-ACAT-CONTROL-NBR            22750000
                 GO TO FORMAT-FUNDS-EXIT                                22760000
              WHEN OTHER                                                22770000
                 MOVE SQLCODE TO WS-SQLCODE                             22780000
                 SET BAD-SELECT             TO  TRUE                    22790000
                 MOVE 'SELECT ACTIMF'       TO  TROUBLE-DB2-OBJECT      22800000
                 PERFORM SQL-ERROR-ROUTINE                              22810000
           END-EVALUATE                                                 22820000
           MOVE +0                       TO  SQLCODE.                   22830000
                                                                        22840000
       FORMAT-FUNDS-EXIT.  EXIT.                                        22850000
                                                                        22860000
           EJECT                                                        22870000
      ****************                                                  22880000
       MOVE-FUND-DATA.                                                  22890000
      ****************                                                  22900000
           MOVE ATF-FNBR              TO  NSCCAT-MF-CUST-ACCT           22910000
           MOVE ATF-BK-PHSCL-SHR-CD   TO  NSCCAT-MF-SHR-IND             22920000
           MOVE ATF-NTWRK-CNTL-CD     TO  NSCCAT-MF-NTWK-CNTL-IND       22930000
           MOVE ATF-ACCT-TYPE-CD      TO  NSCCAT-MF-ACCT-TYPE-IND       22940000
           EVALUATE TRUE                                                22950000
              WHEN ATF-DVDND-CD = 'C' AND                               22960000
                   ATF-LTCG-CD  = 'C' AND                               22970000
                   ATF-STCG-CD  = 'C'                                   22980000
                 MOVE '0'             TO  NSCCAT-DIVDND-CODE            22990000
              WHEN ATF-DVDND-CD = 'R' AND                               23000000
                   ATF-LTCG-CD  = 'R' AND                               23010000
                   ATF-STCG-CD  = 'R'                                   23020000
                 MOVE '1'             TO  NSCCAT-DIVDND-CODE            23030000
              WHEN ATF-DVDND-CD = 'C' AND                               23040000
                   ATF-LTCG-CD  = 'C' AND                               23050000
                   ATF-STCG-CD  = 'R'                                   23060000
                   MOVE '2'             TO  NSCCAT-DIVDND-CODE          23070000
              WHEN ATF-DVDND-CD = 'C' AND                               23080000
                   ATF-LTCG-CD  = 'R' AND                               23090000
                   ATF-STCG-CD  = 'R'                                   23100000
                   MOVE '3'             TO  NSCCAT-DIVDND-CODE          23110000
              WHEN ATF-DVDND-CD = 'C' AND                               23120000
                   ATF-LTCG-CD  = 'R' AND                               23130000
                   ATF-STCG-CD  = 'C'                                   23140000
                   MOVE '4'             TO  NSCCAT-DIVDND-CODE          23150000
              WHEN ATF-DVDND-CD = 'R' AND                               23160000
                   ATF-LTCG-CD  = 'C' AND                               23170000
                   ATF-STCG-CD  = 'C'                                   23180000
                   MOVE '5'             TO  NSCCAT-DIVDND-CODE          23190000
              WHEN ATF-DVDND-CD = 'R' AND                               23200000
                   ATF-LTCG-CD  = 'R' AND                               23210000
                   ATF-STCG-CD  = 'C'                                   23220000
                   MOVE '6'             TO  NSCCAT-DIVDND-CODE          23230000
              WHEN ATF-DVDND-CD = 'R' AND                               23240000
                   ATF-LTCG-CD  = 'C' AND                               23250000
                   ATF-STCG-CD  = 'R'                                   23260000
                   MOVE '7'             TO  NSCCAT-DIVDND-CODE          23270000
LRM015        WHEN ATF-DVDND-CD =  '0'                                  23280000
LRM015        WHEN ATF-DVDND-CD =  '1'                                  23290000
LRM015        WHEN ATF-DVDND-CD =  '2'                                  23300000
LRM015        WHEN ATF-DVDND-CD =  '3'                                  23310000
LRM015        WHEN ATF-DVDND-CD =  '4'                                  23320000
LRM015        WHEN ATF-DVDND-CD =  '5'                                  23330000
LRM015        WHEN ATF-DVDND-CD =  '6'                                  23340000
LRM015        WHEN ATF-DVDND-CD =  '7'                                  23350000
LRM015             MOVE ATF-DVDND-CD    TO  NSCCAT-DIVDND-CODE          23360000
              END-EVALUATE                                              23370000
           MOVE ATF-DVDND-PAYEE-CD    TO  NSCCAT-DIVDND-PAYEE-IND       23380000
           MOVE ATF-BRKR-EXCTG-NBR    TO  NSCCAT-EXC-BROKR              23390000
           MOVE ATF-MF-FULL-PRTL-CD   TO  NSCCAT-MF-FULPART-IND         23400000
LRM012*****MOVE '0'                   TO  NSCCAT-MF-CDSC-IND-DLVR.      23410000
LRM012     MOVE SPACES                TO  NSCCAT-MF-CDSC-IND-DLVR.      23420000
           MOVE SPACES                TO  NSCCAT-MF-FIRM-IND-DLVR.      23430000
           MOVE AT-TRANS-TYPE-CD            TO  NSCCAT-TRANS-TYPE.      23440000
ET0001     IF AT-TRNFR-TYPE-CD = 'MFC'                                  23450000
ET0001        MOVE ATF-RE-REGIST-DATE (1:4)                             23460000
ET0001                                TO NSCCAT-MF-RE-REGIST-DT (1:4)   23470000
ET0001        MOVE ATF-RE-REGIST-DATE (6:2)                             23480000
ET0001                                TO NSCCAT-MF-RE-REGIST-DT (5:2)   23490000
ET0001        MOVE ATF-RE-REGIST-DATE (9:2)                             23500000
ET0001                                TO NSCCAT-MF-RE-REGIST-DT (7:2)   23510000
ET0001     END-IF.                                                      23520000
LRM018     IF ((AT-TRNFR-TYPE-CD = 'PTR' OR 'PTF')                      23530000
LRM012     AND FR-ACAT-CONTROL-NBR(1 : 2) NOT = '20')                   23531000
LRM012     OR  AT-TRNFR-TYPE-CD = 'RCL'                                 23531100
LRM012        CONTINUE                                                  23531200
LRM012     ELSE                                                         23531300
LRM002     IF (NSCCAT-TRANS-TYPE = 'A' OR 'C')                          23531400
LRM002        PERFORM READ-NTWREGOP                                     23531500
LRM002        IF NTW-OMNIBUS-ACCT                                       23531600
LRM004        OR NTW-DST-MFE-ACCT                                       23531700
LRM002           PERFORM LOOKUP-CDSC-RTN THRU LOOKUP-CDSC-EXIT          23531800
LRM002            IF BMFSECIO-RETURN-OK                                 23531900
LRM002               IF (SALES-CHARGE                                   23532000
LRM002               OR (NO-SALES-CHARGE AND BACK-END))                 23533000
LRM002                  MOVE '1'         TO  NSCCAT-MF-CDSC-IND-DLVR    23534000
LRM002               DISPLAY 'SET 1 FROM BMFSEC ' WS-CLIENT             23535000
LRM012      ' ON AT REC ' AT-ISIN-SEC-ISSUE-CD  ' ' NSCCAT-TRANSFER-TYPE23536000
LRM012                  ' ' AT-ACAT-CONTROL-NBR                         23537000
LRM002     END-IF.                                                      23538000
                                                                        23539000
LRM001     IF AT-TRNFR-TYPE-CD = 'MFC'                                  23540000
LRM001        MOVE ATF-FCST-ACCT-RCVR-NBR TO  NSCCAT-MF-FUND-CUST-ACCT  23550000
LRM001     END-IF.                                                      23560000
                                                                        23570000
LRM027     IF ATF-ACCT-TYPE-STTS-CD = 'S'                               23571000
LRM029     OR FR-FND-AGNT-CD = '1'                                      23571101
LRM027        MOVE '1' TO NSCCAT-MF-CDSC-IND-DLVR                       23571204
LRM027                    NSCCAT-MF-AGENT-PROC-IND                      23572004
LRM027     END-IF.                                                      23574000
           EJECT                                                        23580000
LRM002 LOOKUP-CDSC-RTN.                                                 23590000
LRM002     INITIALIZE BMFSECIO-AREA                                     23600000
LRM002     MOVE AT-ISIN-SEC-ISSUE-CD      TO BMFSECIO-SECURITY          23610000
LRM002     SET BMFSECIO-REQUEST-MSD-MFMSD TO TRUE                       23620000
LRM002     CALL BMFSEC USING BMFSECIO-AREA                              23630000
LRM002     EVALUATE TRUE                                                23640000
LRM002       WHEN BMFSECIO-RETURN-OK                                    23650000
TEST***           DISPLAY 'RETURN FND FROM BMFSEC'                      23660000
LRM002            MOVE BMFSECIO-MFMSD-AREA TO MF-MSD-REC                23670000
LRM002       WHEN BMFSECIO-INVALID-RETURN                               23680000
LRM002            DISPLAY 'BMFSECIO READ ERROR, RETURN CODE:'           23690000
LRM002                     BMFSECIO-RETURN-CODE ' '                     23700000
LRM002                     BMFSECIO-ERROR-DESC                          23710000
LRM002            DISPLAY '**     ABENDING *'                           23720000
LRM002            MOVE +5999 TO ABEND-CODE                              23730000
LRM002            CALL ABEND USING ABEND-CODE                           23740000
LRM002     END-EVALUATE.                                                23750000
LRM002 LOOKUP-CDSC-EXIT.                                                23760000
LRM002     EXIT.                                                        23770000
           EJECT                                                        23780000
      ***************                                                   23790000
       READ-NTWREGOP.                                                   23800000
      ***************                                                   23810000
                                                                        23820000
           MOVE 'N'                         TO  NTW-HOUSE-ACCT-SW.      23830000
           MOVE 'N'                         TO  NTW-OMNIBUS-ACCT-SW.    23840000
           MOVE SPACES                      TO  NTW-HOUSE-ACCOUNT.      23850000
           MOVE SPACES                      TO  NTWREG-REC.             23860000
           MOVE SPACES                      TO  NTWREG-KEY-IN.          23870000
           MOVE WS-CLIENT (2:3)             TO  NTWREG-KEY-IN (1:3).    23880000
           MOVE AT-ISIN-SEC-ISSUE-CD        TO  NTWREG-KEY-IN (6:9).    23890000
                                                                        23900000
           READ NTWREG-FILE               INTO  NTWREG-REC.             23910000
                                                                        23920000
           IF (NTWREG-FILE-STATUS = '00' OR '97')                       23930000
           IF WS-CLIENT (2:3) = CLIENT-NO OF NTWREG-REC AND             23940000
              AT-ISIN-SEC-ISSUE-CD  = CUSIP-9 OF NTWREG-REC             23950000
              IF REG-OP-HOUSE-ACCT > SPACES                             23960000
                 MOVE REG-OP-HOUSE-ACCT     TO  NTW-HOUSE-ACCOUNT       23970000
                 SET NTW-HOUSE-ACCT         TO  TRUE                    23980000
              ELSE                                                      23990000
                 MOVE SPACES                TO  NTW-HOUSE-ACCOUNT       24000000
                 MOVE 'N'                   TO  NTW-HOUSE-ACCT-SW       24010000
              END-IF                                                    24020000
              IF OMNIBUS-PROCESSING OF NTWREG-REC                       24030000
                 SET NTW-OMNIBUS-ACCT       TO  TRUE                    24040000
              ELSE                                                      24050000
LRM004        IF DST-DIRECT         OF NTWREG-REC                       24060000
LRM004           SET NTW-DST-MFE-ACCT TO TRUE                           24070000
LRM004        ELSE                                                      24080000
                 MOVE 'N'                   TO  NTW-OMNIBUS-ACCT-SW     24090000
              END-IF END-IF                                             24100000
           ELSE                                                         24110000
              MOVE SPACES                   TO  NTW-HOUSE-ACCOUNT       24120000
              MOVE 'N'                      TO  NTW-HOUSE-ACCT-SW       24130000
              MOVE 'N'                      TO  NTW-OMNIBUS-ACCT-SW     24140000
           END-IF                                                       24150000
           END-IF.                                                      24160000
                                                                        24170000
           EJECT                                                        24180000
      *************                                                     24190000
       READ-NTWMAST.                                                    24200000
      *************                                                     24210000
                                                                        24220000
           MOVE 'N'                          TO  IO-SUCCESSFUL-SW.      24230000
           MOVE SPACES                       TO  NTWMAST-REC.           24240000
           MOVE 0                            TO  PAYABLE-SEQUENCE-NO.   24250000
           MOVE ZEROES                       TO  ACCT-ID OF NTWMAST-REC.24260000
           MOVE WS-CLIENT (2:3)              TO  CLIENT-NO              24270000
                                                 OF NTWMAST-REC         24280000
                                                 CLIENT OF NTWMAST-REC. 24290000
           MOVE AT-ISIN-SEC-ISSUE-CD         TO  CUSIP-9 OF NTWMAST-REC.24300000
           MOVE WS-BRCH                      TO  BRANCH-3               24310000
                                                 OF NTWMAST-REC.        24320000
           MOVE WS-ACCT                      TO  ACCT-5 OF NTWMAST-REC. 24330000
                                                                        24340000
           EVALUATE AT-CSH-MGN-SHRT-CD                                  24350000
              WHEN 'C'                                                  24360000
                 MOVE '1'                    TO  WS-T                   24370000
              WHEN 'M'                                                  24380000
                 MOVE '2'                    TO  WS-T                   24390000
              WHEN 'S'                                                  24400000
                 MOVE '5'                    TO  WS-T                   24410000
              WHEN OTHER                                                24420000
                 MOVE ' '                    TO  WS-T                   24430000
           END-EVALUATE.                                                24440000
                                                                        24450000
           CALL  CKDIGIT                  USING  WS-BRCH-ACCT-TC        24460000
                                                 LENGTH-KEY             24470000
                                                 WS-C.                  24480000
                                                                        24490000
           IF WS-C NOT NUMERIC                                          24500000
              DISPLAY 'CLIENT = ' WS-CLIENT (2:3)                       24510000
                      ' ACAT CONTROL = ' AT-ACAT-CONTROL-NBR            24520000
                      ' ACCOUNT = ' WS-BRCH-ACCT-TC                     24530000
                      ' BAD CALL TO CKDIGIT'                            24540000
              MOVE SPACES                   TO  WS-C                    24550000
           END-IF.                                                      24560000
                                                                        24570000
           MOVE WS-T                         TO  WS-TC (1:1).           24580000
           MOVE WS-C                         TO  WS-TC (2:1).           24590000
           MOVE WS-TC                        TO  ACCT-TYPE-CHK-DGT      24600000
                                                 OF NTWMAST-REC.        24610000
           MOVE MAST-KEY-AREA                TO  NTWMAST-KEY-IN.        24620000
                                                                        24630000
           READ NTWMAST-FILE               INTO  NTWMAST-REC.           24640000
                                                                        24650000
           IF WS-CLIENT (2:3) = CLIENT-NO OF NTWMAST-REC    AND         24660000
              AT-ISIN-SEC-ISSUE-CD = CUSIP-9 OF NTWMAST-REC AND         24670000
              WS-BRCH = BRANCH-3 OF NTWMAST-REC             AND         24680000
              WS-ACCT = ACCT-5   OF NTWMAST-REC             AND         24690000
              WS-TC   = ACCT-TYPE-CHK-DGT OF NTWMAST-REC                24700000
              SET IO-SUCCESSFUL             TO  TRUE                    24710000
           END-IF.                                                      24720000
                                                                        24730000
           EJECT                                                        24740000
      *****************                                                 24750000
       CHECK-FR-CUTOFF.                                                 24760000
      *****************                                                 24770000
                                                                        24780000
           EXEC SQL                                                     24790000
              SET :WS-TMSTMP-TIME = CURRENT TIMESTAMP                   24800000
           END-EXEC                                                     24810000
                                                                        24820000
           IF SQLCODE NOT = +0                                          24830000
              MOVE SQLCODE TO WS-SQLCODE                                24840000
              MOVE 'FR TIMESTAMP'           TO  TROUBLE-DB2-OBJECT      24850000
              PERFORM SQL-ERROR-ROUTINE                                 24860000
           END-IF                                                       24870000
                                                                        24880000
           MOVE WS-TMSTMP-HH                TO  WS-CURRENT-HH           24890000
           MOVE WS-TMSTMP-MM                TO  WS-CURRENT-MM           24900000
           MOVE WS-TMSTMP-SS                TO  WS-CURRENT-SS           24910000
           MOVE WS-TMSTMP-NNS               TO  WS-CURRENT-NNS          24920000
                                                                        24930000
           IF WS-CURRENT-TIME > WS-FRA-TIME                             24940000
              SET AFTER-CUTOFF-FR           TO  TRUE                    24950000
           ELSE                                                         24960000
              SET BEFORE-CUTOFF-FR          TO  TRUE                    24970000
           END-IF                                                       24980000
                                                                        24990000
           .                                                            25000000
                                                                        25010000
           EJECT                                                        25020000
      *****************                                                 25030000
       WRITE-FR-RECORD.                                                 25040000
      *****************                                                 25050000
                                                                        25060000
           MOVE SPACES                      TO  NSCCFR-RECORD           25070000
           MOVE 'FR'                        TO  NSCCFR-REC-TYPE         25080000
           MOVE 759                         TO  NSCCFR-REC-LENGTH       25090000
           MOVE 1                           TO  NSCCFR-PHSCL-SEQ-NBR    25100000
           MOVE 1                           TO  NSCCFR-LGCL-SEQ-NBR     25110000
           MOVE 'A'                         TO  NSCCFR-TRANS-TYPE       25120000
LRM010     IF FR-ACAT-CONTROL-NBR(1 : 2) = 'XX'                         25130000
              MOVE SPACES                   TO  NSCCFR-ACATS-CNTL-NBR   25140000
LRM010     ELSE                                                         25150000
              MOVE FR-ACAT-CONTROL-NBR      TO  NSCCFR-ACATS-CNTL-NBR   25160000
LRM010     END-IF.                                                      25170000
           MOVE FR-TRNFR-TYPE-CD            TO  NSCCFR-TRANSFER-TYPE    25180000
           MOVE FR-SBMTG-PRTCP-NBR          TO  NSCCFR-SUB-PART-NBR     25190000
           IF FR-TRNFR-TYPE-CD NOT = 'RCL'                              25200000
              MOVE FR-SBMTG-PRTCP-NBR       TO  NSCCFR-ORG-RCV-NBR      25210000
           END-IF                                                       25220000
           MOVE FR-DLVR-NBR                 TO  NSCCFR-ORG-DEL-NBR      25230000
           MOVE FR-ASSET-SEQ-NBR            TO  NSCCFR-ASSET-SEQ-NBR    25240000
           IF FR-ISIN-SEC-ISSUE-CD (1:2) = 'XX'                         25250000
              MOVE SPACES                   TO  NSCCFR-SEC-ID           25260000
           ELSE                                                         25270000
              MOVE FR-ISIN-SEC-ISSUE-CD     TO  NSCCFR-SEC-ID           25280000
           END-IF                                                       25290000
           IF NSCCFR-SEC-ID = SPACES                                    25300000
              MOVE SPACES                   TO  NSCCFR-SEC-CNTRY-CD     25310000
                                                NSCCFR-SEC-CHECK-DGT    25320000
           ELSE                                                         25330000
              MOVE FR-ISIN-CNTRY-CD         TO  NSCCFR-SEC-CNTRY-CD     25340000
              MOVE FR-ISIN-SEC-CDG-CD       TO  NSCCFR-SEC-CHECK-DGT    25350000
           END-IF                                                       25360000
           MOVE FR-MF-TRANS-TYPE-CD         TO  NSCCFR-MF-TRANS-TYPE    25370000
           MOVE FR-FRCTN-CD                 TO  NSCCFR-FRCN-IND         25380000
           MOVE FR-NRA-TAX-PCT              TO  NSCCFR-NRA-TAX-PRCNT    25390000
           MOVE FR-DSBMT-ACCRL-CD           TO  NSCCFR-ATD-ACCRU-CD     25400000
           MOVE FR-DSBMT-FRCTN-CSH-CD       TO  NSCCFR-ATD-CASH-CD      25410000
           MOVE FR-DSBMT-RSDL-CD            TO  NSCCFR-ATD-RESDU-CD     25420000
           MOVE FR-BK-PHSCL-SHR-CD          TO  NSCCFR-SHARE-IND        25430000
           MOVE FR-DLRVY-CD                 TO  NSCCFR-PI-DEL-IND       25440000
           MOVE FR-TPA-NBR                  TO  NSCCFR-TPA-NBR          25450000
           MOVE FR-CUST-NM                  TO  NSCCFR-CUST-NAME        25460000
           MOVE FR-FUND-ACCT-CD             TO  NSCCFR-FND-ACCT-IND     25470000
           MOVE FR-FNBR                     TO  NSCCFR-FND-CUST-ACCT-NBR25480000
           MOVE FR-BRKR-EXCTG-NBR           TO  NSCCFR-XCUTE-BRKR       25490000
           MOVE FR-NTWRK-CNTL-CD            TO  NSCCFR-NETWRK-CNTL-IND  25500000
           MOVE FR-SS-TIN-CD                TO  NSCCFR-SSN-EIN-IND      25510000
           MOVE FR-SS-TIN-NBR               TO  NSCCFR-SSN-EIN-NBR      25520000
      *    MOVE FR-DVDND-CD                 TO  NSCCFR-DVDND-CD         25530000
           EVALUATE TRUE                                                25540000
              WHEN FR-DVDND-CD = 'C' AND                                25550000
                   FR-LTCG-CD  = 'C' AND                                25560000
                   FR-STCG-CD  = 'C'                                    25570000
                   MOVE '0'                 TO  NSCCFR-DVDND-CD         25580000
              WHEN FR-DVDND-CD = 'R' AND                                25590000
                   FR-LTCG-CD  = 'R' AND                                25600000
                   FR-STCG-CD  = 'R'                                    25610000
                   MOVE '1'                 TO  NSCCFR-DVDND-CD         25620000
              WHEN FR-DVDND-CD = 'C' AND                                25630000
                   FR-LTCG-CD  = 'C' AND                                25640000
                   FR-STCG-CD  = 'R'                                    25650000
                   MOVE '2'                 TO  NSCCFR-DVDND-CD         25660000
              WHEN FR-DVDND-CD = 'C' AND                                25670000
                   FR-LTCG-CD  = 'R' AND                                25680000
                   FR-STCG-CD  = 'R'                                    25690000
                   MOVE '3'                 TO  NSCCFR-DVDND-CD         25700000
              WHEN FR-DVDND-CD = 'C' AND                                25710000
                   FR-LTCG-CD  = 'R' AND                                25720000
                   FR-STCG-CD  = 'C'                                    25730000
                   MOVE '4'                 TO  NSCCFR-DVDND-CD         25740000
              WHEN FR-DVDND-CD = 'R' AND                                25750000
                   FR-LTCG-CD  = 'C' AND                                25760000
                   FR-STCG-CD  = 'C'                                    25770000
                   MOVE '5'                 TO  NSCCFR-DVDND-CD         25780000
              WHEN FR-DVDND-CD = 'R' AND                                25790000
                   FR-LTCG-CD  = 'R' AND                                25800000
                   FR-STCG-CD  = 'C'                                    25810000
                   MOVE '6'                 TO  NSCCFR-DVDND-CD         25820000
              WHEN FR-DVDND-CD = 'R' AND                                25830000
                   FR-LTCG-CD  = 'C' AND                                25840000
                   FR-STCG-CD  = 'R'                                    25850000
                   MOVE '7'                 TO  NSCCFR-DVDND-CD         25860000
           END-EVALUATE                                                 25870000
           MOVE FR-WTHLD-CD                 TO  NSCCFR-WITHOLD-IND      25880000
           MOVE FR-PYBL-INFO-CD             TO  NSCCFR-PAYABLE-IND      25890000
           MOVE FR-ZIP5-CD                  TO  NSCCFR-CUST-ZIP-5       25900000
           MOVE FR-ZIP4-CD                  TO  NSCCFR-CUST-ZIP-4       25910000
           MOVE FR-SOC-CD                   TO  NSCCFR-SOCIAL-CODE      25920000
      *    MOVE FR-NAV-ACCT-IND             TO  NSCCFR-NAV-ACCT-IND     25930000
           EVALUATE FR-NAV-ACCT-IND                                     25940000
              WHEN 'N'                                                  25950000
                 MOVE '0'                   TO  NSCCFR-NAV-ACCT-IND     25960000
              WHEN 'Y'                                                  25970000
                 MOVE '1'                   TO  NSCCFR-NAV-ACCT-IND     25980000
              WHEN OTHER                                                25990000
                 MOVE SPACE                 TO  NSCCFR-NAV-ACCT-IND     26000000
           END-EVALUATE                                                 26010000
      *    MOVE FR-MRGN-ACCT-IND            TO  NSCCFR-MARGN-ACCT-IND   26020000
           EVALUATE FR-MRGN-ACCT-IND                                    26030000
              WHEN 'N'                                                  26040000
                 MOVE '0'                   TO  NSCCFR-MARGN-ACCT-IND   26050000
              WHEN 'Y'                                                  26060000
                 MOVE '1'                   TO  NSCCFR-MARGN-ACCT-IND   26070000
              WHEN OTHER                                                26080000
                 MOVE SPACE                 TO  NSCCFR-MARGN-ACCT-IND   26090000
           END-EVALUATE                                                 26100000
      *    MOVE FR-CHCK-WRTNG-IND           TO  NSCCFR-CHECK-WRT-IND    26110000
           EVALUATE FR-CHCK-WRTNG-IND                                   26120000
              WHEN 'N'                                                  26130000
                 MOVE '0'                   TO  NSCCFR-CHECK-WRT-IND    26140000
              WHEN 'Y'                                                  26150000
                 MOVE '1'                   TO  NSCCFR-CHECK-WRT-IND    26160000
              WHEN OTHER                                                26170000
                 MOVE SPACE                 TO  NSCCFR-CHECK-WRT-IND    26180000
           END-EVALUATE                                                 26190000
           MOVE FR-SL-ST-CD                 TO  NSCCFR-STATE-CODE       26200000
           MOVE FR-CNTRY-ORGN-CD            TO  NSCCFR-CNTRY-CODE       26210000
           MOVE FR-ACCT-RR-NM               TO  NSCCFR-ACCT-REP-NAME    26220000
           MOVE FR-ACCT-RR-CD               TO  NSCCFR-ACCT-REP-NBR     26230000
           MOVE FR-BRCH-NBR                 TO  NSCCFR-BRANCH-ID-NBR    26240000
           MOVE FR-PYBL-QTY                 TO  NSCCFR-NBR-OF-PAYABLES  26250000
           IF FR-W8-WTHLD-CD NOT > SPACES                               26260000
              MOVE SPACES TO   NSCCFR-W8-AREA                           26270000
           ELSE                                                         26280000
              MOVE FR-W8-WTHLD-CD          TO  NSCCFR-WITHOLD-IND       26290000
              IF FR-W8-CERT-DT = '0001-01-01'                           26300000
                 MOVE SPACES                TO  NSCCFR-W8-CERT-DATE     26310000
              ELSE                                                      26320000
                 MOVE FR-W8-CERT-DT(1 : 4)   TO                         26330000
                                           NSCCFR-W8-CERT-DATE(1 : 4)   26340000
                 MOVE FR-W8-CERT-DT(6 : 2)   TO                         26350000
                                           NSCCFR-W8-CERT-DATE(5 : 2)   26360000
                 MOVE FR-W8-CERT-DT(9 : 2)   TO                         26370000
                                           NSCCFR-W8-CERT-DATE(7 : 2)   26380000
              END-IF                                                    26390000
              IF FR-W8-EXPTN-DT = '0001-01-01'                          26400000
                 MOVE SPACES                TO  NSCCFR-W8-EXPTN-DATE    26410000
              ELSE                                                      26420000
                 MOVE FR-W8-EXPTN-DT(1 : 4)  TO                         26430000
                                           NSCCFR-W8-EXPTN-DATE(1 : 4)  26440000
                 MOVE FR-W8-EXPTN-DT(6 : 2)  TO                         26450000
                                           NSCCFR-W8-EXPTN-DATE(5 : 2)  26460000
                 MOVE FR-W8-EXPTN-DT(9 : 2)  TO                         26470000
                                           NSCCFR-W8-EXPTN-DATE(7 : 2)  26480000
              END-IF                                                    26490000
              IF FR-W8-OVRD-NRA-SPC-RT NOT = ZEROS                      26500000
                MOVE FR-W8-OVRD-NRA-SPC-RT TO NSCCFR-W8-OVRD-SPC-RATE-9 26510000
              END-IF                                                    26520000
              MOVE FR-W8-QULFD-INTRM-IND  TO  NSCCFR-W8-INTRM-IND       26530000
              MOVE FR-W8-OVRD-CNTRY-CD    TO  NSCCFR-W8-OVRD-CNTRY      26540000
              MOVE FR-W8-OVRD-CNTRY-CD-STTS TO                          26550000
                                          NSCCFR-W8-OVRD-CNTRY(2 :1)    26560000
           END-IF.                                                      26570000
LRM027     IF FR-FUND-ACCT-STTS-CD = 'S'                                26572006
LRM029     OR FR-FND-AGNT-CD = '1'                                      26572106
LRM027        MOVE '1'                      TO  NSCCFR-MF-AGENT         26573006
LRM027     END-IF.                                                      26573106
                                                                        26574000
           PERFORM FORMAT-NAME-ADDRESS                                  26580000
           MOVE FR-NM-END-LN-QTY            TO  WS-NM-END-LN-QTY-LONG   26590000
           MOVE WS-NM-END-LN-QTY            TO  NSCCFR-CUST-NAME-ENDLN  26600000
           MOVE FR-MEMO-TXT                 TO  NSCCFR-MEMO-TEXT        26610000
      *    MOVE FR-ACH-IND                  TO  NSCCFR-ACH-IND          26620000
           EVALUATE FR-ACH-IND                                          26630000
              WHEN 'N'                                                  26640000
                 MOVE '0'                   TO  NSCCFR-ACH-IND          26650000
              WHEN 'Y'                                                  26660000
                 MOVE '1'                   TO  NSCCFR-ACH-IND          26670000
              WHEN OTHER                                                26680000
                 MOVE SPACE                 TO  NSCCFR-ACH-IND          26690000
           END-EVALUATE                                                 26700000
      *    MOVE FR-PAC-IND                  TO  NSCCFR-PAC-IND          26710000
           EVALUATE FR-PAC-IND                                          26720000
              WHEN 'N'                                                  26730000
                 MOVE '0'                   TO  NSCCFR-PAC-IND          26740000
              WHEN 'Y'                                                  26750000
                 MOVE '1'                   TO  NSCCFR-PAC-IND          26760000
              WHEN OTHER                                                26770000
                 MOVE SPACE                 TO  NSCCFR-PAC-IND          26780000
           END-EVALUATE                                                 26790000
      *    MOVE FR-SWP-IND                  TO  NSCCFR-SWP-IND          26800000
           EVALUATE FR-SWP-IND                                          26810000
              WHEN 'N'                                                  26820000
                 MOVE '0'                   TO  NSCCFR-SWP-IND          26830000
              WHEN 'Y'                                                  26840000
                 MOVE '1'                   TO  NSCCFR-SWP-IND          26850000
              WHEN OTHER                                                26860000
                 MOVE SPACE                 TO  NSCCFR-SWP-IND          26870000
           END-EVALUATE                                                 26880000
           MOVE FR-ROA-LOI-AMT              TO  NSCCFR-ROA-LOI-VALUE    26890000
           IF FR-LOI-DT = '0001-01-01'                                  26900000
              MOVE SPACES                   TO  NSCCFR-LOI-NBR-DATE     26910000
           ELSE                                                         26920000
              MOVE FR-LOI-DT (1:4)          TO NSCCFR-LOI-NBR-DATE (1:4)26930000
              MOVE FR-LOI-DT (6:2)          TO NSCCFR-LOI-NBR-DATE (5:2)26940000
              MOVE FR-LOI-DT (9:2)          TO NSCCFR-LOI-NBR-DATE (7:2)26950000
           END-IF                                                       26960000
           EVALUATE FR-TRD-RLTD-IND                                     26970000
              WHEN 'N'                                                  26980000
                 MOVE '0'                   TO  NSCCFR-RLT-TRADE-IND    26990000
              WHEN 'Y'                                                  27000000
                 MOVE '1'                   TO  NSCCFR-RLT-TRADE-IND    27010000
              WHEN OTHER                                                27020000
                 MOVE SPACE                 TO  NSCCFR-RLT-TRADE-IND    27030000
           END-EVALUATE                                                 27040000
           IF FR-ACCT-RLTD-NBR (1:8) = LOW-VALUES OR HIGH-VALUES        27050000
              MOVE SPACES                   TO  NSCCFR-RLT-ACCT-NBR     27060000
           ELSE                                                         27070000
              MOVE FR-ACCT-RLTD-NBR         TO  NSCCFR-RLT-ACCT-NBR     27080000
           END-IF                                                       27090000
           MOVE FR-ACCT-RLTD-CD             TO  NSCCFR-RLT-ACCT-IND     27100000
           IF FR-SWP-PAC-EFFCT-DT = '0001-01-01'                        27110000
              MOVE SPACES                 TO  NSCCFR-SWP-PAC-EFF-DT     27120000
           ELSE                                                         27130000
              MOVE FR-SWP-PAC-EFFCT-DT (1:4)                            27140000
                                          TO NSCCFR-SWP-PAC-EFF-DT (1:4)27150000
              MOVE FR-SWP-PAC-EFFCT-DT (6:2)                            27160000
                                          TO NSCCFR-SWP-PAC-EFF-DT (5:2)27170000
              MOVE FR-SWP-PAC-EFFCT-DT (9:2)                            27180000
                                          TO NSCCFR-SWP-PAC-EFF-DT (7:2)27190000
           END-IF                                                       27200000
           MOVE FR-CDSC-PYMNT-CD            TO  NSCCFR-CDSC-PAYMNT-CD   27210000
           MOVE FR-DSBMT-OPTN-CD            TO  NSCCFR-DISBURS-OPT-CD   27220000
           EVALUATE NSCCFR-DISBURS-OPT-CD                               27230000
              WHEN '0'                                                  27240000
                 MOVE FR-DSBMT-AMT          TO  WS-DISBURS-AMT-0        27250000
                 MOVE WS-DISBURS-AMT-0      TO  NSCCFR-DISBURS-AMT      27260000
              WHEN '1'                                                  27270000
                 MOVE FR-DSBMT-AMT          TO  WS-DISBURS-AMT-1        27280000
                 MOVE WS-DISBURS-AMT-1      TO  NSCCFR-DISBURS-AMT      27290000
              WHEN '2'                                                  27300000
                 MOVE FR-DSBMT-AMT          TO  WS-DISBURS-AMT-2        27310000
                 MOVE WS-DISBURS-AMT-2      TO  NSCCFR-DISBURS-AMT      27320000
              WHEN '3'                                                  27330000
                 MOVE FR-DSBMT-AMT          TO  WS-DISBURS-AMT-2        27340000
                 MOVE WS-DISBURS-AMT-2      TO  NSCCFR-DISBURS-AMT      27350000
              WHEN OTHER                                                27360000
      *          MOVE SPACES                TO  NSCCFR-DISBURS-AMT-X    27370000
                 MOVE '0'                   TO  NSCCFR-DISBURS-OPT-CD   27380000
                 MOVE '0000000000000000'    TO  NSCCFR-DISBURS-AMT      27390000
           END-EVALUATE                                                 27400000
           IF FR-PYMNT-JAN-IND = 'Y'                                    27410000
              MOVE '1'                      TO  NSCCFR-PAY-INDS (1)     27420000
           ELSE                                                         27430000
              MOVE '0'                      TO  NSCCFR-PAY-INDS (1)     27440000
           END-IF                                                       27450000
           IF FR-PYMNT-FEB-IND = 'Y'                                    27460000
              MOVE '1'                      TO  NSCCFR-PAY-INDS (2)     27470000
           ELSE                                                         27480000
              MOVE '0'                      TO  NSCCFR-PAY-INDS (2)     27490000
           END-IF                                                       27500000
           IF FR-PYMNT-MAR-IND = 'Y'                                    27510000
              MOVE '1'                      TO  NSCCFR-PAY-INDS (3)     27520000
           ELSE                                                         27530000
              MOVE '0'                      TO  NSCCFR-PAY-INDS (3)     27540000
           END-IF                                                       27550000
           IF FR-PYMNT-APR-IND = 'Y'                                    27560000
              MOVE '1'                      TO  NSCCFR-PAY-INDS (4)     27570000
           ELSE                                                         27580000
              MOVE '0'                      TO  NSCCFR-PAY-INDS (4)     27590000
           END-IF                                                       27600000
           IF FR-PYMNT-MAY-IND = 'Y'                                    27610000
              MOVE '1'                      TO  NSCCFR-PAY-INDS (5)     27620000
           ELSE                                                         27630000
              MOVE '0'                      TO  NSCCFR-PAY-INDS (5)     27640000
           END-IF                                                       27650000
           IF FR-PYMNT-JUN-IND = 'Y'                                    27660000
              MOVE '1'                      TO  NSCCFR-PAY-INDS (6)     27670000
           ELSE                                                         27680000
ENP001        MOVE '0'                      TO  NSCCFR-PAY-INDS (6)     27690000
           END-IF                                                       27700000
           IF FR-PYMNT-JUL-IND = 'Y'                                    27710000
              MOVE '1'                      TO  NSCCFR-PAY-INDS (7)     27720000
           ELSE                                                         27730000
              MOVE '0'                      TO  NSCCFR-PAY-INDS (7)     27740000
           END-IF                                                       27750000
           IF FR-PYMNT-AUG-IND = 'Y'                                    27760000
              MOVE '1'                      TO  NSCCFR-PAY-INDS (8)     27770000
           ELSE                                                         27780000
              MOVE '0'                      TO  NSCCFR-PAY-INDS (8)     27790000
           END-IF                                                       27800000
           IF FR-PYMNT-SEP-IND = 'Y'                                    27810000
              MOVE '1'                      TO  NSCCFR-PAY-INDS (9)     27820000
           ELSE                                                         27830000
              MOVE '0'                      TO  NSCCFR-PAY-INDS (9)     27840000
           END-IF                                                       27850000
           IF FR-PYMNT-OCT-IND = 'Y'                                    27860000
              MOVE '1'                      TO  NSCCFR-PAY-INDS (10)    27870000
           ELSE                                                         27880000
              MOVE '0'                      TO  NSCCFR-PAY-INDS (10)    27890000
           END-IF                                                       27900000
           IF FR-PYMNT-NOV-IND = 'Y'                                    27910000
              MOVE '1'                      TO  NSCCFR-PAY-INDS (11)    27920000
           ELSE                                                         27930000
              MOVE '0'                      TO  NSCCFR-PAY-INDS (11)    27940000
           END-IF                                                       27950000
           IF FR-PYMNT-DEC-IND = 'Y'                                    27960000
              MOVE '1'                      TO  NSCCFR-PAY-INDS (12)    27970000
           ELSE                                                         27980000
              MOVE '0'                      TO  NSCCFR-PAY-INDS (12)    27990000
           END-IF                                                       28000000
           MOVE FR-PYMNT-DT-CD              TO  NSCCFR-PAY-DATE-VAL     28010000
           MOVE FR-RTRMT-TAX-CD             TO  NSCCFR-RETIRE-TAX-CD    28020000
           MOVE FR-SHRHR-BNK-ACCT-NBR   TO  NSCCFR-SHRHLDR-BNK-ACCT-NBR 28030000
           MOVE FR-SHRHR-BNK-TYPE-CD    TO  NSCCFR-SHRHLDR-BNK-ACCT-TYPE28040000
           IF FR-CHCK-FRST-DT = '0001-01-01'                            28050000
              MOVE SPACES               TO  NSCCFR-1ST-CHECK-DATE       28060000
           ELSE                                                         28070000
              MOVE FR-CHCK-FRST-DT (1:4) TO  NSCCFR-1ST-CHECK-DATE (1:4)28080000
              MOVE FR-CHCK-FRST-DT (6:2) TO  NSCCFR-1ST-CHECK-DATE (5:2)28090000
              MOVE FR-CHCK-FRST-DT (9:2) TO  NSCCFR-1ST-CHECK-DATE (7:2)28100000
           END-IF                                                       28110000
           MOVE FR-ABA-ROUTING-NBR          TO  NSCCFR-ABA-ROUTE-NBR    28120000
           MOVE FR-COST-BSS-CD              TO  NSCCFR-COST-BASIS-CD    28130000
           MOVE SPACES                      TO  NSCCFR-FIRM-IND-DLVR    28140000
           MOVE NSCCFR-NBR-OF-PAYABLES      TO  NSCCFR-PYBL-QTY         28150000
           EVALUATE NSCCFR-PYBL-QTY                                     28160000
              WHEN 0                                                    28170000
                 MOVE NSCCFR-RECORD         TO  NSCC-FR-0-PYBL-REC      28180000
                 WRITE NSCC-FR-0-PYBL-REC                               28190000
              WHEN 1                                                    28200000
                 MOVE 1                     TO  S3                      28210000
                 MOVE S3                    TO  WS-PAYABLE-NBR          28220000
                                                WS-PYBL-NBR             28230000
                 PERFORM FORMAT-PAYABLES                                28240000
                 PERFORM FORMAT-PAYABLES-NA                             28250000
                 MOVE NA-LINE-CNTR         TO NSCCFR-PAY-NAME-ENDLN (S3)28260000
                 MOVE 1131                 TO  NSCCFR-REC-LENGTH        28270000
                 MOVE NSCCFR-RECORD        TO  NSCC-FR-BASIC1           28280000
                 MOVE NSCCFR-PAYABLE-INFO (S3) TO  NSCC-FR-PYBL-1       28290000
                 WRITE NSCC-FR-1-PYBL-REC                               28300000
              WHEN 2                                                    28310000
                 MOVE 1503                  TO  NSCCFR-REC-LENGTH       28320000
                 MOVE NSCCFR-RECORD         TO  NSCC-FR-BASIC2          28330000
                 PERFORM VARYING S3 FROM 1 BY 1 UNTIL S3 > 2            28340000
                    MOVE S3                 TO  WS-PAYABLE-NBR          28350000
                                                WS-PYBL-NBR             28360000
                    PERFORM FORMAT-PAYABLES                             28370000
                    PERFORM FORMAT-PAYABLES-NA                          28380000
                    MOVE NA-LINE-CNTR      TO NSCCFR-PAY-NAME-ENDLN (S3)28390000
                    MOVE NSCCFR-PAYABLE-INFO (S3) TO NSCC-FR-PYBL-2 (S3)28400000
                 END-PERFORM                                            28410000
                 WRITE NSCC-FR-2-PYBL-REC                               28420000
              WHEN 3                                                    28430000
                 MOVE 1875                  TO  NSCCFR-REC-LENGTH       28440000
                 MOVE NSCCFR-RECORD         TO  NSCC-FR-BASIC3          28450000
                 PERFORM VARYING S3 FROM 1 BY 1 UNTIL S3 > 3            28460000
                    MOVE S3                 TO  WS-PAYABLE-NBR          28470000
                                                WS-PYBL-NBR             28480000
                    PERFORM FORMAT-PAYABLES                             28490000
                    PERFORM FORMAT-PAYABLES-NA                          28500000
                    MOVE NA-LINE-CNTR      TO NSCCFR-PAY-NAME-ENDLN (S3)28510000
                    MOVE NSCCFR-PAYABLE-INFO (S3) TO NSCC-FR-PYBL-3 (S3)28520000
                 END-PERFORM                                            28530000
                 WRITE NSCC-FR-3-PYBL-REC                               28540000
              WHEN 4                                                    28550000
                 MOVE 2247                  TO  NSCCFR-REC-LENGTH       28560000
                 MOVE NSCCFR-RECORD         TO  NSCC-FR-BASIC4          28570000
                 PERFORM VARYING S3 FROM 1 BY 1 UNTIL S3 > 4            28580000
                    MOVE S3                 TO  WS-PAYABLE-NBR          28590000
                                                WS-PYBL-NBR             28600000
                    PERFORM FORMAT-PAYABLES                             28610000
                    PERFORM FORMAT-PAYABLES-NA                          28620000
                    MOVE NA-LINE-CNTR      TO NSCCFR-PAY-NAME-ENDLN (S3)28630000
                    MOVE NSCCFR-PAYABLE-INFO (S3) TO NSCC-FR-PYBL-4 (S3)28640000
                 END-PERFORM                                            28650000
                 WRITE NSCC-FR-4-PYBL-REC                               28660000
              WHEN 5                                                    28670000
                 MOVE 2619                  TO  NSCCFR-REC-LENGTH       28680000
                 MOVE NSCCFR-RECORD         TO  NSCC-FR-BASIC5          28690000
                 PERFORM VARYING S3 FROM 1 BY 1 UNTIL S3 > 5            28700000
                    MOVE S3                 TO  WS-PAYABLE-NBR          28710000
                                                WS-PYBL-NBR             28720000
                    PERFORM FORMAT-PAYABLES                             28730000
                    PERFORM FORMAT-PAYABLES-NA                          28740000
                    MOVE NA-LINE-CNTR      TO NSCCFR-PAY-NAME-ENDLN (S3)28750000
                    MOVE NSCCFR-PAYABLE-INFO (S3) TO NSCC-FR-PYBL-5 (S3)28760000
                 END-PERFORM                                            28770000
                 WRITE NSCC-FR-5-PYBL-REC                               28780000
              WHEN 6                                                    28790000
                 MOVE 2991                  TO  NSCCFR-REC-LENGTH       28800000
                 MOVE NSCCFR-RECORD         TO  NSCC-FR-BASIC6          28810000
                 PERFORM VARYING S3 FROM 1 BY 1 UNTIL S3 > 6            28820000
                    MOVE S3                 TO  WS-PAYABLE-NBR          28830000
                                                WS-PYBL-NBR             28840000
                    PERFORM FORMAT-PAYABLES                             28850000
                    PERFORM FORMAT-PAYABLES-NA                          28860000
                    MOVE NA-LINE-CNTR      TO NSCCFR-PAY-NAME-ENDLN (S3)28870000
                    MOVE NSCCFR-PAYABLE-INFO (S3) TO NSCC-FR-PYBL-6 (S3)28880000
                 END-PERFORM                                            28890000
                 WRITE NSCC-FR-6-PYBL-REC                               28900000
           END-EVALUATE                                                 28910000
                                                                        28920000
                                                                        28930000
           ADD 1                            TO  CLIENT-FR-REC-CNTR (S1) 28940000
                                                CLIENT-ALL-REC-CNTR (S1)28950000
                                                WS-TOTAL-FR-REC-CNTR    28960000
                                                NSCCI-TOTAL-REC-CNTR    28970000
                                                                        28980000
           .                                                            28990000
                                                                        29000000
           EJECT                                                        29010000
      *********************                                             29020000
       FORMAT-NAME-ADDRESS.                                             29030000
      *********************                                             29040000
                                                                        29050000
           MOVE ZEROES                      TO  NA-LINE-CNTR            29060000
           MOVE 1                           TO  S2                      29070000
                                                                        29080000
           MOVE WS-CUST-NA-AREA             TO  NSCCFR-CUST-NA-AREA     29090000
                                                                        29100000
           EXEC SQL                                                     29110000
              OPEN NSCC_NA_CRSR                                         29120000
           END-EXEC                                                     29130000
                                                                        29140000
           IF SQLCODE NOT = +0                                          29150000
              MOVE SQLCODE TO WS-SQLCODE                                29160000
              SET BAD-OPEN                  TO  TRUE                    29170000
              MOVE 'NSCC_NA CSR OPEN'       TO  TROUBLE-DB2-OBJECT      29180000
              PERFORM SQL-ERROR-ROUTINE                                 29190000
           END-IF                                                       29200000
                                                                        29210000
           PERFORM UNTIL SQLCODE NOT = +0                               29220000
              EXEC SQL                                                  29230000
                 FETCH NSCC_NA_CRSR                                     29240000
                 INTO  :FR-NA-LINE-NBR                                  29250000
                      ,:FR-CUST-NA-LINE-TXT                             29260000
              END-EXEC                                                  29270000
                                                                        29280000
              EVALUATE SQLCODE                                          29290000
                 WHEN +100                                              29300000
                    CONTINUE                                            29310000
                 WHEN +0                                                29320000
                    ADD 1                   TO  NA-LINE-CNTR            29330000
                    IF NA-LINE-CNTR = (1 OR 3 OR 5)                     29340000
                       MOVE FR-CUST-NA-LINE-TXT TO NSCCFR-CUST-NA-1 (S2)29350000
                    ELSE                                                29360000
                       IF NA-LINE-CNTR = (2 OR 4 OR 6)                  29370000
                          MOVE FR-CUST-NA-LINE-TXT                      29380000
                                            TO  NSCCFR-CUST-NA-2 (S2)   29390000
                          ADD 1             TO  S2                      29400000
                       END-IF                                           29410000
                    END-IF                                              29420000
                 WHEN OTHER                                             29430000
                    SET BAD-FETCH           TO  TRUE                    29440000
              END-EVALUATE                                              29450000
           END-PERFORM                                                  29460000
                                                                        29470000
           IF SQLCODE NOT = +100                                        29480000
              MOVE SQLCODE TO WS-SQLCODE                                29490000
              SET BAD-FETCH                 TO  TRUE                    29500000
              MOVE 'NSCC_NA CSR FETCH'      TO  TROUBLE-DB2-OBJECT      29510000
              PERFORM SQL-ERROR-ROUTINE                                 29520000
           END-IF                                                       29530000
                                                                        29540000
           EXEC SQL                                                     29550000
              CLOSE NSCC_NA_CRSR                                        29560000
           END-EXEC                                                     29570000
                                                                        29580000
           IF SQLCODE NOT = +0                                          29590000
              MOVE SQLCODE TO WS-SQLCODE                                29600000
              SET BAD-CLOSE                 TO  TRUE                    29610000
              MOVE 'NSCC_NA CSR CLOSE'      TO  TROUBLE-DB2-OBJECT      29620000
              PERFORM SQL-ERROR-ROUTINE                                 29630000
           ELSE                                                         29640000
              MOVE +0                       TO  SQLCODE                 29650000
           END-IF                                                       29660000
                                                                        29670000
           .                                                            29680000
                                                                        29690000
           EJECT                                                        29700000
      *****************                                                 29710000
       FORMAT-PAYABLES.                                                 29720000
      *****************                                                 29730000
                                                                        29740000
           EXEC SQL                                                     29750000
              SELECT                                                    29760000
                 ACCT_NBR,                                              29770000
                 ZIP5_CD,                                               29780000
                 ZIP4_CD,                                               29790000
                 ACCT_PYBL_CD,                                          29800000
                 ISIN_CNTRY_CD,                                         29810000
                 ISIN_SEC_ISSUE_CD,                                     29820000
                 ISIN_SEC_CDG_CD,                                       29830000
                 PYBL_ALTNT_CD,                                         29840000
                 PYBL_ALTNT_RSN_TXT,                                    29850000
                 ADDRS_DVDND_IND,                                       29860000
                 ADDRS_SYSWL_IND,                                       29870000
                 ADDRS_ATMDF_IND,                                       29880000
                 CRSS_FND_RNVST_IND,                                    29890000
                 ALTNT_PYBL_IND                                         29900000
              INTO :FRP-AREA                                            29910000
              FROM VFNDPYBL                                             29920000
              WHERE CLIENT_NBR       = :WS-CLIENT                 AND   29930000
                    ACAT_CONTROL_NBR = :FR-ACAT-CONTROL-NBR AND         29940000
                    ASSET_SEQ_NBR    = :FR-ASSET-SEQ-NBR    AND         29950000
                    PYBL_NBR         = :WS-PAYABLE-NBR                  29960000
           END-EXEC                                                     29970000
                                                                        29980000
           IF SQLCODE NOT = +0                                          29990000
              MOVE SQLCODE TO WS-SQLCODE                                30000000
              SET BAD-SELECT                TO  TRUE                    30010000
              MOVE 'SELECT VFNDPYBL'        TO  TROUBLE-DB2-OBJECT      30020000
              PERFORM SQL-ERROR-ROUTINE                                 30030000
           END-IF                                                       30040000
                                                                        30050000
           MOVE FRP-ACCT-NBR                TO  NSCCFR-PAY-ACCT-NBR (S3)30060000
           MOVE FRP-ZIP5-CD                 TO  NSCCFR-PAY-ZIP-5 (S3)   30070000
           MOVE FRP-ZIP4-CD                 TO  NSCCFR-PAY-ZIP-4 (S3)   30080000
           PERFORM FORMAT-PAYABLE-ADDRESS-OPTN                          30090000
           MOVE FRP-ACCT-PYBL-CD        TO  NSCCFR-PAY-ACCT-IND (S3)    30100000
           MOVE FRP-ISIN-CNTRY-CD       TO  NSCCFR-SEC-ISS-CNTRY-CD (S3)30110000
           MOVE FRP-ISIN-SEC-ISSUE-CD   TO  NSCCFR-SEC-ISS-ID (S3)      30120000
           MOVE FRP-ISIN-SEC-CDG-CD     TO  NSCCFR-SEC-ISS-CHK-DGT (S3) 30130000
           MOVE FRP-PYBL-ALTNT-CD       TO  NSCCFR-ALT-PAYA-IND (S3)    30140000
           MOVE FRP-PYBL-ALTNT-RSN-TXT  TO  NSCCFR-ALT-PAY-REASON (S3)  30150000
                                                                        30160000
           .                                                            30170000
                                                                        30180000
           EJECT                                                        30190000
      ********************                                              30200000
       FORMAT-PAYABLES-NA.                                              30210000
      ********************                                              30220000
                                                                        30230000
           MOVE ZEROES                      TO  NA-LINE-CNTR            30240000
                                                S2                      30250000
                                                                        30260000
           MOVE WS-CUST-NA-AREA             TO  NSCCFR-PBL-NA-AREA (S3) 30270000
                                                                        30280000
           EXEC SQL                                                     30290000
              OPEN NSCC_PY_NA_CRSR                                      30300000
           END-EXEC                                                     30310000
                                                                        30320000
           IF SQLCODE NOT = +0                                          30330000
              SET BAD-OPEN                  TO  TRUE                    30340000
           END-IF                                                       30350000
                                                                        30360000
           PERFORM UNTIL SQLCODE NOT = +0                               30370000
              EXEC SQL                                                  30380000
                 FETCH NSCC_PY_NA_CRSR                                  30390000
                 INTO  :FRP-NA-LINE-NBR                                 30400000
                      ,:FRP-PYBL-NA-LINE-TXT                            30410000
              END-EXEC                                                  30420000
                                                                        30430000
              EVALUATE SQLCODE                                          30440000
                 WHEN +100                                              30450000
                    CONTINUE                                            30460000
                 WHEN +0                                                30470000
                    ADD 1                   TO  NA-LINE-CNTR            30480000
                    IF NA-LINE-CNTR = (1 OR 3 OR 5)                     30490000
                       MOVE FRP-PYBL-NA-LINE-TXT                        30500000
                                            TO  NSCCFR-PBL-NA-1 (S3, S2)30510000
                    ELSE                                                30520000
                       IF NA-LINE-CNTR = (2 OR 4 OR 6)                  30530000
                          MOVE FRP-PYBL-NA-LINE-TXT                     30540000
                                            TO  NSCCFR-PBL-NA-2 (S3, S2)30550000
                          ADD 1             TO  S2                      30560000
                       END-IF                                           30570000
                    END-IF                                              30580000
                 WHEN OTHER                                             30590000
                    SET BAD-FETCH           TO  TRUE                    30600000
              END-EVALUATE                                              30610000
           END-PERFORM                                                  30620000
                                                                        30630000
           IF SQLCODE NOT = +100                                        30640000
              MOVE SQLCODE TO WS-SQLCODE                                30650000
              SET BAD-FETCH                 TO  TRUE                    30660000
              MOVE 'PYBL NA CSR FETCH'      TO  TROUBLE-DB2-OBJECT      30670000
              PERFORM SQL-ERROR-ROUTINE                                 30680000
           END-IF                                                       30690000
                                                                        30700000
           EXEC SQL                                                     30710000
              CLOSE NSCC_PY_NA_CRSR                                     30720000
           END-EXEC                                                     30730000
                                                                        30740000
           IF SQLCODE NOT = +0                                          30750000
              MOVE SQLCODE TO WS-SQLCODE                                30760000
              SET BAD-CLOSE                 TO  TRUE                    30770000
              MOVE 'PAYBLE NA CSR CLOSE'    TO  TROUBLE-DB2-OBJECT      30780000
              PERFORM SQL-ERROR-ROUTINE                                 30790000
           ELSE                                                         30800000
              MOVE +0                       TO  SQLCODE                 30810000
           END-IF                                                       30820000
                                                                        30830000
           .                                                            30840000
                                                                        30850000
           EJECT                                                        30860000
      *****************************                                     30870000
       FORMAT-PAYABLE-ADDRESS-OPTN.                                     30880000
      *****************************                                     30890000
                                                                        30900000
           MOVE 'Z'                         TO  NSCCFR-PAY-ADDR-OPT (S3)30910000
                                                                        30920000
           IF FRP-ADDRS-DVDND-IND = 'Y'  AND                            30930000
              FRP-ADDRS-SYSWL-IND = 'N'  AND                            30940000
              FRP-ADDRS-ATMDF-IND = 'N'                                 30950000
              MOVE '1'                      TO  NSCCFR-PAY-ADDR-OPT (S3)30960000
           END-IF                                                       30970000
                                                                        30980000
           IF FRP-ADDRS-DVDND-IND = 'N'  AND                            30990000
              FRP-ADDRS-SYSWL-IND = 'Y'  AND                            31000000
              FRP-ADDRS-ATMDF-IND = 'N'                                 31010000
              MOVE '2'                      TO  NSCCFR-PAY-ADDR-OPT (S3)31020000
           END-IF                                                       31030000
                                                                        31040000
           IF FRP-ADDRS-DVDND-IND = 'N'  AND                            31050000
              FRP-ADDRS-SYSWL-IND = 'N'  AND                            31060000
              FRP-ADDRS-ATMDF-IND = 'Y'                                 31070000
              MOVE '3'                      TO  NSCCFR-PAY-ADDR-OPT (S3)31080000
           END-IF                                                       31090000
                                                                        31100000
           IF FRP-ADDRS-DVDND-IND = 'Y'  AND                            31110000
              FRP-ADDRS-SYSWL-IND = 'Y'  AND                            31120000
              FRP-ADDRS-ATMDF-IND = 'Y'                                 31130000
              MOVE '4'                      TO  NSCCFR-PAY-ADDR-OPT (S3)31140000
           END-IF                                                       31150000
                                                                        31160000
           IF FRP-ADDRS-DVDND-IND = 'Y'  AND                            31170000
              FRP-ADDRS-SYSWL-IND = 'N'  AND                            31180000
              FRP-ADDRS-ATMDF-IND = 'Y'                                 31190000
              MOVE '5'                      TO  NSCCFR-PAY-ADDR-OPT (S3)31200000
           END-IF                                                       31210000
                                                                        31220000
           IF FRP-ADDRS-DVDND-IND = 'Y'  AND                            31230000
              FRP-ADDRS-SYSWL-IND = 'Y'  AND                            31240000
              FRP-ADDRS-ATMDF-IND = 'N'                                 31250000
              MOVE '6'                      TO  NSCCFR-PAY-ADDR-OPT (S3)31260000
           END-IF                                                       31270000
                                                                        31280000
           IF FRP-ADDRS-DVDND-IND = 'N'  AND                            31290000
              FRP-ADDRS-SYSWL-IND = 'Y'  AND                            31300000
              FRP-ADDRS-ATMDF-IND = 'Y'                                 31310000
              MOVE '7'                      TO  NSCCFR-PAY-ADDR-OPT (S3)31320000
           END-IF                                                       31330000
                                                                        31340000
           IF FRP-CRSS-FND-RNVST-IND = 'Y'                              31350000
              MOVE '8'                      TO  NSCCFR-PAY-ADDR-OPT (S3)31360000
           END-IF                                                       31370000
                                                                        31380000
           IF FRP-ALTNT-PYBL-IND = 'Y'                                  31390000
              MOVE '9'                      TO  NSCCFR-PAY-ADDR-OPT (S3)31400000
           END-IF                                                       31410000
                                                                        31420000
           IF NSCCFR-PAY-ADDR-OPT (S3) = 'Z'                            31430000
              MOVE ' '                      TO  NSCCFR-PAY-ADDR-OPT (S3)31440000
           END-IF                                                       31450000
                                                                        31460000
           .                                                            31470000
                                                                        31480000
           EJECT                                                        31490000
      **************************                                        31500000
       REWRITE-CYCLE-LOG-HEADER.                                        31510000
      **************************                                        31520000
                                                                        31530000
           MOVE SPACES                    TO  CLOG-NSCC-LAST-SENT-HDR   31540000
           MOVE ZEROES                    TO  CLOG-LAST-SENT-PROC-DATE  31550000
                                              CLOG-LAST-SENT-CYCLE-NBR  31560000
                                              CLOG-LAST-SENT-REC-CNTR   31570000
                                              CLOG-LAST-SENT-TI-REC-CNTR31580000
                                              CLOG-LAST-SENT-AT-REC-CNTR31590000
                                              CLOG-LAST-SENT-FR-REC-CNTR31600000
           MOVE LOW-VALUES                TO  CLOG-KEY-A                31610000
           MOVE BPD-PROC-DATE             TO  CLOG-LAST-SENT-PROC-DATE  31620000
           MOVE WS-MULTI-BATCH-NBR        TO  CLOG-LAST-SENT-CYCLE-NBR  31630000
           MOVE WS-FROM-TMSTMP            TO  CLOG-LAST-FROM-TMSTMP     31640000
           MOVE WS-TO-TMSTMP              TO  CLOG-LAST-TO-TMSTMP       31650000
           MOVE NSCCI-TOTAL-REC-CNTR      TO  CLOG-LAST-SENT-REC-CNTR   31660000
           MOVE WS-TOTAL-TI-REC-CNTR      TO  CLOG-LAST-SENT-TI-REC-CNTR31670000
           MOVE WS-TOTAL-AT-REC-CNTR      TO  CLOG-LAST-SENT-AT-REC-CNTR31680000
           MOVE WS-TOTAL-FR-REC-CNTR      TO  CLOG-LAST-SENT-FR-REC-CNTR31690000
                                                                        31700000
           REWRITE CYCLE-LOG-REC       FROM  CLOG-RECORD                31710000
                                                                        31720000
           IF CYCLE-LOG-STATUS = '23'                                   31730000
              WRITE CYCLE-LOG-REC      FROM  CLOG-RECORD                31740000
           END-IF                                                       31750000
                                                                        31760000
           IF CYCLE-LOG-STATUS NOT = '00'                               31770000
              DISPLAY ' '                                               31780000
              DISPLAY '**********************************************'  31790000
              DISPLAY '* CANNOT UPDATE  THE CYCLE LOG HEADER RECORD *'  31800000
              DISPLAY '* KEY = ' CLOG-KEY-STREAM-IND,                   31810000
                                  CLOG-KEY-INOUT-IND                    31820000
                      '                 *'                              31830000
              DISPLAY '* STATUS = ' CYCLE-LOG-STATUS                    31840000
                      '                                *'               31850000
              DISPLAY '* PROGRAM IS ABENDING!                       *'  31860000
              DISPLAY ' '                                               31870000
              CALL ABEND            USING  ABEND-CODE                   31880000
           END-IF                                                       31890000
                                                                        31900000
           .                                                            31910000
                                                                        31920000
      *******************                                               31930000
       SQL-ERROR-ROUTINE.                                               31940000
      *******************                                               31950000
                                                                        31960000
           CALL DSNTIAR               USING  SQLCA                      31970000
                                             WS-DB2-MESSAGE-AREA        31980000
                                             WS-ERR-LINE-LEN            31990000
                                                                        32000000
           DISPLAY ' '                                                  32010000
                                                                        32020000
           PERFORM VARYING WS-ERROR-INDEX FROM 1 BY 1                   32030000
              UNTIL WS-ERROR-INDEX GREATER THAN 12                      32040000
                 IF WS-ERROR-MSG (WS-ERROR-INDEX) > SPACES              32050000
                    DISPLAY '*** ' WS-ERROR-MSG (WS-ERROR-INDEX)        32060000
                 END-IF                                                 32070000
           END-PERFORM                                                  32080000
                                                                        32090000
           DISPLAY ' '                                                  32100000
           DISPLAY '*** DB2 OBJECT IN TROUBLE IS ' TROUBLE-DB2-OBJECT   32110000
           DISPLAY '*** PROGRAM IS ABENDING!'                           32120000
           DISPLAY '****** SQLCODE = ' WS-SQLCODE                       32130000
           DISPLAY ' '                                                  32140000
                                                                        32150000
           PERFORM ENDJOB-ROUTINE.                                      32160000
                                                                        32170000
           EXEC SQL  ROLLBACK  END-EXEC                                 32180000
           CALL  ABEND     USING ABEND-CODE                             32190000
                                                                        32200000
           .                                                            32210000
                                                                        32220000
           EJECT                                                        32230000
      *****************                                                 32240000
       INITIAL-ROUTINE.                                                 32250000
      *****************                                                 32260000
                                                                        32270000
           OPEN INPUT   NTWREG-FILE                                     32280000
                        NTWMAST-FILE.                                   32290000
                                                                        32300000
           OPEN OUTPUT  NSCC-IN-FILE                                    32310000
                                                                        32320000
           OPEN I-O   CYCLE-LOG.                                        32330000
                                                                        32340000
           IF CYCLE-LOG-STATUS = '00' OR '97'                           32350000
              CONTINUE                                                  32360000
           ELSE                                                         32370000
              DISPLAY ' '                                               32380000
              DISPLAY '*****************************'                   32390000
              DISPLAY '* BAD OPEN OF CYCLELOG FILE *'                   32400000
              DISPLAY '* VSAM STATUS = ' CYCLE-LOG-STATUS '          *' 32410000
              DISPLAY '* PROGRAM IS ABENDING       *'                   32420000
              DISPLAY '*****************************'                   32430000
              DISPLAY ' '                                               32440000
              MOVE +0001                 TO  ABEND-CODE                 32450000
              CALL ABEND              USING  ABEND-CODE                 32460000
           END-IF                                                       32470000
                                                                        32480000
           MOVE 'CAT501'                 TO  BPDATES-CALLING-PGM        32490000
           MOVE 'C'                      TO  BPDATES-REQ-TYPE           32500000
           MOVE '  '                     TO  BPDATES-CALENDAR-TYPE      32510000
           CALL  BPDATES              USING  BPDATES-PARAMETERS         32520000
                                                                        32530000
           IF BPD-VALID-RETURN                                          32540000
              CONTINUE                                                  32550000
           ELSE                                                         32560000
              DISPLAY ' '                                               32570000
              DISPLAY '*******************************'                 32580000
              DISPLAY '* BPDATES INVALID-RETURN = ' BPDATES-RETURN-CODE 32590000
                      ' *'                                              32600000
              DISPLAY '* PROGRAM IS ABENDING         *'                 32610000
              DISPLAY '*******************************'                 32620000
              DISPLAY ' '                                               32630000
              CALL ABEND              USING  ABEND-CODE                 32640000
           END-IF                                                       32650000
                                                                        32660000
           EXEC SQL                                                     32670000
               SET :WS-TO-TMSTMP = CURRENT TIMESTAMP                    32680000
           END-EXEC                                                     32690000
                                                                        32700000
           IF SQLCODE NOT = +0                                          32710000
              DISPLAY 'SQLCODE = ' SQLCODE                              32720000
              PERFORM SQL-ERROR-ROUTINE                                 32730000
           END-IF                                                       32740000
                                                                        32750000
LRM015     DISPLAY 'LS-STREAM-IND   = ' LS-STREAM-IND                   32760000
LRM015     DISPLAY 'LS-ASCENDIS-RUN = ' LS-ASCENDIS-RUN                 32770000
LRM015     DISPLAY 'LS-ASCENDIS-EOD = ' LS-ASCENDIS-EOD                 32780000
           DISPLAY ' '                                                  32790000
           DISPLAY '              CUTOFF TIMES:'                        32800000
           DISPLAY '              -------------'                        32810000
           DISPLAY 'TI ADD               : ' LS-TIA-TIME                32820000
           DISPLAY 'TI CHANGE/DELETE     : ' LS-TIC-TIME                32830000
           DISPLAY 'TI REJECT (DELIVERER): ' LS-TIRD-TIME               32840000
           DISPLAY 'TI REJECT (RECEIVER) : ' LS-TIRR-TIME               32850000
           DISPLAY 'TI ACCELERATE        : ' LS-TIX-TIME                32860000
           DISPLAY ' '                                                  32870000
           DISPLAY 'AT ADD               : ' LS-ATA-TIME                32880000
           DISPLAY 'AT CHANGE/DELETE     : ' LS-ATCD-TIME               32890000
           DISPLAY ' '                                                  32900000
           DISPLAY 'FR ADD               : ' LS-FRA-TIME                32910000
                                                                        32920000
           MOVE LS-TIA-TIME                 TO  WS-TIA-HHMM             32930000
           MOVE LS-TIC-TIME                 TO  WS-TIC-HHMM             32940000
           MOVE LS-TIRD-TIME                TO  WS-TIRD-HHMM            32950000
           MOVE LS-TIRR-TIME                TO  WS-TIRR-HHMM            32960000
           MOVE LS-TIX-TIME                 TO  WS-TIX-HHMM             32970000
           MOVE LS-ATA-TIME                 TO  WS-ATA-HHMM             32980000
           MOVE LS-ATCD-TIME                TO  WS-ATCD-HHMM            32990000
LRM001     MOVE LS-ATRD-TIME                TO  WS-ATRD-HHMM            33000000
           MOVE LS-FRA-TIME                 TO  WS-FRA-HHMM             33010000
                                                                        33020000
           MOVE ZEROES                      TO  WS-TIA-SS               33030000
                                                WS-TIC-SS               33040000
                                                WS-TIRD-SS              33050000
                                                WS-TIRR-SS              33060000
                                                WS-TIX-SS               33070000
                                                WS-ATA-SS               33080000
                                                WS-ATCD-SS              33090000
LRM001                                          WS-ATRD-SS              33100000
                                                WS-FRA-SS               33110000
                                                                        33120000
           .                                                            33130000
           EJECT                                                        33140000
LRM020 OPEN-TABL-FILE.                                                  33150000
LRM020     MOVE 'OPEN'                    TO TABLRQST-REQUEST           33160000
LRM020     MOVE 'ACAT   '                 TO TABLRQST-TABLE-NAME        33170000
LRM020                                                                  33180000
LRM020     CALL TABLGET USING TABLRQST-COMMAREA                         33190000
LRM020                                                                  33200000
LRM020     IF TABLRQST-RETURN-CODE = 'OK  '                             33210000
LRM020        NEXT SENTENCE                                             33220000
LRM020     ELSE                                                         33230000
LRM020        DISPLAY ' '                                               33240000
LRM020        DISPLAY '****************************************'        33250000
LRM020        DISPLAY '*    TABLE FILE OPEN ERROR             *'        33260000
LRM020        DISPLAY '*    DSN=SZ.ZZZ.TBLFILE  DD TABLFLE    *'        33270000
LRM020        DISPLAY '*    TABLRQST-RT-CODE ' TABLRQST-RETURN-CODE     33280000
LRM020        DISPLAY '****************************************'        33290000
LRM020********MOVE +3020    TO ABEND-CODE                               33300000
LRM020********CALL ABEND              USING  ABEND-CODE                 33310000
LRM020     END-IF.                                                      33310100
LRM020                                                                  33310200
LRM020 APPLY-TABL-CUTOFF-OVERRIDES.                                     33310300
LRM020     MOVE 'GETN'                     TO TABLRQST-REQUEST          33310400
LRM020     MOVE 'CYCLE'                    TO TABLRQST-TABLE-KEY        33310500
LRM020     MOVE WS-MULTI-BATCH-NBR(4:1)    TO TABLRQST-TABLE-KEY(6:1)   33310600
LRM020                                                                  33310700
LRM020     CALL  TABLGET  USING  TABLRQST-COMMAREA                      33310800
LRM020                                                                  33310900
LRM020     IF TABLRQST-RETURN-CODE = 'OK'                               33311000
LRM020         DISPLAY 'TABL RQST COMMAREA = ' TABLRQST-COMMAREA        33311100
LRM020         IF WS-MULTI-BATCH-NBR(4:1) = TABLRQST-TABLE-KEY(6:1)     33311200
LRM020            DISPLAY 'TABL ENTRY FOUND MATCHING CYCLE '            33311300
LRM020                       WS-MULTI-BATCH-NBR(4:1)                    33311400
LRM020            IF (WS-MULTI-BATCH-NBR(4:1) = '1' OR '2' OR '3')      33311500
LRM020            AND TABLRQST-RETURN-DATA(1:4) > WS-TIA-TIME-AREA(1:4) 33311600
LRM020               DISPLAY 'TABL ENTRY / OVERRIDE CYCLE 1-3 TIME TO ' 33311700
LRM020                       TABLRQST-RETURN-DATA(1:4)                  33311800
LRM020               MOVE TABLRQST-RETURN-DATA(1:4)                     33311900
LRM020                                 TO  WS-TIA-TIME-AREA(1:4)        33312000
LRM020            ELSE                                                  33312100
LRM020            IF WS-MULTI-BATCH-NBR(4:1) = '4'                      33312200
LRM020            AND TABLRQST-RETURN-DATA(1:4) > WS-ATA-TIME-AREA(1:4) 33312300
LRM020                  DISPLAY 'TABL ENTRY / OVERRIDE CYCLE 4 TIME TO '33312400
LRM020                       TABLRQST-RETURN-DATA(1:4)                  33312500
LRM020                  MOVE TABLRQST-RETURN-DATA(1:4)                  33312600
LRM020                                 TO  WS-ATA-TIME-AREA(1:4)        33312700
LRM020                                     WS-ATCD-TIME-AREA(1:4)       33312800
LRM020                                     WS-TIRD-TIME-AREA(1:4)       33312900
LRM020            ELSE                                                  33313000
LRM020            IF WS-MULTI-BATCH-NBR(4:1) = '5'                      33313100
LRM020            AND TABLRQST-RETURN-DATA(1:4) > WS-TIC-TIME-AREA(1:4) 33313200
LRM020                  DISPLAY 'TABL ENTRY / OVERRIDE CYCLE 5 TIME TO '33313300
LRM020                       TABLRQST-RETURN-DATA(1:4)                  33313400
LRM020                  MOVE TABLRQST-RETURN-DATA(1:4)                  33313500
LRM020                                 TO  WS-TIC-TIME-AREA(1:4)        33313600
LRM020                                     WS-TIRR-TIME-AREA(1:4)       33313700
LRM020                                     WS-TIX-TIME-AREA(1:4)        33313800
LRM020                                     WS-ATRD-TIME-AREA(1:4)       33313900
LRM020                                     WS-FRA-TIME-AREA(1:4)        33314000
LRM020            END-IF END-IF END-IF                                  33314100
LRM020     END-IF.                                                      33314200
LRM020 CLOSE-TABL-FILE.                                                 33314300
LRM020     MOVE 'CLOS'                    TO TABLRQST-REQUEST           33314400
LRM020     MOVE 'ACAT   '                 TO TABLRQST-TABLE-NAME        33314500
LRM020                                                                  33314600
LRM020     CALL TABLGET USING TABLRQST-COMMAREA                         33314700
LRM020                                                                  33314800
LRM020     IF TABLRQST-RETURN-CODE = 'OK  '                             33314900
LRM020        NEXT SENTENCE                                             33315000
LRM020     ELSE                                                         33315100
LRM020        DISPLAY ' '                                               33315200
LRM020        DISPLAY '****************************************'        33315300
LRM020        DISPLAY '*    TABLE FILE CLOSE ERROR            *'        33315400
LRM020        DISPLAY '*    DSN=SZ.ZZZ.TBLFILE  DD TABLFLE    *'        33315500
LRM020        DISPLAY '*    TABLRQST-RT-CODE ' TABLRQST-RETURN-CODE     33315600
LRM020        DISPLAY '****************************************'        33315700
LRM020     END-IF.                                                      33315800
           EJECT                                                        33315900
      ****************                                                  33316000
       ENDJOB-ROUTINE.                                                  33316100
      ****************                                                  33316200
                                                                        33316300
           CLOSE  NSCC-IN-FILE                                          33316400
                  CYCLE-LOG                                             33316500
                                                                        33316600
           PERFORM VARYING S1 FROM 1 BY 1                               33316700
              UNTIL S1 > CLIENT-TABLE-CNTR                              33316800
              DISPLAY ' '                                               33316900
              DISPLAY '   TOTALS FOR CLIENT ' CLIENT-NUM (S1)           33317000
              DISPLAY '   ----------------------'                       33318000
              DISPLAY 'NUMBER OF TI RECORDS: '                          33319000
                                           CLIENT-TI-REC-CNTR (S1)      33320000
              DISPLAY 'NUMBER OF AT RECORDS: '                          33330000
                                           CLIENT-AT-REC-CNTR (S1)      33340000
              IF CLIENT-B1-434503 (S1) = '0'                            33350000
                 DISPLAY 'E.D. JONES WILL SUPPLY FR RECORDS ITSELF'     33360000
              ELSE                                                      33370000
                 DISPLAY 'NUMBER OF FR RECORDS: '                       33380000
                                              CLIENT-FR-REC-CNTR (S1)   33390000
              END-IF                                                    33400000
              DISPLAY 'CLIENT TOTAL RECORDS: ' CLIENT-ALL-REC-CNTR (S1) 33410000
              DISPLAY '                   ***'                          33420000
           END-PERFORM                                                  33430000
                                                                        33440000
           DISPLAY ' '                                                  33450000
           DISPLAY '   TOTAL RECORDS FROM TABLE '                       33460000
           DISPLAY '   -------------------------'                       33470000
           DISPLAY 'NUMBER OF TI RECORDS: ' WS-IN-TI-REC-CNTR           33480000
           DISPLAY 'NUMBER OF AT RECORDS: ' WS-IN-AT-REC-CNTR           33490000
           DISPLAY '      FROM FULL TRANSFER = ' WS-IN-AT1-REC-CNTR     33500000
           DISPLAY '      FROM PARTIAL TRANSFER = ' WS-IN-AT2-REC-CNTR  33510000
           DISPLAY 'NUMBER OF FR RECORDS: ' WS-IN-FR-REC-CNTR           33520000
           DISPLAY 'NUMBER OF TOTAL RECORDS: ' WS-IN-TOTAL-REC-CNTR     33530000
                                                                        33540000
           DISPLAY ' '                                                  33550000
           DISPLAY '   NSCC INPUT TOTALS'                               33560000
           DISPLAY '   -----------------'                               33570000
           DISPLAY 'NUMBER OF TI RECORDS: ' WS-TOTAL-TI-REC-CNTR        33580000
           DISPLAY 'NUMBER OF AT RECORDS: ' WS-TOTAL-AT-REC-CNTR        33590000
           DISPLAY '  ( NUMBER OF OPTN RECS:  ' WS-IN-AT-OPTN-CNTR  ' )'33600000
           DISPLAY '  ( NUMBER OF FM RECORDS: ' WS-IN-AT-MF-CNTR ' )'   33610000
           DISPLAY 'NUMBER OF FR RECORDS: ' WS-TOTAL-FR-REC-CNTR        33620000
           DISPLAY 'NSCCIN TOTAL RECORDS: ' NSCCI-TOTAL-REC-CNTR        33630000
                                                                        33640000
           DISPLAY ' '                                                  33650000
           DISPLAY '*************************'                          33660000
           DISPLAY '* END OF CAT501 PROGRAM *'                          33670000
           DISPLAY '*************************'                          33680000
           DISPLAY ' '                                                  33690000
                                                                        33700000
           .                                                            33710000
